{
    "acronym": "infinigram",
    "title": "Infini-gram: Scaling Unbounded n-gram Language Models to a Trillion Tokens",
    "seed_ids": [],
    "s2id": "1c143a753d4eb82da5526132149f6e4ed5271b63",
    "abstract": "Are $n$-gram language models still relevant in this era of neural large language models (LLMs)? Our answer is yes, and we showcase their values in both text analysis and improving neural LLMs. This was done by modernizing $n$-gram LMs in two aspects. First, we train them at the same data scale as neural LLMs -- 5 trillion tokens. This is the largest $n$-gram LM ever built. Second, existing $n$-gram LMs use small $n$ which hinders their performance; we instead allow $n$ to be arbitrarily large, by introducing a new $\\infty$-gram LM with backoff. Instead of pre-computing $n$-gram count tables (which would be very expensive), we develop an engine named infini-gram -- powered by suffix arrays -- that can compute $\\infty$-gram (as well as $n$-gram with arbitrary $n$) probabilities with millisecond-level latency. The $\\infty$-gram framework and infini-gram engine enable us to conduct many novel and interesting analyses of human-written and machine-generated text: we find that the $\\infty$-gram LM has fairly high accuracy for next-token prediction (47%), and can complement neural LLMs to greatly reduce their perplexity. When analyzing machine-generated text, we also observe irregularities in the machine--$\\infty$-gram agreement level with respect to the suffix length, which indicates deficiencies in neural LLM pretraining and the positional embeddings of Transformers.",
    "authors": [
        "Jiacheng Liu",
        "Sewon Min",
        "Luke Zettlemoyer",
        "Yejin Choi",
        "Hannaneh Hajishirzi"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": "The $\\infty$-gram framework and infini-gram engine enable us to conduct many novel and interesting analyses of human-written and machine-generated text: it is found that the $\\infty$-gram LM has fairly high accuracy for next-token prediction, and can complement neural LLMs to greatly reduce their perplexity.",
    "citationCount": 11,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}