{
    "acronym": "longhorn",
    "title": "Longhorn: State Space Models are Amortized Online Learners",
    "seed_ids": [
        "ttt",
        "samba",
        "based",
        "gla",
        "mamba",
        "retnet",
        "rwkv4",
        "hyena",
        "ptwoattn",
        "sgconv",
        "s5",
        "gssm",
        "flashattn",
        "dssm",
        "s4",
        "deltanet",
        "performer",
        "lineartransformer",
        "linformer",
        "transformer"
    ],
    "s2id": "af4e8a4bf3effaf04a141e1048276c77ea8585a9",
    "abstract": "The most fundamental capability of modern AI methods such as Large Language Models (LLMs) is the ability to predict the next token in a long sequence of tokens, known as ``sequence modeling.\"Although the Transformers model is the current dominant approach to sequence modeling, its quadratic computational cost with respect to sequence length is a significant drawback. State-space models (SSMs) offer a promising alternative due to their linear decoding efficiency and high parallelizability during training. However, existing SSMs often rely on seemingly ad hoc linear recurrence designs. In this work, we explore SSM design through the lens of online learning, conceptualizing SSMs as meta-modules for specific online learning problems. This approach links SSM design to formulating precise online learning objectives, with state transition rules derived from optimizing these objectives. Based on this insight, we introduce a novel deep SSM architecture based on the implicit update for optimizing an online regression objective. Our experimental results show that our models outperform state-of-the-art SSMs, including the Mamba model, on standard sequence modeling benchmarks and language modeling tasks.",
    "authors": [
        "Bo Liu",
        "Rui Wang",
        "Lemeng Wu",
        "Yihao Feng",
        "Peter Stone",
        "Qian Liu"
    ],
    "venue": "",
    "year": 2024,
    "tldr": "This work introduces a novel deep SSM architecture based on the implicit update for optimizing an online regression objective, and shows that these models outperform state-of-the-art SSMs, including the Mamba model, on standard sequence modeling benchmarks and language modeling tasks.",
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}