{
    "h3-0": "# Hungry Hungry Hippos: Towards Language Modeling with State Space Models \n\nDaniel Y.",
    "h3-1": "Fu* ${ }^{* \\dagger}$, Tri Dao* ${ }^{* \\dagger}$, Khaled K. Saab ${ }^{\\ddagger}$, Armin W. Thomas ${ }^{\\dagger \\dagger}$,<br>Atri Rudra ${ }^{\\ddagger \\ddagger}$, and Christopher Rét<br>${ }^{\\dagger}$ Department of Computer Science, Stanford University<br>${ }^{\\ddagger}$ Department of Electrical Engineering, Stanford University<br>${ }^{\\dagger \\dagger}$ Department of Psychology, Stanford University<br>${ }^{\\ddagger \\ddagger}$ Department of Computer Science and Engineering, University at Buffalo, SUNY<br>\\{danfu,tridao\\}@cs.stanford.edu, \\{ksaab,athms\\}@stanford.edu, atri@buffalo.edu,<br>chrismre@cs.stanford.edu\n\nDecember 28, 2022\n\n\n#### Abstract\n\nState space models (SSMs) have demonstrated state-of-the-art sequence modeling performance in some modalities, but underperform attention in language modeling. Moreover, despite scaling nearly linearly in sequence length instead of quadratically, SSMs are still slower than Transformers due to poor hardware utilization. In this paper, we make progress on understanding the expressivity gap between SSMs and attention in language modeling, and on reducing the hardware barrier between SSMs and attention. First, we use synthetic language modeling tasks to understand the gap between SSMs and attention. We find that existing SSMs struggle with two capabilities: recalling earlier tokens in the sequence and comparing tokens across the sequence. To understand the impact on language modeling, we propose a new SSM layer, H3, that is explicitly designed for these abilities. H3 matches attention on the synthetic languages and comes within 0.4 PPL of Transformers on OpenWebText. Furthermore, a hybrid 125M-parameter H3-attention model that retains two attention layers surprisingly outperforms Transformers on OpenWebText by 1.0 PPL. Next, to improve the efficiency of training SSMs on modern hardware, we propose FlashConv. FlashConv uses a fused block FFT algorithm to improve efficiency on sequences up to 8 K , and introduces a novel state passing algorithm that exploits the recurrent properties of SSMs to scale to longer sequences. FlashConv yields $2 \\times$ speedup on the long-range arena benchmark and allows hybrid language models to generate text $2.4 \\times$ faster than Transformers. Using FlashConv, we scale hybrid H3-attention language models up to 2.7B parameters on the Pile and find promising initial results, achieving lower perplexity than Transformers and outperforming Transformers in zero- and few-shot learning on a majority of tasks in the SuperGLUE benchmark. ## 1 Introduction\n\nState space models (SSMs) have achieved state-of-the-art sequence modeling performance in domains ranging from time series analysis [25] to audio generation [22]. However, they have yet to match the performance of Transformers on language modeling, often underperforming Transformers by multiple points in perplexity [25]. An natural question is whether this gap in performance is due to inherent inductive biases and capabilities in attention [17, 49], or whether it is a function of the significant organizational resources that have been spent training and tuning large attention-based language models [10, 32, 66], as well as specialized hardware support for attention, ranging from tensor cores [45] to transformer chips [34, 48]. We take first steps towards answering these questions in this paper. First, we use synthetic language modeling tasks to show that there is an expressivity gap between SSMs and attention. Using our insights,\n\n[^0]![](https://cdn.mathpix.com/cropped/2024_09_12_7a1798f4fbf723c76fd6g-02.jpg?height=584&width=1651&top_left_y=245&top_left_x=237)\n\nFigure 1: Left: H3 stacks two discrete SSMs with shift and diagonal matrices and uses multiplicative interactions between input projections and their outputs to model comparisons between points in a sequence. Middle: H3 can perform associative recall-which is easy for attention, but not existing SSMs. Right: FlashConv uses a new state-passing algorithm over fused block FFTConv to increase hardware efficiency of SSMs, allowing H3 to scale to billion-parameter models. we design a new SSM layer that nearly matches attention in language modeling. Second, we propose better hardware-aware algorithms for SSMs that allow them to take advantage of modern accelerators-and run faster than attention. Understanding the Expressivity Gap. To understand the gap between SSMs and attention, we draw on synthetic language modeling tasks that have been proposed as a mechanistic basis for in-context learning in Transformers [49] These synthetic languages focus on the ability to manipulate text-recalling tokens from earlier time steps, or comparing tokens from different points in a sequence. We find that existing SSMs struggle to model these synthetic languages. To probe how important these skills are for language modeling, we propose H3 (Hungry Hungry Hippo), a new SSM-based layer designed to solve these language modeling tasks. H3 stacks two SSMs, with multiplicative interactions between their outputs and input projections. The SSMs allow H3 to keep a log of tokens (to recall them later), while the multiplicative interactions allow for comparisons across the sequence. H3 matches attention on the synthetic languages and almost closes the gap with Transformers on language modeling-coming within 0.4 perplexity of Transformers on OpenWebText (compared to 3.4 ppl for existing SSMs-even those explicitly designed for language modeling [42]). Furthermore, a simple hybrid H3-attention model that retains two attention layers surprisingly outperforms Transformers on OpenWebText by 1.0 perplexity. To further evaluate H 3 on language modeling, we train $125 \\mathrm{M}-, 355 \\mathrm{M}-, 1.3 \\mathrm{~B}-$, and 2.7 B -parameter hybrid H3-attention language models on the Pile [21], using hyperparameters from GPT-3 [7]. These hybrid models outperform Transformer-based language models of the same size in perplexity, and match or outperform them on a majority of tasks in the SuperGLUE benchmark in zero- and few-shot learning. Since the SSM layers in these hybrid models admit a recurrent view, they can also perform $2.4 \\times$ faster inference than Transformers. Scaling SSMs. Next, we improve the efficiency of SSMs on modern hardware, to reduce the hardware barrier between attention and SSMs. SSMs scale nearly linearly in sequence length instead of quadratically like attention, but still run slower on modern hardware due to poor hardware utilization. To close this gap, we propose FlashCOnv, a hierarchical algorithm for computing SSMs, inspired by IO-Aware attention [15]. The technical challenge is that SSMs require a FFT-based convolution over the input sequence, which requires an FFT, pointwise multiply, and inverse FFT. When implemented in cuFFT [47], this operation incurs expensive GPU memory reads/writes, and cannot utilize the specialized matrix multiply units available on modern hardware ${ }^{1}$. To use specialized matrix multiply units, we appeal to classical techniques that split the FFT into blocks and compute it using a series of matrix multiplications. Combined with kernel fusion, this \"block\" FFT solution increases hardware efficiency, but only as long as the sequence length can fit into GPU SRAM\n\n[^1](on-chip memory, analogous to L1 cache on the CPU) - up to sequence length 8 K on modern A100. To scale to sequences longer than 8 K , we propose a state passing algorithm (Figure 1 right), specialized to SSMs. The key insight is that we can use the recurrent properties of SSMs to process the input in chunks-as long as we keep track of an additional state vector. The state passing algorithm splits the input into the largest chunks that can fit into GPU SRAM, efficiently computes the FFT-based convolution using block FFT, and updates an intermediate state to start the next chunk. Using this state-passing algorithm, FlashConv can scale SSMs to any sequence length - even longer than can fit on GPU SRAM at once - while maintaining a near linear compute complexity. FlashConv sets state-of-the-art speed on long range arena using S4 [25], outperforming Transformers by $5.8 \\times$ and previous S4 models by $2 \\times$. FlashConV trains H3 4- $8 \\times$ times faster than attention for long sequences, and is a critical component for scaling to billion-parameter models ${ }^{2}$. ## 2 Background\n\nWe present some background on state space models and linear attention, which inspired our H3 layer. ### 2.1 State Space Models\n\nA continuous-time state-space representation [6] defines a linear mapping from an input signal $u(t) \\in \\mathbb{R}$ (as a function of time $t$ ) to an output signal $y(t) \\in \\mathbb{R}$ through a state-variable $x(t) \\in \\mathbb{R}^{m}$, with the following differential equation, for some matrices $\\mathbf{A} \\in \\mathbb{R}^{m \\times m}, \\mathbf{B} \\in \\mathbb{R}^{m \\times 1}, \\mathbf{C} \\in \\mathbb{R}^{1 \\times m}, \\mathbf{D} \\in \\mathbb{R}^{1 \\times 1}: \\dot{x}(t)=\\mathbf{A} x(t)+\\mathbf{B} u(t)$, $y(t)=\\mathbf{C} x(t)+\\mathbf{D} u(t)$. Similarly, a discrete-time state-space representation defines a linear mapping from a discrete input signal $u_{i}$ (for $i=1,2, \\ldots$ ) to a discrete output signal $y_{i}$ though a state-variable $x_{i} \\in \\mathbb{R}^{m}$ :\n\n$$\n\\begin{aligned}\nx_{i} & =\\mathbf{A} x_{i-1}+\\mathbf{B} u_{i} \\\\\ny_{i} & =\\mathbf{C} x_{i}+\\mathbf{D} u_{i}\n\\end{aligned}\n$$\n\nA state-space model (SSM) uses these representations as a layer in a deep learning pipeline, where the matrices $\\mathbf{A}, \\mathbf{B}, \\mathbf{C}, \\mathbf{D}$ are learned from data (e.g., with gradient-based optimization). One often has $d$ of these SSMs in parallel, each corresponding to one hidden dimension. To preserve the sequence history, HiPPO [24] projects the history on a basis of orthogonal polynomials, which translates to having SSMs whose A, B matrices are initialized to some special matrices. This recurrent form of SSMs allows efficient inference (i.e., generation): to generate the output of the next time-step, one only needs the state of the current time-step, not the entire input history. Furthermore, SSMs can freely extrapolate to sequences longer than seen during training. SSMs as Convolution. For efficient training, given the entire sequence of the input $u_{1}, \\ldots, u_{N}$, the output sequence $y_{1}, \\ldots, y_{N}$ can also be written as the convolution of the input with the filter [27]:\n\n$$\nf=\\left[\\mathbf{C B}, \\mathbf{C A B}, \\mathbf{C A}^{2} \\mathbf{B}, \\ldots, \\mathbf{C A}^{N-1} \\mathbf{B}\\right]\n$$\n\nThat is, from an initial condition $x_{0}$, we have $y_{i}=\\mathbf{C A}^{i} \\mathbf{B} x_{0}+(f * u)_{i}+\\mathbf{D} u_{i}$, where $(f * u)$ denotes a linear convolution between $f$ and $u$. If we set the initial condition $x_{0}$ to be zero, then $y$ is exactly a linear convolution of $u$, with a residual connection $\\mathbf{D} u$. More generally, any linear time-invariant system (of which SSMs are a special case) can be written as a convolution. Given a 1 D input sequence $u \\in \\mathbb{R}^{N}$ of length $N$, we denote the 1 D output sequence $y \\in \\mathbb{R}^{N}$ of an SSM parameterized by matrices $\\mathbf{A}, \\mathbf{B}, \\mathbf{C}, \\mathbf{D}$ as\n\n$$\ny=\\operatorname{SSM}_{\\mathbf{A}, \\mathbf{B}, \\mathbf{C}, \\mathbf{D}}(u)\n$$\n\nTo simplify notation, we omit the reference to $\\mathbf{A}, \\mathbf{B}, \\mathbf{C}, \\mathbf{D}$ and write $y=\\operatorname{SSM}(u)$ if they are clear from context. When $u$ is multidimensional of dimension $d$, we stack $d$ of these SSMs together that defines a mapping from $u \\in \\mathbb{R}^{N \\times d}$ to $y \\in \\mathbb{R}^{N \\times d}$, using the same notation $y=\\operatorname{SSM}(u)$. To construct the filter $f$ from $\\mathbf{A}, \\mathbf{B}, \\mathbf{C}$ efficiently, $\\mathbf{A}$ is often constrained to be diagonal $[26,29]$, or diagonal plus low-rank [25]. SSM through FFTs. Computing the convolution naively through conventional matrix operations is expensive for long kernels, scaling as $O\\left(N^{2}\\right)$. Instead, we can use FFTs: take the FFT of $f$ and $u$, multiply them together pointwise, and then take the inverse FFT. This yields an $O(N \\log N)$ algorithm. [^2]\n### 2.2 Linear attention\n\nWe describe linear attention [35] and its connection to RNNs, which inspired our model design (Section 3). In standard attention [62], we have $N$ query/key/value tokens $Q_{i}, K_{i}, V_{i} \\in \\mathbb{R}^{d}$ for $i=1, \\ldots, N$, where $N$ is the sequence length and $d$ is the head dimension. For some similarity metric $\\operatorname{Sim}: \\mathbb{R}^{d} \\times \\mathbb{R}^{d} \\rightarrow \\mathbb{R}$, we want to compute the output:\n\n$$\nO_{i}=\\frac{\\sum_{j=1}^{i} \\operatorname{Sim}\\left(Q_{i}, K_{j}\\right) V_{j}}{\\sum_{j=1}^{i} \\operatorname{Sim}\\left(Q_{i}, K_{j}\\right)} \\in \\mathbb{R}^{d}\n$$\n\nFor standard softmax attention, $\\operatorname{Sim}(q, k)=e^{q^{\\top} k}$ (often the dot product is scaled by $1 / \\sqrt{d}$ ). Linear attention makes the assumption that $\\operatorname{Sim}$ has the form $\\operatorname{Sim}(q, k)=\\phi(q)^{\\top} \\phi(k)$, for some (nonlinear) function $\\phi$. The output is then $O_{i}=\\frac{\\phi\\left(Q_{i}\\right)^{\\top} \\sum_{j=1}^{i} \\phi\\left(K_{j}\\right) V_{j}^{\\top}}{\\phi\\left(Q_{i}\\right)^{\\top} \\sum_{j=1}^{i} \\phi\\left(K_{j}\\right)}$. Let $S_{i}=\\sum_{j=1}^{i} \\phi\\left(K_{j}\\right) V_{j}^{\\top} \\in \\mathbb{R}^{d \\times d}, z_{i}=\\sum_{j=1}^{i} \\phi\\left(K_{j}\\right) \\in \\mathbb{R}^{d}$, $d_{i}=\\phi\\left(Q_{i}\\right)^{\\top} z_{i} \\in \\mathbb{R}$. Then $O_{i}=\\frac{\\phi\\left(Q_{i}\\right)^{\\top} S_{i}}{d_{i}}$. This connects linear attention to RNNs: the output $O_{i}$ is a function of $S_{i}$ and $z_{i}$, both of which are incrementally updated (as cumulative sums). ## 3 Hungry Hungry Hippos Layer to Model Discrete Sequences\n\nTo understand the gap between SSMs and attention on language modeling, we examine two synthetic language modeling tasks. These tasks motivate our H3 layer to add a discrete SSM (based on shift matrix) and multiplicative interaction to effectively model discrete sequences. We then show that the H3 layer is expressive enough to solve these synthetic tasks, and that this understanding leads to better performance on a real language modeling benchmark. ### 3.1 Motivation: Synthetic Language Modeling Tasks\n\nWe describe two closely-related synthetic tasks, summarized in Table 1. Olsson et al. [49] argue that the ability to solve (variants of) these tasks accounts for the majority of the in-context learning capability of Transformers, and more intuition is given in Appendix E. Table 1: Synthetic language modeling tasks. | Task | Input | Output | Sequence Length | Vocab Size |\n| :---: | :---: | :---: | :---: | :---: |\n| Induction Head | $a b c d e \\vdash f g h i \\ldots x y z \\vdash$ | $f$ | 30 | 20 |\n| Associative Recall | $a 2 c 4 b 3 d 1 a$ | 2 | 20 | 10 |\n\nThe Induction Head task tests how well a model can recall content after a special token (e.g., $\\vdash$ in Table 1). At the end of the sequence, the model must recall the token that appeared immediately after the special token earlier in the sequence. Associative Recall [1] is similar to the induction head task, but requires the model to remember multiple key-value pairs. At the end of the sequence, the model must recall a specific value belonging to a specific key. Table 2: Evaluation of 2-layer models on synthetic language tasks. | Task | Random | S4D | Gated State Spaces | H3 | Attention |\n| :---: | :---: | :---: | :---: | :---: | :---: |\n| Induction Head | 5.0 | 35.6 | 6.8 | $\\mathbf{1 0 0 . 0}$ | $\\mathbf{1 0 0 . 0}$ |\n| Associative Recall | 25.0 | 86.0 | 78.0 | 99.8 | $\\mathbf{1 0 0 . 0}$ |\n\nTable 2 (for two-layer models) shows that S4D [26] and Gated State Spaces [42] both fail to model these synthetic languages, which suggests they may not have the expressivity for general language. We argue that these failures suggest two missing capabilities: (i) to remember tokens that appear after a particular event (e.g., the special token in the induction head task), and (ii) to compare tokens across the sequence (e.g., comparing keys to decide which value to recall). Attention has both these capabilities: it can compare tokens by constructing the quadratic attention matrix $\\mathbf{Q K}^{\\top}$, and it can recall tokens by direct copying (multiplying $\\operatorname{softmax}\\left(\\mathbf{Q K}^{\\top}\\right)$ with $\\left.\\mathbf{V}\\right)$. In Section 3.2, we design our new layer H3 to enable these capabilities in SSMs, narrowing the expressivity gap between SSMs and attention. ### 3.2 H3 Layer\n\nH3 uses SSMs with shift and diagonal matrices, along with multiplicative operations against projections of the input to capture the missing capabilities identified by the synthetics. High-level Intuition. (i) To remember tokens from the past, we want the state $x_{i}$ to copy from the input $u_{i}$, and then pass that information to the next state $x_{i+1}$. As $x_{i+1}$ relates to $x_{i}$ by $\\mathbf{A} x_{i}$, we use a discrete SSM with a shift matrix A (described formally below) that shifts the elements of a state vector (e.g., mapping $[a, b, c] \\rightarrow[0, a, b]$ ). (ii) To compare tokens across the sequence, we use multiplicative interaction: the output of an SSM, containing information from previous time steps, is multiplied with the input at the current time steps, thus measuring similarity between tokens. H3 is loosely inspired by linear attention (Section 2): we project the input $u$ to get three signals $\\mathbf{Q}, \\mathbf{K}, \\mathbf{V}$. Then we replace the non-linearity $\\phi(\\mathbf{K})$ with an SSM where $\\mathbf{A}$ is a shift matrix $\\left(\\mathrm{SSM}_{\\text {shift }}\\right)$, and we replace the summation $S_{i}$ with a SSM with diagonal $\\mathbf{A}\\left(\\mathrm{SSM}_{\\text {diag }}\\right)$. The output, for the case of head dimension $d_{h}=1$, is:\n\n$$\n\\mathbf{Q} \\odot \\operatorname{SSM}_{\\text {diag }}\\left(\\operatorname{SSM}_{\\text {shift }}(\\mathbf{K}) \\odot \\mathbf{V}\\right)\n$$\n\nwhere $\\odot$ denotes pointwise multiplication. We can view this form as stacking two SSMs with multiplicative interaction (each is a \"hungry hippo\", hence the name of our layer). A more formal connection between linear attention, time-varying systems, and H3 can be found in Appendix B. Remembering Key Tokens: Shift and Diagonal SSMs. The shift and diagonal SSMs are designed to address the capability to log tokens after particular events. In the shift SSM, we constrain $\\mathbf{A} \\in \\mathbb{R}^{m \\times m}$ to be a shift matrix $\\mathbf{A}_{i, j}=\\left\\{\\begin{array}{ll}1 & \\text { for } i-1=j \\\\ 0 & \\text { otherwise }\\end{array}\\right.$. The action of this matrix on the hidden state $x_{i}$ is to shift each coordinate down by one-thereby creating a \"memory\" of the previous states. For example, if $\\mathbf{B}=e_{1}$, the first basis vector, then $x_{i}=\\left[u_{i}, u_{i-1}, \\ldots, u_{i-m+1}\\right]$ contains the inputs from the previous $m$ time steps. We learn $\\mathbf{B}$ and $\\mathbf{C}\\left(\\mathbf{B}\\right.$ can also be fixed to $e_{1}$ for simplicity, in which case the output is a 1D conv. with kernel size $m$ ). The diagonal SSM constrains $\\mathbf{A}$ to be diagonal and initializes it from the diagonal version of HiPPO (S4D [26]). This parameterization allows the model to remember state over the entire sequence. The shift SSM can detect when a particular event occurs, and the diagonal SSM can remember a token afterwards for the rest of the sequence. Multiplicative Interaction for Comparison. We take the multiplicative interactions from linear attention, but they provide another missing capability when combined with a shift matrix: comparing tokens across the sequence. The multiplicative interactions between the output of the shift SSM and the V projection mimics local multiplicative interactions in linear attention (depending on the size of the hidden state). Similarly, multiplicative interactions with the $\\mathbf{Q}$ projection and the output of the diagonal SSM allows comparisons between tokens over the entire sequence. H3 Layer. The overall layer is given in Algorithm 1 and shown schematically in Figure 1 (left). We use the H3 layer to construct a model in the same style as Transformers by interleaving it with MLPs, connected by residual connection and layer norm (i.e., pre-norm architecture [2]). We will also consider a hybrid H3-attention model (two attention layers while the rest are H 3 , Sections 3.3 and 5). ```\nAlgorithm 1 H3 Layer\nRequire: Input sequence \\(u \\in \\mathbb{R}^{N \\times d}\\) from the previous layer, weight matrices \\(\\mathbf{W}_{Q}, \\mathbf{W}_{K}, \\mathbf{W}_{V}, \\mathbf{W}_{O} \\in \\mathbb{R}^{d \\times d}\\), a shift\n    SSM SSM \\(_{\\text {shift }}\\), a diagonal SSM SSM \\({ }_{\\text {diag }}\\), head dimension \\(d_{h}\\). Compute \\(\\mathbf{Q}=u \\mathbf{W}_{Q}, \\mathbf{K}=u \\mathbf{W}_{K}, \\mathbf{V}=u \\mathbf{W}_{V} \\in \\mathbb{R}^{N \\times d}\\)\n    Pass \\(\\mathbf{K}\\) through the shift SSM: \\(\\overline{\\mathbf{K}}=\\operatorname{SSM}_{\\text {shift }}(\\mathbf{K}) \\in \\mathbb{R}^{N \\times d}\\). Split \\(\\mathbf{Q}, \\overline{\\mathbf{K}}, \\mathbf{V}\\) into \\(H\\) \"heads\" \\(\\left(\\mathbf{Q}^{(h)}, \\overline{\\mathbf{K}}^{(h)}, \\mathbf{V}^{(h)}\\right.\\) for \\(\\left.h=1, \\ldots, H\\right)\\), each a sequence of \\(N\\) vectors of size \\(d_{h}=d / H\\). for \\(1 \\leq h \\leq H\\) do\n        Take the batched outer product \\(\\overline{\\mathbf{K}}^{(h)}\\left(\\mathbf{V}^{(h)}\\right)^{\\top} \\in \\mathbb{R}^{N \\times d_{h} \\times d_{h}}\\) (batched in the \\(N\\)-dimension) and pass it through a\n        diagonal SSM: \\(\\mathbf{K V}^{(h)}=\\operatorname{SSM}_{\\text {diag }}\\left(\\overline{\\mathbf{K}}^{(h)}\\left(\\mathbf{V}^{(h)}\\right)^{\\top}\\right) \\in \\mathbb{R}^{N \\times d_{h} \\times d_{h}}\\). Batch-multiply by \\(\\mathbf{Q}: \\mathbf{O}^{(h)}=\\left[\\mathbf{Q}_{1}^{(h)} \\mathbf{K} \\mathbf{V}_{1}^{(h)}, \\ldots, \\mathbf{Q}_{N}^{(h)} \\mathbf{K} \\mathbf{V}_{N}^{(h)}\\right] \\in \\mathbb{R}^{N \\times d_{h}}\\) (batched in the \\(N\\)-dimension). end for\n    Concatenate the output \\(\\mathbf{O}^{(h)}\\) of each head, and multiply by the output projection matrix \\(\\mathbf{W}_{O} \\in \\mathbb{R}^{d \\times d}\\). ```\n\nEfficiency We show that H 3 scales as $O(N \\log N)$ with sequence length $N$-asymptotically more efficient than attention, which typically requires $O\\left(N^{2} d\\right)$ time and $O\\left(N^{2}\\right)$ space $^{3}$ (proof in Appendix D.3). Proposition 1. Let $N$ be the sequence length, $d$ be the hidden dimension, and assume that the head dimension $d_{h}$ is of order $O(1)$. Then the H3 layer takes $O\\left(d^{2} N+d N \\log N\\right)$ time and $O(d N)$ space to compute. ### 3.3 Expressivity\n\nWe show that H3 can model our synthetic languages, as well as natural language on OpenWebText [23]. We also present a hybrid H3-attention extension that outperforms Transformers on OpenWebText. Mechanism for Solving Associative Recall with H3. H3 is expressive enough to solve our synthetic language modeling tasks, as shown in Table 2. Figure 1 (middle) shows a mechanism for a single H3 layer to solve the associative recall task for a particular key-value pair $(a, 3)$. The shift SSM and following multiplicative interaction act as a gate on whether to let a value through to the diagonal SSM, based on whether the previous token was key $a$. The diagonal SSM stores the value 3 in memory, and continually outputs it. The final multiplicative interaction gates whether to let the diagonal SSM's output through-based on whether the current input token is the key $a$. We formally construct the weights of an H3 layer to solve this task in Appendix D.1. Table 3: Perplexity of SSM variants compared to Transformers on OpenWebText. All models have 12 layers, with size around 125 M , and are trained with the same hyperpameters, for 50 B tokens. | H3 | H3 Hybrid (2 Attn) | S4D | GSS | GSS Hybrid (2 Attn) | Transformer |\n| :---: | :---: | :---: | :---: | :---: | :---: |\n| 21.0 | $\\mathbf{1 9 . 6}$ | 24.9 | 24.0 | 19.8 | 20.6 |\n\nBetter Synthetic Language Modeling Translates to Better Natural Language Modeling. We validate that when H 3 can solve these synthetic tasks, it also improves the modeling capability on natural language (e.g., on the OpenWebText dataset). As shown in Table 3, H3 comes within 0.4 perplexity points of Transformers when trained for 50B tokens on OpenWebText, and performs much better than existing SSM variants (S4D, GSS), by $3-3.9$ points. Extension: H3-attention Hybrid Model. A simple hybrid H3-attention language model surprisingly outperforms Transformers on OpenWebText by 1.0 point. Our hybrid model simply retains two self-attention layers: one in the second layer, and one in the middle (layer $2+N / 2$ for an $N$-layer model, $N$ even). The H3-attention hybrid also outperforms the GSS-attention hybrid [42]. ## 4 FlashConv: Efficiently Training SSMs\n\nTo improve the efficiency of SSMs on modern hardware, we propose FlashConv. FlashConv fuses the FFT, pointwise multiply, and inverse FFT to reduce memory reads/writes. It also uses a block FFT algorithm to make use of specialized matrix multiply units (e.g., tensor cores on A100) for sequence lengths up to $8 K$. For sequences longer than 8 K , the computation no longer fits in GPU SRAM ${ }^{4}$, so we propose a novel state-passing algorithm that splits the sequence into chunks to compute the FFT convolution one chunk at a time. FlashConv can speed up any SSMs (not just H3). ### 4.1 Fused Block FFTConv\n\nWe deploy two techniques to speed up the FFT-based convolution for sequences shorter than 8 K : kernel fusion and block FFT. Kernel fusion addresses IO bottlenecks due to reading and writing of intermediate results, while block FFT allows the FFT-based convolution to utilize specialized matrix multiplication units. These techniques allow us to speed up FFTConv by $2 \\times$ (Section 6) for sequences shorter than 8 k . Kernel Fusion. Naive implementations of FFTConv using standard libraries such as cuFFT are IObound due to repeated reading and writing of intermediate results. The FFT convolution in an SSM with input $u$ and filter $f$ has the form $i F F T(F F T(u) \\odot F F T(f))$ (where $\\odot$ denotes pointwise multiplication). [^3]It requires reading and writing intermediate results to GPU memory-which can dominate the runtime. Following FlashAttention [15], we first fuse the entire FFTConv into a single kernel and compute it in SRAM to avoid this overhead. Block FFT. To further speed up the computation of FFT-based convolution, we exploit specialized matrix multiplication hardware on modern GPUs (e.g., Tensor Cores on Nvidia GPUs perform fast $16 \\times 16$ matrix multiplication). We appeal to classical results that show that the FFT can be written as a series of block-diagonal matrix multiplications interleaved with permutation. We note that such algorithms are not new, but our setting (fused FFTConv on GPU) introduces new bottlenecks-by removing the IO bottlenecks, compute becomes the bottleneck (note that a single FFT on GPU is usually IO bound). Suppose that we want to perform an $N$-point FFT, which is equivalent to multiply by the DFT matrix $\\mathbf{F}_{N}$. Suppose that $N=N_{1} N_{2}$ for some integers $N_{1}, N_{2}$. By the Cooley-Tukey decomposition of the DFT [3, 11] (also known as the four-step FFT algorithm), we can write $\\mathbf{F}_{N}=\\mathbf{P}\\left(\\mathbf{I}_{N_{2}} \\otimes \\mathbf{F}_{N_{1}}\\right) \\mathbf{P}^{\\top} \\mathbf{D}\\left(\\mathbf{I}_{N_{1}} \\otimes \\mathbf{F}_{N_{2}}\\right) \\mathbf{P}$, where $\\mathbf{P}$ denotes a fixed permutation that reshapes the input as a $N_{1} \\times N_{2}$ array and then transpose it, $\\otimes$ denotes Kroneker product, $\\mathbf{D}$ is a $N \\times N$ diagonal matrix (called the twiddle factors) [14], and $\\mathbf{I}_{N_{i}}$ and $\\mathbf{F}_{N_{i}}$ are the identity and DFT matrix of size $N_{i} \\times N_{i}$. As $\\mathbf{I}_{N_{2}} \\otimes \\mathbf{F}_{N_{1}}$ and $\\mathbf{I}_{N_{1}} \\otimes \\mathbf{F}_{N_{2}}$ are just block-diagonal matrices, we can make use of specialized matmul units to perform these multiplications. Similarly, if $N=N_{1} N_{2} N_{3}$ then we can decompose the $N$-point FFT into a series of (block) FFT of size $N_{1}, N_{2}$, and $N_{3}$, interleaved by permutation. The block FFT algorithm incurs $O(N r \\log N / \\log r)$ FLOPs for a sequence length $N$, if $N$ can be written as $r^{p}$ for two integers $r, p$. This incurs more FLOPs than standard FFT $(O(N \\log N))$, but can run faster when we using specialized matrix multiplication hardware. ### 4.2 State-Passing\n\nHowever, the fused kernel cannot run if the sequence is too long to fit into GPU SRAM (longer than 8K on A100). We show how to exploit the particular form of the FFT in SSM to speed it up for long sequences. The recurrent nature of SSMs allows us to split the FFTConv of a length- $N$ sequence into chunks of size $N^{\\prime}$ each ( $N^{\\prime}$ is the longest FFT we can fit into SRAM), assuming $N$ is a multiple of $N^{\\prime}$ ). We use FFTConv to compute each chunk and use a recurrence to connect the chunks. In particular, we split the inputs $u$ into $C=N / N^{\\prime}$ chunks $u^{(c)} \\in \\mathbb{R}^{N^{\\prime}}$ for $c=1, \\ldots, C$. Similarly, split the states $x$ into $x^{(c)} \\in \\mathbb{R}^{N^{\\prime} \\times m}$ and the output $y$ into $y^{(c)} \\in \\mathbb{R}^{N^{\\prime}}$ for $i=1, \\ldots, C$. We will only need the end-state $x_{N^{\\prime}}^{(c)}$ of each chunk $c$. Let $f=\\left[\\mathbf{C B}, \\mathbf{C A B}, \\mathbf{C A}^{2} \\mathbf{B}, \\ldots, \\mathbf{C A}^{N^{\\prime}-1} \\mathbf{B}\\right]$ be the SSM filter. Recall from Section 2 that for each chunk $c$, $y_{i}^{(c)}=\\mathbf{C A}^{i} \\mathbf{B} x_{N^{\\prime}}^{(c-1)}+\\left(f * u^{(c)}\\right)_{i}+\\mathbf{D} u_{i}^{(c)}$, since $x_{N^{\\prime}}^{(c-1)}$, the end-state of the previous chunk $(c-1)$ is the initial condition for the current chunk $c$. In vector notation, $y^{(c)}=\\mathbf{M}_{x y} x_{N^{\\prime}}^{(c-1)}+f * u^{(c)}+\\mathbf{D} u^{(c)}$ for some matrix $\\mathbf{M}_{x y} \\in \\mathbb{R}^{N^{\\prime} \\times m}$. Additionally we need to update the end-state of each chunk with $x_{N^{\\prime}}^{c}=\\mathbf{A}^{N^{\\prime}} x_{N^{\\prime}}^{(c-1)}+\\mathbf{M}_{u x} u^{(c)}$ for some matrix $\\mathbf{M}_{u x}^{m \\times N^{\\prime}}$ (derivation in Appendix C.2). In essence, we can compute the output for each chunk with FFT-based convolution as long as we remember the end-state of the previous chunk, and the end-state of each chunk can be updated recurrently. This yields a state-passing algorithm for long sequences, where we only compute FFT of length $N^{\\prime}$, and update some hidden state each iteration. Let BlockFFTConv refer to our fused block FFTConv kernel. Then, the state-passing algorithm for 1D input is given by Algorithm 2. For inputs of dimension $d$ where we stack $d$ SSMs, we simply batch Algorithm 2 along the $d$-dimension. ```\nAlgorithm 2 State Passing Algorithm\nRequire: Input \\(u \\in \\mathbb{R}^{N}\\), SSM parameterized by matrices \\(\\mathbf{A} \\in \\mathbb{R}^{m \\times m}, \\mathbf{B} \\in \\mathbb{R}^{m \\times 1}, \\mathbf{C} \\in \\mathbb{R}^{1 \\times m}, \\mathbf{D} \\in \\mathbb{R}^{1 \\times 1}\\), chunk size\n    \\(N^{\\prime}\\) where \\(N\\) is a multiple of \\(N^{\\prime}\\). Precompute \\(\\mathbf{A}^{N^{\\prime}} \\in \\mathbb{R}^{m \\times m}, \\mathbf{M}_{u x}=\\left[\\mathbf{A}^{N^{\\prime}-1} \\mathbf{B}, \\ldots, \\mathbf{B}\\right] \\in \\mathbb{R}^{m \\times N^{\\prime}}, \\mathbf{M}_{x y}=\\left[\\mathbf{C}, \\mathbf{C A}, \\ldots, \\mathbf{C A}^{N^{\\prime}-1}\\right] \\in \\mathbb{R}^{N^{\\prime} \\times m}\\). Split the inputs \\(u_{1: N}\\) into \\(C=N / N^{\\prime}\\) chunks \\(u_{1: N^{\\prime}}^{(c)}\\) for \\(c=1, \\ldots, C\\). Let the initial state be \\(x_{N^{\\prime}}^{(0)}=0 \\in \\mathbb{R}^{m}\\). for \\(1 \\leq c \\leq C\\) do\n        Compute \\(y^{(c)}=\\mathbf{M}_{x y} x_{N^{\\prime}}^{(c-1)}+\\operatorname{BlockFFTConv}\\left(f, u_{j}\\right)+\\mathbf{D} u^{(c)} \\in \\mathbb{R}^{N^{\\prime}}\\).",
    "h3-2": "Update state: \\(x_{N^{\\prime}}^{(c)}=\\mathbf{A}^{N^{\\prime}} x_{N^{\\prime}}^{(c-1)}+\\mathbf{M}_{u x} u^{(c)}\\). end for\n    Return \\(y=\\left[y^{(1)} \\ldots y^{(C)}\\right]\\). ```\n\nTable 4: Perplexity (lower is better) of models on the Pile, OpenWebText and WikiText-103. GPT-Neo and hybrid H3 are trained on the Pile, while GPT2 is trained on WebText. All models use the same GPT2 tokenizer. We report the perplexity of GPT-2 models on the Pile $\\left(^{*}\\right)$ for context, though the performance is not directly comparable since they were trained on different data. | Model | Pile | OpenWebText | WikiText103 |\n| :---: | :---: | :---: | :---: |\n| GPT-2 small (125M) | $19.0^{*}$ | 22.6 | 29.9 |\n| GPT-Neo-125M | 9.4 | 22.6 | 26.3 |\n| Hybrid H3-125M | $\\mathbf{8 . 8}$ | $\\mathbf{2 0 . 9}$ | $\\mathbf{2 3 . 7}$ |\n| GPT-2 medium (355M) | $13.9^{*}$ | 17.0 | 21.8 |\n| Hybrid H3-355M | $\\mathbf{7 . 1}$ | $\\mathbf{1 5 . 9}$ | $\\mathbf{1 6 . 9}$ |\n| GPT-2 XL (1.5B) | $12.4^{*}$ | 12.9 | 17.0 |\n| GPT-Neo-1.3B | 6.2 | 13.1 | 13.3 |\n| Hybrid H3-1.3B | $\\mathbf{6 . 0}$ | $\\mathbf{1 2 . 4}$ | $\\mathbf{1 2 . 5}$ |\n| GPT-Neo-2.7B | 5.7 | 11.7 | 11.5 |\n| Hybrid H3-2.7B | $\\mathbf{5 .",
    "h3-3": "4}$ | $\\mathbf{1 1 . 0}$ | $\\mathbf{1 0 . 6}$ |\n\nTable 5: Zero-shot acc. on SuperGLUE with logit scoring. Best results in bold, second best underline. | Model | WSC | WIC | RTE | CB | MultiRC | ReCoRD | BoolQ | COPA | Average |\n| :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: |\n| OPT-125M | $\\mathbf{3 9 . 4}$ | $\\underline{52.0}$ | 48.7 | 37.4 | $\\underline{58.9}$ | $\\underline{44.9}$ | $\\underline{59.6}$ | $\\underline{60.0}$ | 50.1 |\n| GPT-Neo-125M | $\\underline{36.5}$ | $\\mathbf{5 3 . 6}$ | $\\underline{53.1}$ | $\\underline{41.1}$ | $\\underline{\\mathbf{5 9 . 9}}$ | 39.6 | $\\mathbf{6 2 . 2}$ | $\\underline{60.0}$ | $\\underline{50.8}$ |\n| Hybrid H3-125M | $\\mathbf{3 9 .",
    "h3-4": "4}$ | 51.4 | $\\mathbf{5 9 . 2}$ | $\\mathbf{4 8 . 2}$ | 51.4 | $\\mathbf{5 5 . 0}$ | $\\underline{59.6}$ | $\\mathbf{6 7 . 0}$ | $\\mathbf{5 3 . 9}$ |\n| GPT-2 medium $(355 M)$ | $\\underline{50.0}$ | $\\mathbf{5 2 . 0}$ | 51.3 | 28.6 | $\\mathbf{5 9 . 5}$ | $\\underline{53.3}$ | $\\underline{61.0}$ | $\\underline{65.0}$ | 52.6 |\n| OPT-350M | $\\mathbf{5 3 . 5}$ | 50.8 | $\\underline{53.4}$ | $\\underline{35.7}$ | $\\underline{58.9}$ | 51.4 | 60.9 | 60.0 | $\\underline{53.1}$ |\n| Hybrid H3-355M | 37.5 | $\\underline{51.7}$ | $\\mathbf{5 5 .",
    "h3-5": "2}$ | $\\underline{\\mathbf{4 1 . 1}}$ | $\\mathbf{5 9 . 5}$ | $\\mathbf{6 2 . 3}$ | $\\mathbf{6 1 . 5}$ | $\\mathbf{6 9 . 0}$ | $\\mathbf{5 4 . 7}$ |\n| OPT-1.3B | 36.5 | 49.5 | $\\mathbf{5 3 .",
    "h3-6": "4}$ | $\\mathbf{3 9 . 3}$ | $\\mathbf{5 8 . 3}$ | $\\underline{61.8}$ | 55.0 | $\\underline{69.0}$ | $\\underline{52.9}$ |\n| GPT-Neo-1.3B | $\\underline{41.3}$ | $\\underline{50.0}$ | $\\underline{52.3}$ | $\\underline{33.9}$ | 57.9 | 55.5 | $\\underline{59.9}$ | 66.0 | 52.1 |\n| Hybrid H3-1.3B | $\\mathbf{5 2 .",
    "h3-7": "9}$ | $\\mathbf{5 0 . 3}$ | $\\mathbf{5 3 . 4}$ | $\\underline{33.9}$ | $\\underline{58.2}$ | $\\mathbf{6 7 . 8}$ | $\\mathbf{6 1 . 7}$ | $\\mathbf{7 4 . 0}$ | $\\mathbf{5 6 . 5}$ |\n| OPT-2.7B | $\\mathbf{5 1 . 0}$ | $\\underline{50.8}$ | 50.5 | $\\underline{41.1}$ | 57.4 | $\\underline{65.9}$ | 60.9 | 66.0 | $\\underline{55.5}$ |\n| GPT-Neo-2.7B | $\\underline{37.5}$ | 50.0 | $\\underline{52.3}$ | $\\mathbf{5 0 . 0}$ | $\\mathbf{5 9 . 1}$ | $\\underline{60.0}$ | $\\mathbf{6 1 . 1}$ | $\\underline{67.0}$ | 54.6 |\n| Hybrid H3-2.7B | 36.5 | $\\mathbf{5 1 .",
    "h3-8": "3}$ | $\\mathbf{5 7 . 0}$ | 37.5 | $\\underline{58.7}$ | $\\mathbf{7 1 . 3}$ | $\\mathbf{6 1 .",
    "h3-9": "1}$ | $\\mathbf{8 1 . 0}$ | $\\mathbf{5 6 . 8}$ |\n\nWe prove that Algorithm 2 yields the same output as if one has computed the SSM using a large FFT of size $N$ (proof in Appendix D.4):\n\nProposition 2. For input $u \\in \\mathbb{R}^{N}$ and matrices $\\mathbf{A}, \\mathbf{B}, \\mathbf{C}, \\mathbf{D}$, the output $y \\in \\mathbb{R}^{N}$ returned by Algorithm 2 is the same as the output defined by the SSM parameterized by $\\mathbf{A}, \\mathbf{B}, \\mathbf{C}, \\mathbf{D}$. ## 5 H3 Evaluation\n\nTo understand how well capturing the synthetics in Section 3.1 translates to language modeling, we train two hybrid hybrid H3-attention language models at sizes $125 \\mathrm{M}, 355 \\mathrm{M}, 1.3 \\mathrm{~B}$, and 2.7 B , and we evaluate their performance against Transformers. The hybrid models match or exceed the quality of Transformers in perplexity and zero/few-shot learning. We also validate that H3 models retain strong performance on non-text sequence modeling. Appendix F contains additional experiments on more datasets, length extrapolation, and scaling with data. ### 5.1 Language Modeling\n\nWe compare hybrid H3-attention language models against Transformer-based language models. We evaluate language modeling performance using perplexity, zero-shot learning, and few-shot learning performance. Hybrid H3 models outperform Transformers, which suggests that closing the gap between SSMs and attention on the synthetic languages translates to real language modeling capabilities. We also report the generation speed of hybrid H3 models compared to Transformers; since SSMs are recurrent models, they can generate tokens $2.4 \\times$ faster than Transformers. Appendix F shows performance of pure H3 language models on these same evaluation metrics. Setup We train hybrid models at sizes $125 \\mathrm{M}, 355 \\mathrm{M}, 1.3 \\mathrm{~B}$, and 2.7 B on the Pile [21] for 400B tokens. We compare against checkpoints of equivalent sizes from Open-AI [53] and GPT-Neo ${ }^{5}$ [4], from HuggingFace [65]. [^4]Table 6: 3 -shot acc. on SuperGLUE with logit scoring. Best results in bold, second best underline. | Model | WSC | WIC | RTE | CB | MultiRC | ReCoRD | BoolQ | COPA | Average |\n| :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: |\n| OPT-125M | 36.5 | $\\mathbf{5 0 . 2}$ | 47.3 | $\\underline{44.6}$ | $\\mathbf{5 7 . 9}$ | $\\underline{44.9}$ | 41.9 | 60.0 | $\\underline{47.9}$ |\n| GPT-Neo-125M | $\\underline{38.5}$ | $\\underline{50.0}$ | $\\underline{53.1}$ | 17.9 | 56.3 | 39.6 | $\\mathbf{6 2 . 1}$ | $\\underline{60.0}$ | 47.2 |\n| Hybrid H3-125M | $\\mathbf{4 3 .",
    "h3-10": "3}$ | 49.1 | $\\mathbf{5 8 . 1}$ | $\\mathbf{5 1 . 8}$ | $\\underline{48.9}$ | $\\mathbf{5 5 . 0}$ | $\\underline{56.1}$ | $\\underline{\\mathbf{6 7 . 0}}$ | $\\mathbf{5 3 . 7}$ |\n| GPT-2 medium (355M) | 36.5 | $\\mathbf{5 0 . 5}$ | $\\underline{48.0}$ | 8.9 | 43.5 | $\\underline{53.3}$ | 58.8 | $\\underline{65.0}$ | 45.6 |\n| OPT-350M | $\\underline{37.5}$ | $\\underline{50.0}$ | 45.8 | $\\mathbf{4 4 . 6}$ | $\\underline{49.8}$ | $\\underline{51.4}$ | $\\mathbf{6 1 . 7}$ | $\\underline{60.0}$ | $\\underline{50.1}$ |\n| Hybrid H3-355M | $\\underline{\\mathbf{4 2 . 3}}$ | 47.5 | $\\mathbf{5 0 . 5}$ | $\\underline{28.6}$ | $\\mathbf{5 9 . 7}$ | $\\mathbf{6 2 . 3}$ | $\\underline{60.5}$ | $\\mathbf{6 9 . 0}$ | $\\mathbf{5 2 . 6}$ |\n| OPT-1.3B | $\\mathbf{4 4 . 2}$ | $\\mathbf{5 1 . 1}$ | $\\underline{53.4}$ | 16.1 | $\\mathbf{5 9 . 9}$ | $\\underline{62.1}$ | 38.3 | $\\underline{70.0}$ | 49.4 |\n| GPT-Neo-1.3B | 35.6 | 50.6 | 47.3 | $\\mathbf{3 2 .",
    "h3-11": "1}$ | $\\mathbf{5 9 . 9}$ | 55.7 | $\\mathbf{6 1 . 2}$ | 67.0 | $\\underline{51.2}$ |\n| Hybrid H3-1.3B | $\\underline{36.5}$ | 49.2 | $\\mathbf{5 5 . 2}$ | $\\underline{23.2}$ | $\\underline{59.3}$ | $\\mathbf{6 7 . 6}$ | $\\underline{56.9}$ | $\\mathbf{7 6 . 0}$ | $\\mathbf{5 3 . 0}$ |\n| OPT-2.7B | $\\underline{44.2}$ | 50.5 | $\\mathbf{5 3 . 4}$ | 17.9 | $\\underline{59.2}$ | $\\underline{66.0}$ | $\\mathbf{6 2 . 0}$ | $\\underline{71.0}$ | $\\underline{53.0}$ |\n| GPT-Neo-2.7B | $\\mathbf{4 9 . 0}$ | $\\mathbf{5 1 . 9}$ | $\\underline{51.6}$ | $\\underline{21.4}$ | 57.0 | 60.0 | 56.0 | 68.0 | 51.9 |\n| Hybrid H3-2.7B | 36.5 | 45.6 | 47.3 | $\\mathbf{4 6 . 4}$ | $\\mathbf{5 9 . 4}$ | $\\mathbf{7 1 . 1}$ | $\\underline{60.6}$ | $\\mathbf{7 7 . 0}$ | $\\mathbf{5 5 . 5}$ |\n\nTable 7: Inference throughput on A100 80GB, 1.3B models. Batch size 64, prompt length 512, 1024, or 1536, and generating 128 tokens per sequence in the batch (i.e., $64 \\times 128$ tokens in a batch). Hybrid H3 is up to $2.4 \\times$ faster than a Transformer of similar size in inference. The difference is larger for longer sequences. | Tokens/s | Prompt length 512 | Prompt length 1024 | Prompt length 1536 |\n| :---: | :---: | :---: | :---: |\n| Transformer-1.3B | 1340 | 770 | 520 |\n| Hybrid H3-1.3B | 1980 | 1580 | 1240 |\n\nPerplexity Table 4 shows perplexity on the Pile [21], OpenWebText [23], and WikiText-103 [43]. On the Pile, our 125M hybrid model outperforms GPT-Neo, which was also trained on the Pile. Our hybrid models also outperform GPT-Neo models and GPT-2 models on zero-shot transfer to OpenWebText and WikiText103. We report the PPL of GPT-2 models for context, though the performance is not directly comparable since they were trained on different data. Zero- and Few-shot Performance We compare the zero- and few-shot performance of hybrid H3 language models against OPT [66], GPT-Neo, and GPT-2 models, where public checkpoints are available.",
    "h3-12": "We report performance with rank classification on the logits of the possible choices (see Appendix F. 7 for raw generation). Table 5 reports zero-shot performance on the SuperGLUE benchmark, and Table 6 reports the 3 -shot performance. Following the perplexity results, the hybrid language models outperform or match the best the Transformer baseline on more than half the tasks. Language Modeling Inference Finally, since SSMs are recurrent models, they admit faster text generation than Transformers. Table 7 shows inference throughput of a 1.3B-parameter hybrid model compared to a Transformer. The hybrid model has up to $2.4 \\times$ higher throughput. ## 6 FlashConv Evaluation\n\nWe evaluate how well FlashConv speeds up SSMs. FlashConv sets state-of-the-art performance on the long range arena benchmark [59] using S4 [25]. We report performance of training H3 module with FlashConv compared to attention at various sequence lengths, from 256 to 32 K and demonstrate nearly linear scaling. Long Range Arena The Long Range Arena (LRA) benchmark [59] is a benchmark for long-range sequence modeling. The state-of-the-art approach, S4 [28], is an SSM. Table 8 shows that FlashConV accelerates S4 by $2 \\times$, outperforming Transformers by $5.8 \\times$. Benchmark H3 Against Attention We benchmark the time to run the forward and backward pass of H3 with FlashConv against attention.",
    "h3-13": "FlashConv maintains nearly linear scaling, even to very long sequence lengths. Fig. 2 shows overall $2-3 \\times$ speedup over FFTConv with cuFFT using our techniques (block FFT, state-passing). Simple kernel fusion (even without block FFT) can yield speedup over cuFFT for short sequences, since memory reads/writes are the bottleneck for short sequences. For long sequences, SSMs using state passing can be dozens of times faster than even the fastest attention implementation. Table 8: Speedup on the LRA benchmark. | Models | Speedup |\n| :---: | :---: |\n| Transformer | $1 \\times$ |\n| FlashAttention [15] | $2.4 \\times$ |\n| Block-sparse FlashAttention [15] | $2.8 \\times$ |\n| S4 [28] | $2.9 \\times$ |\n| S4 with FLASHConv | $5.8 \\times$ |\n\n![](https://cdn.mathpix.com/cropped/2024_09_12_7a1798f4fbf723c76fd6g-10.jpg?height=540&width=1661&top_left_y=561&top_left_x=228)\n\nFigure 2: We compare the speed of different algorithms to perform FFT-based convolution, along with FlashAttention [15] (the fastest attention implementation we know of). We use batch size 8, hidden dimension 1024, and varying sequence length from 256 to 32 k , and measure on an A100-SMX4-40GB GPU. We see that kernel fusion gives up to $3.4 \\times$ speedup over naive FFTConv for short sequences (up to 512 ), block FFT gives up to $2 \\times$ speedup for medium length sequences $(1 \\mathrm{k}-8 \\mathrm{k})$, and state-passing allows $2.3 \\times$ faster FFTConv for long sequences ( 16 k and above). ## 7 Conclusion\n\nOur main goal is to understand and narrow the gap between attention and SSMs in language modeling in terms of modeling capabilities and hardware efficiency. Our exploration based on synthetic language tasks motivated us to design the H3 layer, which is surprisingly competitive with attention. Our BlockFFTCONV algorithm exploits matrix multiplication units and the dual recurrent-convolution view of SSMs to substantially speed up SSMs, reducing the hardware barrier between attention and SSMs. We are excited about several future directions. Our H3 layer is a simple combination of two SSMs, and more sophisticated designs could be more expressive. Our encouraging results on language models up to 1.3B parameters suggests that scaling SSMs to larger sizes is a promising avenue. Since simply adding two attention layers to H3 models already outperforms both the pure H3 model and Transformers, we are optimistic about combining the complementary strengths of SSMs and attention in the future. ## Acknowledgments\n\nWe thank Albert Gu for helpful discussion regarding the model architecture, and more importantly for sending us daily hippo videos. We thank Together Computer for providing portions of the compute used to train models in this paper. We gratefully acknowledge the support of NIH under No. U54EB020405 (Mobilize), NSF under Nos. CCF1763315 (Beyond Sparsity), CCF1563078 (Volume to Velocity), and 1937301 (RTML); ARL under No. W911NF-21-2-0251 (Interactive Human-AI Teaming); ONR under No. N000141712266 (Unifying Weak Supervision); ONR N00014-20-1-2480: Understanding and Applying Non-Euclidean Geometry in Machine Learning; N000142012275 (NEPTUNE); NXP, Xilinx, LETI-CEA, Intel, IBM, Microsoft, NEC, Toshiba, TSMC, ARM, Hitachi, BASF, Accenture, Ericsson, Qualcomm, Analog Devices, Google Cloud, Salesforce, Total, the HAI-GCP Cloud Credits for Research program, the Stanford Data Science Initiative (SDSI), Department of Defense (DoD) through the National Defense Science and Engineering Graduate Fellowship (NDSEG) Program, Wu Tsai Neuroscience Stanford Interdisciplinary Graduate Fellowship, and members of the Stanford DAWN project: Facebook, Google, and VMWare.",
    "h3-14": "The U.S. Government is authorized to reproduce and distribute reprints for Governmental purposes notwithstanding any copyright\nnotation thereon. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views, policies, or endorsements, either expressed or implied, of DARPA, NIH, ONR, or the U.S.",
    "h3-15": "Government. Atri Rudra's research is supported by NSF grant CCF-1763481. ## References\n\n[1] Jimmy Ba, Geoffrey E Hinton, Volodymyr Mnih, Joel Z Leibo, and Catalin Ionescu. Using fast weights to attend to the recent past. Advances in neural information processing systems, 29, 2016. [2] Alexei Baevski and Michael Auli. Adaptive input representations for neural language modeling. In International Conference on Learning Representations, 2018. [3] David H Bailey. FFTs in external or hierarchical memory. The journal of Supercomputing, 4(1):23-35, 1990 . [4] Sid Black, Leo Gao, Phil Wang, Connor Leahy, and Stella Biderman. GPT-Neo: Large Scale Autoregressive Language Modeling with Mesh-Tensorflow, March 2021. If you use this software, please cite it using these metadata. [5] Rishi Bommasani, Drew A Hudson, Ehsan Adeli, Russ Altman, Simran Arora, Sydney von Arx, Michael S Bernstein, Jeannette Bohg, Antoine Bosselut, Emma Brunskill, et al. On the opportunities and risks of foundation models. arXiv preprint arXiv:2108.07258, 2021. [6] Willian L Brogan. Modern control theory, 1974. [7] Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, et al. Language models are few-shot learners. Advances in neural information processing systems, 33:1877-1901, 2020. [8] Kyunghyun Cho, Bart Van Merriënboer, Dzmitry Bahdanau, and Yoshua Bengio. On the properties of neural machine translation: Encoder-decoder approaches.",
    "h3-16": "arXiv preprint arXiv:1409.1259, 2014. [9] Krzysztof Marcin Choromanski, Valerii Likhosherstov, David Dohan, Xingyou Song, Andreea Gane, Tamas Sarlos, Peter Hawkins, Jared Quincy Davis, Afroz Mohiuddin, Lukasz Kaiser, et al. Rethinking attention with performers. In International Conference on Learning Representations (ICLR), 2020. [10] Aakanksha Chowdhery, Sharan Narang, Jacob Devlin, Maarten Bosma, Gaurav Mishra, Adam Roberts, Paul Barham, Hyung Won Chung, Charles Sutton, Sebastian Gehrmann, et al. Palm: Scaling language modeling with pathways.",
    "h3-17": "arXiv preprint arXiv:2204.02311, 2022. [11] James W. Cooley and John W. Tukey. An algorithm for the machine calculation of complex fourier series. Mathematics of Computation, 19(90):297-301, 1965. [12] Kamalaker Dadi, Gaël Varoquaux, Antonia Machlouzarides-Shalit, Krzysztof J Gorgolewski, Demian Wassermann, Bertrand Thirion, and Arthur Mensch. Fine-grain atlases of functional modes for fmri analysis. NeuroImage, 221:117126, 2020. [13] Zihang Dai, Zhilin Yang, Yiming Yang, Jaime G Carbonell, Quoc Le, and Ruslan Salakhutdinov. Transformer-xl: Attentive language models beyond a fixed-length context. In Proceedings of the 57 th Annual Meeting of the Association for Computational Linguistics, pages 2978-2988, 2019. [14] Tri Dao, Beidi Chen, Nimit Sohoni, Arjun Desai, Michael Poli, Jessica Grogan, Alexander Liu, Aniruddh Rao, Atri Rudra, and Christopher Ré. Monarch: Expressive structured matrices for efficient and accurate training. In International Conference on Machine Learning (ICML), 2022. [15] Tri Dao, Daniel Y. Fu, Stefano Ermon, Atri Rudra, and Christopher Ré. Flashattention: Fast and memory-efficient exact attention with io-awareness. In Advances in Neural Information Processing Systems, 2022. [16] Giannis Daras, Nikita Kitaev, Augustus Odena, and Alexandros G Dimakis. Smyrf-efficient attention using asymmetric clustering.",
    "h3-18": "Advances in Neural Information Processing Systems, 33:6476-6489, 2020. [17] Benjamin L Edelman, Surbhi Goel, Sham Kakade, and Cyril Zhang. Inductive biases and variable creation in self-attention mechanisms.",
    "h3-19": "In International Conference on Machine Learning, pages 5793-5831. PMLR, 2022 . [18] Nelson Elhage, Neel Nanda, Catherine Olsson, Tom Henighan, Nicholas Joseph, Ben Mann, Amanda Askell, Yuntao Bai, Anna Chen, Tom Conerly, Nova DasSarma, Dawn Drain, Deep Ganguli, Zac Hatfield-Dodds, Danny Hernandez, Andy Jones, Jackson Kernion, Liane Lovitt, Kamal Ndousse, Dario Amodei, Tom Brown, Jack Clark, Jared Kaplan, Sam McCandlish, and Chris Olah. A mathematical framework for transformer circuits. Transformer Circuits Thread, 2021. https://transformercircuits.pub/2021/framework/index.html. [19] Bruce Fischl. Freesurfer. Neuroimage, 62(2):774-781, 2012. [20] Robert S Fisher, Carlos Acevedo, Alexis Arzimanoglou, Alicia Bogacz, J Helen Cross, Christian E Elger, Jerome Engel Jr, Lars Forsgren, Jacqueline A French, Mike Glynn, et al. Ilae official report: a practical clinical definition of epilepsy.",
    "h3-20": "Epilepsia, 55(4):475-482, 2014. [21] Leo Gao, Stella Biderman, Sid Black, Laurence Golding, Travis Hoppe, Charles Foster, Jason Phang, Horace He, Anish Thite, Noa Nabeshima, et al. The pile: An 800 gb dataset of diverse text for language modeling. arXiv preprint arXiv:2101.00027, 2020. [22] Karan Goel, Albert Gu, Chris Donahue, and Christopher Ré. It's raw! audio generation with state-space models. arXiv preprint arXiv:2202.09729, 2022. [23] Aaron Gokaslan, Vanya Cohen, Ellie Pavlick, and Stefanie Tellex. Openwebtext corpus, 2019. [24] Albert Gu, Tri Dao, Stefano Ermon, Atri Rudra, and Christopher Ré. Hippo: Recurrent memory with optimal polynomial projections. Advances in Neural Information Processing Systems, 33:1474-1487, 2020 . [25] Albert Gu, Karan Goel, and Christopher Ré. Efficiently modeling long sequences with structured state spaces. In The International Conference on Learning Representations (ICLR), 2022. [26] Albert Gu, Ankit Gupta, Karan Goel, and Christopher Ré. On the parameterization and initialization of diagonal state space models. In Advances in Neural Information Processing Systems, 2022. [27] Albert Gu, Isys Johnson, Karan Goel, Khaled Saab, Tri Dao, Atri Rudra, and Christopher Ré. Combining recurrent, convolutional, and continuous-time models with linear state-space layers. Advances in neural information processing systems, 34, 2021. [28] Albert Gu, Isys Johnson, Aman Timalsina, Atri Rudra, and Christopher Ré. How to train your hippo: State space models with generalized orthogonal basis projections.",
    "h3-21": "arXiv preprint arXiv:2206.12037, 2022. [29] Ankit Gupta, Albert Gu, and Jonathan Berant. Diagonal state spaces are as effective as structured state spaces.",
    "h3-22": "In Advances in Neural Information Processing Systems, 2022. [30] Curtis Hawthorne, Andrew Jaegle, Cătălina Cangea, Sebastian Borgeaud, Charlie Nash, Mateusz Malinowski, Sander Dieleman, Oriol Vinyals, Matthew Botvinick, Ian Simon, et al. General-purpose, long-context autoregressive modeling with perceiver ar. arXiv preprint arXiv:2202.07765, 2022. [31] Sepp Hochreiter and Jürgen Schmidhuber. Lstm can solve hard long time lag problems.",
    "h3-23": "Advances in neural information processing systems, 9, 1996. [32] Jordan Hoffmann, Sebastian Borgeaud, Arthur Mensch, Elena Buchatskaya, Trevor Cai, Eliza Rutherford, Diego de Las Casas, Lisa Anne Hendricks, Johannes Welbl, Aidan Clark, et al. Training compute-optimal large language models. arXiv preprint arXiv:2203.15556, 2022. [33] Sara Hooker. The hardware lottery. Communications of the ACM, 64(12):58-65, 2021. [34] Sheng-Chun Kao, Suvinay Subramanian, Gaurav Agrawal, and Tushar Krishna. An optimized dataflow for mitigating attention performance bottlenecks. arXiv preprint arXiv:2107.06419, 2021. [35] Angelos Katharopoulos, Apoorv Vyas, Nikolaos Pappas, and François Fleuret. Transformers are RNNs: Fast autoregressive transformers with linear attention.",
    "h3-24": "In International Conference on Machine Learning, pages 5156-5165. PMLR, 2020. [36] Feyza Duman Keles, Pruthuvi Mahesakya Wijewardena, and Chinmay Hegde. On the computational complexity of self-attention.",
    "h3-25": "arXiv preprint arXiv:2209.04881, 2022. [37] Michael Patrick Kerr. The impact of epilepsy on patients' lives. Acta Neurologica Scandinavica, 126:1-9, 2012 . [38] Maedbh King, Carlos R Hernandez-Castillo, Russell A Poldrack, Richard B Ivry, and Jörn Diedrichsen. Functional boundaries in the human cerebellum revealed by a multi-domain task battery. Nature neuroscience, 22(8):1371-1378, 2019. [39] Nikita Kitaev, Łukasz Kaiser, and Anselm Levskaya. Reformer: The efficient transformer. In The International Conference on Machine Learning (ICML), 2020. [40] Shengjie Luo, Shanda Li, Tianle Cai, Di He, Dinglan Peng, Shuxin Zheng, Guolin Ke, Liwei Wang, and Tie-Yan Liu. Stable, fast and accurate: Kernelized attention with relative positional encoding.",
    "h3-26": "Advances in Neural Information Processing Systems, 34:22795-22807, 2021. [41] Christopher J Markiewicz, Krzysztof J Gorgolewski, Franklin Feingold, Ross Blair, Yaroslav O Halchenko, Eric Miller, Nell Hardcastle, Joe Wexler, Oscar Esteban, Mathias Goncavles, et al. The openneuro resource for sharing of neuroscience data. Elife, 10:e71774, 2021. [42] Harsh Mehta, Ankit Gupta, Ashok Cutkosky, and Behnam Neyshabur. Long range language modeling via gated state spaces. arXiv preprint arXiv:2206.13947, 2022. [43] Stephen Merity, Caiming Xiong, James Bradbury, and Richard Socher. Pointer sentinel mixture models, 2016 . [44] Eric Nguyen, Karan Goel, Albert Gu, Gordon Downs, Preey Shah, Tri Dao, Stephen Baccus, and Christopher Ré. S4nd: Modeling images and videos as multidimensional signals with state spaces. In Advances in Neural Information Processing Systems, 2022. [45] NVIDIA. Nvidia Tesla V100 GPU architecture, 2017. [46] NVIDIA. Nvidia A100 tensor core GPU architecture, 2020. [47] NVIDIA. cufft v11.7.1 documentation, 2022. https://docs.nvidia.com/cuda/cufft/index.html. [48] NVIDIA. Nvidia H100 tensor core GPU architecture, 2022. [49] Catherine Olsson, Nelson Elhage, Neel Nanda, Nicholas Joseph, Nova DasSarma, Tom Henighan, Ben Mann, Amanda Askell, Yuntao Bai, Anna Chen, Tom Conerly, Dawn Drain, Deep Ganguli, Zac Hatfield-Dodds, Danny Hernandez, Scott Johnston, Andy Jones, Jackson Kernion, Liane Lovitt, Kamal Ndousse, Dario Amodei, Tom Brown, Jack Clark, Jared Kaplan, Sam McCandlish, and Chris Olah. In-context learning and induction heads. Transformer Circuits Thread, 2022. https://transformercircuits.pub/2022/in-context-learning-and-induction-heads/index.html. [50] Alan V Oppenheim. Applications of digital signal processing. Englewood Cliffs, 1978. [51] Alan V Oppenheim, John R Buck, and Ronald W Schafer. Discrete-time signal processing. Vol. 2. Upper Saddle River, NJ: Prentice Hall, 2001. [52] Markus N Rabe and Charles Staats. Self-attention does not need $O\\left(n^{2}\\right)$ memory. arXiv preprint arXiv:2112.05682, 2021. [53] Alec Radford, Jeffrey Wu, Rewon Child, David Luan, Dario Amodei, Ilya Sutskever, et al. Language models are unsupervised multitask learners. OpenAI blog, 1(8):9, 2019. [54] Jack W Rae, Anna Potapenko, Siddhant M Jayakumar, Chloe Hillier, and Timothy P Lillicrap. Compressive transformers for long-range sequence modelling.",
    "h3-27": "In International Conference on Learning Representations, 2019. [55] Khaled Saab, Jared Dunnmon, Christopher Ré, Daniel Rubin, and Christopher Lee-Messer. Weak supervision as an efficient approach for automated seizure detection in electroencephalography. NPJ digital medicine, 3(1):1-12, 2020. [56] Vinit Shah, Eva Von Weltin, Silvia Lopez, James Riley McHugh, Lillian Veloso, Meysam Golmohammadi, Iyad Obeid, and Joseph Picone. The temple university hospital seizure detection corpus. Frontiers in neuroinformatics, 12:83, 2018. [57] Mohammad Khubeb Siddiqui, Ruben Morales-Menendez, Xiaodi Huang, and Nasir Hussain. A review of epileptic seizure detection using machine learning classifiers. Brain informatics, 7(1):1-18, 2020. [58] Siyi Tang, Jared Dunnmon, Khaled Kamal Saab, Xuan Zhang, Qianying Huang, Florian Dubost, Daniel Rubin, and Christopher Lee-Messer. Self-supervised graph neural networks for improved electroencephalographic seizure analysis. In International Conference on Learning Representations, 2021. [59] Yi Tay, Mostafa Dehghani, Samira Abnar, Yikang Shen, Dara Bahri, Philip Pham, Jinfeng Rao, Liu Yang, Sebastian Ruder, and Donald Metzler. Long range arena: A benchmark for efficient transformers. In International Conference on Learning Representations, 2020. [60] Armin W Thomas, Christopher Ré, and Russell A Poldrack. Self-supervised learning of brain dynamics from broad neuroimaging data. arXiv preprint arXiv:2206.11417, 2022. [61] David C Van Essen, Stephen M Smith, Deanna M Barch, Timothy EJ Behrens, Essa Yacoub, Kamil Ugurbil, Wu-Minn HCP Consortium, et al. The wu-minn human connectome project: an overview. Neuroimage, 80:62-79, 2013. [62] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. Attention is all you need. Advances in neural information processing systems, 30, 2017. [63] Sinong Wang, Belinda Z Li, Madian Khabsa, Han Fang, and Hao Ma. Linformer: Self-attention with linear complexity.",
    "h3-28": "arXiv preprint arXiv:2006.04768, 2020. [64] Pete Warden. Speech commands: A dataset for limited-vocabulary speech recognition. arXiv preprint arXiv:1804.03209, 2018. [65] Thomas Wolf, Lysandre Debut, Victor Sanh, Julien Chaumond, Clement Delangue, Anthony Moi, Pierric Cistac, Tim Rault, Rémi Louf, Morgan Funtowicz, Joe Davison, Sam Shleifer, Patrick von Platen, Clara Ma, Yacine Jernite, Julien Plu, Canwen Xu, Teven Le Scao, Sylvain Gugger, Mariama Drame, Quentin Lhoest, and Alexander M. Rush. Transformers: State-of-the-art natural language processing. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing: System Demonstrations, pages 38-45, Online, October 2020. Association for Computational Linguistics. [66] Susan Zhang, Stephen Roller, Naman Goyal, Mikel Artetxe, Moya Chen, Shuohui Chen, Christopher Dewan, Mona Diab, Xian Li, Xi Victoria Lin, et al. OPT: Open pre-trained transformer language models. arXiv preprint arXiv:2205.01068, 2022. ## A Related Work\n\nState space models have shown promise in modeling sequential data, including time series data [25], audio [22], and visual data [44]. Our model builds off work on simplifying and parameterizing diagonal versions of S4 [26, 28, 29]. Gated state spaces [42] also aim to adapt SSMs to language modeling, but our results suggest that the GSS model does not perform as well as H3 (or even as well as earlier SSMs like S4D). The idea to combine SSMs with attention in hybrid models is not new; Mehta et al. [42] also showed that interleaving attention with their GSS layer can improve performance, which we also validate on our OpenWebText experiments. These positive results suggest that attention and SSMs are complementary, and that hybrid models may be a promising direction for future work. Large language foundation models [5] have demonstrated the power of scaling attention-based networks to billions of parameters and training them on trillions of tokens [32]. Understanding the mechanistic basis [18] behind these models may yield insights into better design choices for future models. These and similar explorations have informed the design of H 3 and our selection of synthetic languages. A number of recent works have also explored how to address the shortcomings of attention by approximating the attention computation $[9,16,35,39,59,63]$. We believe these efforts are complementary to SSMs, and we are excited to see how they can be combined in future work. Linear attention [35] and classical sequence models like RNNs serve as inspiration for H3. Appendix B draws a direct connection between linear attention and LTI systems. Luo et al. [40] also propose a variant of linear attention that can achieve $O(n \\log n)$ scaling in sequence length. Appendix F evaluates linear attention on language modeling, and finds that it underperforms exact attention, whereas H3 outperforms attention. The multiplicative interactions in H3 are reminiscent of gating mechanisms in LSTMs [31] and GRUs [8], which suggests that architectural lessons from these sequence models may be useful for adapting SSMs to language modeling. A number of algorithms for scaling attention to longer sequences have also been proposed, such as Transformer-XL [13], Reformer [39], Performer [9], and Perceiver AR [30]. Some of these approaches underperform exact attention on language modeling, and may be slower in wall-clock speed [15]. A thorough comparison of these alternatives to exact attention and how well they scale in model size and amount of training data is fruitful future work. FFT algorithms are used in a wide variety of applications, including signal processing [50], control theory [6], and more. Various algorithms for computing the FFT have existed for decades [51]. We hope our work on appealing to these classic algorithms to accelerate new applications such as learned SSMs will inspire future algorithmic exploration, even if hardware is not designed for them [33]. ## B Linear Attention and Time-Varying Systems\n\nWe draw some connections from linear attention to LTI systems and SSMs. We first present linear attention as a linear time-varying system, and show how converting it to a linear time-invariant system matches H3. Linear time-varying system and linear attention In general, a layer in a sequence model takes in a sequence and outputs a sequence. Many of these take the form of a linear time-varying system (thanks to the Picard-Lindelof theorem, nonlinear systems can be approximated by a series of linear system):\n\n$$\n\\begin{aligned}\nx_{i} & =\\mathbf{A}_{i} x_{i-1}+\\mathbf{B}_{i} u_{i} \\\\\ny_{i} & =\\mathbf{C}_{i} x_{i}+\\mathbf{D}_{i} u_{i}\n\\end{aligned}\n$$\n\nThis has the same form as SSMs (Section 2), except that the matrices can depend on the timestep. Recall the form of linear attention from Section 2. For the purpose of approximation, we ignore the denominator in linear attention Section 2 (i.e., assuming $d_{i}=1$ ). We see that $S_{i}$ is just a cumulative sum, satisfying the recurrence $S_{i+1}=S_{i}+\\phi\\left(K_{i+1}\\right) V_{i+1}^{T}$. Similarly, $O_{i}$ satisfies the recurrence $O_{i+1}=\\phi\\left(Q_{i+1}\\right)^{T} S_{i+1}$. This is a linear time-varying system of the form $x_{i+1}=\\mathbf{A} x_{i}+\\mathbf{B} u_{i+1}$ and $y_{i+1}=\\mathbf{C}_{i+1} x_{i+1}$ (with $\\mathbf{A}=I$, $\\left.\\mathbf{B}=I, u_{i}=\\phi\\left(K_{i}\\right) V_{i}^{T}, C_{i}=\\phi\\left(Q_{i}\\right)^{T}\\right)$. That is, $\\mathbf{A}$ and $\\mathbf{B}$ are constant, but $C$ is time-variant. To convert this into a linear time-invariant version, we treat the time-variant $\\mathbf{C}_{i}$ as a post-processing step. We instead of a fixed $\\mathbf{C}$ for the LTI. This yields an LTI:\n\n$$\n\\begin{aligned}\nx_{i+1} & =\\mathbf{A} x_{i}+\\mathbf{B} \\phi\\left(K_{i}\\right) V_{i}^{T} \\\\\ny_{i+1} & =\\mathbf{C} x_{i}\n\\end{aligned}\n$$\n\nfor some matrices $\\mathbf{A}, \\mathbf{B}, \\mathbf{C}$ that are learned. We then apply post-processing by multiply $y_{i+1}$ with $\\phi\\left(Q_{i}\\right)^{T}$. Replacing $\\phi\\left(K_{i}\\right)$ with a shift SSM yields an analogue to H3. ## C Method details\n\nSince we have described the forward pass in Section 3, we describe here the backward pass in details. ## C. 1 Backward Pass\n\nWe show how to compute the backward pass in a fused kernel. Let $y=f * u+\\mathbf{D} u$. In our case, we have $f$ and $u$ have the same length, so they are symmetric as far as the convolution is concerned. Suppose we are given $d y=\\frac{\\partial l}{\\partial y}$ (where $l$ is some loss function). We wish to compute $d u, d f$, and $d D$ (which are $\\frac{\\partial l}{\\partial u}, \\frac{\\partial l}{\\partial f}$, and $\\frac{\\partial l}{\\partial \\mathrm{D}}$, respectively). The most challenging part is computing the gradient through the convolution operator - but we'll see that we can re-use our FFT infrastructure for it. The rest of the operations are straightforward; we have $d \\mathbf{D}=d y u^{T}$. Gradient of the Convolution Here, we'll discuss how to compute $d f$ by integrating w.r.t. the convolution operator $*$. As an immediate consequence, we'll be able to compute $d u$ as well. Since $f$ and $u$ are the same length $L, f * u$ and $u * f$ have the same result. Thus, we'll start from $u * f$ here. For some notation, let $O=u * f$. Then, $d O=d y$. Recall that $O[i]=\\sum_{j=0}^{i-1} u[i-j] f[j]$. We'll start by extending $u$ and $f$ with zeros, to give them length $2 L$. Let $u^{\\prime}=[u[0], u[1], \\ldots, u[L-$ $1], 0, \\ldots, 0]$, and $f^{\\prime}$ extended similarly. Let $O^{\\prime}=u^{\\prime} * f^{\\prime}$, and $O=O^{\\prime}[: N]$. Assume that we have all the values of $d O^{\\prime}$ (we only have them for the first half, but we'll see that it doesn't matter in the end). Let's construct a Toeplitz matrix $H_{u^{\\prime}}$ such that $u^{\\prime} * f^{\\prime}=H_{u^{\\prime}} f^{\\prime}$ :\n\n$$\nH_{u^{\\prime}}=\\left[\\begin{array}{cccc}\nu^{\\prime}[0] & 0 & \\ldots & 0 \\\\\nu^{\\prime}[1] & u^{\\prime}[0] & \\ldots & 0 \\\\\n\\vdots & \\vdots & \\ddots & \\vdots \\\\\nu^{\\prime}[2 L-1] & u^{\\prime}[2 L-2] & \\ldots & u^{\\prime}[0]\n\\end{array}\\right]\n$$\n\nSince, we have $u^{\\prime}[i]=f^{\\prime}[i]=0$ for $i \\geq L$, we can actually fill in the zeros of the above matrix as well:\n\n$$\nH_{u^{\\prime}}=\\left[\\begin{array}{cccc}\nu^{\\prime}[0] & u^{\\prime}[2 L-1] & \\ldots & u^{\\prime}[1] \\\\\nu^{\\prime}[1] & u^{\\prime}[0] & \\ldots & u^{\\prime}[2] \\\\\n\\vdots & \\vdots & \\ddots & \\vdots \\\\\nu^{\\prime}[2 L-1] & u^{\\prime}[2 L-2] & \\ldots & u^{\\prime}[0]\n\\end{array}\\right]\n$$\n\nThen, we can use the matrix multiplication chain rule to find that:\n\n$$\n\\begin{aligned}\nd f^{\\prime}=H_{u^{\\prime}}^{T} d O^{\\prime} & =\\left[\\begin{array}{cccc}\nu^{\\prime}[0] & u^{\\prime}[1] & \\ldots & u^{\\prime}[2 L-1] \\\\\nu^{\\prime}[2 L-1] & u^{\\prime}[0] & \\ldots & u^{\\prime}[2 L-2] \\\\\n\\vdots & \\vdots & \\ddots & \\vdots \\\\\nu^{\\prime}[1] & u^{\\prime}[2] & \\ldots & u^{\\prime}[0]\n\\end{array}\\right] \\\\\n& =\\left[\\begin{array}{cccc}\nu^{\\prime}[0] & u^{\\prime}[-(2 L-1)] & \\ldots & u^{\\prime}[-1] \\\\\nu^{\\prime}[-1] & u^{\\prime}[0] & \\ldots & u^{\\prime}[-2] \\\\\n\\vdots & \\vdots & \\ddots & \\vdots \\\\\nu^{\\prime}[-(2 L-1)] & u^{\\prime}[-(2 L-2)] & \\ldots & u^{\\prime}[0]\n\\end{array}\\right]\n\\end{aligned}\n$$\n\nwhere we use $u^{\\prime}[-i]$ to mean $u^{\\prime}[2 L-i]$. Notice that this matrix has the same format as $H_{u^{\\prime}}$ ! Let $u_{*}^{\\prime}=$ $\\left[u^{\\prime}[0], u^{\\prime}[-1], \\ldots, u^{\\prime}[-(2 N-1)]\\right]$. Then:\n\n$$\nd f^{\\prime}=\\left(u_{*}^{\\prime} * d O^{\\prime}\\right)\n$$\n\nSo how do we compute $u_{*}^{\\prime}$ efficiently?",
    "h3-29": "Naively, we might incur some nasty memory access issues. But a nice property about the DFT saves us! Let $U[i]$ be the $i$-th element of the DFT of a signal $u$.",
    "h3-30": "Note that $U[i]$ is complex. We have:\n\n$$\nU^{*}[i]=U[-i]\n$$\n\nwhere here the $*$ represents the complex conjugate. We can use this property to compute $d f^{\\prime}$ efficiently:\n\n$$\nd f^{\\prime}=u_{*}^{\\prime} * d O^{\\prime}=i F F T\\left(F F T^{*}\\left(u^{\\prime}\\right) F F T\\left(d O^{\\prime}\\right)\\right) \\Rightarrow d f=d f^{\\prime}[: N]=i F F T\\left(F F T^{*}\\left(u^{\\prime}\\right) F F T\\left(d y^{\\prime}\\right)\\right)[: N]\n$$\n\nwhere $F F T^{*}$ denotes taking the complex conjugate of the FFT, and $d y^{\\prime}$ denotes $d y$, padded with zeros. Computing $d u$ We can use this same trick to compute $d u$, except we need to add in the contribution from the original $\\mathbf{D} u$ term. We end up with:\n\n$$\nd u=d u^{\\prime}[: N]+\\mathbf{D} d y=i F F T\\left(F F T^{*}\\left(f^{\\prime}\\right) F F T\\left(d y^{\\prime}\\right)\\right)[: N]+\\mathbf{D} d y\n$$\n\n## C. 2 State-Passing Matrices\n\nWe show how to derive $\\mathbf{M}_{u x}$ for the state update in our state-passing algorithm.",
    "h3-31": "We wish to construct a matrix $v M_{u x} \\in \\mathbb{R}^{m \\times N^{\\prime}}$ such that $\\mathbf{M}_{u x} u=\\sum_{i=1}^{N^{\\prime}} \\mathbf{A}^{N^{\\prime}-1} \\mathbf{B} u_{i}$. Note that $\\mathbf{A}^{i} \\mathbf{B} \\in \\mathbb{R}^{d \\times 1}$ is a column vector. We can simply stack these column vectors to form a matrix: $\\mathbf{M}_{u x}=$ $\\left[\\mathbf{A}^{N^{\\prime}-1} \\mathbf{B}, \\mathbf{A}^{N^{\\prime}-2} \\mathbf{B}, \\ldots, \\mathbf{B}\\right]$\n\n## D Proofs\n\nWe show parameterizations of H 3 and attention that solves the associative recall task. We prove Proposition 1 and Proposition 2. ## D. 1 H3 Expressivity\n\nThis section formally describes a parameterization of H3 that solves the associative recall task. ## D.1.1 Example Language $\\Lambda$\n\nConsider a simple language with 4 keys and 4 values.",
    "h3-32": "For concreteness, we will use the keys $\\left\\{k_{1}, k_{2}, k_{3}, k_{4}\\right\\}=$ $L_{K}$ and the values $\\left\\{v_{1}, v_{2}, v_{3}, v_{4}\\right\\}=L_{V}$, i.e. our language $L=L_{K} \\cup L_{V}$. Given a sequence of key-value pairs with one key at the end, we want a model to generate the value associated with the key at the end.",
    "h3-33": "Assume that the key at the end appeared in the sequence. More formally, let $N+1$ be the length of the sequence, $N$ even. The language $\\Lambda$ consists of sequences $x \\in L^{N+1}$. Each sequence has an associated mapping $f_{x}: L_{K} \\rightarrow L_{V}$. For each sequence, the odd indices are randomly sampled from $L_{K}$, for $x_{1}, x_{3}, \\ldots, x_{N-1}$. The even indices are defined by $f_{x}: x_{2 * i}=f_{x}\\left(x_{2 * i-1}\\right)$, for $1 \\leq i \\leq N / 2$. The last item in the sequence $x_{N+1}$, is randomly drawn from the keys that have appeared in $x$ already, i.e. $x_{N+1} \\in \\cup\\left\\{x_{1}, x_{3}, \\ldots, x_{N-1}\\right\\}$. The goal of this language modeling task is to produce $f_{x}\\left(x_{N+1}\\right)$ at the end of the sequence. ## D.1.2 H3 Model to Solve $\\Lambda$\n\nWe describe a toy H3 model that can solve $\\Lambda$. Consider a model consisting of an embedding layer, an H3 model, and an output projection with softmax. Recall that $d$ is the dimension of the H 3 model, $m$ is the dimension of its hidden states, and $H$ is the number of heads. Let $d=8, m=2, H=4$. Let the embedding layer map each key $k_{i}$ to the $e_{i}$ basis vector, and map each value $v_{i}$ to the $e_{4+i}$ basis vector. Let $\\mathbf{B}_{\\text {shift }}$ and $\\mathbf{C}_{\\text {shift }}$ denote the parameters of the shift SSM, and $\\mathbf{A}_{\\text {diag }}, \\mathbf{B}_{\\text {diag }}$, and $\\mathbf{C}_{\\text {diag }}$ denote the parameters of the diagonal SSM (let $\\mathbf{D}$ be zero for both). Let $\\mathbf{B}_{\\text {shift }}=\\mathbf{B}_{\\text {diag }}=\\mathbf{C}_{d i a g}=e_{1}$. Let $\\mathbf{C}_{s h i f t}=$ [01]. Let $\\mathbf{A}_{\\text {diag }}$ be a diagonal matrix with 1s along its diagonal for each H3. Remark. The action of a diagonal SSM parameterized by $\\mathbf{A}_{\\text {diag }}, \\mathbf{B}_{\\text {diag }}$, and $\\mathbf{C}_{\\text {diag }}$ is to act as a cumulative sum over all its input. The action of shift SSM parameterized by $\\mathbf{B}_{\\text {shift }}$ and $\\mathbf{C}_{\\text {shift }}$ is to shift its input by one time step. Recall that the H3 layer maps its input to $Q, K$, and $V$ by applying $u \\mathbf{W}_{Q}, u \\mathbf{W}_{K}$, and $u \\mathbf{W}_{V}$. Let $\\mathbf{W}_{Q}$ and $\\mathbf{W}_{K}$ be the following:\n\n$$\n\\mathbf{W}_{Q}=\\mathbf{W}_{K}=\\left[\\begin{array}{cccccccc}\n1 & 1 & 0 & 0 & 0 & 0 & 0 & 0 \\\\\n0 & 0 & 1 & 1 & 0 & 0 & 0 & 0 \\\\\n0 & 0 & 0 & 0 & 1 & 1 & 0 & 0 \\\\\n0 & 0 & 0 & 0 & 0 & 0 & 1 & 1 \\\\\n0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\\\\n0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\\\\n0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\\\\n0 & 0 & 0 & 0 & 0 & 0 & 0 & 0\n\\end{array}\\right]\n$$\n\nRecall that $Q$ and $K$ are split into $H$ heads $\\left(\\mathbf{Q}^{(i)}, \\mathbf{K}^{(i)}\\right.$ for $\\left.i \\in\\{1,2,3,4\\}\\right)$, each of which is sent to an independent H3. Remark. The action of $\\mathbf{W}_{Q}$ and $\\mathbf{W}_{K}$ are to \"assign\" each key to a different H3 head, i.e., $\\mathbf{Q}_{t}^{(i)}$ is only non-zero when $x_{t}=k_{i}$. Similarly, $\\overline{\\mathbf{K}}_{t}^{(i)}$ is only non-zero when $x_{t-1}=k_{i}$ (since $\\overline{\\mathbf{K}}_{t}=\\mathbf{K}_{t-1}$ due to the time delay of the shift SSM). Let $\\mathbf{W}_{V}$ be the following:\n\n$$\n\\mathbf{W}_{V}=\\left[\\begin{array}{cccccccc}\n0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\\\\n0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\\\\n0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\\\\n0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\\\\n0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\\\\n0 & 1 & 0 & 1 & 0 & 1 & 0 & 1 \\\\\n1 & 0 & 1 & 0 & 1 & 0 & 1 & 0 \\\\\n1 & 1 & 1 & 1 & 1 & 1 & 1 & 1\n\\end{array}\\right]\n$$\n\nRemark. The action of this matrix is to encode the input value (as \"binary\"), and send it to all H 3 heads. E.g., $\\mathbf{V}_{t}^{(1)}=\\mathbf{V}_{t}^{(2)}=\\mathbf{V}_{t}^{(3)}=\\mathbf{V}_{t}^{(4)}$ for all $i$, and $\\mathbf{V}_{t}^{(i)}=[0,0] \\Leftrightarrow x_{t}=v_{1}, \\mathbf{V}_{t}^{(i)}=[0,1] \\Leftrightarrow x_{t}=v_{2}$, etc. We claim that for $x_{N+1}=k_{i}, \\mathbf{O}_{N+1}^{(i)}$ will be a multiple of the binary encoding of $f_{x}\\left(k_{i}\\right)$, and all the other heads of the output $\\mathbf{O}_{N+1}^{(j)}, 1 \\leq j \\leq 4, j \\neq i$, will be zero. Let the output projection $\\mathbf{W}_{O}$ be such that, with a non-linearity afterwards, it inverts the binary encoding to produce the embedding of the desired output $f_{x}\\left(k_{i}\\right)$.",
    "h3-34": "We will assume such a projection exists, proof left to the reader. Proposition 3. The model described above solves the associative recall problem for the language $\\Lambda$.",
    "h3-35": "Proof. Proof sketch. WLOG, let $x_{N+1}=k_{i}$. Then $\\mathbf{Q}^{(i)}=[1,1]$, but $\\mathbf{Q}^{(j)}=[0,0]$ for $j \\neq i$. Thus, $\\mathbf{O}^{(j)}=[0,0]$ for $j \\neq i$ due to the multiplicative interaction. Since $\\mathbf{Q}^{(i)}=[1,1], \\mathbf{O}^{(i)}$ is the output of the diag SSMs in the H3 head corresponding to $k_{i}$ (recall that each head has two independent shift SSMs and two independent diag SSMs). The output of the diag SSMs are the cumulative sum of all the inputs they have seen in the sequence. For one of the diag SSMs to see a non-zero input, its preceding shift SSM must have a non-zero output. The only times $t$ this can happen in the sequence are when $x_{t-1}=k_{i}$. But then $x_{t}=f_{x}\\left(k_{i}\\right)$. Thus, the input to the diag SSMs are precisely the binary encoding of $f_{x}\\left(k_{i}\\right)$. Then the output $\\mathbf{O}^{(i)}$ is a multiple of the binary encoding of $f_{x}\\left(k_{i}\\right), \\mathbf{W}_{O}$ decodes this output to the embedding of $f_{x}\\left(k_{i}\\right)$. ## D. 2 Attention Expressivity\n\nWe provide an informal sketch of a two-layer attention model that can solve the associative recall task, inspired by the construction of [49]. The first layer of the attention model outputs the embedding of the previous token in the sequence, and concatenates it with the current token in the sequence. The second layer compares the current token to the previous token embeddings, and outputs the paired embedding when there is a match-which is exactly the key-value lookup. The construction proceeds as follows:\n\n- In the first layer, let $Q_{i}$ be mapped to the positional embedding of token $x_{i-1}$ (e.g., $p_{i-1}$ if $p_{i}$ denotes the positional embedding of token $x_{i}$ ), and $K_{i}$ be mapped to the positional embedding of token $x_{i}$. - The attention matrix $A$ is computed as $Q K^{T}$, with a causal mask (i.e., $A_{i, j}=0$ if $j>i$ ). - Then, $\\operatorname{softmax}(A)$ approximates the shift matrix (see Section 3). - Let $V_{i}$ be an encoding of token $x_{i}$, constrained to the first half of the hidden dimension. - Then, for output $O=\\operatorname{softmax}\\left(Q K^{T}\\right) V$, the first half of the vector $O_{i}$ is the encoding of token $x_{i-1}$. - In the second layer, assume that you have a skip connection, that maps the encoding of the input token $x_{i}$ to the second half of the vector $O_{i}$. - Then, the input to the second layer encodes both $x_{i-1}$ and $x_{i}$. - In the second layer, let $Q_{i}$ extract the encoding of $x_{i}$, and let $K_{i}$ extract the encoding of $x_{i-1}$. - Apply a causal mask on $Q K^{T}$. Then, the value of $\\operatorname{softmax}\\left(Q K^{T}\\right)_{i, j}$ is large if $x_{i}=x_{j-1}$, and $i>j-1$. - Let $V_{i}$ extract the encoding of $x_{i}$. - Then, output $O_{i}$ is the sum of values $x_{j}$ such as $x_{j-1}=x_{i}$. But then $O_{i}$ is exactly a lookup of the token that came after $x_{i}$ when it appeared previously in the sequence-which exactly solves associative recall.",
    "h3-36": "We note that the above construction requires the ability for the positional encodings to select the previous token based on the dot product and softmax, and for token comparisons through the dot product and softmax. ## D. 3 H3 Complexity\n\nWe prove Proposition 1, which states that the H3 layer takes $O\\left(d^{2} N+d N \\log N\\right)$ time and $O(d N)$ space for sequence length $N$ and hidden dimension $d$. Proof. We first analyze the time complexity. Consider the matrix multiplies in H3, where the input $u \\in \\mathbb{R}^{N \\times d}$ is multiplied by three weight matrices of size $d \\times d$. These take time $O\\left(d^{2} N\\right)$. The output $\\mathbf{O}$ is also multiplied with an output projection weight matrix of size $d \\times d$, also taking time $O\\left(d^{2} N\\right)$. Therefore the matrix multiplies take time $O\\left(d^{2} N\\right)$. Now consider the two SSMs in H3. The first SSM involves a convolution of $\\mathbf{K} \\in \\mathbb{R}^{N \\times d}$ (in the $N$ dimension) with a kernel of size $N \\times d$. This reduces to an FFT, a pointwise multiply, and an inverse FFT (in the $N$-dimension). This takes time $O(d N \\log N)$. The second SSM involves $H$ convolutions, inputs of size $N \\times d_{h} \\times d_{h}$, along the $N$-dimension. This takes time:\n\n$$\nO\\left(H d_{h}^{2} N \\log N\\right)=O\\left(d d_{h} N \\log N\\right)=O(d N \\log N)\n$$\n\nwhere we use the fact that $d_{h}=d / H$ and that $d_{h}=O(1)$. Therefore the two SSMs take total time $O(d N \\log N)$. As a result, the H 3 layer takes time:\n\n$$\nO\\left(d^{2} N+d N \\log N\\right)\n$$\n\nNow we analyze the space complexity. The matrix multiplies all take space $O(d N)$. The FFTs, pointwise multiplies, and inverse FFTs of the two SSMs takes $O(d N)$ space and $O\\left(H d_{h}^{2} N\\right)=O\\left(d d_{h} N\\right)=O(d N)$ space.",
    "h3-37": "Therefore the overall space complexity is $O(d N)$.",
    "h3-38": "## D. 4 State Passing Correctness\n\nWe prove Proposition 2. We assume that the BlockFFTCONV algorithm is correct, i.e., the output $y=\\operatorname{BLOCkFFTCONv}(f, u)$ is equal to the output of an $\\operatorname{SSM}$ with convolution kernel $f$ and input $u$.",
    "h3-39": "Proof. Proof by induction on $C$. Base case: $C=1$. WTS $y=\\left[y^{(1)}\\right], \\mathbf{M}_{x x} x_{N^{\\prime}}^{(0)}+\\mathbf{M}_{u x} u^{(1)}=x_{N}$. In this case, note that $N=N^{\\prime}$. Then $y^{(1)}=\\mathbf{M}_{x y} x_{N^{\\prime}}^{(0)}+\\operatorname{BLockFFTConv}\\left(f, u_{1}\\right)=\\operatorname{BlockFFTConv}\\left(f, u_{1}\\right)$. But $u=u_{1}$, so $y=y^{(1)}=\\left[y^{(1)}\\right]$. Additionally, by the recursive definition of a state space,\n\n$$\n\\begin{aligned}\nx_{N} & =\\mathbf{A}^{N-1} x_{0}+\\sum_{i=1}^{N} \\mathbf{A}^{N-i} \\mathbf{B} u_{i} \\\\\n& =\\mathbf{A}^{N^{\\prime}-1} x_{0}+\\sum_{i=1}^{N^{\\prime}} \\mathbf{A}^{N^{\\prime}-i} \\mathbf{B} u_{i}^{(1)} \\\\\n& =\\mathbf{M}_{x y} x_{N^{\\prime}}^{(0)}+\\left[\\mathbf{A}^{N^{\\prime}-1} \\mathbf{B}, \\mathbf{A}^{N^{\\prime}-2} \\mathbf{B}, \\ldots, \\mathbf{B}\\right] u^{(1)} \\\\\n& =\\mathbf{M}_{x y} x_{N^{\\prime}}^{(0)}+\\mathbf{M}_{u x} u^{(1)}\n\\end{aligned}\n$$\n\nInductive step: $C>1$. Assume that $\\left[y^{(1)}, \\ldots, y^{(C-1)}\\right]=y\\left[: N^{\\prime}(C-1)\\right]$, and $x_{N^{\\prime}}^{(C-1)}=x_{(C-1) N^{\\prime}}$. WTS that $y^{(C)}=y\\left[N^{\\prime}(C-1): N^{\\prime} C\\right]$, and $\\mathbf{M}_{x x} x_{N^{\\prime}}^{(C-1)}+\\mathbf{M}_{u x} u^{(C)}=x_{N}$. Let $t$ denote $N^{\\prime}(C-1)$. For $i>(C-1) N^{\\prime}$, we have:\n\n$$\n\\begin{aligned}\ny_{i} & =\\mathbf{C A}^{i-t} \\mathbf{B} x_{t}+\\left(f *\\left[u_{t}, u_{t+1}, \\ldots, u_{t+N^{\\prime}-1}\\right]\\right)_{i-t}+\\mathbf{D} u_{i} \\\\\n& =\\mathbf{C A}^{i-t} \\mathbf{B} x_{t}+\\left(f * u^{(C)}\\right)_{i-t}+\\mathbf{D} u_{i} \\\\\n& =\\mathbf{C A}^{i-t} \\mathbf{B} x_{t}+\\operatorname{BLOCKFFTCONv}\\left(f, u^{(C)}\\right)_{i-N^{\\prime}} \\\\\n& =\\left(\\mathbf{M}_{x y} x_{t}+\\operatorname{BLOCKFFTCONV}\\left(f, u^{(C)}\\right)\\right)_{i-N^{\\prime}} \\\\\n& =\\left(\\mathbf{M}_{x y} x_{N^{\\prime}}^{(C-1)}+\\operatorname{BLOCKFFTCONV}\\left(f, u^{(C)}\\right)\\right)_{i-N^{\\prime}} \\\\\n& =y_{i-N^{\\prime}}^{(C)}\n\\end{aligned}\n$$\n\nThus, $y^{(C)}=y\\left[N^{\\prime}(C-1): N^{\\prime} C\\right]$. Similarly,\n\n$$\n\\begin{aligned}\nx_{N} & =\\mathbf{A}^{N^{\\prime}-1} x_{(C-1) N^{\\prime}}+\\sum_{i=1}^{N^{\\prime}} \\mathbf{A}^{N^{\\prime}-i} \\mathbf{B} u_{i+t} \\\\\n& =\\mathbf{A}^{N^{\\prime}-1} x_{N^{\\prime}}^{(C-1)}+\\sum_{i=1}^{N^{\\prime}} \\mathbf{A}^{N^{\\prime}-i} \\mathbf{B} u_{i}^{(C)} \\\\\n& =\\mathbf{M}_{x x} x_{N^{\\prime}}^{(C-1)}+\\left[\\mathbf{A}^{N^{\\prime}-1} \\mathbf{B}, \\mathbf{A}^{N^{\\prime}-2} \\mathbf{B}, \\ldots, \\mathbf{B}\\right] u^{(C)} \\\\\n& =\\mathbf{M}_{x x} x_{N^{\\prime}}^{(C-1)}+\\mathbf{M}_{u x} u^{(C)}\n\\end{aligned}\n$$\n\n## E Experimental Details\n\n## E. 1 Synthetics\n\nOur synthetic tasks, inspired by [49], are designed to mimic the in-context learning capability of large language models - the ability to learn from examples in the input sequence, and use information from the input to\ngenerate the right answer for the output. For example, the induction head task requires memorizing the token that appears after the special $\\vdash$ token in the input sequence, and the associative recall task requires learning the mapping from keys to tokens from the input sequence. We evaluate synthetics by training two-layer versions of our GPT models, with different modules replacing attention. We train models with inner dimension 32, and MLP dimension 128. For all the synthetics, we use a learning rate of $5 \\mathrm{e}-4$ and a weight decay of 0.1 . We sample 5000 training examples and 500 test examples from the same distribution, and we train for 200 epochs. Again, we use embedding dropout of 0.1 and residual dropout of 0.0 . ## E. 2 Model Architecture\n\nFor our 125M models, we use 12 layers, with hidden dimension 1024, and MLP dimension 4096. For our 355M models, we use 24 layers, with the same hidden dimension and MLP dimension. The 1.3B models have 24 layers, with hidden dimension 2048, and MLP dimension 8192. The 2.7B models have 32 layers, hidden dimension 2560, and MLP dimension 10240. The hybrid models have 12, 16, 16, and 20 heads for the 125M, 355M, 1.3B, and 2.7 B models, respectively. The 125M hybrid model has an attention layers at layers 1 and 7, the 355 M and 1.3 B hybrid models have attention layers at layers 1 and 13 , and the 2.7 B hybrid model has attention layers at layers 10 and 21. For both our hybrid models and our H3 models, we use SSM state size 64. Our hybrid model uses head dimension 1 for H3, while our pure H 3 model uses head dimension 8. We run models with mixed-precision training, with bf16 for the MLP's and attention. When training language models, we use fp32 for the FFTConv. ## E. 3 OpenWebText Training\n\nFor the 125M models trained on OpenWebText, we follow the training recipe of the Megatron-LM repo. We use an effective batch size of 512 , and use gradient accumulation to fit into available GPU memory. We use the AdamW optimizer, with learning rate 6e-4 for GPT-2 small and 1.5e-4 for GPT-2 medium, and weight decay of 0.1 . All models are trained with the same hyperparameters for 100 K steps. We run all implementations with mixed-precision training (PyTorch AMP). We train models with sequence length 1024. We use the Openwebtext dataset, with the GPT- 2 BPE tokenizer. We randomly select $0.5 \\%$ of the dataset as the validation set, with the rest being used as training set. This random selection of validation set is done once, and all models are evaluated on the same validation set. ## E. 4 The Pile Training\n\nFor the 125 M and 355 M models trained on the Pile, we follow the training recipe of GPT-3. We use batch size 256 , with sequence length 2048 . We train our models for 800 K steps. We use residual dropout 0.0 and embedding dropout 0.1 . We use the AdamW optimizer, with learning rate $6 \\mathrm{e}-4$ for the 125 M model and $3 \\mathrm{e}-4$ for the 355 M model, and a weight decay of 0.1 . We use a cosine schedule with 8000 steps for linear warmup, and decay the learning rate to $10 \\%$ by 300B tokens, then continue training at $10 \\%$ learning rate for another 100B tokens. We suspect that there exist better hyperparameters for H3 language models, but we did not have the resources to tune them. For the 1.3B models, we double the batch size to 512 (with sequence length 2048), again following the training recipe of GPT-3. The number of training steps are halved so that we train on the same number of tokens. For the Pile dataset, we again use the GPT-2 BPE tokenizer, similar to GPT-3 and GPT-Neo. ## E. 5 SuperGLUE\n\nWe follow the prompts used in the GPT-3 paper [7]. For rank classification on the binary classification tasks, we use yes/no for WSC, WIC, MultiRC, and BoolQ, and we use true/false for RTE. For CB, we use true/false/neither as the three choices. For COPA and ReCoRD, we use the continuations provided by the task. ## E. 6 Hardware\n\nAll models were trained on either a single $16 x \\mathrm{xA} 100-40 \\mathrm{~GB}$ node or a cluster of $8 \\mathrm{xA} 100-80 \\mathrm{~GB}$ nodes. ## F Additional Experiments\n\n## F. 1 LRA Accuracy\n\nWe evaluate the accuracy of H3 on LRA. We compare accuracy to S4D [26], since H3 uses an S4D kernel as a component in its layer. We use the same hyperparameters as S4D, and make the layer bidirectional by making two copies and running them in opposite directions. Table 9: LRA performance of H3 compared to S4D. | Model | ListOps | Text | Retrieval | Image | Pathfinder | Path-X | Avg |\n| :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: |\n| S4D $[26]$ | $\\mathbf{5 8 . 3}$ | 87.3 | 90.7 | $\\mathbf{8 7 . 5}$ | $\\mathbf{9 3 . 6}$ | $\\mathbf{9 2 . 3}$ | $\\mathbf{8 5 . 0}$ |\n| H3 | 57.5 | $\\mathbf{8 8 . 2}$ | $\\mathbf{9 1 . 0}$ | 87.3 | 93.0 | 91.8 | 84.8 |\n\nTable 9 shows that H3 performs well on the LRA benchmark, even thought it was designed for autoregressive language modeling. H3 outperforms S4D on two of the LRA tasks, and comes within 1 point on the others. ## F. 2 WikiText103\n\nWe train 125M-sized models on WikiText103 [43] and compare their test PPL to transformers, as well as other variants of efficient or long-range attention. We use the same hyperparameters and setup as training on OpenWebText. We also provide results from Transformer-XL and Perceiver AR for context, though the results may not be directly comparable due to differences in model size and tokenizer. Table 10: Test PPL on WikiText103. | Models | PPL |\n| :---: | :---: |\n| Transformer (125M) | 18.6 |\n| Hybrid H3 (125M) | 18.5 |\n| Performer (125M) [9] | 26.8 |\n| Reformer (125M) [39] | 26.0 |\n| Linear Attention (125M) [35] | 25.6 |\n| Perceiver AR (358M) [30] | 18.4 |\n| Transformer-XL (285M) [13] | 18.4 |\n\nTable 10 shows that the Hybrid H3 model is competitive with Transformers of the same size, as well as larger models such as the 358 M Perceiver AR and 285 M Transformer-XL. The hybrid H3 model also significantly outperforms transformers with performer, reformer, and linear attention. We note that the Transformer-XL and Perceiver AR PPl numbers are from the original papers, and may not be directly comparable to our results. In particular, they use a tokenizer with a different vocab size, which means that the PPLs are not directly comparable. In addition, the larger vocab size necessitates a change in the model (adaptive softmax) that may affect performance. The top five numbers in Table 10 are trained with the same setup and are directly comparable to each other. ## F. 3 PG-19\n\nWe evaluate models trained on the PG-19 dataset [54], a natural language dataset comprised of texts from books. We compare the performance of Hybrid H3 compared against Transformers and linear attention. We use the same setup as evaluating on OpenWebText. Table 11: Test PPL on PG-19. | Models | PPL |\n| :---: | :---: |\n| Transformer (125M) | 17.0 |\n| Hybrid H3 (125M) | 16.2 |\n| Linear Attention (125M) [35] | 19.1 |\n\nTable 11 shows that Hybrid H3 outperforms transformers and linear attention. ## F. 4 Length Extrapolation\n\nOne property of SSMs is that they can naturally extrapolate to sequence lengths longer than those seen during training. We use the synthetic associative recall task to demonstrate that H 3 maintains this capability. To do so, we train a two-layer H3 model on sequences of length 20 drawn from the associative recall synthetic language. Then, we evaluate accuracy of the last token prediction on sequences of length 20 and 40 . Table 12: Accuracy of an H3 model trained for associative recall on sequences of length 20 , evaluated on sequences of length 20 and 40 . | Models | Acc, seqlen 20 | Acc, seqlen 40 |\n| :---: | :---: | :---: |\n| H3 | 99.8 | 98.4 |\n\nTable 12 shows that H3 maintains accuracy on sequences of length 40 , which is twice the length of the training sequences. ## F. 5 Scaling in Number of Tokens\n\nWe evaluate how well a Hybrid H3 model scales with the number of tokens seen during training, compared to a Transformer. For these experiments, we train a 125M Hybrid H3 model and a 125M Transformer on the Pile for 5B, 10B, and 15B tokens. We use a learning rate of $6 \\mathrm{e}-4$, adjusting the warmup to be $1 \\%$ of the total training time, and adjusting the decay rate to decay the learning rate to $6 \\mathrm{e}-5$ by the end of training. Table 13: Test PPL on the Pile for models trained with fewer tokens. | Train Tokens | Hybrid H3 (125M) | Transformer (125M) |\n| :---: | :---: | :---: |\n| 5B | 11.8 | 12.7 |\n| 10B | 10.7 | 11.3 |\n| 15B | 10.2 | 10.7 |\n\nTable 13 shows the results. Both the Hybrid H3 model and Transformer model improve as the number of training tokens increases. ## F. 6 H3 Language Model\n\nTable 14: Zero-shot performance on SuperGLUE with rank classification. Best results for each model size in bold. | Model | WSC | WIC | RTE | CB | MultiRC | ReCoRD | BoolQ | COPA | Average |\n| :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: |\n| OPT-125M | $\\underline{39.4}$ | $\\underline{52.0}$ | 48.7 | 37.4 | $\\underline{58.9}$ | $\\underline{44.9}$ | $\\underline{59.6}$ | $\\underline{60.0}$ | 50.1 |\n| GPT-Neo-125M | 36.5 | $\\mathbf{5 3 . 6}$ | $\\underline{53.1}$ | $\\underline{41.1}$ | $\\underline{\\mathbf{5 9 . 9}}$ | 39.6 | $\\underline{\\mathbf{6 2 . 2}}$ | $\\underline{60.0}$ | $\\underline{50.8}$ |\n| H3-125M | $\\mathbf{6 1 . 5}$ | 50.0 | $\\underline{53.1}$ | $\\underline{41.1}$ | 4.6 | 15.8 | 46.4 | 51.0 | 40.4 |\n| Hybrid H3-125M | $\\underline{39.4}$ | 51.4 | $\\mathbf{5 9 .",
    "h3-40": "2}$ | $\\mathbf{4 8 . 2}$ | 51.4 | $\\mathbf{5 5 . 0}$ | $\\underline{59.6}$ | $\\mathbf{6 7 . 0}$ | $\\mathbf{5 3 . 9}$ |\n\nWe report the results of a pure H 3 language model on NLP evaluations. We train a 125M model on the Pile for 400B tokens. Tables 14 and 15 show zero-shot and few-shot performance on SuperGLUE, respectively. ## F. 7 Generation Performance\n\nWe report results on SuperGLUE for generation. Instead of taking rank classification, we instead let the model generate a response, and we search for the gold label (i.e., \"yes\" or \"no\" for the yes/no questions) in the output. Tables 16 and 17 report the results. The trends for few-shot learning match with the logit results, but the hybrid and H3 models perform very poorly in zero-shot performance on some tasks. In these cases, the models tend to generate long text responses that are not relevant to the answer. The few-shot learning examples help the models generate answers in a parsable format. ## F. 8 Non-Text Sequence Modeling\n\nWe show that H3 outperforms Transformers on two non-text sequence modeling tasks: raw speech classification and seizure classification over raw EEG signals. H3 sets state-of-the-art performance on seizure classification\n\nTable 15: 3 -shot performance on SuperGLUE with rank classification.",
    "h3-41": "Best results for each size in bold, second best underline. | Model | WSC | WIC | RTE | CB | MultiRC | ReCoRD | BoolQ | COPA | Average |\n| :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: |\n| OPT-125M | 36.5 | $\\mathbf{5 0 . 2}$ | 47.3 | 44.6 | $\\mathbf{5 7 . 9}$ | $\\underline{44.9}$ | 41.9 | $\\underline{60.0}$ | $\\underline{47.9}$ |\n| GPT-Neo-125M | 38.5 | $\\underline{50.0}$ | $\\underline{53.1}$ | 17.9 | $\\underline{56.3}$ | 39.6 | $\\mathbf{6 2 . 1}$ | $\\underline{60.0}$ | 47.2 |\n| H3-125M | $\\mathbf{6 3 . 5}$ | $\\underline{50.0}$ | 52.3 | $\\underline{48.2}$ | 32.6 | 15.8 | 37.8 | 51.0 | 43.9 |\n| Hybrid H3-125M | $\\underline{43.3}$ | 49.1 | $\\mathbf{5 8 . 1}$ | $\\mathbf{5 1 . 8}$ | 48.9 | $\\mathbf{5 5 . 0}$ | $\\underline{56.1}$ | $\\mathbf{6 7 . 0}$ | $\\mathbf{5 3 . 7}$ |\n\nTable 16: Zero-shot performance on SuperGLUE. Best results for each size in bold, second best underline. | Model | WSC | WIC | RTE | CB | MultiRC | ReCoRD | BoolQ | COPA | Average |\n| :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: |\n| OPT-125M | 36.5 | 48.4 | 49.8 | 8.9 | 39.1 | 44.9 | 45.9 | 60.0 | 41.7 |\n| GPT-Neo-125M | $\\underline{27.9}$ | 11.3 | 45.8 | 8.9 | 19.1 | 39.6 | 56.4 | 60.0 | 33.6 |\n| Hybrid H3-125M | 0.0 | 0.0 | 47.3 | 8.9 | 4.4 | 55.0 | 47.6 | 67.0 | 28.8 |\n| GPT-2 medium (355M) | 50.0 | 50.2 | 16.2 | 21.4 | 10.5 | 53.3 | 38.4 | 65.0 | 38.1 |\n| OPT-350M | $\\underline{41.3}$ | 34.8 | 49.5 | 16.1 | 23.6 | 51.4 | 39.7 | 60.0 | 39.6 |\n| Hybrid H3-355M | $\\frac{1}{22.1}$ | 21.5 | 47.3 | 8.9 | 17.1 | 62.3 | 44.4 | 69.0 | 36.6 |\n\nand matches S4 on speech classification-which suggests that H3, or one of its hybrids, may be a strong candidate for a multimodal foundation model.",
    "h3-42": "Appendix E gives experimental details, and Appendix F gives an additional experiment on brain fMRI data. Seizure Classification from EEG Seizures, which are characterized by uncontrolled brain activity, are some of the most common neurological disorders [20]. Chronic seizures, or epilepsy, cause a range of psychiatric and psycho-social disorders and impact the lives of roughly one percent of the global population [37]. The first step to treating epilepsy is manual analysis of scalp EEG by board-certified neurologists. However, the vast amount of EEG data produced by each patient (which can be up to days of data) makes manual EEG analysis a costly and time-consuming process. To mitigate the costs associated with EEG monitoring, recent deep learning techniques have began to show promise in flagging abnormal EEG segments for potential seizure events [57]. A challenge with classifying EEG data is the trade-off between increasing input sequence length, where more context has been shown to improve seizure classification performance [55], with the increased difficulty of training deep learning models on long sequences (e.g., an EEG signal sampled at 200 Hz produces 12,000 time steps per minute). As a result, many techniques involve domain-specialized models and pre-processing steps, such as FFT transforms and graphical representations [58]. We use the largest publicly available EEG corpus, TUSZ v1.5.2 [56], which includes 5,612 EEG signals from 636 patients, with 3,050 annotated seizures. Signals are segmented into 60 -second clips, and split into train/val/test by patient. The train set contains 39765 clips, the val set contains 4351 clips, and the test set contains 10001 clips. We evaluate binary seizure classification of 60 -sec EEG clips, sampled at 200 Hz , with 19 electrodes: $x \\in R^{12,000 \\times 19}$ and $y \\in\\{0,1\\}$ on the TUSZ v1.5.2 [56] corpus. Transformers cannot process the long sequence length of EEG signals without running out of GPU memory, whereas H3 can-and sets state-of-the-art performance. Raw Speech Classification The SC10 speech commands task [64] contains raw audio signals one second in length, sampled at 16 kHz . Similarly to EEG signals, Transformers cannot process the long sequence length. Table 19 shows that H3 comes within half a point of S4, the state-of-the-art method. Functional Magnetic Resonance Imaging Data Functional Magnetic Resonance Imaging (fMRI) data are typically represented in four dimensions, indicating the measured blood-oxygen-level-dependent (BOLD) signal in temporal sequences $S=\\left\\{V_{1}, \\ldots, V_{t}\\right\\}$ of 3-dimensional volumes $V \\in \\mathbb{R}^{x \\times y \\times z}$, each indicating the BOLD signal for all spatial locations of the brain (as defined by three spatial dimensions $x, y$, and $z$ ). A key challenge for the analysis of fMRI data is the high dimensionality and low sample size of its datasets, which typically contain many hundred thousand dimensions (i.e., voxels) for each of several hundred volumes $V$ in each of tens to hundreds of sequences $S$.",
    "h3-43": "In this setting, where the number of features exceed the number of samples, standard machine learning approaches are prone to overfitting. In spite of the low sample size of individual datasets, neuroimaging research can be considered as recently entering a big data era because researchers more frequently share their collected datasets publicly [41]. The\n\nTable 17: 3 -shot performance on SuperGLUE with generation. Best results for each size in bold, second best underline. | Model | WSC | WIC | RTE | CB | MultiRC | ReCoRD | BoolQ | COPA | Average |\n| :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: |\n| OPT-125M | 36.5 | $\\underline{49.1}$ | 47.3 | 33.9 | $\\underline{35.5}$ | $\\underline{44.8}$ | 38.5 | 60.0 | 43.2 |\n| GPT-Neo-125M | $\\underline{38.5}$ | $\\mathbf{5 0 .",
    "h3-44": "0}$ | $\\underline{53.1}$ | $\\mathbf{4 2 .",
    "h3-45": "9}$ | $\\underline{22.5}$ | 39.7 | $\\mathbf{6 1 . 2}$ | $\\mathbf{6 8 . 0}$ | $\\underline{47.0}$ |\n| H3-125M | 0.0 | 0.0 | 47.3 | 8.9 | 0.0 | 15.4 | 37.8 | 53.0 | 20.3 |\n| Hybrid H3-125M | $\\mathbf{4 3 .",
    "h3-46": "3}$ | $\\underline{49.1}$ | $\\mathbf{5 8 . 1}$ | $\\underline{41.1}$ | $\\mathbf{4 0 . 3}$ | $\\mathbf{5 5 . 2}$ | $\\underline{49.5}$ | $\\underline{67.0}$ | $\\mathbf{5 0 . 5}$ |\n| GPT-2 medium $(355 M)$ | 36.5 | $\\mathbf{5 0 . 5}$ | 47.3 | 28.6 | 35.3 | $\\underline{53.1}$ | $\\underline{37.8}$ | $\\underline{63.0}$ | 44.0 |\n| OPT-350M | $\\underline{37.5}$ | $\\underline{50.0}$ | $\\underline{46.2}$ | $\\mathbf{4 1 . 1}$ | $\\underline{40.6}$ | $\\underline{51.3}$ | 39.4 | 59.0 | $\\underline{45.6}$ |\n| Hybrid H3-355M | $\\mathbf{4 2 . 3}$ | 47.5 | $\\mathbf{5 0 . 5}$ | $\\underline{37.5}$ | $\\mathbf{5 7 . 5}$ | $\\mathbf{6 1 . 4}$ | $\\mathbf{4 5 .",
    "h3-47": "4}$ | $\\mathbf{7 3 . 0}$ | $\\mathbf{5 1 . 9}$ |\n\nTable 18: Performance (AUROC) on 60s seizure classification from raw EEG (sequence length 12000). | H3 | Transformer | Dense-CNN | CNN-LSTM | LSTM | 1D-CNN |\n| :---: | :---: | :---: | :---: | :---: | :---: |\n| $\\mathbf{8 3 . 2}$ | x | 78.0 | 68.6 | 69.3 | 69.7 |\n\navailability of these data open up the opportunity for pre-training in neuroimaging at scale, as recently demonstrated by [60], enabling models to utilize the knowledge that can be learned from public functional neuroimaging data for the analysis of individual datasets. Specifically, [60] evaluate the performance of several self-supervised learning frameworks for functional neuroimaging data by first pre-training models on a broad fMRI dataset spanning 11, 980 fMRI runs from 1,726 individuals across 34 datasets and subsequently adapting the pre-trained models to two downstream mental state decoding datasets (namely, the HCP [61] and MDTB [38] datasets). In mental state decoding, predictive models are tasked with identifying (i.e., decoding) some set of mental states (e.g., answering questions about a prose story or math problem) from measured brain activity. The authors find that a GPT-based model, pre-trained in a causal learning framework, performs best in decoding the $20(\\mathrm{HCP})$ and 26 (MDTB) mental states of the two downstream datasets. To evaluate the performance of H 3 on fMRI data, we replicate this analysis, using the up- and downstream fMRI datasets that were published by [60], treating H3 as a drop-in replacement for the GPT model. To alleviate the high dimensionality challenge of fMRI data, and due to the generally high spatial correlation of brain activity, the original authors have reduced the volumetric time series $S$ to a set $\\Theta \\in \\theta_{1}, \\ldots, \\theta_{n}$ of $n=1,024$ functionally-independent brain networks $\\theta$ (as defined by the dictionaries of functional modes (DiFuMo) brain atlas [12]), each describing the BOLD signal for some subset of voxels $v_{x, y, z} \\in V$, such that the resulting sequences $X \\in \\mathbb{R}^{t \\times n}$ describe the activity pattern of each brain network $n$ for time points $t$. In line with [60], we first pre-train models $f(\\cdot)$ to predict the distribution of brain activity for the next time point $j$ of an input sequence $X$, using a mean absolute error ( $L_{\\text {rec }}$ ) training objective given the model's output $\\hat{X} \\in \\mathbb{R}^{t \\times n}: L_{r e c}=\\frac{1}{n} \\sum_{i=1}^{n}\\left|X_{j, i}-\\hat{X}_{j, i}\\right| ; \\hat{X}_{t, n}=b_{n}+\\sum_{n} f\\left(E^{X}\\right)_{t, e} w_{e, n} ; E_{t, e}^{X}=E^{T R}+E^{p o s}+b_{e}+\\sum_{n} X_{t, n} w_{n, e}$. Here, $E^{T R} \\in \\mathbb{R}^{e}$ and $E^{\\text {pos }} \\in \\mathbb{R}^{e}$ represent learnable embeddings for each possible time point and position of an input sequence (for details, see [60]). As the sampling frequency of fMRI is variable, the same position of an input sequence can correspond to different time points. Note that $f(\\cdot)$ processes the input in a lower-dimensional embedding representation $E^{X} \\in \\mathbb{R}^{t \\times e}$ (with $e=768$ dimensions). We evaluate two model architectures for $f(\\cdot)$, namely, the GPT variant used in [60], with 4 hidden layers and 12 attention heads, and a corresponding H 3 variant with 4 hidden layers (with $H=64$ and $m=1$; see section 3). For both models, the sequence of hidden-states outputs of the last model layer are used to determine $\\hat{X}$. Just as [60], we randomly divide the upstream data into distinct training and validation datasets by randomly designating $5 \\%$ of the fMRI runs of each of the 34 upstream datasets as validation data (at a minimum of 2 runs per dataset) and using the rest of the runs for training. During upstream learning, we then randomly sample sequences of 10 to 100 time points from the fMRI runs and train models with the ADAM optimizer (with $\\beta_{1}=0.9, \\beta_{2}=0.999$, and $\\epsilon=1 e^{-8}$ ) for 5,000 steps at a mini-batch size of 512 , and a learning rate of $5 e^{-4}$. We apply a linear learning rate decay schedule (with a warm-up phase of $1 \\%$ of the total number of training steps), gradient norm clipping at 1.0 , and $L 2$-regularisation (weighted by 0.1 ). We also apply dropout at a rate of 0.1 for the GPT-based model (based on [60]) and evaluate three dropout rates for $\\mathrm{H} 3: 0.1,0.2$, and 0.3 . We find that the H 3 variant trained with 0.2 dropout performs on par with the GPT model, in terms of mean absolute error (Fig. 3), and therefore continue all further analyses with this model variant. We also find that both models exhibit almost identify $L_{r e c}$ error distributions throughout the brain, with relatively higher errors in the posterior parietal, occipital, and cingulate cortices as well parts of the limbic system (Fig. 4). To adapt the pre-trained models to mental state decoding, we add a learnable classification embedding $E^{c l s} \\in \\mathbb{R}^{n}$ to the end of input sequences $X$ and forward the model's prediction $f\\left(E^{X}\\right)$ to a decoding\n\nTable 19: SC 10-class classification on raw audio (sequence length 16000). | H3 | S4 | WaveGan-D | Transformer | Performer | CKConv |\n| :---: | :---: | :---: | :---: | :---: | :---: |\n| 97.04 | $\\mathbf{9 7 . 5 0}$ | 96.25 | x | 30.77 | 71.66 |\n\n![](https://cdn.mathpix.com/cropped/2024_09_12_7a1798f4fbf723c76fd6g-26.jpg?height=496&width=1031&top_left_y=421&top_left_x=554)\n\nFigure 3: Upstream mean absolute error ( $L_{r e c}$ ) in training and evaluation datasets over the course of model training. head $p(\\cdot)$, composed of a dense hidden layer with $e$ model units (one for each embedding dimension, with tanh activation) as well as a softmax output layer with one model unit $i$ for each considered mental state in the data. Accordingly, we adapt models by optimizing a standard cross entropy loss objective: $L_{c l s}=-\\sum_{i} y_{i} \\log p\\left(f\\left(E^{X}\\right)\\right)_{i}$, where $y_{i}$ indicates a binary variable that is 1 if $i$ is the correct mental state and 0 otherwise. During downstream adaptation, we begin training with the respective pre-trained model parameters and then allow all parameters to change freely. Similar to [60], we randomly split each of the two downstream datasets into distinct training and test datasets, each comprising 40 (HCP) or 10 (MDTB) distinct individuals. We adapt models for 750 steps at a mini-batch size of 256 and a learning rate of $5 e^{-5}$ (otherwise using the same learning parameters as for upstream training). Importantly, we repeat each downstream training run 20 times using different random seeds, leading to different random splits of the data and variability in other non-deterministic training factors (such as random initialization and data shuffling). As for the upstream data, the H3 and GPT-based models generally perform on par in their mental state decoding performances in the two left-out test datasets (Table 20). Table 20: Downstream adaptation performance of models pre-trained on fMRI data, averaged over 20 training runs with varying random seeds. F1-scores are macro-averaged. | Dataset | Model | Acc. $( \\pm 95 \\% \\mathrm{CI})$ | F1 $( \\pm 95 \\% \\mathrm{CI})$ |\n| :---: | :---: | :---: | :---: |\n| HCP | GPT | $88.44( \\pm 0.39)$ | $87.24( \\pm 0.39)$ |\n|  | H3 | $88.75( \\pm 0.33)$ | $87.16( \\pm 0.37)$ |\n| MDTB | GPT | $89.47( \\pm 0.44)$ | $88.74( \\pm 0.54)$ |\n|  | H3 | $88.25( \\pm 0.45)$ | $85.76( \\pm 0.61)$ |\n\n![](https://cdn.mathpix.com/cropped/2024_09_12_7a1798f4fbf723c76fd6g-27.jpg?height=507&width=835&top_left_y=1080&top_left_x=645)\n\nFigure 4: Mean absolute error $\\left(L_{r e c}\\right)$ of the final pre-trained models for each voxel of the brain projected onto the inflated cortical surface of the FsAverage template [19].",
    "h3-48": "[^0]:    *Equal Contribution. Order determined by coin flip. [^1]:    ${ }^{1} \\mathrm{An} \\mathrm{A} 100 \\mathrm{GPU}$ has a maximum of $312 \\mathrm{TFLOPs} / \\mathrm{s}$ of FP16 with tensor cores, but only $20 \\mathrm{TFLOPs} / \\mathrm{s}$ of FP32 (and 40 TFLOPs/s of FP16) without tensor cores [46]. This trend started with the V100 GPUs [45] and has continued with the H100 GPUs [48]. [^2]:    ${ }^{2}$ Code for H 3 is available at https://github.com/HazyResearch/H3\n\n[^3]:    ${ }^{3}$ There are several memory-efficient algorithms for attention $[15,52]$, though their time complexity is still quadratic in $N$, which is a lower-bound for attention [36]. ${ }^{4}$ SRAM, or on-chip memory, is much faster than off-chip GPU memory, but usually much smaller, on the order of around 100 KB for each streaming processor. [^4]:    ${ }^{5}$ There is no pretrained GPT-Neo at the 350 M size. "
}