{
    "retnet-0": "# Retentive Network: A Successor to Transformer for Large Language Models \n\nYutao Sun* ${ }^{\\dagger \\ddagger}$ Li Dong* $^{* \\dagger}$ Shaohan Huang ${ }^{\\dagger}$ Shuming Ma ${ }^{\\dagger}$<br>Yuqing Xia ${ }^{\\dagger}$ Jilong Xue ${ }^{\\dagger}$ Jianyong Wang ${ }^{\\ddagger}$ Furu Wei ${ }^{\\dagger \\diamond}$<br>${ }^{\\dagger}$ Microsoft Research $\\quad{ }^{\\ddagger}$ Tsinghua University<br>https://aka.ms/GeneralAI\n\n\n#### Abstract\n\nIn this work, we propose Retentive Network (RETNET) as a foundation architecture for large language models, simultaneously achieving training parallelism, low-cost inference, and good performance.",
    "retnet-1": "We theoretically derive the connection between recurrence and attention. Then we propose the retention mechanism for sequence modeling, which supports three computation paradigms, i.e., parallel, recurrent, and chunkwise recurrent. Specifically, the parallel representation allows for training parallelism. The recurrent representation enables low-cost $O(1)$ inference, which improves decoding throughput, latency, and GPU memory without sacrificing performance. The chunkwise recurrent representation facilitates efficient long-sequence modeling with linear complexity, where each chunk is encoded parallelly while recurrently summarizing the chunks. Experimental results on language modeling show that RETNET achieves favorable scaling results, parallel training, low-cost deployment, and efficient inference. The intriguing properties make RETNET a strong successor to Transformer for large language models. Code will be available at https: / aka.ms/retnet. ![](https://cdn.mathpix.com/cropped/2024_09_12_fb33982bc7545f33a227g-01.jpg?height=571&width=1289&top_left_y=1639&top_left_x=407)\n\nFigure 1: Retentive network (RetNet) achieves low-cost inference (i.e., GPU memory, throughput, and latency), training parallelism, and favorable scaling curves compared with Transformer. Results of inference cost are reported with 8 k as input length. Figure 6 shows more results on different sequence lengths. [^0]\n## 1 Introduction\n\nTransformer $\\left[\\mathrm{VSP}^{+}\\right.$17] has become the de facto architecture for large language models $\\left[\\mathrm{BMR}^{+} 20\\right]$, which was initially proposed to overcome the sequential training issue of recurrent models [HS97]. However, training parallelism of Transformers is at the cost of inefficient inference, because of the $O(N)$ complexity per step and memory-bound key-value cache [Sha19], which renders Transformers unfriendly to deployment. The growing sequence length increases GPU memory consumption as well as latency and reduces inference speed. Numerous efforts have continued to develop the next-generation architecture, aiming at retaining training parallelism and competitive performance as Transformers while having efficient $O(1)$ inference. It is challenging to achieve the above goals simultaneously, i.e., the so-called \"impossible triangle\" as shown in Figure 2. There have been three main strands of research. First, linearized attention [KVPF20] approximates standard attention scores $\\exp (\\boldsymbol{q} \\cdot \\boldsymbol{k})$ with kernels $\\phi(\\boldsymbol{q}) \\cdot \\phi(\\boldsymbol{k})$, so that autoregressive inference can be rewritten in a recurrent form. However, the modeling capability and performance are worse than Transformers, which hinders the method's popularity. The second strand returns to recurrent models for efficient inference while sacrificing training parallelism. As a remedy, element-wise operators $\\left[\\mathrm{PAA}^{+} 23\\right]$ are used for acceleration, however, representation capacity and performance are harmed. The third line of research explores replacing attention with other mechanisms, such as S 4 [GGR21], and its variants [DFS ${ }^{+}$22, $\\mathrm{PMN}^{+}$23]. None of the previous work can break through the impossible triangle, resulting in no clear winner compared with Transformers. In this work, we propose retentive networks (RetNet), achieving low-cost inference, efficient longsequence modeling, Transformer-comparable performance, and parallel model training simultaneously. Specifically, we introduce a multi-scale retention mechanism to substitute multi-head attention, which has three computation paradigms, i.e., parallel, recurrent, and chunkwise recurrent representations. First, the parallel representation empowers training parallelism to utilize GPU devices fully. Second, the recurrent representation enables efficient $O(1)$ inference in terms of memory and computation. The deployment cost and latency can be significantly reduced. Moreover, the implementation is greatly simplified without key-value cache tricks. Third, the chunkwise recurrent representation can perform efficient long-sequence modeling. We parallelly encode each local block for computation speed while recurrently encoding the global blocks to save GPU memory. We conduct extensive experiments to compare RetNet with Transformer and its variants. Experimental results on language modeling show that RetNet is consistently competitive in terms of both scaling curves and in-context learning. Moreover, the inference cost of RetNet is length-invariant. For a 7B model and 8 k sequence length, RetNet decodes $8.4 \\times$ faster and saves $70 \\%$ of memory than Transformers with key-value caches. During training, RetNet also achieves 25-50\\% memory saving and $7 \\times$ acceleration than standard Transformer and an advantage towards highly-optimized FlashAttention $\\left[\\mathrm{DFE}^{+}\\right.$22]. Besides, RetNet's inference latency is insensitive to batch size, allowing enormous throughput. The intriguing properties make RetNet a strong successor to Transformer for large language models. ## 2 Retentive Networks\n\nRetentive network (RetNet) is stacked with $L$ identical blocks, which follows a similar layout (i.e., residual connection, and pre-LayerNorm) as in Transformer [VSP ${ }^{+}$17]. Each RetNet block contains two modules: a multi-scale retention (MSR) module, and a feed-forward network (FFN) module. We introduce the MSR module in the following sections. Given an input sequence $x=x_{1} \\cdots x_{|x|}$, RetNet encodes the sequence in an autoregressive way. The input vectors $\\left\\{\\boldsymbol{x}_{i}\\right\\}_{i=1}^{|x|}$ is first packed into $X^{0}=\\left[\\boldsymbol{x}_{1}, \\cdots, \\boldsymbol{x}_{|x|}\\right] \\in \\mathbb{R}^{|x| \\times d_{\\text {model }}}$, where $d_{\\text {model }}$ is hidden dimension. Then we compute contextualized vector representations $X^{l}=\\operatorname{RetNet}_{l}\\left(X^{l-1}\\right), l \\in[1, L]$. ### 2.1 Retention\n\nIn this section, we introduce the retention mechanism that has a dual form of recurrence and parallelism. So we can train the models in a parallel way while recurrently conducting inference. Given input $X \\in \\mathbb{R}^{|x| \\times d_{\\text {model }}}$, we project it to one-dimensional function $v(n)=X_{n} \\cdot \\boldsymbol{w}_{V}$. Consider a sequence modeling problem that maps $v(n) \\mapsto o(n)$ through states $s_{n}$. Let $v_{n}, o_{n}$ denote $v(n), o(n)$ for simplicity. We formulate the mapping in a recurrent manner:\n\n$$\n\\begin{array}{lr}\ns_{n}=A s_{n-1}+K_{n}^{\\top} v_{n}, & A \\in \\mathbb{R}^{d \\times d}, K_{n} \\in \\mathbb{R}^{1 \\times d} \\\\\no_{n}=Q_{n} s_{n}=\\sum_{m=1}^{n} Q_{n} A^{n-m} K_{m}^{\\top} v_{m}, & Q_{n} \\in \\mathbb{R}^{1 \\times d}\n\\end{array}\n$$\n\nwhere we map $v_{n}$ to the state vector $s_{n}$, and then implement a linear transform to encode sequence information recurrently. Next, we make the projection $Q_{n}, K_{n}$ content-aware:\n\n$$\nQ=X W_{Q}, \\quad K=X W_{K}\n$$\n\nwhere $W_{Q}, W_{K} \\in \\mathbb{R}^{d \\times d}$ are learnable matrices. We diagonalize the matrix $A=\\Lambda\\left(\\gamma e^{i \\theta}\\right) \\Lambda^{-1}$, where $\\gamma, \\theta \\in \\mathbb{R}^{d}$. Then we obtain $A^{n-m}=$ $\\Lambda\\left(\\gamma e^{i \\theta}\\right)^{n-m} \\Lambda^{-1}$. By absorbing $\\Lambda$ into $W_{Q}$ and $W_{K}$, we can rewrite Equation (1) as:\n\n$$\n\\begin{aligned}\no_{n} & =\\sum_{m=1}^{n} Q_{n}\\left(\\gamma e^{i \\theta}\\right)^{n-m} K_{m}^{\\top} v_{m} \\\\\n& =\\sum_{m=1}^{n}\\left(Q_{n}\\left(\\gamma e^{i \\theta}\\right)^{n}\\right)\\left(K_{m}\\left(\\gamma e^{i \\theta}\\right)^{-m}\\right)^{\\boldsymbol{\\top}} v_{m}\n\\end{aligned}\n$$\n\nwhere $Q_{n}\\left(\\gamma e^{i \\theta}\\right)^{n}, K_{m}\\left(\\gamma e^{i \\theta}\\right)^{-m}$ is known as xPos [SDP ${ }^{+}$22], i.e., a relative position embedding proposed for Transformer. We further simplify $\\gamma$ as a scalar, Equation (3) becomes:\n\n$$\no_{n}=\\sum_{m=1}^{n} \\gamma^{n-m}\\left(Q_{n} e^{i n \\theta}\\right)\\left(K_{m} e^{i m \\theta}\\right)^{\\dagger} v_{m}\n$$\n\nwhere ${ }^{\\dagger}$ is the conjugate transpose. The formulation is easily parallelizable within training instances. In summary, we start with recurrent modeling as shown in Equation (1), and then derive its parallel formulation in Equation (4). We consider the original mapping $v(n) \\mapsto o(n)$ as vectors and obtain the retention mechanism as follows. The Parallel Representation of Retention As shown in Figure 3a, the retention layer is defined as:\n\n$$\n\\begin{array}{r}\nQ=\\left(X W_{Q}\\right) \\odot \\Theta, \\quad K=\\left(X W_{K}\\right) \\odot \\bar{\\Theta}, \\quad V=X W_{V} \\\\\n\\Theta_{n}=e^{i n \\theta}, \\quad D_{n m}= \\begin{cases}\\gamma^{n-m}, & n \\geq m \\\\\n0, & n<m\\end{cases}\n\\end{array}\n$$\n\n$$\n\\operatorname{Retention}(X)=\\left(Q K^{\\boldsymbol{\\top}} \\odot D\\right) V\n$$\n\nwhere $\\bar{\\Theta}$ is the complex conjugate of $\\Theta$, and $D \\in \\mathbb{R}^{|x| \\times|x|}$ combines causal masking and exponential decay along relative distance as one matrix. Similar to self-attention, the parallel representation enables us to train the models with GPUs efficiently. ![](https://cdn.mathpix.com/cropped/2024_09_12_fb33982bc7545f33a227g-04.jpg?height=520&width=1245&top_left_y=235&top_left_x=526)\n\nFigure 3: Dual form of RetNet. \"GN\" is short for GroupNorm. The Recurrent Representation of Retention As shown in Figure 3b, the proposed mechanism can also be written as recurrent neural networks (RNNs), which is favorable for inference. For the $n$-th timestep, we recurrently obtain the output as:\n\n$$\n\\begin{aligned}\n& S_{n}=\\gamma S_{n-1}+K_{n}^{\\top} V_{n} \\\\\n& \\operatorname{Retention}\\left(X_{n}\\right)=Q_{n} S_{n}, \\quad n=1, \\cdots,|x|\n\\end{aligned}\n$$\n\nwhere $Q, K, V, \\gamma$ are the same as in Equation (5). The Chunkwise Recurrent Representation of Retention A hybrid form of parallel representation and recurrent representation is available to accelerate training, especially for long sequences. We divide the input sequences into chunks. Within each chunk, we follow the parallel representation (Equation (5)) to conduct computation. In contrast, cross-chunk information is passed following the recurrent representation (Equation (6)). Specifically, let $B$ denote the chunk length. We compute the retention output of the $i$-th chunk via:\n\n$$\n\\begin{aligned}\n& Q_{[i]}=Q_{B i: B(i+1)}, \\quad K_{[i]}=K_{B i: B(i+1)}, \\quad V_{[i]}=V_{B i: B(i+1)} \\\\\n& R_{i}=K_{[i]}^{\\top}\\left(V_{[i]} \\odot \\zeta\\right)+\\gamma^{B} R_{i-1}, \\quad \\zeta_{i j}=\\gamma^{B-i-1} \\\\\n& \\operatorname{Retention}\\left(X_{[i]}\\right)= \\underbrace{\\left.Q_{[i]} K_{[i]}^{\\top} \\odot D\\right) V_{[i]}}_{\\text {Inner-Chunk }}+\\underbrace{\\left(Q_{[i]} R_{i-1}\\right) \\odot \\xi}_{\\text {Cross-Chunk }}, \\quad \\xi_{i j}=\\gamma^{i+1}\n\\end{aligned}\n$$\n\nwhere $[i]$ indicates the $i$-th chunk, i.e., $x_{[i]}=\\left[x_{(i-1) B+1}, \\cdots, x_{i B}\\right]$. ### 2.2 Gated Multi-Scale Retention\n\nWe use $h=d_{\\text {model }} / d$ retention heads in each layer, where $d$ is the head dimension. The heads use different parameter matrices $W_{Q}, W_{K}, W_{V} \\in \\mathbb{R}^{d \\times d}$. Moreover, multi-scale retention (MSR) assigns different $\\gamma$ for each head. For simplicity, we set $\\gamma$ identical among different layers and keep them fixed. In addition, we add a swish gate [HG16, RZL17] to increase the non-linearity of retention layers. Formally, given input $X$, we define the layer as:\n\n$$\n\\begin{aligned}\n& \\gamma=1-2^{-5-\\operatorname{arange}(0, h)} \\in \\mathbb{R}^{h} \\\\\n& \\operatorname{head}_{i}=\\operatorname{Retention}\\left(X, \\gamma_{i}\\right) \\\\\n& Y=\\operatorname{GroupNorm}_{h}\\left(\\operatorname{Concat}\\left(\\operatorname{head}_{1}, \\cdots, \\text { head }_{h}\\right)\\right) \\\\\n& \\operatorname{MSR}(X)=\\left(\\operatorname{swish}\\left(X W_{G}\\right) \\odot Y\\right) W_{O}\n\\end{aligned}\n$$\n\nwhere $W_{G}, W_{O} \\in \\mathbb{R}^{d_{\\text {model }} \\times d_{\\text {model }}}$ are learnable parameters, and GroupNorm [WH18] normalizes the output of each head, following SubLN proposed in [SPP ${ }^{+}$19].",
    "retnet-2": "Notice that the heads use multiple $\\gamma$ scales, which results in different variance statistics. So we normalize the head outputs separately. The pseudocode of retention is summarized in Figure 4. ```\ndef ParallelRetention(\n    q, # bsz * num_head * len * qk_dim\n    k, # bsz * num_head * len * qk_dim\n    v, # bsz * num_head * len * v_dim\n    decay_mask # num_head * len * len\n    ):\n    retention = q @ k.transpose(-1, -2)\n    retention = retention * decay_mask\n    output = retention @ v\n    output = group_norm(output)\n    return output\ndef RecurrentRetention(\n```\n\n```\n    q, k, v, # bsz * num_head * len * qkv_dim\n    past_kv, # bsz * num_head * qk_dim * v_dim\n    decay # num_head * 1 * 1\n    ):\n    current_kv = decay * past_kv + k.unsqueeze\n        (-1) * v.unsqueeze(-2)\n    output = torch.sum(q.unsqueeze(-1) *\n        current_kv, dim=-2)\n    output = group_norm(output)\n    return output, current_kv\ndef ChunkwiseRetention(\n```\n\n```\n    q, k, v, # bsz * num_head * chunk_size * qkv_dim\n    past_kv, # bsz * num_head * qk_dim * v_dim\n    decay_mask, # num_head * chunk_size * chunk_size\n    chunk_decay, # num_head * 1 * 1\n    inner_decay, # num_head * chunk_size\n    ):\n    retention = q @ k.transpose(-1, -2)\n    retention = retention * decay_mask\n    inner_retention = retention @ v\n    cross_retention = (q @ past_kv) * inner_decay\n    retention = inner_retention + cross_retention\n    output = group_norm(retention)\n    current_kv = chunk_decay * past_kv + k.transpose(-1, -2) @ v\n    return output, current_kv\n```\n\nFigure 4: Pseudocode for the three computation paradigms of retention. Retention Score Normalization We utilize the scale-invariant nature of GroupNorm to improve the numerical precision of retention layers. Specifically, multiplying a scalar value within GroupNorm does not affect outputs and backward gradients, i.e., GroupNorm $\\left(\\alpha * \\operatorname{head}_{i}\\right)=$ GroupNorm $\\left(\\right.$ head $\\left._{i}\\right)$. We implement three normalization factors in Equation (5). First, we normalize $Q K^{\\top}$ as $Q K^{\\top} / \\sqrt{d}$. Second, we replace $D$ with $\\tilde{D}_{n m}=D_{n m} / \\sqrt{\\sum_{i=1}^{n} D_{n i}}$. Third, let $R$ denote the retention scores $R=Q K^{\\top} \\odot D$, we normalize it as $\\tilde{R}_{n m}=R_{n m} / \\max \\left(\\left|\\sum_{i=1}^{n} R_{n i}\\right|, 1\\right)$. Then the retention output becomes Retention $(X)=\\tilde{R} V$. The above tricks do not affect the final results while stabilizing the numerical flow of both forward and backward passes, because of the scale-invariant property. ### 2.3 Overall Architecture of Retention Networks\n\nFor an $L$-layer retention network, we stack multi-scale retention (MSR) and feed-forward network (FFN) to build the model. Formally, the input sequence $\\left\\{x_{i}\\right\\}_{i=1}^{|x|}$ is transformed to vectors by a word embedding layer. We use the packed embeddings $X^{0}=\\left[\\boldsymbol{x}_{1}, \\cdots, \\boldsymbol{x}_{|x|}\\right] \\in \\mathbb{R}^{|x| \\times d_{\\text {model }}}$ as the input and compute the model output $X^{L}$ :\n\n$$\n\\begin{aligned}\nY^{l} & =\\operatorname{MSR}\\left(\\operatorname{LN}\\left(X^{l}\\right)\\right)+X^{l} \\\\\nX^{l+1} & =\\operatorname{FFN}\\left(\\operatorname{LN}\\left(Y^{l}\\right)\\right)+Y^{l}\n\\end{aligned}\n$$\n\nwhere $\\mathrm{LN}(\\cdot)$ is LayerNorm [BKH16]. The FFN part is computed as $\\operatorname{FFN}(X)=\\operatorname{gelu}\\left(X W_{1}\\right) W_{2}$, where $W_{1}, W_{2}$ are parameter matrices. Training We use the parallel (Equation (5)) and chunkwise recurrent (Equation (7)) representations during the training process. The parallelization within sequences or chunks efficiently utilizes GPUs to accelerate computation. More favorably, chunkwise recurrence is especially useful for long-sequence training, which is efficient in terms of both FLOPs and memory consumption. | Architectures | Training <br> Parallelization | Inference Cost | Long-Sequence <br> Memory Complexity | Performance |\n| :--- | :---: | :---: | :---: | :---: |\n| Transformer | $\\boldsymbol{\\checkmark}$ | $O(N)$ | $O(N)$ | $\\boldsymbol{\\checkmark}$ |\n| Linear Transformer | $\\boldsymbol{\\checkmark}$ | $O(1)$ | $O(N)$ | $\\mathbf{x}$ |\n| Recurrent NN | $\\mathbf{x}$ | $O(1)$ | $O(N)$ | $\\mathbf{x}$ |\n| RWKV | $\\mathbf{x}$ | $O(1)$ | $O(N)$ | $\\boldsymbol{\\checkmark}$ |\n| H3/S4 | $\\boldsymbol{\\checkmark}$ | $O(1)$ | $O(N \\log N)$ | $\\boldsymbol{\\checkmark}$ |\n| Hyena | $\\boldsymbol{\\checkmark}$ | $O(N)$ | $O(N \\log N)$ | $\\boldsymbol{\\checkmark}$ |\n| RetNet | $\\boldsymbol{\\checkmark}$ | $O(1)$ | $O(N)$ | $\\boldsymbol{\\checkmark}$ |\n\nTable 1: Model comparison from various perspectives. RetNet achieves training parallelization, constant inference cost, linear long-sequence memory complexity, and good performance. Inference The recurrent representation (Equation (6)) is employed during the inference, which nicely fits autoregressive decoding. The $O(1)$ complexity reduces memory and inference latency while achieving equivalent results. ### 2.4 Relation to and Differences from Previous Methods\n\nTable 1 compares RetNet with previous methods from various perspectives. The comparison results echo the \"impossible triangle\" presented in Figure 2. Moreover, RetNet has linear memory complexity for long sequences due to the chunkwise recurrent representation. We also summarize the comparisons with specific methods as follows. Transformer The parallel representation of retention shares similar spirits as Transformers $\\left[\\mathrm{VSP}^{+}\\right.$17]. The most related Transformer variant is Lex Transformer [SDP ${ }^{+}$22] which implements xPos as position embeddings. As described in Equation (3), the derivation of retention aligns with xPos. In comparison with attention, retention removes softmax and enables recurrent formulation, which significantly benefits inference. S4 Unlike Equation (2), if $Q_{n}$ and $K_{n}$ are content-unaware, the formulation can be degenerated to S4 [GGR21], where $O=\\left(Q K^{\\top}, Q A K^{\\top}, . ., Q A^{|x|-1} K^{\\top}\\right) * V$. Linear Attention The variants typically use various kernels $\\phi\\left(q_{i}\\right) \\phi\\left(k_{j}\\right) / \\sum_{n=1}^{|x|} \\phi\\left(q_{i}\\right) \\phi\\left(k_{n}\\right)$ to replace the softmax function. However, linear attention struggles to effectively encode position information, rendering the models less performant. Besides, we reexamine sequence modeling from scratch, rather than aiming at approximating softmax. AFT/RWKV Attention Free Transformer (AFT) simplifies dot-product attention to element-wise operations and moves softmax to key vectors. RWKV replaces AFT's position embeddings with exponential decay and runs the models recurrently for training and inference. In comparison, retention preserves high-dimensional states to encode sequence information, which contributes to expressive ability and better performance. xPos/RoPE Compared with relative position embedding methods proposed for Transformers, Equation (3) presents a similar formulation as $\\mathrm{xPos}\\left[\\mathrm{SDP}^{+}\\right.$22] and RoPE [SLP $\\left.{ }^{+} 21\\right]$. Sub-LayerNorm As shown in Equation (8), the retention layer uses Sub-LayerNorm [WMH ${ }^{+}$22] to normalize outputs. Because the multi-scale modeling leads to different variances for the heads, we replace the original LayerNorm with GroupNorm. ## 3 Experiments\n\nWe conduct experiments on language modeling to evaluate RetNet. We evaluate the proposed architecture with various benchmarks, i.e., language modeling performance, and zero-/few-shot learning on downstream tasks. Moreover, for training and inference, we compare speed, memory consumption, and latency. | Size | Hidden Dim. | \\#Layers | Batch Size | \\# Tokens | Learning Rate |\n| :---: | :---: | :---: | :---: | :---: | :---: |\n| 1.3B | 2048 | 24 | 4 M | 100 B | $6 \\times 10^{-4}$ |\n| 2.7B | 2560 | 32 | 4 M | 100 B | $3 \\times 10^{-4}$ |\n| 6.7B | 4096 | 32 | 4 M | 100 B | $3 \\times 10^{-4}$ |\n\nTable 2: Sizes, and learning hyper-parameters of the models in language modeling experiments. ![](https://cdn.mathpix.com/cropped/2024_09_12_fb33982bc7545f33a227g-07.jpg?height=408&width=708&top_left_y=544&top_left_x=703)\n\nFigure 5: Perplexity decreases along with scaling up the model size. We empirically observe that RetNet tends to outperform Transformer when the model size is larger than 2B. ### 3.1 Setup\n\nParameter Allocation We re-allocate the parameters in MSR and FFN for fair comparisons. Let $d$ denote $d_{\\text {model }}$ for simplicity here. In Transformers, there are about $4 d^{2}$ parameters in self-attention where $W_{Q}, W_{K}, W_{V}, W_{O} \\in \\mathbb{R}^{d \\times d}$, and $8 d^{2}$ parameters in FFN where the intermediate dimension is $4 d$. In comparison, RetNet has $8 d^{2}$ parameters in retention, where $W_{Q}, W_{K} \\in \\mathbb{R}^{d \\times d}, W_{G}, W_{V} \\in$ $\\mathbb{R}^{d \\times 2 d}, W_{O} \\in \\mathbb{R}^{2 d \\times d}$. Notice that the head dimension of $V$ is twice $Q, K$. The widened dimension is projected back to $d$ by $W_{O}$. In order to keep the parameter number the same as Transformer, the FFN intermediate dimension in RetNet is $2 d$. Meanwhile, we set the head dimension to 256 in our experiments, i.e., 256 for queries and keys, and 512 for values. For fair comparison, we keep $\\gamma$ identical among different model sizes, where $\\gamma=1-e^{\\operatorname{linspace}(\\log 1 / 32, \\log 1 / 512, h)} \\in \\mathbb{R}^{h}$ instead of the default value in Equation (8). Language Model Training As shown in Table 2, we train language models with various sizes (i.e., $1.3 \\mathrm{~B}, 2.7 \\mathrm{~B}$, and 6.7 B ) from scratch. The training corpus is a curated compilation of The Pile $\\left[\\mathrm{GBB}^{+}\\right.$20], $\\mathrm{C} 4\\left[\\mathrm{DMI}^{+} 21\\right]$, and The Stack $\\left[\\mathrm{KLBA}^{+} 22\\right]$. We append the <bos> token to indicate the start of a sequence ${ }^{2}$. The training batch size is 4 M tokens with 2048 maximal length. We train the models with 100B tokens, i.e., 25 k steps. We use the AdamW [LH19] optimizer with $\\beta_{1}=0.9, \\beta_{2}=0.98$, and weight decay is set to 0.05 . The number of warmup steps is 375 with linear learning rate decay. The parameters are initialized following DeepNet $\\left[\\mathrm{WMD}^{+}\\right.$22] to guarantee training stability. The implementation is based on TorchScale $\\left[\\mathrm{MWH}^{+} 22\\right]$. We train the models with 512 AMD MI200 GPUs. ### 3.2 Comparisons with Transformer\n\nLanguage Modeling As shown in Figure 5, we report perplexity on the validation set for the language models based on Transformer and RetNet. We present the scaling curves with three model sizes, i.e., 1.3B, 2.7B, and 6.7B. RetNet achieves comparable results with Transformers. More importantly, the results indicate that RetNet is favorable regarding size scaling. Besides performance, the RetNet training is quite stable in our experiments. Experimental results show that RetNet is a strong competitor to Transformer for large language models. Empirically, we find that RetNet starts to outperform Transformer when the model size is larger than 2B. We also summarize the language modeling results with different context lengths in Appendix B. [^1]|  | HS | BoolQ | COPA | PIQA | Winograd | Winogrande | SC | Avg |\n| :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: |\n| Zero-Shot |  |  |  |  |  |  |  |  |\n| Transformer | 55.9 | 62.0 | 69.0 | 74.6 | 69.5 | 56.5 | 75.0 | 66.07 |\n| RetNet | 60.7 | 62.2 | 77.0 | 75.4 | 77.2 | 58.1 | 76.0 | 69.51 |\n| 4-Shot |  |  |  |  |  |  |  |  |\n| Transformer | 55.8 | 58.7 | 71.0 | 75.0 | 71.9 | 57.3 | 75.4 | 66.44 |\n| RetNet | 60.5 | 60.1 | 78.0 | 76.0 | 77.9 | 59.9 | 75.9 | 69.76 |\n\nTable 3: Zero-shot and few-shot learning with Transformer and RetNet. The model size is 6.7B. | Model Size | Memory (GB) $\\downarrow$ <br> Trm+FlashAttn |  |  | RetNet | Trm | Throughput (wps) $\\uparrow$ |  |  |\n| :--- | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: |\n|  | Trm+FlashAttn | RetNet |  |  |  |  |  |  |\n| 1.3B | 74.8 | 38.8 | 34.5 | 10832.4 | 63965.2 | 73344.8 |  |  |\n| 2.7B | 69.6 | 42.1 | 42.0 | 5186.0 | 34990.2 | 38921.2 |  |  |\n| 6.7B | 69.0 | 51.4 | 48.0 | 2754.4 | 16230.1 | 17458.6 |  |  |\n| 13B | 61.4 | 46.3 | 45.9 | 1208.9 | 7945.1 | 8642.2 |  |  |\n\nTable 4: Training cost of Transformer (Trm), Transformer with FlashAttention (Trm+FlashAttn), and RetNet. We report memory consumption and training throughput (word per second; wps). Zero-Shot and Few-Shot Evaluation on Downstream Tasks We also compare the language models on a wide range of downstream tasks. We evaluate zero-shot and 4-shot learning with the 6.7B models. As shown in Table 3, the datasets include HellaSwag (HS) [ZHB ${ }^{+}$19], BoolQ [CLC ${ }^{+19]}$, COPA [WPN ${ }^{+}$19], PIQA [BZB ${ }^{+20]}$, Winograd, Winogrande [LDM12], and StoryCloze (SC) $\\left[\\mathrm{MRL}^{+} 17\\right]$. The accuracy numbers are consistent with language modeling perplexity presented in Figure 5. RetNet achieves comparable performance with Transformer on zero-shot and in-context learning settings. ### 3.3 Training Cost\n\nAs shown in Table 4, we compare the training speed and memory consumption of Transformer and RetNet, where the training sequence length is 8192 . We also compare with FlashAttention [DFE ${ }^{+} 22$ ], which improves speed and reduces GPU memory IO by recomputation and kernel fusion. In comparison, we implement RetNet using vanilla PyTorch code, and leave kernel fusion or FlashAttention-like acceleration for future work. We use chunkwise recurrent representation of retention as described in Equation (7). The chunk size is set to 512 . We evaluate the results with eight Nvidia A100-80GB GPUs, because FlashAttention is highly optimized for A100. Tensor parallelism is enabled for 6.7B and 13B models. Experimental results show that RetNet is more memory-efficient and has higher throughput than Transformers during training. Even compared with FlashAttention, RetNet is still competitive in terms of speed and memory cost. Moreover, without relying on specific kernels, it is easy to train RetNet on other platforms efficiently. For example, we train the RetNet models on an AMD MI200 cluster with decent throughput. It is notable that RetNet has the potential to further reduce cost via advanced implementation, such as kernel fusion. ### 3.4 Inference Cost\n\nAs shown in Figure 6, we compare memory cost, throughput, and latency of Transformer and RetNet during inference. Transformers reuse KV caches of previously decoded tokens. RetNet uses the recurrent representation as described in Equation (6). We evaluate the 6.7B model on the A100-80GB GPU in our experiments. Figure 6 shows that RetNet outperforms Transformer in terms of inference cost. Memory As shown in Figure 6a, the memory cost of Transformer increases linearly due to KV caches. In contrast, the memory consumption of RetNet remains consistent even for long sequences,\n\n![](https://cdn.mathpix.com/cropped/2024_09_12_fb33982bc7545f33a227g-09.jpg?height=1129&width=1417&top_left_y=228&top_left_x=352)\n\nFigure 6: Inference cost of Transformer and RetNet with a model size of 6.7B. RetNet outperforms Transformers in terms of memory consumption, throughput, and latency. requiring much less GPU memory to host RetNet. The additional memory consumption of RetNet is almost negligible (i.e., about $3 \\%$ ) while the model weights occupy $97 \\%$. Throughput As presented in Figure 6b, the throughput of Transformer drops along with the decoding length increases. In comparison, RetNet has higher and length-invariant throughput during decoding, by utilizing the recurrent representation of retention. Latency Latency is an important metric in deployment, which greatly affects user experience. We report decoding latency in Figure 6c. Experimental results show that increasing batch size renders Transformer's latency larger. Moreover, the latency of Transformers grows faster with longer input. In order to make latency acceptable, we have to restrict the batch size, which harms the overall inference throughput of Transformers. By contrast, RetNet's decoding latency outperforms Transformers and keeps almost the same across different batch sizes and input lengths. ### 3.5 Comparison with Transformer Variants\n\nApart from Transformer, we compare RetNet with various efficient Transformer variants, including Linear Transformer [KVPF20], RWKV [PAA ${ }^{+}$23], H3 [DFS+ 22], and Hyena [PMN ${ }^{+}$23].",
    "retnet-3": "All models have 200M parameters with 16 layers and a hidden dimension of 1024. For H3, we set the head dimension as 8 . For RWKV, we use the TimeMix module to substitute self-attention layers while keeping FFN layers consistent with other models for fair comparisons. We train the models with 10 k steps with a batch size of 0.5 M tokens. Most hyperparameters and training corpora are kept the same as in Section 3.1. Table 5 reports the perplexity numbers on the in-domain validation set and other out-of-domain corpora, e.g., Project Gutenberg 2019-2022 (PG22) [SDP ${ }^{+}$22], QMSum [ZYY ${ }^{+}$21], GovRe-\n\n| Method | In-Domain | PG22 | QMSum | GovReport | SummScreen |\n| :--- | :---: | :---: | :---: | :---: | :---: |\n| RWKV | 30.92 | 51.41 | 28.17 | 19.80 | 25.78 |\n| H3 | 29.97 | 49.17 | 24.29 | 19.19 | 25.11 |\n| Hyena | 32.08 | 52.75 | 28.18 | 20.55 | 26.51 |\n| Linear Transformer | 40.24 | 63.86 | 28.45 | 25.33 | 32.02 |\n| RetNet | $\\mathbf{2 6 .",
    "retnet-4": "0 5}$ | $\\mathbf{4 5 . 2 7}$ | $\\mathbf{2 1 . 3 3}$ | $\\mathbf{1 6 . 5 2}$ | $\\mathbf{2 2 . 4 8}$ |\n\nTable 5: Perplexity results on language modeling. RetNet outperforms other architectures on both the in-domain evaluation set and various out-of-domain corpora. | Method | In-Domain | PG22 | QMSum | GovReport | SummScreen |\n| :--- | :---: | :---: | :---: | :---: | :---: |\n| RetNet | $\\mathbf{2 6 .",
    "retnet-5": "0 5}$ | $\\mathbf{4 5 . 2 7}$ | $\\mathbf{2 1 . 3 3}$ | $\\mathbf{1 6 . 5 2}$ | $\\mathbf{2 2 . 4 8}$ |\n| - swish gate | 27.84 | 49.44 | 22.52 | 17.45 | 23.72 |\n| - GroupNorm | 27.54 | 46.95 | 22.61 | 17.59 | 23.73 |\n| - $\\gamma$ decay | 27.86 | 47.85 | 21.99 | 17.49 | 23.70 |\n| - multi-scale decay | 27.02 | 47.18 | 22.08 | 17.17 | 23.38 |\n| Reduce head dimension | 27.68 | 47.72 | 23.09 | 17.46 | 23.41 |\n\nTable 6: Ablation results on in-domain and out-of-domain corpora. port $\\left[\\mathrm{HCP}^{+}\\right.$21], SummScreen [CCWG21, $\\mathrm{SSI}^{+}$22]. Overall, RetNet outperforms previous methods across different datasets. RetNet not only achieves better evaluation results on the in-domain corpus but also obtains lower perplexity on several out-of-domain datasets. The favorable performance makes RetNet a strong successor to Transformer, besides the benefits of significant cost reduction (Sections 3.3 and 3.4).",
    "retnet-6": "In addition, we discuss the training and inference efficiency of the compared methods. Let $d$ denote the hidden dimension, and $n$ the sequence length. For training, RWKV's token-mixing complexity is $O(d n)$ while Hyena's is $O(d n \\log n)$ with Fast Fourier Transform acceleration. The above two methods reduce training FLOPS via employing element-wise operators to trade-off modeling capacity. In comparison with retention, the chunk-wise recurrent representation is $O(d n(b+h))$, where $b$ is the chunk size, $h$ is the head dimension, and we usually set $b=512, h=256$. For either large model size (i.e., larger $d$ ) or sequence length, the additional $b+h$ has negligible effects. So the RetNet training is quite efficient without sacrificing the modeling performance. For inference, among the compared efficient architectures, Hyena has the same complexity (i.e., $O(n)$ per step) as Transformer while the others can perform $O(1)$ decoding. ### 3.6 Ablation Studies\n\nWe ablate various design choices of RetNet and report the language modeling results in Table 6 . The evaluation settings and metrics are the same as in Section 3.5. Architecture We ablate the swish gate and GroupNorm as described in Equation (8). Table 6 shows that the above two components improve the final performance. Firstly, the gating module is essential for enhancing non-linearity and improving model capability. Notice that we use the same parameter allocation as Transformers after removing the gate. Secondly, group normalization in retention balances the variances of multi-head outputs, which improves training stability and language modeling results. Multi-Scale Decay Equation (8) shows that we use different $\\gamma$ as the decay rates for the retention heads. In the ablation studies, we examine removing $\\gamma$ decay (i.e., \" $-\\gamma$ decay\") and applying the same decay rate across heads (i.e., \"- multi-scale decay\"). Specifically, ablating $\\gamma$ decay is equivalent to $\\gamma=1$. In the second setting, we set $\\gamma=127 / 128$ for all heads. Table 6 indicates that both the decay mechanism and using multiple decay rates can improve the language modeling performance. Head Dimension From the recurrent perspective of Equation (1), the head dimension implies the memory capacity of hidden states. In the ablation study, we reduce the default head dimension from\n256 to 64 , i.e., 64 for queries and keys, and 128 for values. We keep the hidden dimension $d_{\\text {model }}$ the same so the number of heads increases. Experimental results in Table 6 show that the larger head dimension achieves better performance. ## 4 Conclusion\n\nIn this work, we propose retentive networks (RetNet) for sequence modeling, which enables various representations, i.e., parallel, recurrent, and chunkwise recurrent. RetNet achieves significantly better inference efficiency (in terms of memory, speed, and latency), favorable training parallelization, and competitive performance compared with Transformers. The above advantages make RetNet an ideal successor to Transformers for large language models, especially considering the deployment benefits brought by the $O(1)$ inference complexity. In the future, we would like to scale up RetNet in terms of model size $\\left[\\mathrm{CDH}^{+}\\right.$22] and training steps. Moreover, retention can efficiently work with structured prompting $\\left[\\mathrm{HSD}^{+} 22 \\mathrm{~b}\\right]$ by compressing long-term memory. We will also use RetNet as the backbone architecture to train multimodal large language models [HSD ${ }^{+} 22 \\mathrm{a}, \\mathrm{HDW}^{+} 23, \\mathrm{PWD}^{+} 23$ ]. In addition, we are interested in deploying RetNet models on various edge devices, such as mobile phones. ## Acknowledgement\n\nWe would like to acknowledge Jiayu Ding, Songlin Yang, and colleagues from MSRA System Group for the helpful discussions. ## References\n\n[BKH16] Jimmy Lei Ba, Jamie Ryan Kiros, and Geoffrey E Hinton. Layer normalization. arXiv preprint arXiv:1607.06450, 2016. $\\left[\\mathrm{BMR}^{+}\\right.$20] Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel Ziegler, Jeffrey Wu, Clemens Winter, Chris Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. Language models are few-shot learners. In Advances in Neural Information Processing Systems, volume 33, pages 1877-1901. Curran Associates, Inc., 2020. $\\left[\\mathrm{BZB}^{+}\\right.$20] Yonatan Bisk, Rowan Zellers, Ronan Le Bras, Jianfeng Gao, and Yejin Choi. Piqa: Reasoning about physical commonsense in natural language.",
    "retnet-7": "In Thirty-Fourth AAAI Conference on Artificial Intelligence, 2020. [CCWG21] Mingda Chen, Zewei Chu, Sam Wiseman, and Kevin Gimpel. Summscreen: A dataset for abstractive screenplay summarization.",
    "retnet-8": "arXiv preprint arXiv:2104.07091, 2021. $\\left[\\mathrm{CDH}^{+}\\right.$22] Zewen Chi, Li Dong, Shaohan Huang, Damai Dai, Shuming Ma, Barun Patra, Saksham Singhal, Payal Bajaj, Xia Song, Xian-Ling Mao, Heyan Huang, and Furu Wei. On the representation collapse of sparse mixture of experts. In Advances in Neural Information Processing Systems, 2022. $\\left[\\right.$ CLC $^{+}$19] Christopher Clark, Kenton Lee, Ming-Wei Chang, Tom Kwiatkowski, Michael Collins, and Kristina Toutanova. BoolQ: Exploring the surprising difficulty of natural yes/no questions.",
    "retnet-9": "In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics, pages 2924-2936, 2019. $\\left[\\mathrm{DFE}^{+}\\right.$22] Tri Dao, Dan Fu, Stefano Ermon, Atri Rudra, and Christopher Ré. Flashattention: Fast and memory-efficient exact attention with io-awareness. Advances in Neural Information Processing Systems, 35:16344-16359, 2022. [DFS ${ }^{+}$22] Tri Dao, Daniel Y Fu, Khaled K Saab, Armin W Thomas, Atri Rudra, and Christopher Ré. Hungry hungry hippos: Towards language modeling with state space models.",
    "retnet-10": "arXiv preprint arXiv:2212.14052, 2022. [DMI ${ }^{+}$21] Jesse Dodge, Ana Marasović, Gabriel Ilharco, Dirk Groeneveld, Margaret Mitchell, and Matt Gardner. Documenting large webtext corpora: A case study on the colossal clean crawled corpus. In Conference on Empirical Methods in Natural Language Processing, 2021. $\\left[\\mathrm{GBB}^{+}\\right.$20] Leo Gao, Stella Biderman, Sid Black, Laurence Golding, Travis Hoppe, Charles Foster, Jason Phang, Horace He, Anish Thite, Noa Nabeshima, et al. The Pile: An 800GB dataset of diverse text for language modeling.",
    "retnet-11": "arXiv preprint arXiv:2101.00027, 2020. [GGR21] Albert Gu, Karan Goel, and Christopher Ré. Efficiently modeling long sequences with structured state spaces. arXiv preprint arXiv:2111.00396, 2021. $\\left[\\mathrm{HCP}^{+}\\right.$21] Luyang Huang, Shuyang Cao, Nikolaus Parulian, Heng Ji, and Lu Wang. Efficient attentions for long document summarization. arXiv preprint arXiv:2104.02112, 2021. $\\left[\\mathrm{HDW}^{+} 23\\right]$ Shaohan Huang, Li Dong, Wenhui Wang, Yaru Hao, Saksham Singhal, Shuming Ma, Tengchao Lv, Lei Cui, Owais Khan Mohammed, Qiang Liu, Kriti Aggarwal, Zewen Chi, Johan Bjorck, Vishrav Chaudhary, Subhojit Som, Xia Song, and Furu Wei. Language is not all you need: Aligning perception with language models. ArXiv, abs/2302.14045, 2023. [HG16] Dan Hendrycks and Kevin Gimpel. Gaussian error linear units (GELUs). arXiv: Learning, 2016. [HS97] Sepp Hochreiter and Jürgen Schmidhuber. Long short-term memory. Neural Computation, 9:1735-1780, November 1997. [HSD ${ }^{+}$22a] Yaru Hao, Haoyu Song, Li Dong, Shaohan Huang, Zewen Chi, Wenhui Wang, Shuming Ma, and Furu Wei. Language models are general-purpose interfaces. ArXiv, abs/2206.06336, 2022. $\\left[\\mathrm{HSD}^{+}\\right.$22b] Yaru Hao, Yutao Sun, Li Dong, Zhixiong Han, Yuxian Gu, and Furu Wei. Structured prompting: Scaling in-context learning to 1,000 examples.",
    "retnet-12": "ArXiv, abs/2212.06713, 2022 . $\\left[\\mathrm{KLBA}^{+}\\right.$22] Denis Kocetkov, Raymond Li, Loubna Ben Allal, Jia Li, Chenghao Mou, Carlos Muñoz Ferrandis, Yacine Jernite, Margaret Mitchell, Sean Hughes, Thomas Wolf, Dzmitry Bahdanau, Leandro von Werra, and Harm de Vries. The Stack: 3TB of permissively licensed source code.",
    "retnet-13": "Preprint, 2022. [KVPF20] Angelos Katharopoulos, Apoorv Vyas, Nikolaos Pappas, and François Fleuret. Transformers are rnns: Fast autoregressive transformers with linear attention.",
    "retnet-14": "In International Conference on Machine Learning, pages 5156-5165. PMLR, 2020. [LDM12] Hector Levesque, Ernest Davis, and Leora Morgenstern. The winograd schema challenge. In Thirteenth International Conference on the Principles of Knowledge Representation and Reasoning, 2012. [LH19] Ilya Loshchilov and Frank Hutter. Decoupled weight decay regularization. In International Conference on Learning Representations, 2019. $\\left[\\mathrm{MRL}^{+}\\right.$17] Nasrin Mostafazadeh, Michael Roth, Annie Louis, Nathanael Chambers, and James Allen. Lsdsem 2017 shared task: The story cloze test. In Proceedings of the 2nd Workshop on Linking Models of Lexical, Sentential and Discourse-level Semantics, pages $46-51,2017$. $\\left[\\mathrm{MWH}^{+}\\right.$22] Shuming Ma, Hongyu Wang, Shaohan Huang, Wenhui Wang, Zewen Chi, Li Dong, Alon Benhaim, Barun Patra, Vishrav Chaudhary, Xia Song, and Furu Wei. TorchScale: Transformers at scale. CoRR, abs/2211.13184, 2022. $\\left[\\mathrm{OSG}^{+}\\right.$23] Antonio Orvieto, Samuel L. Smith, Albert Gu, Anushan Fernando, Caglar Gulcehre, Razvan Pascanu, and Soham De. Resurrecting recurrent neural networks for long sequences. ArXiv, abs/2303.06349, 2023. $\\left[\\mathrm{PAA}^{+}\\right.$23] Bo Peng, Eric Alcaide, Quentin Anthony, Alon Albalak, Samuel Arcadinho, Huanqi Cao, Xin Cheng, Michael Chung, Matteo Grella, Kranthi Kiran GV, Xuzheng He, Haowen Hou, Przemyslaw Kazienko, Jan Kocon, Jiaming Kong, Bartlomiej Koptyra, Hayden Lau, Krishna Sri Ipsit Mantri, Ferdinand Mom, Atsushi Saito, Xiangru Tang, Bolun Wang, Johan S. Wind, Stansilaw Wozniak, Ruichong Zhang, Zhenyuan Zhang, Qihang Zhao, Peng Zhou, Jian Zhu, and Rui-Jie Zhu. Rwkv: Reinventing rnns for the transformer era, 2023. $\\left[\\mathrm{PMN}^{+}\\right.$23] Michael Poli, Stefano Massaroli, Eric Nguyen, Daniel Y Fu, Tri Dao, Stephen Baccus, Yoshua Bengio, Stefano Ermon, and Christopher Ré. Hyena hierarchy: Towards larger convolutional language models. arXiv preprint arXiv:2302.10866, 2023. $\\left[\\mathrm{PWD}^{+}\\right.$23] Zhiliang Peng, Wenhui Wang, Li Dong, Yaru Hao, Shaohan Huang, Shuming Ma, and Furu Wei. Kosmos-2: Grounding multimodal large language models to the world. ArXiv, abs/2306.14824, 2023. [RZL17] Prajit Ramachandran, Barret Zoph, and Quoc V. Le. Swish: a self-gated activation function. arXiv: Neural and Evolutionary Computing, 2017. [SDP ${ }^{+}$22] Yutao Sun, Li Dong, Barun Patra, Shuming Ma, Shaohan Huang, Alon Benhaim, Vishrav Chaudhary, Xia Song, and Furu Wei. A length-extrapolatable transformer. arXiv preprint arXiv:2212.10554, 2022. [Sha19] Noam M. Shazeer. Fast transformer decoding: One write-head is all you need. ArXiv, abs/1911.02150, 2019. [SLP ${ }^{+}$21] Jianlin Su, Yu Lu, Shengfeng Pan, Bo Wen, and Yunfeng Liu. Roformer: Enhanced transformer with rotary position embedding.",
    "retnet-15": "arXiv preprint arXiv:2104.09864, 2021. [SPP ${ }^{+}$19] Mohammad Shoeybi, Mostofa Patwary, Raul Puri, Patrick LeGresley, Jared Casper, and Bryan Catanzaro. Megatron-LM: Training multi-billion parameter language models using model parallelism.",
    "retnet-16": "arXiv preprint arXiv:1909.08053, 2019. [SSI ${ }^{+}$22] Uri Shaham, Elad Segal, Maor Ivgi, Avia Efrat, Ori Yoran, Adi Haviv, Ankit Gupta, Wenhan Xiong, Mor Geva, Jonathan Berant, et al. Scrolls: Standardized comparison over long language sequences. arXiv preprint arXiv:2201.03533, 2022. $\\left[\\mathrm{VSP}^{+}\\right.$17] Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N. Gomez, Lukasz Kaiser, and Illia Polosukhin. Attention is all you need. In Advances in Neural Information Processing Systems 30: Annual Conference on Neural Information Processing Systems 2017, 4-9 December 2017, Long Beach, CA, USA, pages 60006010, 2017. [WH18] Yuxin Wu and Kaiming He. Group normalization. In Proceedings of the European conference on computer vision (ECCV), pages 3-19, 2018. $\\left[\\mathrm{WMD}^{+}\\right.$22] Hongyu Wang, Shuming Ma, Li Dong, Shaohan Huang, Dongdong Zhang, and Furu Wei. DeepNet: Scaling Transformers to 1,000 layers. ArXiv, abs/2203.00555, 2022. [WMH ${ }^{+}$22] Hongyu Wang, Shuming Ma, Shaohan Huang, Li Dong, Wenhui Wang, Zhiliang Peng, Yu Wu, Payal Bajaj, Saksham Singhal, Alon Benhaim, et al. Foundation transformers. arXiv preprint arXiv:2210.06423, 2022. $\\left[\\mathrm{WPN}^{+}\\right.$19] Alex Wang, Yada Pruksachatkun, Nikita Nangia, Amanpreet Singh, Julian Michael, Felix Hill, Omer Levy, and Samuel R Bowman. SuperGLUE: A stickier benchmark for general-purpose language understanding systems.",
    "retnet-17": "arXiv preprint arXiv:1905.00537, 2019 . $\\left[\\mathrm{ZHB}^{+}\\right.$19] Rowan Zellers, Ari Holtzman, Yonatan Bisk, Ali Farhadi, and Yejin Choi. Hellaswag: Can a machine really finish your sentence? In Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, 2019. [ZYY+ 21] Ming Zhong, Da Yin, Tao Yu, Ahmad Zaidi, Mutethia Mutuma, Rahul Jha, Ahmed Hassan Awadallah, Asli Celikyilmaz, Yang Liu, Xipeng Qiu, et al. Qmsum: A new benchmark for query-based multi-domain meeting summarization.",
    "retnet-18": "arXiv preprint arXiv:2104.05938, 2021. ## A Hyperparameters\n\n| Hyperparameters | $\\mathbf{1 . 3 B}$ | $\\mathbf{2 . 7 B}$ | $\\mathbf{6 . 7 B}$ |\n| :--- | :---: | :---: | :---: |\n| Layers | 24 | 32 | 32 |\n| Hidden size | 2048 | 2560 | 4096 |\n| FFN size | 4096 | 5120 | 8192 |\n| Heads | 8 | 10 | 16 |\n| Learning rate | $6 \\times 10^{-4}$ | $3 \\times 10^{-4}$ | $3 \\times 10^{-4}$ |\n| LR scheduler |  | Polynomial decay |  |\n| Warm-up steps |  | 375 |  |\n| Tokens per batch |  | 4 M |  |\n| Adam $\\beta$ |  | $(0.9,0.98)$ |  |\n| Training steps |  | 25,000 |  |\n| Gradient clipping |  | 2.0 |  |\n| Dropout |  | 0.1 |  |\n| Weight decay |  | 0.01 |  |\n\nTable 7: Hyperparamters used for the models in Section 3. ## B Grouped Results of Different Context Lengths\n\nAs shown in Table 8, we report language modeling results with different context lengths. In order to make the numbers comparable, we use 2048 text chunks as evaluation data and only compute perplexity for the last 128 tokens. Experimental results show that RetNet outperforms Transformer across different context lengths. Besides, RetNet can utilize longer context for better results. | Model | $\\mathbf{5 1 2}$ | $\\mathbf{1 0 2 4}$ | $\\mathbf{2 0 4 8}$ |\n| :--- | :---: | :---: | :---: |\n| Transformer | 13.55 | 12.56 | 12.35 |\n| RetNet | 13.09 | 12.14 | 11.98 |\n\nTable 8: Language modeling perplexity of RetNet and Transformer with different context length.",
    "retnet-19": "The results show that RetNet has a consistent advantage across sequence length.",
    "retnet-20": "[^0]:    * Equal contribution. $\\diamond$ Corresponding author. [^1]:    ${ }^{2} \\mathrm{We}$ find that appending the <bos> token at the beginning benefits training stability and performance. "
}