{
    "softmaxattn-0": "# Softmax Attention with Constant Cost per Token \n\nFranz A. Heinsen<br>franz@glassroom.com\n\n\n#### Abstract\n\nWe propose a simple modification to the conventional attention mechanism applied by Transformers: Instead of quantifying pairwise query-key similarity with scaled dot-products, we quantify it with the logarithms of scaled dot-products of exponentials. Our modification linearizes attention with exponential kernel feature maps, whose corresponding feature function is infinite dimensional. We show that our modification is expressible as a composition of log-sums of exponentials, with a latent space of constant size, enabling application with constant time and space complexity per token. We implement our modification, verify that it works in practice, and conclude that it is a promising alternative to conventional attention. ${ }^{1}$\n\n\n## 1 Summary\n\nThe conventional attention mechanism of Transformers (Vaswani et al., 2017) has become the predominant method for capturing sequential dependencies, but its cost is quadratic in sequence length $n$, because it applies a Softmax function over the rows of an $n \\times n$ matrix of scaled dotproducts. FlashAttention (Dao et al., 2022) reduces memory use from quadratic to linear by computing, normalizing, and reducing the matrix in an incremental fashion, i.e., without ever storing it in full, but the compute cost remains quadratic. Numerous alternatives to conventional attention have been proposed to reduce its quadratic cost, including linearized, low-rank, and sparse approximations, mechanisms that slide context\n\n[^0]windows, and convolutions in the frequency domain.",
    "softmaxattn-1": "We cannot summarize all proposals fairly in the space of a paragraph. Notable examples include the methods proposed by Child et al. (2019), Wang et al. (2020), Kitaev et al. (2020), Katharopoulos et al. (2020), Zhai et al. (2021), Roy et al. (2020), Lee-Thorp et al.",
    "softmaxattn-2": "(2021), and Poli et al. (2023). More recently, generalized state space models that build on previous research (Martin and Cundy, 2017) (Gu et al., 2021) have shown promise by incorporating data-driven mechanisms to control the evolution of a fixed-size latent state (Peng et al., 2023) (Gu and Dao, 2023) (Katsch, 2023), but their performance is inferior on certain tasks (e.g., recalling arbitrary parts of the input context), motivating the hypothesis that methods with a fixed-size latent space cannot outperform conventional attention (Jelassi et al., 2024). ### 1.1 Modifying Attention\n\nWe find that a simple modification to conventional attention linearizes it (Katharopoulos et al., 2020) with exponential kernel feature maps, and we show that this modification renders attention expressible as a composition of log-sums of exponentials, with a fixed-size latent space, for sequential application with constant cost per token. We implement our modification, verify that it works, and conclude that it is a promising alternative. The modification we propose is:\n\n$$\n\\begin{gathered}\n\\text { modified }(Q, K, V):= \\\\\n\\text { Attention }(Q) \\\\\n\\text { Softmax }\\left(\\log \\frac{\\exp (Q) \\exp (K)^{T}}{\\exp (c)}\\right) V\n\\end{gathered}\n$$\n\nwhere queries $Q$, keys $K$ and values $V$ have $n_{Q} \\times d_{K}, n_{K} \\times d_{K}$, and $n_{K} \\times d_{V}$ elements, respectively, and $c$ is a scalar constant, all in $\\mathbb{R}$. We compute all exponentials elementwise. ### 1.2 As Log-Sums of Exponentials\n\nIn Section 2, we prove that\n\n$$\n\\begin{aligned}\n& \\text { modified } \\\\\n& \\operatorname{Attention}(Q, K, V)=\\exp (\\log S-\\log Z) \\text {, }\n\\end{aligned}\n$$\n\nwhere\n\n$$\n\\begin{aligned}\n& \\log S=\\operatorname{LSE}_{\\left[d_{K}\\right]}(Q+\\underbrace{\\operatorname{LSE}_{\\left[n_{K}\\right]}\\left(K^{T}+\\log V\\right)}_{d_{K} \\times d_{V} \\text { elements }}) \\\\\n& \\log Z=\\operatorname{LSE}_{\\left[d_{K}\\right]}(Q+\\underbrace{\\operatorname{LSE}_{\\left[n_{K}\\right]}\\left(K^{T}\\right)}_{d_{K} \\text { elements }})\n\\end{aligned}\n$$\n\nThe elementwise sums are over compatible dimensions, broadcasting over all other dimensions, from left to right-e.g., before reduction, the broadcasted elementwise sum $K^{T}+\\log V$ has $d_{K} \\times n_{K} \\times d_{V}$ elements. The functions $\\operatorname{LSE}_{\\left[d_{K}\\right]}(\\cdot)$ and $\\operatorname{LSE}_{\\left[n_{K}\\right]}(\\cdot)$ compute log-sums of exponentials over the dimension indexed by $\\left(1,2, \\ldots, d_{K}\\right)$ and $\\left(1,2, \\ldots, n_{K}\\right)$, respectively. If any of $V$ 's elements are negative, $\\log V$ is complex, and therefore so is $\\log S$, but all Softmax mixtures of $V$ remain over $\\mathbb{R}$ because they are a composition of operations under which $\\mathbb{R}$ is closed (1). ### 1.3 Autoregressive Case\n\nFor autoregressive attention, in which $n_{Q}=n_{K}$ and for each query at step $t$ we compute attention only over $t$ trailing tokens, we note that in (3), all sequential dependencies are modeled by the logsums computed with $\\operatorname{LSE}_{\\left[n_{K}\\right]}(\\cdot)$, so we can compute autoregressive $\\log S$ and $\\log Z$ with:\n\n$$\n\\begin{aligned}\n& \\log S=\\operatorname{LSE}_{\\left[d_{K}\\right]}(Q+\\underbrace{\\operatorname{LCSE}_{\\left[n_{K}\\right]}\\left(K^{T}+\\log V\\right)}_{d_{K} \\times n_{K} \\times d_{V} \\text { elements }}) \\\\\n& \\log Z=\\operatorname{LSE}_{\\left[d_{K}\\right]}(Q+\\underbrace{\\operatorname{LCSE}_{\\left[n_{K}\\right]}\\left(K^{T}\\right)}_{d_{K} \\times n_{K} \\text { elements }})\n\\end{aligned}\n$$\n\nwhere the function $\\operatorname{LCSE}_{\\left[n_{K}\\right]}(\\cdot)$ computes a logcumulative-sum of exponentials over the dimension indexed by and $\\left(1,2, \\ldots, n_{K}\\right)$. For sequential application, given a new query $Q_{t}$ at step $t$, we need only the end-states of the two log-cumulative-sums of exponentials:\n\n$$\n\\begin{aligned}\n& \\log S_{t}=\\operatorname{LSE}_{\\left[d_{K}\\right]}(Q_{t}+\\underbrace{H_{t}^{(S)}}_{d_{K} \\times d_{V}}) \\\\\n& \\log Z_{t}=\\operatorname{LSE}_{\\left[d_{K}\\right]}(Q_{t}+\\underbrace{H_{t}^{(Z)}}_{d_{K}})\n\\end{aligned}\n$$\n\nwhere hidden states $H_{t}^{(S)}$ and $H_{t}^{(Z)}$ are the states of the two log-cumulative-sums at step $t$ :\n\n$$\n\\begin{aligned}\n& H_{t}^{(S)}=\\log \\left(\\exp \\left(H_{t-1}^{(S)}\\right)+\\exp \\left(K_{t}+\\log V_{t}\\right)\\right) \\\\\n& H_{t}^{(Z)}=\\log \\left(\\exp \\left(H_{t-1}^{(Z)}\\right)+\\exp \\left(K_{t}\\right)\\right)\n\\end{aligned}\n$$\n\nwith zeros as their initial condition:\n\n$$\n\\begin{aligned}\n& H_{0}^{(S)}=\\{0\\}^{d_{K} \\times d_{V}} \\\\\n& H_{0}^{(Z)}=\\{0\\}^{d_{K}}\n\\end{aligned}\n$$\n\nTogether, $H_{t}^{(S)}$ and $H_{t}^{(Z)}$ hold the latent, or hidden, state of autoregressive attention's computation at step $t$. They enable us to compute autoregressive attention sequentially with constant time and space complexity per token, $\\mathcal{O}(1)$. ### 1.4 Non-Autoregressive Case\n\nFor non-autoregressive attention, in which $n_{Q}$ may differ from $n_{K}$ and for each query we compute attention over all tokens in the sequence, we compute $\\log S$ and $\\log Z$ with (3). For sequential application, in which we add a new token to the input context at step $t$, with key $K_{t}$ and value $V_{t}$, we compute $\\log S$ and $\\log Z$ for all queries from the updated hidden states:\n\n$$\n\\begin{aligned}\n& \\log S=\\operatorname{LSE}_{\\left[d_{K}\\right]}\\left(Q+H_{t}^{(S)}\\right) \\\\\n& \\log Z=\\operatorname{LSE}_{\\left[d_{K}\\right]}\\left(Q+H_{t}^{(Z)}\\right)\n\\end{aligned}\n$$\n\nwhere $H_{t}^{(S)}$ and $H_{t}^{(Z)}$ are the hidden states at step $t$ (6), with zeros as their initial condition (7). ## 2 Proof\n\nGiven a query $q$ and a key $k$ in $\\mathbb{R}^{d_{K}}$, the logarithm of the dot-product of their exponentials is $\\log \\left(\\sum(\\exp (q) \\odot \\exp (k))\\right)=\\operatorname{LSE}(q+k)$, where $\\odot$ denotes an elementwise product. Log-sums of exponentials are associative and commutative, making the proof fairly straightforward. For clarity's sake, we walk step-by-step through a sequence of algebraic manipulations. We start by expanding the Softmax function in (1) and simplifying the resulting expression. We obtain a form of linear attention (Katharopoulos et al., 2020) with exponential kernel feature maps:\n\n$$\n\\begin{gathered}\n\\operatorname{Softmax}\\left(\\log \\frac{\\exp (Q) \\exp (K)^{T}}{\\exp (c)}\\right) V= \\\\\n{\\left[\\frac{\\exp (Q) \\exp (K)^{T}}{\\sum_{\\left[n_{K}\\right]} \\exp (Q) \\exp (K)^{T}}\\right] V}\n\\end{gathered}\n$$\n\nwhere $\\sum_{\\left[n_{K}\\right]}$ normalizes each row to a probability distribution. The scaling constant $\\exp (c)$ disappears because it becomes a common divisor of numerator and denominator expressions. Note that the feature function corresponding to the exponential kernel is infinite dimensional. Substitute the dot-products of exponentiated queries and exponentiated keys with equivalent explicit summations over elementwise products:\n\n$$\n\\left[\\frac{\\sum_{\\left[d_{K}\\right]} \\exp (Q) \\odot \\exp (K)^{T}}{\\sum_{\\left[n_{K}\\right]} \\sum_{\\left[d_{K}\\right]} \\exp (Q) \\odot \\exp (K)^{T}}\\right] V\n$$\n\nwhere the elementwise product $\\odot$ is over compatible dimensions, broadcasting over any other dimensions, from left to right, such that the broadcasted elementwise product $\\exp (Q) \\odot \\exp (K)^{T}$ has $n_{Q} \\times d_{K} \\times n_{K}$ elements. ${ }^{2}$\nExpress matrix multiplication with $V$ as a summation over broadcasted elementwise products:\n\n$$\n\\frac{\\sum_{\\left[n_{K}\\right]} \\sum_{\\left[d_{K}\\right]} \\exp (Q) \\odot \\exp (K)^{T} \\odot V}{\\sum_{\\left[n_{K}\\right]} \\sum_{\\left[d_{K}\\right]} \\exp (Q) \\odot \\exp (K)^{T}}\n$$\n\nBoth $\\exp (K)^{T}$ and $V$ have a dimension indexed by $\\left(1,2, \\ldots, n_{K}\\right)$, but $\\exp (Q)$ does not, so we can sum over that dimension before broadcastmultiplying elementwise with $\\exp (Q)$ :\n\n$$\n\\frac{\\sum_{\\left[d_{K}\\right]} \\exp (Q) \\odot \\sum_{\\left[n_{K}\\right]} \\exp (K)^{T} \\odot V}{\\sum_{\\left[d_{K}\\right]} \\exp (Q) \\odot \\sum_{\\left[n_{K}\\right]} \\exp (K)^{T}}\n$$\n\nDefine $S$ and $Z$ as the expressions that compute numerators and denominators, respectively,\n\n$$\n\\begin{aligned}\n& S:=\\sum_{\\left[d_{K}\\right]} \\exp (Q) \\odot \\sum_{\\left[n_{K}\\right]} \\exp (K)^{T} \\odot V \\\\\n& Z:=\\sum_{\\left[d_{K}\\right]} \\exp (Q) \\odot \\sum_{\\left[n_{K}\\right]} \\exp (K)^{T}\n\\end{aligned}\n$$\n\nand take their logarithms. We obtain:\n\n$$\n\\begin{aligned}\n& \\log S=\\operatorname{LSE}_{\\left[d_{K}\\right]}\\left(Q+\\operatorname{LSE}_{\\left[n_{K}\\right]}\\left(K^{T}+\\log V\\right)\\right) \\\\\n& \\log Z=\\operatorname{LSE}_{\\left[d_{K}\\right]}\\left(Q+\\operatorname{LSE}_{\\left[n_{K}\\right]}\\left(K^{T}\\right)\\right),\n\\end{aligned}\n$$\n\nwhich is the same as (3). [^1]\n## 3 Implementation\n\nAs proof of concept, we implement our attention mechanism for both autoregressive applications (e.g., generative language modeling) and nonautoregressive applications (e.g., masked language modeling). For simplicity and expediency, we limit our implementation in two significant ways: First, we restrict $V$ to elements $\\geq 0$ to avoid dealing with complex floating-point numbers, which incur greater overhead and are more cumbersome to manipulate than real floating-point numbers with existing software infrastructure. Second, when computing autoregressive attention over $n_{K}$ tokens, we first compute all $n_{K}$ hidden states with a parallel scan, and then reduce them, which is space-inefficient but easier to implement with existing software infrastructure. ${ }^{3}$\n\nWe apply our implementation in a small generative language model ( 125 M parameters, 50257 token ids, 768 embedding features). For numerical stability, in each layer we compute $\\log V$ over $\\mathbb{R}$ directly, with a dense feed-forward transformation of token states, implicitly defining $V$ as $\\log V$ 's exponential but never actually computing it. To remain in $\\mathbb{R}$, we use the logarithm of attention as input to subsequent transformations in the layer, i.e., the input to subsequent transformations is $\\log S-\\log Z$ instead of $\\exp (\\log S-\\log Z)$. Please see our published code for all model details. We train the model on 300B tokens from The Pile (Gao et al., 2020) with a conventional sequence length of 1024 tokens, and obtain a crossentropy loss of 2.47 , competitive with state-of-theart generative language models of similar size. ## 4 Conclusions\n\nBy all indications, our attention mechanism is a promising alternative to the conventional one, but the evidence we have so far is too scant to be conclusive. An adequate comparison requires addressing our implementation's temporary limitations and evaluating models with one to several orders of magnitude more parameters on a diverse set of benchmarks and downstream tasks. [^2]\n## References\n\nRewon Child, Scott Gray, Alec Radford, and Ilya Sutskever. 2019. Generating long sequences with sparse transformers. CoRR abs/1904.10509. Tri Dao, Daniel Y. Fu, Stefano Ermon, Atri Rudra, and Christopher Ré. 2022. Flashattention: Fast and memory-efficient exact attention with io-awareness.",
    "softmaxattn-3": "Leo Gao, Stella Biderman, Sid Black, Laurence Golding, Travis Hoppe, Charles Foster, Jason Phang, Horace He, Anish Thite, Noa Nabeshima, Shawn Presser, and Connor Leahy. 2020. The Pile: An 800 gb dataset of diverse text for language modeling. arXiv preprint arXiv:2101.00027.",
    "softmaxattn-4": "Albert Gu and Tri Dao. 2023. Mamba: Linear-time sequence modeling with selective state spaces. Albert Gu, Karan Goel, and Christopher Ré. 2021. Efficiently modeling long sequences with structured state spaces. CoRR abs/2111.00396. Samy Jelassi, David Brandfonbrener, Sham M. Kakade, and Eran Malach. 2024. Repeat after me: Transformers are better than state space models at copying. Angelos Katharopoulos, Apoorv Vyas, Nikolaos Pappas, and François Fleuret. 2020. Transformers are rnns: Fast autoregressive transformers with linear attention. CoRR abs/2006.16236. Tobias Katsch. 2023. Gateloop: Fully data-controlled linear recurrence for sequence modeling.",
    "softmaxattn-5": "Nikita Kitaev, Lukasz Kaiser, and Anselm Levskaya. 2020. Reformer: The efficient transformer. CoRR abs/2001.04451.",
    "softmaxattn-6": "James Lee-Thorp, Joshua Ainslie, Ilya Eckstein, and Santiago Ontañón. 2021. Fnet: Mixing tokens with fourier transforms. CoRR abs/2105.03824.",
    "softmaxattn-7": "Eric Martin and Chris Cundy. 2017. Parallelizing linear recurrent neural nets over sequence length. CoRR abs/1709.04057. Bo Peng, Eric Alcaide, Quentin Anthony, Alon Albalak, Samuel Arcadinho, Huanqi Cao, Xin Cheng, Michael Chung, Matteo Grella, Kranthi Kiran GV, Xuzheng He, Haowen Hou, Przemyslaw Kazienko, Jan Kocon, Jiaming Kong, Bartlomiej Koptyra, Hayden Lau, Krishna Sri Ipsit Mantri, Ferdinand Mom, Atsushi Saito, Xiangru Tang, Bolun Wang, Johan S. Wind, Stansilaw Wozniak, Ruichong Zhang, Zhenyuan Zhang, Qihang Zhao, Peng Zhou, Jian Zhu, and Rui-Jie Zhu. 2023. Rwkv: Reinventing rnns for the transformer era. Michael Poli, Stefano Massaroli, Eric Nguyen, Daniel Y. Fu, Tri Dao, Stephen Baccus, Yoshua Bengio, Stefano Ermon, and Christopher Ré. 2023. Hyena hierarchy: Towards larger convolutional language models. Aurko Roy, Mohammad Saffar, Ashish Vaswani, and David Grangier. 2020. Efficient content-based sparse attention with routing transformers. CoRR abs/2003.05997. Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N. Gomez, Lukasz Kaiser, and Illia Polosukhin. 2017. Attention is all you need. CoRR abs/1706.03762. Sinong Wang, Belinda Z. Li, Madian Khabsa, Han Fang, and Hao Ma. 2020. Linformer: Self-attention with linear complexity. CoRR abs/2006.04768. Shuangfei Zhai, Walter Talbott, Nitish Srivastava, Chen Huang, Hanlin Goh, Ruixiang Zhang, and Josh M. Susskind. 2021. An attention free transformer. CoRR abs/2105.14103. [^0]:    ${ }^{1}$ Source code and instructions for replicating our results are online at https://github.com/glassroom/heinsen_attention. [^1]:    ${ }^{2}$ Properly, we are computing a tensor product over the non-compatible dimensions, but we describe it as a combination of elementwise multiplication and broadcasting because those operations will be more familiar to more readers. [^2]:    ${ }^{3}$ It is possible to compute autoregressive attention over $n_{K}$ tokens in parallel more space-efficiently, by evaluating\n\n    $$\n    \\log S=\\operatorname{LSE}_{\\left[d_{K}\\right]}\\left(Q+\\operatorname{LCSE}_{\\left[n_{K}\\right]}\\left(K^{T}+\\log V\\right)\\right)\n    $$\n\n    without simultaneously storing all $d_{K} \\times n_{K} \\times d_{V}$ intermediate values of the broadcasted sum $K^{T}+\\log V$ in memory. "
}