{
    "transextra-0": "Exploring Transformer Extrapolation\n\n1Zhen Qin\\equalcontrib, 1Yiran Zhong\\equalcontrib, 2Hui Deng Corresponding author. Email: zhongyiran@gmail.com. Abstract\n\nLength extrapolation has attracted considerable attention recently since it allows transformers to be tested on longer sequences than those used in training. Previous research has shown that this property can be attained by using carefully designed Relative Positional Encodings (RPEs). While these methods perform well on a variety of corpora, the conditions for length extrapolation have yet to be investigated. This paper attempts to determine what types of RPEs allow for length extrapolation through a thorough mathematical and empirical analysis. We discover that a transformer is certain to possess this property as long as the series that corresponds to the RPE’s exponential converges. Two practices are derived from the conditions and examined in language modeling tasks on a variety of corpora. As a bonus from the conditions, we derive a new Theoretical Receptive Field (TRF) to measure the receptive field of RPEs without taking any training steps. Extensive experiments are conducted on the Wikitext-103, Books, Github, and WikiBook datasets to demonstrate the viability of our discovered conditions. We also compare TRF to Empirical Receptive Field (ERF) across different models, showing consistently matched trends on these datasets. Introduction\n\nTransformer (Vaswani et al. 2017) is advancing steadily in the areas of natural language processing (Qin et al. 2023b; Devlin et al. 2019; Liu et al. 2019; Qin et al. 2022b, a; Liu et al. 2022; Qin and Zhong 2023), computer vision (Dosovitskiy et al. 2020; Sun et al. 2022b; Lu et al. 2022; Hao et al. 2024), and audio processing (Gong, Chung, and Glass 2021; Akbari et al.",
    "transextra-1": "2021; Gulati et al. 2020; Sun et al. 2022a). Although it outperforms other architectures such as RNNs (Cho et al. 2014; Qin, Yang, and Zhong 2023) and CNNs (Kim 2014; Hershey et al. 2016; Gehring et al. 2017) in many sequence modeling tasks, its lack of length extrapolation capability limits its ability to handle a wide range of sequence lengths, i.e., inference sequences need to be equal to or shorter than training sequences. Increasing the training sequence length is only a temporary solution because the space-time complexity grows quadratically with the sequence length. Another option is to extend the inference sequence length by converting the trained full attention blocks to sliding window attention blocks (Beltagy, Peters, and Cohan 2020), but this will result in significantly worse efficiency than the full attention speed (Press, Smith, and Lewis 2022). How to permanently resolve this issue without incurring additional costs has emerged as a new topic. A mainstream solution for length extrapolation is to design a Relative Positional Encoding (RPE) (Qin et al. 2023c) that concentrates attention on neighboring tokens. For example, ALiBi (Press, Smith, and Lewis 2022) applies linear decay biases to the attention to reduce the contribution from distant tokens. Kerple (Chi et al. 2022) investigates shift-invariant conditionally positive definite kernels in RPEs and proposes a collection of kernels that promote the length extrapolation property. It also shows that ALiBi is one of its instances. Sandwich (Chi, Fan, and Rudnicky 2022) proposes a hypothesis to explain the secret behind ALiBi and empirically proves it by integrating the hypothesis into sinusoidal positional embeddings. In order to investigate transformer extrapolation, we first establish a hypothesis regarding why existing RPE-based length extrapolation methods (Qin et al. 2023a) have this capacity to extrapolate sequences in inference based on empirical analysis. Then we identify the conditions of RPEs that satisfy the hypothesis through mathematical analysis. Finally, the discovered conditions are empirically validated on a variety of corpora. Specifically, we assume that due to decay biases, existing RPE-based length extrapolation methods behave similarly to sliding window attention, i.e., only tokens within a certain range can influence the attention scores. A transformer can extrapolate for certain in this scenario since the out-of-range tokens have no effect on the attention outcomes. We derive that a transformer is guaranteed to satisfy this hypothesis if the series corresponding to the exponential of its RPE converges.",
    "transextra-2": "Based on the observation, we show that previous RPE-based methods (Press, Smith, and Lewis 2022; Chi et al. 2022) can be seen as particular instances under the conditions. Two new practices from the conditions are derived and evaluated in language modeling. The observed conditions not only shed light on the secret of length extrapolation but also offer a new perspective on computing the Theoretical Receptive Fields (TRF) of RPEs. In contrast to prior approaches that require training gradients to compute TRF, we propose a new way to calculate TRF that is solely based on the formulation of RPEs.",
    "transextra-3": "Extensive experiments on Wikitext-103 (Merity et al. 2016), Books (Zhu et al. 2015), Github (Gao et al. 2020), and WikiBook (Wettig et al. 2022) validate the conditions. TRF calculated by our method substantially matches the trend of the Empirical Receptive Field (ERF) in real-world scenarios. Preliminary\n\nBefore embarking on the journey of exploring, we introduce several preliminary concepts that will be used throughout the paper, such as softmax attention, relative positional encoding, length extrapolation, and sliding window attention.",
    "transextra-4": "We also provide the necessary notations for the subsequent analysis, i.e., we use to denote a matrix and to represent the th row of . The complete math notations can be found in Appendix. Following previous work (Press, Smith, and Lewis 2022), we restrict our analysis to causal language models and assume that the max sequence length during training is . Softmax attention\n\nSoftmax attention is a key component of transformers which operates on query , key and value matrices. Each matrix is a linear map that takes as input:\n\n𝐐 = 𝐗𝐖 Q , 𝐊 = 𝐗𝐖 K , 𝐕 = 𝐗𝐖 V ∈ ℝ n × d , formulae-sequence 𝐐 subscript 𝐗𝐖 𝑄 formulae-sequence 𝐊 subscript 𝐗𝐖 𝐾 𝐕 subscript 𝐗𝐖 𝑉 superscript ℝ 𝑛 𝑑 \\mathbf{Q}=\\mathbf{X}\\mathbf{W}_{Q},\\ \\mathbf{K}=\\mathbf{X}\\mathbf{W}_{K},\\ \\mathbf{V}=\\mathbf{X}\\mathbf{W}_{V}\\in\\mathbb{R}^{n\\times d}, (1)\n\nwhere is the sequence length and is the dimension of the hidden feature. The output attention matrix can be formulated as:\n\n𝐎 = Softmax ​ ( 𝐐𝐊 𝖳 / d ) ​ 𝐕 . 𝐎 Softmax superscript 𝐐𝐊 𝖳 𝑑 𝐕 \\mathbf{O}=\\mathrm{Softmax}(\\mathbf{Q}\\mathbf{K}^{\\mkern-1.5mu\\mathsf{T}}/\\sqrt{d})\\mathbf{V}. (2)\n\nTo prevent information leakage in causal language modeling, a mask matrix is used to ensure that current tokens can only see previous tokens and themselves. The lower triangular elements of are , and the upper triangular ones, except for the diagonal, are . Then the output attention matrix for causal language models will be:\n\n𝐎 = Softmax ​ ( 𝐐𝐊 ⊤ / d + 𝐌 ) ​ 𝐕 . 𝐎 Softmax superscript 𝐐𝐊 top 𝑑 𝐌 𝐕 \\mathbf{O}=\\mathrm{Softmax}(\\mathbf{Q}\\mathbf{K}^{\\top}/\\sqrt{d}+\\mathbf{M})\\mathbf{V}. (3)\n\nNote that Eq. 3 can be seen as a general form of attention, i.e., when the elements of are all 0, Eq. 3 is degenerated to Eq.",
    "transextra-5": "2. For ease of discussion, we use Eq. 3 to represent attention computation. Relative positional encoding\n\nPositional encoding is designed to inject positional bias into transformers. Absolute Positional Encoding (APE) (Vaswani et al. 2017; Gehring et al. 2017) and Relative Positional Encoding (RPE) (Su et al. 2021; Liutkus et al. 2021; Press, Smith, and Lewis 2022; Chi et al. 2022) are the two most common types of positional encoding. In this paper, we focus on RPE because it is the key for length extrapolation, as shown in (Press, Smith, and Lewis 2022). An attention with RPE can be written as:\n\n𝐎 = Softmax ​ ( 𝐐𝐊 ⊤ / d + 𝐌 + 𝐏 ) ​ 𝐕 , 𝐎 Softmax superscript 𝐐𝐊 top 𝑑 𝐌 𝐏 𝐕 \\mathbf{O}=\\mathrm{Softmax}(\\mathbf{Q}\\mathbf{K}^{\\top}/\\sqrt{d}+\\mathbf{M}+\\mathbf{P})\\mathbf{V}, (4)\n\nwhere is a Toeplitz matrix that encodes relative positional information, i.e., . It is worth noting that and can be merged, and the merged matrix is still a Toeplitz matrix. We use to represent the merged matrix and rewrite Eq. 4 as:\n\n𝐎 = Softmax ​ ( 𝐐𝐊 ⊤ / d + 𝐑 ) ​ 𝐕 . 𝐎 Softmax superscript 𝐐𝐊 top 𝑑 𝐑 𝐕 \\mathbf{O}=\\mathrm{Softmax}(\\mathbf{Q}\\mathbf{K}^{\\top}/\\sqrt{d}+\\mathbf{R})\\mathbf{V}. (5)\n\nDefinition of length extrapolation\n\nThe property of length extrapolation allows a model to be tested on longer sequences than those used in training. Previous sequence modeling structures such as RNNs (Hochreiter and Schmidhuber 1997) and CNNs (Gehring et al. 2017) often naturally possess this property, but it is a difficult task for transformers. This property is only present in sliding window transformers and a few transformer variants with specifically designed RPEs (Chi et al. 2022; Press, Smith, and Lewis 2022; Chi, Fan, and Rudnicky 2022). In language modeling, one token can only see itself and previous tokens. Therefore, regardless the sequence length, the performance should be stable for the neighboring tokens that are within the training sequence length (Beltagy, Peters, and Cohan 2020). For the tokens that are out of range, the performance will degrade if the model does not support length extrapolation (Press, Smith, and Lewis 2022). Based on the observation above, we give a definition of length extrapolation:\n\nDefinition 0.1. For a language model , given dataset , if for any , there is,\n\n| p ​ p ​ l n ​ ( 𝒳 , ℱ ) − p ​ p ​ l m ​ ( 𝒳 , ℱ ) | / p ​ p ​ l m ​ ( 𝒳 , ℱ ) < δ , 𝑝 𝑝 subscript 𝑙 𝑛 𝒳 ℱ 𝑝 𝑝 subscript 𝑙 𝑚 𝒳 ℱ 𝑝 𝑝 subscript 𝑙 𝑚 𝒳 ℱ 𝛿 |ppl_{n}(\\mathcal{X},\\mathcal{F})-ppl_{m}(\\mathcal{X},\\mathcal{F})|/ppl_{m}(\\mathcal{X},\\mathcal{F})<\\delta, (6)\n\nthen is considered to have the extrapolation property.",
    "transextra-6": "Here is a small constant, means that calculates perplexity with a max sequence length of on the data set . Empirically, if becomes very large() as increases, we consider that does not have extrapolation property. Sliding window attention\n\nFor the convenience of subsequent discussions, we define a window attention at position and window size as follows:\n\n𝐨 i j superscript subscript 𝐨 𝑖 𝑗 \\displaystyle\\mathbf{o}_{i}^{j} = ∑ i − j + 1 ≤ s ≤ i exp ⁡ ( 𝐪 i ⊤ ​ 𝐤 s / d ) ​ exp ⁡ ( r i ​ s ) ​ 𝐯 s ∑ i − j + 1 ≤ t ≤ i exp ⁡ ( 𝐪 i ⊤ ​ 𝐤 t / d ) ​ exp ⁡ ( r i ​ t ) absent subscript 𝑖 𝑗 1 𝑠 𝑖 superscript subscript 𝐪 𝑖 top subscript 𝐤 𝑠 𝑑 subscript 𝑟 𝑖 𝑠 subscript 𝐯 𝑠 subscript 𝑖 𝑗 1 𝑡 𝑖 superscript subscript 𝐪 𝑖 top subscript 𝐤 𝑡 𝑑 subscript 𝑟 𝑖 𝑡 \\displaystyle=\\frac{\\sum_{i-j+1\\leq s\\leq i}\\exp(\\mathbf{q}_{i}^{\\top}\\mathbf{k}_{s}/\\sqrt{d})\\exp(r_{is})\\mathbf{v}_{s}}{\\sum_{i-j+1\\leq t\\leq i}\\exp(\\mathbf{q}_{i}^{\\top}\\mathbf{k}_{t}/\\sqrt{d})\\exp(r_{it})} (7) ≜ ∑ i − j + 1 ≤ s ≤ i c i ​ s ​ 𝐯 s C i ​ j , ≜ absent subscript 𝑖 𝑗 1 𝑠 𝑖 subscript 𝑐 𝑖 𝑠 subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑗 \\displaystyle\\triangleq\\frac{\\sum_{i-j+1\\leq s\\leq i}c_{is}\\mathbf{v}_{s}}{C_{ij}},\n\nwhere\n\nWe further assume , where is a constant. The represents the attention output of the -th token, which interacts with the tokens preceding it. Note that window attention naturally possesses the length extrapolation ability. There are two ways to infer window attention: nonoverlapping inference and sliding window inference as shown on the right of Figure 1. In sliding window inference, the tokens within each sliding window must be re-encoded multiple times, making it substantially slower than the nonoverlapping one. In table 1 we compare the average inference time over a group of window sizes between the sliding window inference and nonoverlapping window inference. The sliding window one is more than 44 times slower than the nonoverlapping one. However, as shown on the left of Figure 1, the sliding window inference has much lower ppl than the nonoverlapping one. Transformer Extrapolation Exploration\n\nIn this section, we first describe the hypothesis about why existing RPE-based length extrapolation methods can extrapolate sequences in inference and provide empirical evidence for it. Then we derive the conditions for length extrapolation in detail and demonstrate that recent RPE-based length extrapolation methods (Chi et al. 2022; Press, Smith, and Lewis 2022) satisfy the conditions. The hypothesis\n\nA sliding window attention with window size is equivalent to the following RPE on full attention:\n\nm i ​ j = { 0 , i − j ≤ w . − ∞ , others . subscript m 𝑖 𝑗 cases 0 𝑖 𝑗 𝑤 others \\mathrm{m}_{ij}=\\begin{cases}0,&i-j\\leq w.\\\\\n-\\infty,&\\mathrm{others}.\\end{cases} (8)\n\nBy comparing Eq. 8 and the corresponding RPE of Alibi (Press, Smith, and Lewis 2022) in Figure 2, we can see that they both have the same behavior in that they both concentrate tokens inside a specified range. Also, in Figure 1, we show that the performance of Alibi is similar to the sliding window attention when the window size is sufficiently large. Based on these two observations, we make the following hypothesis:\n\nHypothesis 0.1. A RPE that makes a transformer extrapolatable needs to have similar behavior to sliding window attention, i.e., should satisfy:\n\n∀ ϵ > 0 , ∃ j 0 , s . t , j > j 0 , δ ​ ( i , j ) < ϵ , formulae-sequence for-all italic-ϵ 0 subscript 𝑗 0 𝑠 𝑡 𝑗 subscript 𝑗 0 𝛿 𝑖 𝑗 italic-ϵ \\forall\\epsilon>0,\\exists j_{0},s.t,j>j_{0},\\delta(i,j)<\\epsilon, (9)\n\nwhere , and the window length needs to be sufficiently large. In the following sections, we will derive the conditions for RPEs that satisfy Eq. 9. The conditions\n\nLet us introduce the first lemma:\n\nLemma 0.2. When the following condition is satisfied, Eq. 9 holds. lim i → ∞ C i ​ i ≜ C < ∞ . ≜ subscript → 𝑖 subscript 𝐶 𝑖 𝑖 𝐶 {\\lim}_{i\\to\\infty}C_{ii}\\triangleq C<\\infty. (10)\n\nProof. When , the test sequence length is smaller than the max sequence length during training, take , we get When , we can reformulate Eq. 7 as:\n\n𝐨 i i superscript subscript 𝐨 𝑖 𝑖 \\displaystyle\\mathbf{o}_{i}^{i} = ∑ i − j + 1 ≤ s ≤ i c i ​ s ​ 𝐯 s + ∑ 1 ≤ s ≤ i − j c i ​ s ​ 𝐯 s C i ​ i absent subscript 𝑖 𝑗 1 𝑠 𝑖 subscript 𝑐 𝑖 𝑠 subscript 𝐯 𝑠 subscript 1 𝑠 𝑖 𝑗 subscript 𝑐 𝑖 𝑠 subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑖 \\displaystyle=\\frac{\\sum_{i-j+1\\leq s\\leq i}c_{is}\\mathbf{v}_{s}+\\sum_{1\\leq s\\leq i-j}c_{is}\\mathbf{v}_{s}}{C_{ii}} = ∑ i − j + 1 ≤ s ≤ i c i ​ s ​ 𝐯 s C i ​ j ​ C i ​ j C i ​ i + ∑ 1 ≤ s ≤ i − j c i ​ s ​ 𝐯 s C i ​ i − C i ​ j ​ C i ​ i − C i ​ j C i ​ i absent subscript 𝑖 𝑗 1 𝑠 𝑖 subscript 𝑐 𝑖 𝑠 subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 subscript 1 𝑠 𝑖 𝑗 subscript 𝑐 𝑖 𝑠 subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑖 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 \\displaystyle=\\frac{\\sum_{i-j+1\\leq s\\leq i}c_{is}\\mathbf{v}_{s}}{C_{ij}}\\frac{{C_{ij}}}{{C_{ii}}}+\\frac{\\sum_{1\\leq s\\leq i-j}c_{is}\\mathbf{v}_{s}}{C_{ii}-C_{ij}}\\frac{C_{ii}-C_{ij}}{C_{ii}} = ∑ i − j + 1 ≤ s ≤ i c i ​ s ​ 𝐯 s C i ​ j ​ C i ​ j C i ​ i + ∑ 1 ≤ s ≤ i − j c i ​ s ​ 𝐯 s C i ​ i − C i ​ j ​ ( 1 − C i ​ j C i ​ i ) . absent subscript 𝑖 𝑗 1 𝑠 𝑖 subscript 𝑐 𝑖 𝑠 subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 subscript 1 𝑠 𝑖 𝑗 subscript 𝑐 𝑖 𝑠 subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑖 subscript 𝐶 𝑖 𝑗 1 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 \\displaystyle=\\frac{\\sum_{i-j+1\\leq s\\leq i}c_{is}\\mathbf{v}_{s}}{C_{ij}}\\frac{{C_{ij}}}{{C_{ii}}}+\\frac{\\sum_{1\\leq s\\leq i-j}c_{is}\\mathbf{v}_{s}}{C_{ii}-C_{ij}}\\left(1-\\frac{{C_{ij}}}{{C_{ii}}}\\right). Therefore we have:\n\n𝐨 i i − 𝐨 i j superscript subscript 𝐨 𝑖 𝑖 superscript subscript 𝐨 𝑖 𝑗 \\displaystyle\\mathbf{o}_{i}^{i}-\\mathbf{o}_{i}^{j} = ( 1 − C i ​ j C i ​ i ) ​ ( ∑ i − j + 1 ≤ s ≤ i c i ​ s ​ 𝐯 s C i ​ j − ∑ 1 ≤ s ≤ i − j c i ​ s ​ 𝐯 s C i ​ i − C i ​ j ) . absent 1 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 subscript 𝑖 𝑗 1 𝑠 𝑖 subscript 𝑐 𝑖 𝑠 subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑗 subscript 1 𝑠 𝑖 𝑗 subscript 𝑐 𝑖 𝑠 subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑖 subscript 𝐶 𝑖 𝑗 \\displaystyle=\\left(1-\\frac{{C_{ij}}}{{C_{ii}}}\\right)\\left(\\frac{\\sum_{i-j+1\\leq s\\leq i}c_{is}\\mathbf{v}_{s}}{C_{ij}}-\\frac{\\sum_{1\\leq s\\leq i-j}c_{is}\\mathbf{v}_{s}}{C_{ii}-C_{ij}}\\right). (11)\n\nFor the second part:\n\n‖ ∑ i − j + 1 ≤ s ≤ i c i ​ s ​ 𝐯 s C i ​ j − ∑ 1 ≤ s ≤ i − j c i ​ s ​ 𝐯 s C i ​ i − C i ​ j ‖ norm subscript 𝑖 𝑗 1 𝑠 𝑖 subscript 𝑐 𝑖 𝑠 subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑗 subscript 1 𝑠 𝑖 𝑗 subscript 𝑐 𝑖 𝑠 subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑖 subscript 𝐶 𝑖 𝑗 \\displaystyle\\left\\|\\frac{\\sum_{i-j+1\\leq s\\leq i}c_{is}\\mathbf{v}_{s}}{C_{ij}}-\\frac{\\sum_{1\\leq s\\leq i-j}c_{is}\\mathbf{v}_{s}}{C_{ii}-C_{ij}}\\right\\| (12) ≤ ∑ i − j + 1 ≤ s ≤ i c i ​ s ​ ‖ 𝐯 s ‖ C i ​ j + ∑ 1 ≤ s ≤ i − j c i ​ s ​ ‖ 𝐯 s ‖ C i ​ i − C i ​ j absent subscript 𝑖 𝑗 1 𝑠 𝑖 subscript 𝑐 𝑖 𝑠 norm subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑗 subscript 1 𝑠 𝑖 𝑗 subscript 𝑐 𝑖 𝑠 norm subscript 𝐯 𝑠 subscript 𝐶 𝑖 𝑖 subscript 𝐶 𝑖 𝑗 \\displaystyle\\leq\\frac{\\sum_{i-j+1\\leq s\\leq i}c_{is}\\|\\mathbf{v}_{s}\\|}{C_{ij}}+\\frac{\\sum_{1\\leq s\\leq i-j}c_{is}\\|\\mathbf{v}_{s}\\|}{C_{ii}-C_{ij}} ≤ ∑ i − j + 1 ≤ s ≤ i c i ​ s ​ l C i ​ j + ∑ 1 ≤ s ≤ i − j c i ​ s ​ l C i ​ i − C i ​ j = 2 ​ l absent subscript 𝑖 𝑗 1 𝑠 𝑖 subscript 𝑐 𝑖 𝑠 𝑙 subscript 𝐶 𝑖 𝑗 subscript 1 𝑠 𝑖 𝑗 subscript 𝑐 𝑖 𝑠 𝑙 subscript 𝐶 𝑖 𝑖 subscript 𝐶 𝑖 𝑗 2 𝑙 \\displaystyle\\leq\\frac{\\sum_{i-j+1\\leq s\\leq i}c_{is}l}{C_{ij}}+\\frac{\\sum_{1\\leq s\\leq i-j}c_{is}l}{C_{ii}-C_{ij}}=2l\n\nWe have\n\nδ ​ ( i , j ) ≤ 2 ​ ( 1 − C i ​ j C i ​ i ) ​ l . 𝛿 𝑖 𝑗 2 1 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 𝑙 \\delta(i,j)\\leq 2\\left(1-\\frac{{C_{ij}}}{{C_{ii}}}\\right)l. (13)\n\nAccording to Eq 10 and the tail of convergence series is arbitrarily small.",
    "transextra-7": ", we can find a , s.t. if , . We can also find a , s.t. if , . If we take , so if , we have:\n\nC i ​ i − C i ​ j < ϵ , C − ϵ < C i ​ i < C + ϵ formulae-sequence subscript 𝐶 𝑖 𝑖 subscript 𝐶 𝑖 𝑗 italic-ϵ 𝐶 italic-ϵ subscript 𝐶 𝑖 𝑖 𝐶 italic-ϵ C_{ii}-C_{ij}<\\epsilon,C-\\epsilon<C_{ii}<C+\\epsilon (14)\n\nSo when , we have\n\nδ ​ ( i , j ) ≤ 2 ​ ( 1 − C i ​ j C i ​ i ) ​ l 𝛿 𝑖 𝑗 2 1 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 𝑙 \\displaystyle\\delta(i,j)\\leq 2\\left(1-\\frac{{C_{ij}}}{{C_{ii}}}\\right)l = 2 ​ C i ​ i − C i ​ j C i ​ i ​ l ≤ 2 ​ ϵ C − ϵ ​ l absent 2 subscript 𝐶 𝑖 𝑖 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 𝑙 2 italic-ϵ 𝐶 italic-ϵ 𝑙 \\displaystyle=2\\frac{C_{ii}-C_{ij}}{C_{ii}}l\\leq 2\\frac{\\epsilon}{C-\\epsilon}l (15) ≤ 2 ​ l ​ ϵ C − C / 2 = 4 ​ l ​ ϵ C absent 2 𝑙 italic-ϵ 𝐶 𝐶 2 4 𝑙 italic-ϵ 𝐶 \\displaystyle\\leq\\frac{2l\\epsilon}{C-C/2}=\\frac{4l\\epsilon}{C}\n\nAccording to the definition of limitation, Eq. 10 holds. ∎\n\nThis lemma implies that for any token if the attention of the model focuses on its neighboring tokens, the model has length extrapolation property. The lemma accompanies our intuitions. Does it mean that as long as a RPE follows the same principle, i.e., places more weights on neighboring tokens, the model is guaranteed to have the length extrapolation property? In the following sections, we will demonstrate that concentrating more weights on neighboring tokens does not guarantee the transformer has the length extrapolation property. Specifically, we will provide a mathematical proof of the sufficient conditions for RPE to have the length extrapolation property.",
    "transextra-8": "Theorem 0.3. When the following condition is satisfied, Eq. 9 holds. lim i → ∞ B i ​ i < ∞ , B i ​ i = ∑ 1 ≤ t ≤ i b i ​ t < ∞ . formulae-sequence subscript → 𝑖 subscript 𝐵 𝑖 𝑖 subscript 𝐵 𝑖 𝑖 subscript 1 𝑡 𝑖 subscript 𝑏 𝑖 𝑡 {\\lim}_{i\\to\\infty}B_{ii}<\\infty,B_{ii}=\\sum_{1\\leq t\\leq i}b_{it}<\\infty. (16)\n\nProof. Since we assume , then:\n\na i ​ j = exp ⁡ ( 𝐪 i ⊤ ​ 𝐤 j ) ≤ exp ⁡ ( l 2 ) , subscript 𝑎 𝑖 𝑗 superscript subscript 𝐪 𝑖 top subscript 𝐤 𝑗 superscript 𝑙 2 \\displaystyle a_{ij}=\\exp(\\mathbf{q}_{i}^{\\top}\\mathbf{k}_{j})\\leq\\exp(l^{2}), (17)\n\nc i ​ j = a i ​ j ​ b i ​ j ≤ exp ⁡ ( l 2 ) ​ b i ​ j , C i ​ i ≤ exp ⁡ ( l 2 ) ​ B i ​ i . formulae-sequence subscript 𝑐 𝑖 𝑗 subscript 𝑎 𝑖 𝑗 subscript 𝑏 𝑖 𝑗 superscript 𝑙 2 subscript 𝑏 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 superscript 𝑙 2 subscript 𝐵 𝑖 𝑖 \\displaystyle c_{ij}=a_{ij}b_{ij}\\leq\\exp(l^{2})b_{ij},C_{ii}\\leq\\exp(l^{2})B_{ii}.",
    "transextra-9": "(18)\n\nTherefore, Eq. 10 can be derived from Eq. 16. Combine with Lemma 0.2, the proof is concluded. ∎\n\nBy leveraging the property of RPE, Theorem 0.3 can be further simplified as:\n\nTheorem 0.4.",
    "transextra-10": "When the following condition is satisfied, Eq. 9 holds. lim i → ∞ ∑ t = 1 i b i − t = lim i → ∞ ∑ t = 0 i − 1 b t < ∞ . subscript → 𝑖 superscript subscript 𝑡 1 𝑖 subscript 𝑏 𝑖 𝑡 subscript → 𝑖 superscript subscript 𝑡 0 𝑖 1 subscript 𝑏 𝑡 \\lim_{i\\to\\infty}\\sum_{t=1}^{i}b_{i-t}=\\lim_{i\\to\\infty}\\sum_{t=0}^{i-1}b_{t}<\\infty. (19)\n\nProof. According to the definition of RPE:\n\nB i ​ i = ∑ 1 ≤ t ≤ i b i ​ t = ∑ t = 1 i b i − t = ∑ t = 0 i − 1 b t . subscript 𝐵 𝑖 𝑖 subscript 1 𝑡 𝑖 subscript 𝑏 𝑖 𝑡 superscript subscript 𝑡 1 𝑖 subscript 𝑏 𝑖 𝑡 superscript subscript 𝑡 0 𝑖 1 subscript 𝑏 𝑡 B_{ii}=\\sum_{1\\leq t\\leq i}b_{it}=\\sum_{t=1}^{i}b_{i-t}=\\sum_{t=0}^{i-1}b_{t}. (20)\n\nThis means that Eq. 16 is equivalent to:\n\nlim i → ∞ B i ​ i = lim i → ∞ ∑ t = 0 i − 1 b t < ∞ . ∎ subscript → 𝑖 subscript 𝐵 𝑖 𝑖 subscript → 𝑖 superscript subscript 𝑡 0 𝑖 1 subscript 𝑏 𝑡 {\\lim_{i\\to\\infty}}B_{ii}={\\lim_{i\\to\\infty}}\\sum_{t=0}^{i-1}b_{t}<\\infty.\\qed (21)\n\nTheorem 0.4 indicates that as long as the series of converges, the model is guaranteed to have length extrapolation property. Based on this principle, we can mathematically determine whether an RPE allows for length extrapolation before conducting experiments or designing a variety of RPEs that can do length extrapolation. In Appendix, we show that previous methods such as Alibi (Press, Smith, and Lewis 2022), Kerple (Chi et al. 2022), and Sandwich (Chi, Fan, and Rudnicky 2022) satisfy our derived conditions for length extrapolation. Theoretical receptive field\n\nIn the previous section, we established the conditions for length extrapolation. As an extra bonus, we can derive Theoretical Receptive Fields (TRF) for any RPE-based length extrapolation method. Let us start with the definition of Empirical Receptive Field (ERF). ERF can be viewed as a window containing the vast majority of the information contained within the attention. Recall Eq. 13, by setting , we can define:\n\nC i ​ j = C i ​ i ​ ( 1 − ϵ ) , n emp ​ ( ϵ ) = inf j ( C i ​ j > C i ​ i ​ ( 1 − ϵ ) ) , formulae-sequence subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 1 italic-ϵ subscript 𝑛 emp italic-ϵ subscript infimum 𝑗 subscript 𝐶 𝑖 𝑗 subscript 𝐶 𝑖 𝑖 1 italic-ϵ C_{ij}=C_{ii}(1-\\epsilon),\\ n_{\\text{emp}}(\\epsilon)=\\inf_{j}(C_{ij}>C_{ii}(1-\\epsilon)),\n\nis the ERF that represents the minimal sequence length required to maintain the performance within a gap of . Intuitively, ERF can be viewed as the smallest window that contains the majority of the information within an attention. Since it is related to both and , it can only be calculated after training. Now we define TRF, which allows us to estimate the receptive field without training. To accomplish this, we consider the upper bound of .",
    "transextra-11": "From the definition of and Eq. 17, is upper bounded by . Therefore, we can define the TRF respect to series as:\n\nn the ​ ( ϵ ) subscript 𝑛 the italic-ϵ \\displaystyle n_{\\mathrm{the}}(\\epsilon) = inf j ( B i ​ j > B ​ ( 1 − ϵ ) ) absent subscript infimum 𝑗 subscript 𝐵 𝑖 𝑗 𝐵 1 italic-ϵ \\displaystyle=\\inf_{j}(B_{ij}>B(1-\\epsilon)) (22) = inf j ( ∑ t = 0 j − 1 b t > B ​ ( 1 − ϵ ) ) absent subscript infimum 𝑗 superscript subscript 𝑡 0 𝑗 1 subscript 𝑏 𝑡 𝐵 1 italic-ϵ \\displaystyle=\\inf_{j}\\left(\\sum_{t=0}^{j-1}b_{t}>B(1-\\epsilon)\\right) = inf j ( ∑ t ≥ j b t < B ​ ϵ ) absent subscript infimum 𝑗 subscript 𝑡 𝑗 subscript 𝑏 𝑡 𝐵 italic-ϵ \\displaystyle=\\inf_{j}\\left(\\sum_{t\\geq j}b_{t}<B\\epsilon\\right)\n\nwhere . We may find it difficult to give the analytical form of the partial sum of the series at times, but we can still compute the TRF numerically or compare the TRFs of different RPEs using the theorem below:\n\nTheorem 0.5.",
    "transextra-12": "If the following conditions hold:\n\nα t α subscript 𝛼 𝑡 𝛼 \\displaystyle\\frac{\\alpha_{t}}{\\alpha} ≤ β t β , t → ∞ , α ≜ lim j → ∞ ∑ t = 0 j − 1 α t , β ≜ lim j → ∞ ∑ t = 0 j − 1 β t . formulae-sequence absent subscript 𝛽 𝑡 𝛽 formulae-sequence → 𝑡 formulae-sequence ≜ 𝛼 subscript → 𝑗 superscript subscript 𝑡 0 𝑗 1 subscript 𝛼 𝑡 ≜ 𝛽 subscript → 𝑗 superscript subscript 𝑡 0 𝑗 1 subscript 𝛽 𝑡 \\displaystyle\\leq\\frac{\\beta_{t}}{\\beta},t\\to\\infty,\\ \\alpha\\triangleq\\lim_{j\\to\\infty}\\sum_{t=0}^{j-1}\\alpha_{t},\\ \\beta\\triangleq\\lim_{j\\to\\infty}\\sum_{t=0}^{j-1}\\beta_{t}. (23)\n\nThen:\n\nn the α ​ ( ϵ ) ≤ n the β ​ ( ϵ ) , ϵ → 0 . formulae-sequence superscript subscript 𝑛 the 𝛼 italic-ϵ superscript subscript 𝑛 the 𝛽 italic-ϵ → italic-ϵ 0 n_{\\mathrm{the}}^{\\alpha}(\\epsilon)\\leq n_{\\mathrm{the}}^{\\beta}(\\epsilon),\\epsilon\\to 0. (24)\n\nProof. According to Eq.23, there exists , such that, when , we have:\n\nα t α ≤ β t β . subscript 𝛼 𝑡 𝛼 subscript 𝛽 𝑡 𝛽 \\frac{\\alpha_{t}}{\\alpha}\\leq\\frac{\\beta_{t}}{\\beta}. (25)\n\nLet , where\n\nn the β ​ ( ϵ 0 ) = t 0 , superscript subscript 𝑛 the 𝛽 subscript italic-ϵ 0 subscript 𝑡 0 n_{\\mathrm{the}}^{\\beta}(\\epsilon_{0})=t_{0}, (26)\n\nthen we get:\n\n∑ t ≥ n the β ​ ( ϵ ) β t ≤ β ​ ϵ , n the β ​ ( ϵ ) > t 0 . formulae-sequence subscript 𝑡 superscript subscript 𝑛 the 𝛽 italic-ϵ subscript 𝛽 𝑡 𝛽 italic-ϵ superscript subscript 𝑛 the 𝛽 italic-ϵ subscript 𝑡 0 \\sum_{t\\geq n_{\\mathrm{the}}^{\\beta}(\\epsilon)}\\beta_{t}\\leq\\beta\\epsilon,n_{\\mathrm{the}}^{\\beta}(\\epsilon)>t_{0}. (27)\n\nFinally:\n\n∑ t ≥ n the β ​ ( ϵ ) α t ≤ ∑ t ≥ n the β ​ ( ϵ ) α ​ β t β ≤ α ​ β ​ ϵ β = α ​ ϵ . subscript 𝑡 superscript subscript 𝑛 the 𝛽 italic-ϵ subscript 𝛼 𝑡 subscript 𝑡 superscript subscript 𝑛 the 𝛽 italic-ϵ 𝛼 subscript 𝛽 𝑡 𝛽 𝛼 𝛽 italic-ϵ 𝛽 𝛼 italic-ϵ \\displaystyle\\sum_{t\\geq n_{\\mathrm{the}}^{\\beta}(\\epsilon)}\\alpha_{t}\\leq\\sum_{t\\geq n_{\\mathrm{the}}^{\\beta}(\\epsilon)}\\frac{\\alpha\\beta_{t}}{\\beta}\\leq\\frac{\\alpha\\beta\\epsilon}{\\beta}=\\alpha\\epsilon. According to Eq. 22, we have:\n\nn the a ​ ( ϵ ) ≤ n the b ​ ( ϵ ) . superscript subscript 𝑛 the 𝑎 italic-ϵ superscript subscript 𝑛 the 𝑏 italic-ϵ n_{\\mathrm{the}}^{a}(\\epsilon)\\leq n_{\\mathrm{the}}^{b}(\\epsilon). (28)\n\nThe series follows the same trend as TRF, the smaller the series, the smaller the TRF. ∎\n\nWe provide several examples of how to compute TRF in the Appendix. Two new RPEs\n\nBased on the proven conditions of length extrapolation, we can design infinite kinds of RPEs with the length extrapolation property. Here, we propose two new RPEs to empirically prove the conditions and hypothesis, namely:\n\nType1 : b n : Type1 subscript 𝑏 𝑛 \\displaystyle\\mathrm{Type1}:b_{n} = 1 n 2 = exp ⁡ ( − 2 ​ ln ⁡ n ) , absent 1 superscript 𝑛 2 2 𝑛 \\displaystyle=\\frac{1}{n^{2}}=\\exp(-2\\ln n), Type2 : b n : Type2 subscript 𝑏 𝑛 \\displaystyle\\mathrm{Type2}:b_{n} = exp ⁡ ( − ln 2 ⁡ n ) ; absent superscript 2 𝑛 \\displaystyle=\\exp(-\\ln^{2}n);\n\nThe corresponding TRF of Type 1 is:\n\nB i ​ j subscript 𝐵 𝑖 𝑗 \\displaystyle B_{ij} = ∑ i = 0 j − 1 1 ( i + 1 ) 2 ≈ ∫ 1 j 1 x 2 ​ 𝑑 x = 1 − 1 j , B = 1 . formulae-sequence absent superscript subscript 𝑖 0 𝑗 1 1 superscript 𝑖 1 2 superscript subscript 1 𝑗 1 superscript 𝑥 2 differential-d 𝑥 1 1 𝑗 𝐵 1 \\displaystyle=\\sum_{i=0}^{j-1}\\frac{1}{(i+1)^{2}}\\approx\\int_{1}^{j}\\frac{1}{x^{2}}dx=1-\\frac{1}{j},B=1. (29) n the ​ ( ϵ ) subscript 𝑛 the italic-ϵ \\displaystyle n_{\\mathrm{the}}(\\epsilon) = inf j ( B i ​ j > B ​ ( 1 − ϵ ) ) absent subscript infimum 𝑗 subscript 𝐵 𝑖 𝑗 𝐵 1 italic-ϵ \\displaystyle=\\inf_{j}\\left(B_{ij}>B(1-\\epsilon)\\right) = inf j ( 1 − 1 j > 1 − ϵ ) = Θ ​ ( 1 ϵ ) absent subscript infimum 𝑗 1 1 𝑗 1 italic-ϵ Θ 1 italic-ϵ \\displaystyle=\\inf_{j}\\left(1-\\frac{1}{j}>1-\\epsilon\\right)=\\Theta\\left(\\frac{1}{\\epsilon}\\right)\n\nFor Type 2, it is difficult to provide the analytical form of its TRF. However, we can prove that the TRF of Type 2 is smaller than the TRF of Type 1 using Theorem 0.5 and the inequality below:\n\n∀ c 1 , c 2 > 0 , exp ⁡ ( − ln 2 ⁡ n ) c 1 < 1 / n 2 c 2 , n → ∞ .",
    "transextra-13": "formulae-sequence for-all subscript 𝑐 1 subscript 𝑐 2 0 formulae-sequence superscript 2 𝑛 subscript 𝑐 1 1 superscript 𝑛 2 subscript 𝑐 2 → 𝑛 \\forall c_{1},c_{2}>0,\\frac{\\exp(-\\ln^{2}n)}{c_{1}}<\\frac{1/n^{2}}{c_{2}},n\\to\\infty. Empirical Validation\n\nSetting\n\nAll models are implemented in Fairseq (Ott et al. 2019) and trained on 8 V100 GPUs. We use the same model architecture and training configuration for all RPE variants to ensure fairness. For Wikitext-103 (Merity et al. 2016), since it is a relatively small dataset, we use a 6-layer transformer decoder structure with an embedding size of 512. For other datasets, in particular, we used a 12-layer transformer decoder structure with an embedding size of 768. The evaluation metric is perplexity (PPL) and the max training length during training is 512. The detailed hyper-parameter settings are listed in Appendix. Dataset\n\nWe conduct experiments on Wikitext-103 (Merity et al. 2016), Books (Zhu et al. 2015), Github (Gao et al. 2020) and WikiBook (Wettig et al. 2022). Wikitext-103 is a small dataset containing a preprocessed version of the Wikipedia dataset. It is widely used in many NLP papers. Books has a large number of novels, making it a good corpus for long sequence processing. Github consists of a sizable amount of open-source repositories, the majority of which are written in coding languages. WikiBook is a 22-gigabyte corpus of Wikipedia articles and books curated by (Wettig et al. 2022). This corpus is used to validate the performance of various models on large datasets. Validating the sufficiency. To empirically validate the sufficiency of our discovered conditions, we integrate the two RPEs that were proposed in the previous section into transformers and test their length extrapolation capability on Wikitext-103, Books, Github, and WikiBook datasets. We increase the length of the inference sequence from 512 to 9216 tokens and plot the testing PPLs of our proposed RPEs as well as those of existing methods such as Alibi, Kerple, and Sandwich in Figure 3. Detailed numerical results can be found in Table 4 and Table 5 from Appendix. All these methods demonstrate good length extrapolation capability. However, the stabilized PPL may vary due to the effectiveness of different positional encoding strategies, which are not considered in this paper. We include the Sinusoidal (Vaswani et al. 2017) positional encoding as a reference method that cannot extrapolate, which grows rapidly as the inference sequence length increases. Validating the necessity. Although we only provide mathematical proof for the sufficiency of our discovered conditions, we also attempt to verify their necessity empirically in this section. Specifically, we pick two RPEs that are very close to satisfying Theorem 0.4 as follows. Note that both of them concentrate their weight on neighboring tokens. Example1 : b n = 1 n , Example2 : b n = 1 n ​ ln ⁡ n : Example1 subscript 𝑏 𝑛 1 𝑛 Example2 : subscript 𝑏 𝑛 1 𝑛 𝑛 \\mathrm{Example1}:b_{n}=\\frac{1}{n},\\ \\mathrm{Example2}:b_{n}=\\frac{1}{n\\ln n}\n\nBelow is a brief mathematical proof that the above RPEs do not satisfy Theorem 0.4.",
    "transextra-14": "∑ n = 1 k 1 n superscript subscript 𝑛 1 𝑘 1 𝑛 \\displaystyle\\sum_{n=1}^{k}\\frac{1}{n} > ∫ 1 k + 1 1 x ​ 𝑑 x = ln ⁡ ( k + 1 ) , absent superscript subscript 1 𝑘 1 1 𝑥 differential-d 𝑥 𝑘 1 \\displaystyle>\\int_{1}^{k+1}\\frac{1}{x}dx=\\ln(k+1), ∑ n = 3 k 1 n ​ ln ⁡ n superscript subscript 𝑛 3 𝑘 1 𝑛 𝑛 \\displaystyle\\sum_{n=3}^{k}\\frac{1}{n\\ln n} > ∫ 3 k + 1 1 x ​ ln ⁡ x ​ 𝑑 x = ln ⁡ ln ⁡ ( k + 1 ) − ln ⁡ ln ⁡ 3 . absent superscript subscript 3 𝑘 1 1 𝑥 𝑥 differential-d 𝑥 𝑘 1 3 \\displaystyle>\\int_{3}^{k+1}\\frac{1}{x\\ln x}dx=\\ln\\ln(k+1)-\\ln\\ln 3. We then empirically test their length extrapolation capability on Wikitext-103, Books, Github, and WikiBook datasets by\n\nscaling the inference sequence length from 512 to 9216 tokens. As shown in Figure 4, the PPLs of both RPEs grow rapidly as the length of the testing sequence increases. It de-\n\nmonstrates that both of them cannot extrapolate. We also include Type 1 RPE in Figure 4 as a reference that can extrapolate. Detailed numerical results can be found in Table 6\n\nfrom Appendix. Validating TRF\n\nWe validate our proposed TRF by comparing the trend between the TRF and ERF. We plot the TRFs and ERFs of the Alibi, Kerple, Sandwich, and our proposed RPEs on the aforementioned datasets. As observed in Figure 6 and Figure 5, while the curves vary across datasets, TRF estimates a similar overall trend of ERFs. Visualizing RPE\n\nWe visualize the weighting schemes of Type 1 and Type 2 in Figure 7, i.e., the heatmap of . Type 2 concentrates weights on closer neighboring tokens than Type 1, indicating a smaller TRF and ERF as shown in Figure 6 and Figure 5. We also visualize other methods in Appendix. Conclusion\n\nIn this paper, we explore the secrets of transformer length extrapolation in language modeling. We first make a hypothesis about extrapolation and then derived the sufficient conditions for RPE to have the length extrapolation property. A thorough mathematical analysis reveals that a transformer model is certain to be capable of length extrapolation if the series that corresponds to the exponential of its RPE converges. This observation brings an extra bonus: we can estimate TRFs of RPEs solely based on their formulations. We chose two new RPEs that satisfy the conditions and two that do not to empirically prove the sufficiency of the conditions on four widely used datasets. We also validated our TRFs by comparing them with ERFs on these datasets as well. The results show that our TRFs can accurately reflect the actual receptive fields of RPEs before training. Acknowledgement\n\nThis work is partially supported by the National Key R&D Program of China (NO.2022ZD0160100). References\n\nAkbari et al. (2021) Akbari, H.; Yuan, L.; Qian, R.; Chuang, W.-H.; Chang, S.-F.; Cui, Y.; and Gong, B. 2021. Vatt: Transformers for multimodal self-supervised learning from raw video, audio and text. In arXiv preprint arXiv:2104.11178. Beltagy, Peters, and Cohan (2020) Beltagy, I.; Peters, M. E.; and Cohan, A. 2020. Longformer: The Long-Document Transformer.",
    "transextra-15": "In arXiv:2004.05150. Chi et al. (2022) Chi, T.-C.; Fan, T.-H.; Ramadge, P. J.; and Rudnicky, A.",
    "transextra-16": "I. 2022. KERPLE: Kernelized Relative Positional Embedding for Length Extrapolation.",
    "transextra-17": "ArXiv, abs/2205.09921. Chi, Fan, and Rudnicky (2022) Chi, T.-C.; Fan, T.-H.; and Rudnicky, A. I. 2022. Receptive Field Alignment Enables Transformer Length Extrapolation.",
    "transextra-18": "ArXiv, abs/2212.10356. Cho et al. (2014) Cho, K.; van Merriënboer, B.; Gulcehre, C.; Bahdanau, D.; Bougares, F.; Schwenk, H.; and Bengio, Y. 2014. Learning Phrase Representations using RNN Encoder–Decoder for Statistical Machine Translation. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP), 1724–1734. Doha, Qatar: Association for Computational Linguistics. Devlin et al. (2019) Devlin, J.; Chang, M.-W.; Lee, K.; and Toutanova, K. 2019. BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers), 4171–4186. Minneapolis, Minnesota: Association for Computational Linguistics. Dosovitskiy et al. (2020) Dosovitskiy, A.; Beyer, L.; Kolesnikov, A.; Weissenborn, D.; Zhai, X.; Unterthiner, T.; Dehghani, M.; Minderer, M.; Heigold, G.; Gelly, S.; et al. 2020. An image is worth 16x16 words: Transformers for image recognition at scale.",
    "transextra-19": "arXiv preprint arXiv:2010.11929. Gao et al. (2020) Gao, L.; Biderman, S.; Black, S.; Golding, L.; Hoppe, T.; Foster, C.; Phang, J.; He, H.; Thite, A.; Nabeshima, N.; Presser, S.; and Leahy, C. 2020. The Pile: An 800GB Dataset of Diverse Text for Language Modeling. In arXiv preprint arXiv:2101.00027. Gehring et al. (2017) Gehring, J.; Auli, M.; Grangier, D.; Yarats, D.; and Dauphin, Y. N. 2017. Convolutional sequence to sequence learning.",
    "transextra-20": "In International Conference on Machine Learning, 1243–1252. PMLR. Gong, Chung, and Glass (2021) Gong, Y.; Chung, Y.-A.; and Glass, J. 2021. AST: Audio Spectrogram Transformer. In Proc. Interspeech 2021, 571–575. Gulati et al. (2020) Gulati, A.; Chiu, C.-C.; Qin, J.; Yu, J.; Parmar, N.; Pang, R.; Wang, S.; Han, W.; Wu, Y.; Zhang, Y.; and Zhang, Z., eds. 2020. Conformer: Convolution-augmented Transformer for Speech Recognition. Hao et al. (2024) Hao, D.; Mao, Y.; He, B.; Han, X.; Dai, Y.; and Zhong, Y. 2024. Improving Audio-Visual Segmentation with Bidirectional Generation. In Proceedings of the AAAI Conference on Artificial Intelligence. Hershey et al. (2016) Hershey, S.; Chaudhuri, S.; Ellis, D. P. W.; Gemmeke, J. F.; Jansen, A.; Moore, R. C.; Plakal, M.; Platt, D.; Saurous, R. A.; Seybold, B.; Slaney, M.; Weiss, R. J.; and Wilson, K.",
    "transextra-21": "W. 2016. CNN architectures for large-scale audio classification. 2017 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), 131–135. Hochreiter and Schmidhuber (1997) Hochreiter, S.; and Schmidhuber, J. 1997. Long short-term memory. Neural computation, 9(8): 1735–1780. Kim (2014) Kim, Y. 2014. Convolutional Neural Networks for Sentence Classification. In Conference on Empirical Methods in Natural Language Processing. Knopp (1956) Knopp, K. 1956. Infinite sequences and series. Courier Corporation. Liu et al. (2019) Liu, Y.; Ott, M.; Goyal, N.; Du, J.; Joshi, M.; Chen, D.; Levy, O.; Lewis, M.; Zettlemoyer, L.; and Stoyanov, V. 2019. Roberta: A robustly optimized bert pretraining approach. arXiv preprint arXiv:1907.11692. Liu et al. (2022) Liu, Z.; Li, D.; Lu, K.; Qin, Z.; Sun, W.; Xu, J.; and Zhong, Y. 2022. Neural architecture search on efficient transformers and beyond. arXiv preprint arXiv:2207.13955. Liutkus et al. (2021) Liutkus, A.; Cífka, O.; Wu, S.-L.; Simsekli, U.; Yang, Y.-H.; and Richard, G. 2021. Relative positional encoding for transformers with linear complexity.",
    "transextra-22": "In International Conference on Machine Learning, 7067–7079. PMLR. Lu et al. (2022) Lu, K.; Liu, Z.; Wang, J.; Sun, W.; Qin, Z.; Li, D.; Shen, X.; Deng, H.; Han, X.; Dai, Y.; and Zhong, Y. 2022. Linear video transformer with feature fixation. arXiv preprint arXiv:2210.08164. Merity et al. (2016) Merity, S.; Xiong, C.; Bradbury, J.; and Socher, R. 2016. Pointer Sentinel Mixture Models. In arXiv:1609.07843. Ott et al. (2019) Ott, M.; Edunov, S.; Baevski, A.; Fan, A.; Gross, S.; Ng, N.; Grangier, D.; and Auli, M. 2019. fairseq: A fast, extensible toolkit for sequence modeling. arXiv preprint arXiv:1904.01038. Press, Smith, and Lewis (2022) Press, O.; Smith, N.; and Lewis, M. 2022. Train Short, Test Long: Attention with Linear Biases Enables Input Length Extrapolation. In International Conference on Learning Representations. Qin et al. (2023a) Qin, Z.; Han, X.; Sun, W.; He, B.; Li, D.; Li, D.; Dai, Y.; Kong, L.; and Zhong, Y. 2023a. Toeplitz Neural Network for Sequence Modeling. In The Eleventh International Conference on Learning Representations. Qin et al. (2022a) Qin, Z.; Han, X.; Sun, W.; Li, D.; Kong, L.; Barnes, N.; and Zhong, Y. 2022a. The Devil in Linear Transformer. In Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing, 7025–7041. Abu Dhabi, United Arab Emirates: Association for Computational Linguistics. Qin et al. (2023b) Qin, Z.; Li, D.; Sun, W.; Sun, W.; Shen, X.; Han, X.; Wei, Y.; Lv, B.; Yuan, F.; Luo, X.; Qiao, Y.; and Zhong, Y. 2023b. Scaling TransNormer to 175 Billion Parameters. In arXiv preprint 2307.14995. Qin et al. (2022b) Qin, Z.; Sun, W.; Deng, H.; Li, D.; Wei, Y.; Lv, B.; Yan, J.; Kong, L.; and Zhong, Y. 2022b. cosFormer: Rethinking Softmax In Attention. In International Conference on Learning Representations. Qin et al. (2023c) Qin, Z.; Sun, W.; Lu, K.; Deng, H.; Li, D.; Han, X.; Dai, Y.; Kong, L.; and Zhong, Y. 2023c. Linearized Relative Positional Encoding. arXiv preprint arXiv:2307.09270. Qin, Yang, and Zhong (2023) Qin, Z.; Yang, S.; and Zhong, Y. 2023. Hierarchically gated recurrent neural network for sequence modeling. NeurIPS. Qin and Zhong (2023) Qin, Z.; and Zhong, Y. 2023. Accelerating Toeplitz Neural Network with Constant-time Inference Complexity. In Proceedings of the 2023 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics. Su et al. (2021) Su, J.; Lu, Y.; Pan, S.; Wen, B.; and Liu, Y. 2021. Roformer: Enhanced transformer with rotary position embedding.",
    "transextra-23": "arXiv preprint arXiv:2104.09864. Sun et al. (2022a) Sun, J.; Zhong, G.; Zhou, D.; Li, B.; and Zhong, Y. 2022a. Locality Matters: A Locality-Biased Linear Attention for Automatic Speech Recognition. arXiv preprint arXiv:2203.15609. Sun et al. (2022b) Sun, W.; Qin, Z.; Deng, H.; Wang, J.; Zhang, Y.; Zhang, K.; Barnes, N.; Birchfield, S.; Kong, L.; and Zhong, Y. 2022b. Vicinity Vision Transformer. IEEE Transactions on Pattern Analysis and Machine Intelligence, (01): 1–14. Vaswani et al. (2017) Vaswani, A.; Shazeer, N.; Parmar, N.; Uszkoreit, J.; Jones, L.; Gomez, A. N.; Kaiser, Ł.; and Polosukhin, I. 2017. Attention is all you need. Advances in neural information processing systems, 30. Wettig et al. (2022) Wettig, A.; Gao, T.; Zhong, Z.; and Chen, D. 2022. Should You Mask 15% in Masked Language Modeling?",
    "transextra-24": "In arXiv:2202.08005. Zhu et al. (2015) Zhu, Y.; Kiros, R.; Zemel, R.; Salakhutdinov, R.; Urtasun, R.; Torralba, A.; and Fidler, S. 2015. Aligning Books and Movies: Towards Story-Like Visual Explanations by Watching Movies and Reading Books. In The IEEE International Conference on Computer Vision (ICCV). Supplementary Material\n\nAppendix A Mathematical notations\n\nAppendix B Examples\n\nIn this section, we use Alibi (Press, Smith, and Lewis 2022), Kerple (Chi et al. 2022), and Sandwich (Chi, Fan, and Rudnicky 2022) as examples to support the discovered sufficient conditions 16 for length extrapolation. Alibi The form of Alibi can be written as:\n\nb t = exp ⁡ ( − k ​ t ) , k > 0 . formulae-sequence subscript 𝑏 𝑡 𝑘 𝑡 𝑘 0 b_{t}=\\exp(-kt),k>0. (30)\n\nAccording to the convergence of geometric series:\n\nlim i → ∞ B i ​ i = ∑ t = 0 i − 1 exp ⁡ ( − k ​ t ) < ∞ , subscript → 𝑖 subscript 𝐵 𝑖 𝑖 superscript subscript 𝑡 0 𝑖 1 𝑘 𝑡 \\lim_{i\\to\\infty}B_{ii}=\\sum_{t=0}^{i-1}\\exp(-kt)<\\infty, (31)\n\nwhich satisfies our observed conditions. Kerple Kerple proposes two forms of RPEs: log and power. We discuss them separately. The formulation of the Log variant can be expressed as:\n\nb t = exp ⁡ ( − r ​ log ⁡ ( 1 + k ​ t ) ) = 1 ( 1 + k ​ t ) r subscript 𝑏 𝑡 𝑟 1 𝑘 𝑡 1 superscript 1 𝑘 𝑡 𝑟 b_{t}=\\exp(-r\\log\\left(1+kt\\right))=\\frac{1}{(1+kt)^{r}} (32)\n\nwhere r,k¿0r, k ¿ 0. In Kerple, r,kr, k are learnable. Based on Theorem 0.4, to enable the model to extrapolate, we must add the restriction that r¿1r ¿ 1 because:\n\n1 ( 1 + k ​ t ) r ∼ 1 k r ​ t r , similar-to 1 superscript 1 𝑘 𝑡 𝑟 1 superscript 𝑘 𝑟 superscript 𝑡 𝑟 \\frac{1}{(1+kt)^{r}}\\sim\\frac{1}{k^{r}t^{r}}, (33)\n\nIn empirical analysis, we will show that when r=1r= 1, the model cannot extrapolate. We also checked the trained model from Kerple and found this condition is met. The Ploy variant can be written as:\n\nb t = exp ⁡ ( − k ​ t r ) , 0 < r ≤ 2 . formulae-sequence subscript 𝑏 𝑡 𝑘 superscript 𝑡 𝑟 0 𝑟 2 b_{t}=\\exp(-kt^{r}),0<r\\leq 2. (34)\n\nSince\n\nb t ≤ exp ⁡ ( − k ​ t ) , t → ∞ . formulae-sequence subscript 𝑏 𝑡 𝑘 𝑡 → 𝑡 b_{t}\\leq\\exp(-kt),t\\to\\infty. (35)\n\naccording to the convergence of geometric series, we have:\n\nlim i → ∞ B i ​ i = lim i → ∞ ∑ t = 0 i − 1 exp ⁡ ( − k ​ t r ) < ∞ . subscript → 𝑖 subscript 𝐵 𝑖 𝑖 subscript → 𝑖 superscript subscript 𝑡 0 𝑖 1 𝑘 superscript 𝑡 𝑟 \\lim_{i\\to\\infty}B_{ii}=\\lim_{i\\to\\infty}\\sum_{t=0}^{i-1}\\exp(-kt^{r})<\\infty. (36)\n\nwhich satisfies our observed conditions. Sandwich Given the formulation of Sandwich:\n\nb t = exp ⁡ ( k ​ ( ∑ j = 1 d / 2 cos ⁡ ( t r 2 ​ j / d ) − d 2 ) ) , k > 0 , r > 0 . formulae-sequence subscript 𝑏 𝑡 𝑘 superscript subscript 𝑗 1 𝑑 2 𝑡 superscript 𝑟 2 𝑗 𝑑 𝑑 2 formulae-sequence 𝑘 0 𝑟 0 b_{t}=\\exp\\left(k\\left(\\sum_{j=1}^{d/2}\\cos\\left(\\frac{t}{r^{2j/d}}\\right)-\\frac{d}{2}\\right)\\right),k>0,r>0. We first do the following transformations:\n\nb t subscript 𝑏 𝑡 \\displaystyle b_{t} = exp ⁡ ( k ​ ( ∑ j = 1 d / 2 ( cos ⁡ ( t r 2 ​ j / d ) − 1 ) ) ) absent 𝑘 superscript subscript 𝑗 1 𝑑 2 𝑡 superscript 𝑟 2 𝑗 𝑑 1 \\displaystyle=\\exp\\left(k\\left(\\sum_{j=1}^{d/2}\\left(\\cos\\left(\\frac{t}{r^{2j/d}}\\right)-1\\right)\\right)\\right) (37) = ∏ j = 1 d / 2 exp ⁡ ( k ​ ( cos ⁡ ( t r 2 ​ j / d ) − 1 ) ) , absent superscript subscript product 𝑗 1 𝑑 2 𝑘 𝑡 superscript 𝑟 2 𝑗 𝑑 1 \\displaystyle=\\prod_{j=1}^{d/2}\\exp\\left(k\\left(\\cos\\left(\\frac{t}{r^{2j/d}}\\right)-1\\right)\\right),\n\nthen make a partition over :\n\nt r 2 ​ j / d ≥ π 2 , 𝑡 superscript 𝑟 2 𝑗 𝑑 𝜋 2 \\frac{t}{r^{2j/d}}\\geq\\frac{\\pi}{2}, (38)\n\nwhich is equivalent to:\n\n2 ​ t 2 𝑡 \\displaystyle 2t ≥ π ​ r 2 ​ j / d , 2 ​ t π ≥ r 2 ​ j / d , formulae-sequence absent 𝜋 superscript 𝑟 2 𝑗 𝑑 2 𝑡 𝜋 superscript 𝑟 2 𝑗 𝑑 \\displaystyle\\geq\\pi r^{2j/d},\\frac{2t}{\\pi}\\geq r^{2j/d}, (39) log r ⁡ ( 2 ​ t π ) subscript 𝑟 2 𝑡 𝜋 \\displaystyle\\log_{r}\\left(\\frac{2t}{\\pi}\\right) ≥ 2 ​ j / d , j ≤ d ​ log r ⁡ ( 2 ​ t π ) 2 ≜ f ​ ( t ) . formulae-sequence absent 2 𝑗 𝑑 𝑗 𝑑 subscript 𝑟 2 𝑡 𝜋 2 ≜ 𝑓 𝑡 \\displaystyle\\geq 2j/d,j\\leq\\frac{d\\log_{r}\\left(\\frac{2t}{\\pi}\\right)}{2}\\triangleq f(t). Therefore we have:\n\nb t subscript 𝑏 𝑡 \\displaystyle b_{t} = ∏ 1 ≤ j ≤ f ​ ( t ) exp ⁡ ( k ​ ( cos ⁡ ( t r 2 ​ j / d ) − 1 ) ) absent subscript product 1 𝑗 𝑓 𝑡 𝑘 𝑡 superscript 𝑟 2 𝑗 𝑑 1 \\displaystyle=\\prod_{1\\leq j\\leq f(t)}\\exp\\left(k\\left(\\cos\\left(\\frac{t}{r^{2j/d}}\\right)-1\\right)\\right) (40) × ∏ f ​ ( t ) < j ≤ d / 2 exp ( k ( cos ( t r 2 ​ j / d ) − 1 ) ) . \\displaystyle\\times\\prod_{f(t)<j\\leq d/2}\\exp\\left(k\\left(\\cos\\left(\\frac{t}{r^{2j/d}}\\right)-1\\right)\\right). For the first part:\n\ncos ⁡ ( t r 2 ​ j / d ) − 1 < − 1 . 𝑡 superscript 𝑟 2 𝑗 𝑑 1 1 \\cos\\left(\\frac{t}{r^{2j/d}}\\right)-1<-1. (41)\n\nFor the second part:\n\ncos ⁡ ( t r 2 ​ j / d ) − 1 < 0 . 𝑡 superscript 𝑟 2 𝑗 𝑑 1 0 \\cos\\left(\\frac{t}{r^{2j/d}}\\right)-1<0. (42)\n\nThen:\n\nβ t subscript 𝛽 𝑡 \\displaystyle\\beta_{t} ≤ ∏ 1 ≤ j ≤ f ​ ( t ) exp ⁡ ( − k ) absent subscript product 1 𝑗 𝑓 𝑡 𝑘 \\displaystyle\\leq\\prod_{1\\leq j\\leq f(t)}\\exp(-k) (43) = exp ⁡ ( − k ​ ⌊ f ​ ( t ) ⌋ ) absent 𝑘 𝑓 𝑡 \\displaystyle=\\exp(-k\\lfloor f(t)\\rfloor) ≤ exp ⁡ ( k ) ​ exp ⁡ ( − k ​ f ​ ( t ) ) absent 𝑘 𝑘 𝑓 𝑡 \\displaystyle\\leq\\exp(k)\\exp(-kf(t)) = exp ⁡ ( k ) ​ exp ⁡ ( − k ​ d ​ log r ⁡ ( 2 ​ t π ) 2 ) ≜ g ​ ( t ) . absent 𝑘 𝑘 𝑑 subscript 𝑟 2 𝑡 𝜋 2 ≜ 𝑔 𝑡 \\displaystyle=\\exp(k)\\exp\\left(-\\frac{kd\\log_{r}\\left(\\frac{2t}{\\pi}\\right)}{2}\\right)\\triangleq g(t). According to Rabbe’s test (Knopp 1956):\n\nt ​ ( g ​ ( t ) g ​ ( t + 1 ) − 1 ) 𝑡 𝑔 𝑡 𝑔 𝑡 1 1 \\displaystyle t\\left(\\frac{g(t)}{g({t+1})}-1\\right) = t ​ ( exp ⁡ ( k ​ d 2 ​ log r ⁡ 2 ​ t + 2 2 ​ t ) − 1 ) absent 𝑡 𝑘 𝑑 2 subscript 𝑟 2 𝑡 2 2 𝑡 1 \\displaystyle=t\\left(\\exp\\left(\\frac{kd}{2}\\log_{r}\\frac{2t+2}{2t}\\right)-1\\right) (44) = t ​ ( exp ⁡ ( k ​ d 2 ​ log r ⁡ ( 1 + 1 t ) ) − 1 ) absent 𝑡 𝑘 𝑑 2 subscript 𝑟 1 1 𝑡 1 \\displaystyle=t\\left(\\exp\\left(\\frac{kd}{2}\\log_{r}\\left(1+\\frac{1}{t}\\right)\\right)-1\\right) ∼ t ​ ( k ​ d 2 ​ log r ⁡ ( 1 + 1 t ) + O ​ ( 1 t 2 ) ) similar-to absent 𝑡 𝑘 𝑑 2 subscript 𝑟 1 1 𝑡 𝑂 1 superscript 𝑡 2 \\displaystyle\\sim t\\left(\\frac{kd}{2}\\log_{r}\\left(1+\\frac{1}{t}\\right)+O\\left(\\frac{1}{t^{2}}\\right)\\right) ∼ t ​ ( k ​ d 2 ​ ln ⁡ r ​ ( 1 t − 1 2 ​ t 2 ) + O ​ ( 1 t 2 ) ) similar-to absent 𝑡 𝑘 𝑑 2 𝑟 1 𝑡 1 2 superscript 𝑡 2 𝑂 1 superscript 𝑡 2 \\displaystyle\\sim t\\left(\\frac{kd}{2\\ln r}\\left(\\frac{1}{t}-\\frac{1}{2t^{2}}\\right)+O\\left(\\frac{1}{t^{2}}\\right)\\right) → k ​ d 2 ​ ln ⁡ r , → absent 𝑘 𝑑 2 𝑟 \\displaystyle\\to\\frac{kd}{2\\ln r},\n\nif:\n\nk ​ d 2 ​ ln ⁡ r < 1 , d < 2 ​ ln ⁡ r k , formulae-sequence 𝑘 𝑑 2 𝑟 1 𝑑 2 𝑟 𝑘 \\displaystyle\\frac{kd}{2\\ln r}<1,\\quad d<\\frac{2\\ln r}{k}, (45)\n\nthen the series converges111Note that here we only show that the series corresponding to Sandwich is convergent under certain conditions. The upper bound here is relatively loose, and the conditions used in practice are broader.. Appendix C TRF example\n\nWe use Alibi as an example to show the calculation of TRF. The of Alibi can be written as:\n\nB i ​ j = ∑ i = 0 j − 1 exp ⁡ ( − i ) = 1 − exp ⁡ ( − j ) 1 − exp ⁡ ( − 1 ) , B = 1 1 − exp ⁡ ( − 1 ) formulae-sequence subscript 𝐵 𝑖 𝑗 superscript subscript 𝑖 0 𝑗 1 𝑖 1 𝑗 1 1 𝐵 1 1 1 B_{ij}=\\sum_{i=0}^{j-1}\\exp(-i)=\\frac{1-\\exp(-j)}{1-\\exp(-1)},B=\\frac{1}{1-\\exp(-1)} (46)\n\nThe TRF of Alibi can be calculated as:\n\nn the ​ ( ϵ ) subscript 𝑛 the italic-ϵ \\displaystyle n_{\\mathrm{the}}(\\epsilon) = inf j ( B i ​ j > B ​ ( 1 − ϵ ) ) absent subscript infimum 𝑗 subscript 𝐵 𝑖 𝑗 𝐵 1 italic-ϵ \\displaystyle=\\inf_{j}\\left(B_{ij}>B(1-\\epsilon)\\right) (47) = inf j ( 1 − exp ⁡ ( − j ) > 1 − ϵ ) = Θ ​ ( − log ⁡ ϵ ) .",
    "transextra-25": "absent subscript infimum 𝑗 1 𝑗 1 italic-ϵ Θ italic-ϵ \\displaystyle=\\inf_{j}\\left(1-\\exp(-j)>1-\\epsilon\\right)=\\Theta(-\\log\\epsilon). where represents the upper and lower asymptotic bound. Appendix D Configurations\n\nAppendix E Pseudocode for TRF and ERF visualization\n\n1import torch\n\n3def draw(array, n=50):\n\n4 epsilon = torch.flip(torch.linspace(0, 1, n), dims=[0])\n\n5 index = torch.zeros(n)\n\n6 cusum = torch.sum(array)\n\n7 m = len(array)\n\n8 s = 0\n\n9 i = 0\n\n10 for j in range(m):\n\n11 eps = epsilon[i]\n\n12 while s >= cusum * (1 - eps) and i < n:\n\n13 index[i] = j\n\n14 if i < n - 1:\n\n15 i += 1\n\n16 else:\n\n17 break\n\n18 eps = epsilon[i]\n\n19 s += array[j]\n\n20 while i < n:\n\n21 index[i] = m\n\n22 i += 1\n\n23\n\n24 return index / m, epsilon\n\nAppendix F Detailed Experimental Results\n\nAppendix G Heatmap\n\n◄ Feeling lucky? Conversion report Report an issue View original on arXiv►\n\nCopyright Privacy Policy\n\nGenerated on Wed Feb 28 17:44:44 2024 by LaTeXML"
}