{
    "acronym": "002390988f7157b425ac7e5dc42f3d06eca6ede7",
    "title": "Rewiring with Positional Encodings for Graph Neural Networks",
    "seed_ids": [
        "transformerxl",
        "277dd73bfeb5c46513ce305136b0e71fcd2a311c"
    ],
    "s2id": "002390988f7157b425ac7e5dc42f3d06eca6ede7",
    "abstract": "Several recent works use positional encodings to extend the receptive fields of graph neural network (GNN) layers equipped with attention mechanisms. These techniques, however, extend receptive fields to the complete graph, at substantial computational cost and risking a change in the inductive biases of conventional GNNs, or require complex architecture adjustments. As a conservative alternative, we use positional encodings to expand receptive fields to $r$-hop neighborhoods. More specifically, our method augments the input graph with additional nodes/edges and uses positional encodings as node and/or edge features. We thus modify graphs before inputting them to a downstream GNN model, instead of modifying the model itself. This makes our method model-agnostic, i.e., compatible with any of the existing GNN architectures. We also provide examples of positional encodings that are lossless with a one-to-one map between the original and the modified graphs. We demonstrate that extending receptive fields via positional encodings and a virtual fully-connected node significantly improves GNN performance and alleviates over-squashing using small $r$. We obtain improvements on a variety of models and datasets and reach competitive performance using traditional GNNs or graph Transformers.",
    "authors": [
        "Rickard Brüel Gabrielsson",
        "M. Yurochkin",
        "J. Solomon"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that extending receptive fields via positional encodings and a virtual fully-connected node significantly improves GNN performance and alleviates over-squashing using small $r$."
    },
    "citationCount": 24,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}