{
    "acronym": "006cf91d266077d22dceed39a61e32cfe1b4fcff",
    "title": "Few-shot Temporal Pruning Accelerates Diffusion Models for Text Generation",
    "seed_ids": [
        "diffuseq",
        "reparamdiscdiffu",
        "f2f85068c9e22a4d8fe6b58e2d92e2d30bc10578",
        "1f898d66acabff511a3871b82799aa73c0055402",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "82482585e94192b4e9913727e461f89cd08e9725",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "24425954960ce968e5f14360fbdd0605abcadfcf"
    ],
    "s2id": "006cf91d266077d22dceed39a61e32cfe1b4fcff",
    "abstract": "Diffusion models have achieved significant success in computer vision and shown immense potential in natural language processing applications, particularly for text generation tasks. However, generating high-quality text using these models often necessitates thousands of iterations, leading to slow sampling rates. Existing acceleration methods either neglect the importance of the distribution of sampling steps, resulting in compromised performance with smaller number of iterations, or require additional training, introducing considerable computational overheads. In this paper, we present Few-shot Temporal Pruning, a novel technique designed to accelerate diffusion models for text generation without supplementary training while effectively leveraging limited data. Employing a Bayesian optimization approach, our method effectively eliminates redundant sampling steps during the sampling process, thereby enhancing the generation speed. A comprehensive evaluation of discrete and continuous diffusion models across various tasks, including machine translation, question generation, and paraphrasing, reveals that our approach achieves competitive performance even with minimal sampling steps after down to less than 1 minute of optimization, yielding a significant acceleration of up to 400x in text generation tasks.",
    "authors": [
        "Bocheng Li",
        "Zhujin Gao",
        "Yongxin Zhu",
        "Kun Yin",
        "Haoyu Cao",
        "Deqiang Jiang",
        "Linli Xu"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Few-shot Temporal Pruning is presented, a novel technique designed to accelerate diffusion models for text generation without supplementary training while effectively leveraging limited data by employing a Bayesian optimization approach."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}