{
    "acronym": "008bf3537ffac6fb160a0638c5e3d631a7501d7b",
    "title": "Improving and Unifying Discrete&Continuous-time Discrete Denoising Diffusion",
    "seed_ids": [
        "d3pms",
        "1f898d66acabff511a3871b82799aa73c0055402",
        "33433e9103b00aa0c42597cbfe13a429fbf5abdf",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "e9b9a47cd81c66603c827f0f2bc4fba0d9ae77c4",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2"
    ],
    "s2id": "008bf3537ffac6fb160a0638c5e3d631a7501d7b",
    "abstract": "Discrete diffusion models have seen a surge of attention with applications on naturally discrete data such as language and graphs. Although discrete-time discrete diffusion has been established for a while, only recently Campbell et al. (2022) introduced the first framework for continuous-time discrete diffusion. However, their training and sampling processes differ significantly from the discrete-time version, necessitating nontrivial approximations for tractability. In this paper, we first present a series of mathematical simplifications of the variational lower bound that enable more accurate and easy-to-optimize training for discrete diffusion. In addition, we derive a simple formulation for backward denoising that enables exact and accelerated sampling, and importantly, an elegant unification of discrete-time and continuous-time discrete diffusion. Thanks to simpler analytical formulations, both forward and now also backward probabilities can flexibly accommodate any noise distribution, including different noise distributions for multi-element objects. Experiments show that our proposed USD3 (for Unified Simplified Discrete Denoising Diffusion) outperform all SOTA baselines on established datasets. We open-source our unified code at https://github.com/LingxiaoShawn/USD3.",
    "authors": [
        "Lingxiao Zhao",
        "Xueying Ding",
        "Lijun Yu",
        "L. Akoglu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A series of mathematical simplifications of the variational lower bound that enable more accurate and easy-to-optimize training for discrete diffusion and an elegant unification of discrete-time and continuous-time discrete diffusion."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}