{
    "acronym": "00a92e580cb4801fc32f2ed8cdb215bfb9c1a575",
    "title": "Conformer-based End-to-end Speech Recognition With Rotary Position Embedding",
    "seed_ids": [
        "transformerxl",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "0a82b81fbc0bc25bf4d60f9a18c8ee3571e80d7d",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "00a92e580cb4801fc32f2ed8cdb215bfb9c1a575",
    "abstract": "Transformer-based end-to-end speech recognition models have received considerable attention in recent years due to their high training speed and ability to model a long-range global context. Position embedding in the transformer architecture is indispensable because it provides supervision for dependency modeling between elements at different positions in the input sequence. To make use of the time order of the input sequence, many works inject some information about the relative or absolute position of the element into the input sequence. In this work, we investigate various position embedding methods in the convolution-augmented transformer (conformer) and adopt a novel implementation named rotary position embedding (RoPE). RoPE encodes absolute positional information into the input sequence by a rotation matrix, and then naturally incorporates explicit relative position information into a self-attention module. To evaluate the effectiveness of the RoPE method, we conducted experiments on AISHELL-1 and LibriSpeech corpora. Results show that the conformer enhanced with RoPE achieves superior performance in the speech recognition task. Specifically, our model achieves a relative word error rate reduction of 8.70% and 7.27% over the conformer on test-clean and test-other sets of the LibriSpeech corpus respectively.",
    "authors": [
        "Shengqiang Li",
        "Menglong Xu",
        "Xiao-Lei Zhang"
    ],
    "venue": "Asia-Pacific Signal and Information Processing Association Annual Summit and Conference",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work investigates various position embedding methods in the convolution-augmented transformer (conformer) and adopts a novel implementation named RoPE, which encodes absolute positional information into the input sequence by a rotation matrix, and then naturally incorporates explicit relative position information into a self-attention module."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}