{
    "acronym": "00c806db7d5b56457a81f0f122092e398a330fd1",
    "title": "Predicting the next sentence (not word) in large language models: What model-brain alignment tells us about discourse comprehension",
    "seed_ids": [
        "bert",
        "66c286df54551baba7351a1ed44019367e5aa7ea",
        "5d6f2d03d7fa1b37d7240975a3176de4612866cb",
        "2b31936832bdadb4b751c5294f73888571c37db0",
        "270f3bea8ca801870a6cc56b4d36f7f2019c9ed0"
    ],
    "s2id": "00c806db7d5b56457a81f0f122092e398a330fd1",
    "abstract": "Current large language models (LLMs) rely on word prediction as their backbone pretraining task. Although word prediction is an important mechanism underlying language processing, human language comprehension occurs at multiple levels, involving the integration of words and sentences to achieve a full understanding of discourse. This study models language comprehension by using the next sentence prediction (NSP) task to investigate mechanisms of discourse-level comprehension. We show that NSP pretraining enhanced a model’s alignment with brain data especially in the right hemisphere and in the multiple demand network, highlighting the contributions of nonclassical language regions to high-level language understanding. Our results also suggest that NSP can enable the model to better capture human comprehension performance and to better encode contextual information. Our study demonstrates that the inclusion of diverse learning objectives in a model leads to more human-like representations, and investigating the neurocognitive plausibility of pretraining tasks in LLMs can shed light on outstanding questions in language neuroscience.",
    "authors": [
        "Shaoyun Yu",
        "Chanyuan Gu",
        "Kexin Huang",
        "Ping Li"
    ],
    "venue": "Science Advances",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study models language comprehension by using the next sentence prediction (NSP) task to investigate mechanisms of discourse-level comprehension and shows that NSP pretraining enhanced a model’s alignment with brain data especially in the right hemisphere and in the multiple demand network."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}