{
    "acronym": "014c00319cb23c6322ea5218049661a4ce222946",
    "title": "TART: A plug-and-play Transformer module for task-agnostic reasoning",
    "seed_ids": [
        "gpt",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "525d93a382f6e7873b5d8a2e0713eb3dff7fb250",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "014c00319cb23c6322ea5218049661a4ce222946",
    "abstract": "Large language models (LLMs) exhibit in-context learning abilities which enable the same model to perform several tasks without any task-specific training. In contrast, traditional adaptation approaches, such as fine-tuning, modify the underlying models for each specific task. In-context learning, however, consistently underperforms task-specific tuning approaches even when presented with the same examples. While most existing approaches (e.g., prompt engineering) focus on the LLM's learned representations to patch this performance gap, our analysis actually reveal that LLM representations contain sufficient information to make good predictions. As such, we focus on the LLM's reasoning abilities and demonstrate that this performance gap exists due to their inability to perform simple probabilistic reasoning tasks. This raises an intriguing question: Are LLMs actually capable of learning how to reason in a task-agnostic manner? We answer this in the affirmative and propose TART which generically improves an LLM's reasoning abilities using a synthetically trained Transformer-based reasoning module. TART trains this reasoning module in a task-agnostic manner using only synthetic logistic regression tasks and composes it with an arbitrary real-world pre-trained model without any additional training. With a single inference module, TART improves performance across different model families (GPT-Neo, Pythia, BLOOM), model sizes (100M - 6B), tasks (14 NLP binary classification tasks), and even across different modalities (audio and vision). Additionally, on the RAFT Benchmark, TART improves GPT-Neo (125M)'s performance such that it outperforms BLOOM (176B), and is within 4% of GPT-3 (175B). Our code and models are available at https://github.com/HazyResearch/TART .",
    "authors": [
        "K. Bhatia",
        "A. Narayan",
        "Chris De Sa",
        "Christopher Ré"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes TART, which generically improves an LLM's reasoning abilities using a synthetically trained Transformer-based reasoning module in a task-agnostic manner and improves performance across different model families, tasks, and even across different modalities."
    },
    "citationCount": 9,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}