{
    "acronym": "016e99ccef0afb7011f3ea3b1b932611c8fb957b",
    "title": "Scaleformer: Iterative Multi-scale Refining Transformers for Time Series Forecasting",
    "seed_ids": [
        "performer",
        "reformer",
        "defecf3dc299214f4cb76a093c6eed2297eaa46f",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "231e768f0cd280faa0f725bb353262cb4fed08d1",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "3cbe314cc5407a6c3249815b5173f22ea15173c2",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "f2fc9ef411846dd577c26225ce93f50bb1fa760b"
    ],
    "s2id": "016e99ccef0afb7011f3ea3b1b932611c8fb957b",
    "abstract": "The performance of time series forecasting has recently been greatly improved by the introduction of transformers. In this paper, we propose a general multi-scale framework that can be applied to the state-of-the-art transformer-based time series forecasting models (FEDformer, Autoformer, etc.). By iteratively refining a forecasted time series at multiple scales with shared weights, introducing architecture adaptations, and a specially-designed normalization scheme, we are able to achieve significant performance improvements, from 5.5% to 38.5% across datasets and transformer architectures, with minimal additional computational overhead. Via detailed ablation studies, we demonstrate the effectiveness of each of our contributions across the architecture and methodology. Furthermore, our experiments on various public datasets demonstrate that the proposed improvements outperform their corresponding baseline counterparts. Our code is publicly available in https://github.com/BorealisAI/scaleformer.",
    "authors": [
        "Amin Shabani",
        "A. Abdi",
        "Li Meng",
        "Tristan Sylvain"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A general multi-scale framework that can be applied to the state-of-the-art transformer-based time series forecasting models (FEDformer, Autoformer, etc.), and demonstrates the effectiveness of each of its contributions across the architecture and methodology."
    },
    "citationCount": 34,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}