{
    "acronym": "017cfe49fce1cb77bda2e1791f7203f5ebac0ac7",
    "title": "Director: Generator-Classifiers For Supervised Language Modeling",
    "seed_ids": [
        "gpt2",
        "023edab4738690444e3924e224c2641017a0d794",
        "77ced33cba86b4d01fbfe6622c8f564c89d6a1b3",
        "670edecb7a0d3887893c8f287e66209b87e5f56f",
        "b6c4a96e09b9f11e7c70e7f1fbe3f3971b92762d",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "017cfe49fce1cb77bda2e1791f7203f5ebac0ac7",
    "abstract": "Current language models achieve low perplexity but their resulting generations still suffer from toxic responses, repetitiveness, and contradictions. The standard language modeling setup fails to address these issues. In this paper, we introduce a new architecture, Director, that consists of a unified generator-classifier with both a language modeling and a classification head for each output token. Training is conducted jointly using both standard language modeling data, and data labeled with desirable and undesirable sequences. Experiments in several settings show that the model has competitive training and decoding speed compared to standard language models while yielding superior results, avoiding undesirable behaviors while maintaining generation quality. It also outperforms existing model guiding approaches in terms of both accuracy and efficiency. Our code is made publicly available.",
    "authors": [
        "Kushal Arora",
        "Kurt Shuster",
        "Sainbayar Sukhbaatar",
        "J. Weston"
    ],
    "venue": "AACL",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new architecture, Director, that consists of a unified generator-classifier with both a language modeling and a classification head for each output token that outperforms existing model guiding approaches in terms of both accuracy and efficiency."
    },
    "citationCount": 35,
    "influentialCitationCount": 6,
    "code": null,
    "description": null,
    "url": null
}