{
    "acronym": "017d852fc59ddbe82f3e32e627f35530a388ca94",
    "title": "A Generative Artificial Intelligence Using Multilingual Large Language Models for ChatGPT Applications",
    "seed_ids": [
        "alibi",
        "7b6a8c6d44e0f77bf930484e438d77b7465a69fb",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e"
    ],
    "s2id": "017d852fc59ddbe82f3e32e627f35530a388ca94",
    "abstract": "ChatGPT plays significant roles in the third decade of the 21st Century. Smart cities applications can be integrated with ChatGPT in various fields. This research proposes an approach for developing large language models using generative artificial intelligence models suitable for small- and medium-sized enterprises with limited hardware resources. There are many generative AI systems in operation and in development. However, the technological, human, and financial resources required to develop generative AI systems are impractical for small- and medium-sized enterprises. In this study, we present a proposed approach to reduce training time and computational cost that is designed to automate question–response interactions for specific domains in smart cities. The proposed model utilises the BLOOM approach as its backbone for using generative AI to maximum the effectiveness of small- and medium-sized enterprises. We have conducted a set of experiments on several datasets associated with specific domains to validate the effectiveness of the proposed model. Experiments using datasets for the English and Vietnamese languages have been combined with model training using low-rank adaptation to reduce training time and computational cost. In comparative experimental testing, the proposed model outperformed the `Phoenix’ multilingual chatbot model by achieving a 92% performance compared to `ChatGPT’ for the English benchmark.",
    "authors": [
        "Nguyen Trung Tuan",
        "Philip Moore",
        "Dat Ha Vu Thanh",
        "Hai Van Pham"
    ],
    "venue": "Applied Sciences",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A proposed approach to reduce training time and computational cost that is designed to automate question–response interactions for specific domains in smart cities and utilises the BLOOM approach as its backbone for using generative AI to maximum the effectiveness of small- and medium-sized enterprises."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}