{
    "acronym": "01c2c2e903a99844642cd145b48fcf13978e2a2c",
    "title": "SSR: Solving Named Entity Recognition Problems via a Single-stream Reasoner",
    "seed_ids": [
        "bert",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "95ecc81c2b3ef1cb7ba4028fe2a8f2e04b6f397b"
    ],
    "s2id": "01c2c2e903a99844642cd145b48fcf13978e2a2c",
    "abstract": "Information Extraction (IE) focuses on transforming unstructured data into structured knowledge, of which Named Entity Recognition (NER) is a fundamental component. In the realm of Information Retrieval (IR), effectively recognizing entities can substantially enhance the precision of search and recommendation systems. Existing methods frame NER as a sequence labeling task, which requires extra data and, therefore may be limited in terms of sustainability. One promising solution is to employ a Machine Reading Comprehension (MRC) approach for NER tasks, thereby eliminating the dependence on additional data. This process encounters key challenges, including: (1) Unconventional predictions; (2) Inefficient multi-stream processing; (3) Absence of a proficient reasoning strategy. To this end, we present the Single-Stream Reasoner (SSR), a solution utilizing a reasoning strategy and standardized inputs. This yields a type-agnostic solution for both flat and nested NER tasks, without the need for additional data. On ten NER benchmarks, SSR achieved state-of-the-art results, highlighting its robustness. Furthermore, we illustrated its efficiency through convergence, inference speed, and low-resource scenario performance comparisons. Our architecture displays adaptability and can effortlessly merge with various foundational models and reasoning strategies, fostering advancements in both the IR and IE fields.",
    "authors": [
        "Yuxiang Zhang",
        "Junjie Wang",
        "Xinyu Zhu",
        "Tetsuya Sakai",
        "Hayato Yamana"
    ],
    "venue": "ACM Trans. Inf. Syst.",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Single-Stream Reasoner (SSR) is presented, a solution utilizing a reasoning strategy and standardized inputs that yields a type-agnostic solution for both flat and nested NER tasks, without the need for additional data."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}