{
    "acronym": "01e37a60d6a68bcdc90c3ee0aca9162acb23bbd2",
    "title": "From RoBERTa to aLEXa: Automated Legal Expert Arbitrator for Neural Legal Judgment Prediction",
    "seed_ids": [
        "neurallegal",
        "29584ed6d68a06fdf91440a018f6bc83a44fd177"
    ],
    "s2id": "01e37a60d6a68bcdc90c3ee0aca9162acb23bbd2",
    "abstract": "Neural models have shown promise in redefining the field of legal judgment prediction (LJP), serving as an aid for judges while helping citizens assess the fairness of judgments. Previous neural LJP approaches on binary and multi-label classification tasks, however, relied on outdated language models and faulty hyperparameters. Beyond improving state-of-the-art results in both a binary and the multi-label setting by fine-tuning large language models, we introduce aLEXa, a multi-task hierarchical language model with self-learning loss weights and attention forcing, teaching the model what legal facts to pay most attention to. Additionally, we improve the explainability of LJP models through paragraph attention weighting visualizations, allowing us to qualitatively assess the quality of legal predictions in addition to traditional quantitative metrics. Our results underscore the potential of NLP approaches to redefine traditional judicial decision-making and show promise of the efficacy of hierarchical and domain fine-tuned language models.",
    "authors": [
        "Lukas Haas",
        "Michal Skreta",
        "Lucia Zheng"
    ],
    "venue": "",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "ALEXa is introduced, a multi-task hierarchical language model with self-learning loss weights and attention forcing, teaching the model what legal facts to pay most attention to, underscoring the potential of NLP approaches to redefine traditional judicial decision-making and showing promise of the efficacy of hierarchical and domain fine-tuned language models."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}