{
    "acronym": "02425d2af6368145ce23508fa05e3b4f04c93ff7",
    "title": "Sigma: Siamese Mamba Network for Multi-Modal Semantic Segmentation",
    "seed_ids": [
        "s4",
        "mamba",
        "e730beb44042499763d36214c0498434e470dfd5",
        "b24e899ec0f77eef2fc87a9b8e50516367aa1f97",
        "38c48a1cd296d16dc9c56717495d6e44cc354444",
        "d5ab24beec066610a0af109e25913dba3e42a978",
        "bb6644a9f5920abfc1fa008f366a9ff48468e063",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "9226ae23b95b3f6891461e086d910ffeb7ac448a",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "02425d2af6368145ce23508fa05e3b4f04c93ff7",
    "abstract": "Multi-modal semantic segmentation significantly enhances AI agents' perception and scene understanding, especially under adverse conditions like low-light or overexposed environments. Leveraging additional modalities (X-modality) like thermal and depth alongside traditional RGB provides complementary information, enabling more robust and reliable segmentation. In this work, we introduce Sigma, a Siamese Mamba network for multi-modal semantic segmentation, utilizing the Selective Structured State Space Model, Mamba. Unlike conventional methods that rely on CNNs, with their limited local receptive fields, or Vision Transformers (ViTs), which offer global receptive fields at the cost of quadratic complexity, our model achieves global receptive fields coverage with linear complexity. By employing a Siamese encoder and innovating a Mamba fusion mechanism, we effectively select essential information from different modalities. A decoder is then developed to enhance the channel-wise modeling ability of the model. Our method, Sigma, is rigorously evaluated on both RGB-Thermal and RGB-Depth segmentation tasks, demonstrating its superiority and marking the first successful application of State Space Models (SSMs) in multi-modal perception tasks. Code is available at https://github.com/zifuwan/Sigma.",
    "authors": [
        "Zifu Wan",
        "Yuhao Wang",
        "Silong Yong",
        "Pingping Zhang",
        "Simon Stepputtis",
        "Katia P. Sycara",
        "Yaqi Xie"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Sigma, a Siamese Mamba network for multi-modal semantic segmentation, utilizing the Selective Structured State Space Model, Mamba is introduced, marking the first successful application of State Space Models (SSMs) in multi-modal perception tasks."
    },
    "citationCount": 6,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}