{
    "acronym": "02b88bbf571424ee8bd1008f1f09a41058ed6265",
    "title": "Multi-level Community-awareness Graph Neural Networks for Neural Machine Translation",
    "seed_ids": [
        "lineartransformer",
        "aft",
        "fnet",
        "d5e999aae76d5270ef272076979c809817458212",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "a7721b6523971394a8bd4bfda139122ef59b22cd",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "2a31319e73d4486716168b65cdf7559baeda18ce"
    ],
    "s2id": "02b88bbf571424ee8bd1008f1f09a41058ed6265",
    "abstract": "Neural Machine Translation (NMT) aims to translate the source- to the target-language while preserving the original meaning. Linguistic information such as morphology, syntactic, and semantics shall be grasped in token embeddings to produce a high-quality translation. Recent works have leveraged the powerful Graph Neural Networks (GNNs) to encode such language knowledge into token embeddings. Specifically, they use a trained parser to construct semantic graphs given sentences and then apply GNNs. However, most semantic graphs are tree-shaped and too sparse for GNNs which cause the over-smoothing problem. To alleviate this problem, we propose a novel Multi-level Community-awareness Graph Neural Network (MC-GNN) layer to jointly model local and global relationships between words and their linguistic roles in multiple communities. Intuitively, the MC-GNN layer substitutes a self-attention layer at the encoder side of a transformer-based machine translation model. Extensive experiments on four language-pair datasets with common evaluation metrics show the remarkable improvements of our method while reducing the time complexity in very long sentences.",
    "authors": [
        "Binh Duc Nguyen",
        "Long H. B. Nguyen",
        "D. Dinh"
    ],
    "venue": "International Conference on Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel Multi-level Community-awareness Graph Neural Network (MC-GNN) layer is proposed to jointly model local and global relationships between words and their linguistic roles in multiple communities to reduce the time complexity in very long sentences."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}