{
    "acronym": "02d4e18bc3677be373ff3f31c4a5702cb4e1f520",
    "title": "Pre-trained Language Models in Biomedical Domain: A Survey from Multiscale Perspective",
    "seed_ids": [
        "gpt",
        "49a77a36a0a60d29aa7838ac49a055a69658b195",
        "d25121da56c9050137800c69520111b30201d1ed",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "75f1c7dadb4ed733fb4d3a4cc47b9cbde9ad98cc",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "4cd1eacb7d0e3657ac01a4f687638832546cd072",
        "85bb1317013141d5e5f41d18376cd7257c46264a",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "e092ecf56fcca38d0cd6fe9e1e6b11c380f6c286",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "42f0bae2dacba44e9b5d8f050da3cbe41b9fc437",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "a022bda79947d1f656a1164003c1b3ae9a843df9",
        "66617d894e4cefc86efbf9ab984caada733f549e",
        "dc35daba3fb34b2e6a5b12530badb7b799262bbf"
    ],
    "s2id": "02d4e18bc3677be373ff3f31c4a5702cb4e1f520",
    "abstract": "Pre-trained language models have been the de facto paradigm for most natural language processing (NLP) tasks. In the biomedical domain, which also benefits from NLP techniques, various pre-trained language models were proposed by leveraging domain datasets including biomedical literature, biomedical social medial, electronic health records, and other biological sequences. Large amounts of efforts have been explored on applying these biomedical pre-trained language models to downstream biomedical tasks, from informatics, medicine, and computer science (CS) communities. However, it seems that the vast majority of existing works are isolated from each other probably because of the cross-discipline characteristics. It is expected to propose a survey that not only systematically reviews recent advances of biomedical pre-trained language models and their applications but also standardizes terminology, taxonomy, and benchmarks. Therefore, this paper summarizes the recent progress of pre-trained language models used in the biomedical domain. Particularly, an overview and taxonomy of existing biomedical pre-trained language models as well as their applications in biomedical downstream tasks are exhaustively discussed. At last, we illustrate various limitations and future trends, which we hope can provide inspiration for the future research.",
    "authors": [
        "Benyou Wang"
    ],
    "venue": "",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The recent progress of pre-trained language models used in the biomedical domain is summarized and an overview and taxonomy of existing biomedical pre-trained language models as well as their applications in biomedical downstream tasks are exhaustively discussed."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}