{
    "acronym": "02f0d5faa1cd88ea0afe48b756bfbf9adfefba28",
    "title": "SeqXGPT: Sentence-Level AI-Generated Text Detection",
    "seed_ids": [
        "gpt2",
        "7a30650265477ebe0dc6fc6ce0b54be8644c5226",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "02f0d5faa1cd88ea0afe48b756bfbf9adfefba28",
    "abstract": "Widely applied large language models (LLMs) can generate human-like content, raising concerns about the abuse of LLMs. Therefore, it is important to build strong AI-generated text (AIGT) detectors. Current works only consider document-level AIGT detection, therefore, in this paper, we first introduce a sentence-level detection challenge by synthesizing a dataset that contains documents that are polished with LLMs, that is, the documents contain sentences written by humans and sentences modified by LLMs. Then we propose \\textbf{Seq}uence \\textbf{X} (Check) \\textbf{GPT}, a novel method that utilizes log probability lists from white-box LLMs as features for sentence-level AIGT detection. These features are composed like \\textit{waves} in speech processing and cannot be studied by LLMs. Therefore, we build SeqXGPT based on convolution and self-attention networks. We test it in both sentence and document-level detection challenges. Experimental results show that previous methods struggle in solving sentence-level AIGT detection, while our method not only significantly surpasses baseline methods in both sentence and document-level detection challenges but also exhibits strong generalization capabilities.",
    "authors": [
        "Pengyu Wang",
        "Linyang Li",
        "Ke Ren",
        "Botian Jiang",
        "Dong Zhang",
        "Xipeng Qiu"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Experimental results show that previous methods struggle in solving sentence-level AIGT detection, while the proposed SeqXGPT method not only significantly surpasses baseline methods in both sentence and document-level detection challenges but also exhibits strong generalization capabilities."
    },
    "citationCount": 22,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}