{
    "acronym": "0347de8badf5167da41b3c6b24b67b83bfbebede",
    "title": "Prediction of DNA enhancers based on multi-species genomic base model DNABERT-2 and BiGRU network",
    "seed_ids": [
        "bert",
        "0f4780f3f42dbe9755d54495ae17244cc88a7483"
    ],
    "s2id": "0347de8badf5167da41b3c6b24b67b83bfbebede",
    "abstract": "DNA enhancers are important regulatory elements in the genome, and accurate prediction is crucial for understanding gene regulation. In this study, a DNA enhancer prediction algorithm, DNABERT-Enhancer, is proposed by combining the DNABERT-2 model and the BiGRU network. The algorithm analogizes DNA sequences to sentences, and strengthens the capture of contextual information of DNA sequences by integrating the structural strengths of the DNABERT-2 pre-training model and the BiGRU network, thus realizing the DNA enhancers prediction. The experimental results show an AUC value of 0.943 on the test set. This study provides a new method for DNA enhancer prediction in the field of bioinformatics, which is expected to enhance our understanding of gene regulation in practical applications, for example, it may be used to more accurately identify disease markers, customize personalized medical treatment plans or finding new targets in drug discovery that advances the field of genomics.",
    "authors": [
        "Jiasheng He",
        "Shun Zhang",
        "Chun Fang"
    ],
    "venue": "International Conference on Bioinformatics and Intelligent Computing",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new method for DNA enhancer prediction in the field of bioinformatics is expected to enhance the understanding of gene regulation in practical applications, for example, it may be used to more accurately identify disease markers, customize personalized medical treatment plans or finding new targets in drug discovery that advances the field of genomics."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}