{
    "acronym": "0402a87f87509b040bdcf1d9e0c0be8463c055f8",
    "title": "Customizing Text-to-Image Models with a Single Image Pair",
    "seed_ids": [
        "classfreediffu",
        "3ff7153fd6bd47d08084c7f50f8fd70026c126e7",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "82482585e94192b4e9913727e461f89cd08e9725",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "0402a87f87509b040bdcf1d9e0c0be8463c055f8",
    "abstract": "Art reinterpretation is the practice of creating a variation of a reference work, making a paired artwork that exhibits a distinct artistic style. We ask if such an image pair can be used to customize a generative model to capture the demonstrated stylistic difference. We propose Pair Customization, a new customization method that learns stylistic difference from a single image pair and then applies the acquired style to the generation process. Unlike existing methods that learn to mimic a single concept from a collection of images, our method captures the stylistic difference between paired images. This allows us to apply a stylistic change without overfitting to the specific image content in the examples. To address this new task, we employ a joint optimization method that explicitly separates the style and content into distinct LoRA weight spaces. We optimize these style and content weights to reproduce the style and content images while encouraging their orthogonality. During inference, we modify the diffusion process via a new style guidance based on our learned weights. Both qualitative and quantitative experiments show that our method can effectively learn style while avoiding overfitting to image content, highlighting the potential of modeling such stylistic differences from a single image pair.",
    "authors": [
        "Maxwell Jones",
        "Sheng-Yu Wang",
        "Nupur Kumari",
        "David Bau",
        "Jun-Yan Zhu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Pair Customization is proposed, a new customization method that learns stylistic difference from a single image pair and then applies the acquired style to the generation process and captures the stylistic difference between paired images."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}