{
    "acronym": "046835ef32c580cce3f7cfcb6cf756959bb537db",
    "title": "CLEAR: Can Language Models Really Understand Causal Graphs?",
    "seed_ids": [
        "gpt3",
        "aade40af0d85b0b4fe15c97f6222d5c2e4d6d9b3",
        "c1592c211f8b7791a55afd7162249c723b87c237",
        "66c286df54551baba7351a1ed44019367e5aa7ea"
    ],
    "s2id": "046835ef32c580cce3f7cfcb6cf756959bb537db",
    "abstract": "Causal reasoning is a cornerstone of how humans interpret the world. To model and reason about causality, causal graphs offer a concise yet effective solution. Given the impressive advancements in language models, a crucial question arises: can they really understand causal graphs? To this end, we pioneer an investigation into language models' understanding of causal graphs. Specifically, we develop a framework to define causal graph understanding, by assessing language models' behaviors through four practical criteria derived from diverse disciplines (e.g., philosophy and psychology). We then develop CLEAR, a novel benchmark that defines three complexity levels and encompasses 20 causal graph-based tasks across these levels. Finally, based on our framework and benchmark, we conduct extensive experiments on six leading language models and summarize five empirical findings. Our results indicate that while language models demonstrate a preliminary understanding of causal graphs, significant potential for improvement remains. Our project website is at https://github.com/OpenCausaLab/CLEAR.",
    "authors": [
        "Sirui Chen",
        "Mengying Xu",
        "Kun Wang",
        "Xingyu Zeng",
        "Rui Zhao",
        "Shengjie Zhao",
        "Chaochao Lu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work develops a framework to define causal graph understanding, by assessing language models' behaviors through four practical criteria derived from diverse disciplines (e.g., philosophy and psychology), and develops CLEAR, a novel benchmark that defines three complexity levels and encompasses 20 causal graph-based tasks across these levels."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}