{
    "acronym": "0485e3d4b715bbf6b0a748f307a6ca6c25eb9ea7",
    "title": "JIGMARK: A Black-Box Approach for Enhancing Image Watermarks against Diffusion Model Edits",
    "seed_ids": [
        "gpt3",
        "cf694df964caa156ec306b45d3a3127533cb458f",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "14c3cf58192774b9b6fc6188df99efd6ab5fc739"
    ],
    "s2id": "0485e3d4b715bbf6b0a748f307a6ca6c25eb9ea7",
    "abstract": "In this study, we investigate the vulnerability of image watermarks to diffusion-model-based image editing, a challenge exacerbated by the computational cost of accessing gradient information and the closed-source nature of many diffusion models. To address this issue, we introduce JIGMARK. This first-of-its-kind watermarking technique enhances robustness through contrastive learning with pairs of images, processed and unprocessed by diffusion models, without needing a direct backpropagation of the diffusion process. Our evaluation reveals that JIGMARK significantly surpasses existing watermarking solutions in resilience to diffusion-model edits, demonstrating a True Positive Rate more than triple that of leading baselines at a 1% False Positive Rate while preserving image quality. At the same time, it consistently improves the robustness against other conventional perturbations (like JPEG, blurring, etc.) and malicious watermark attacks over the state-of-the-art, often by a large margin. Furthermore, we propose the Human Aligned Variation (HAV) score, a new metric that surpasses traditional similarity measures in quantifying the number of image derivatives from image editing.",
    "authors": [
        "Minzhou Pan",
        "Yi Zeng",
        "Xue Lin",
        "Ning Yu",
        "Cho-Jui Hsieh",
        "Peter Henderson",
        "Ruoxi Jia"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "JIGMARK is introduced, a first-of-its-kind watermarking technique that enhances robustness through contrastive learning with pairs of images, processed and unprocessed by diffusion models, without needing a direct backpropagation of the diffusion process."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}