{
    "acronym": "04cfbed02b7a043e192272daa8d73315053da435",
    "title": "The Seismo-Performer: A Novel Machine Learning Approach for General and Efficient Seismic Phase Recognition from Local Earthquakes in Real Time",
    "seed_ids": [
        "performer",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d"
    ],
    "s2id": "04cfbed02b7a043e192272daa8d73315053da435",
    "abstract": "When recording seismic ground motion in multiple sites using independent recording stations one needs to recognize the presence of the same parts of seismic waves arriving at these stations. This problem is known in seismology as seismic phase picking. It is challenging to automate the accurate picking of seismic phases to the level of human capabilities. By solving this problem, it would be possible to automate routine processing in real time on any local network. A new machine learning approach was developed to classify seismic phases from local earthquakes. The resulting model is based on spectrograms and utilizes the transformer architecture with a self-attention mechanism and without any convolution blocks. The model is general for various local networks and has only 57 k learning parameters. To assess the generalization property, two new datasets were developed, containing local earthquake data collected from two different regions using a wide variety of seismic instruments. The data were not involved in the training process for any model to estimate the generalization property. The new model exhibits the best classification and computation performance results on its pre-trained weights compared with baseline models from related work. The model code is available online and is ready for day-to-day real-time processing on conventional seismic equipment without graphics processing units.",
    "authors": [
        "A. Stepnov",
        "V. Chernykh",
        "A. Konovalov"
    ],
    "venue": "Italian National Conference on Sensors",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new machine learning approach was developed to classify seismic phases from local earthquakes based on spectrograms and utilizes the transformer architecture with a self-attention mechanism and without any convolution blocks, exhibiting the best classification and computation performance results on its pre-trained weights compared with baseline models from related work."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}