{
    "acronym": "04e96e04ed7ea4916311279a43eede2fb00bb1df",
    "title": "Improving Distantly-Supervised Relation Extraction Through BERT-Based Label and Instance Embeddings",
    "seed_ids": [
        "gpt",
        "68e686817f2c33cd09ba3805fa082348f18affd9"
    ],
    "s2id": "04e96e04ed7ea4916311279a43eede2fb00bb1df",
    "abstract": "Distantly-supervised relation extraction (RE) is an effective method to scale RE to large corpora but suffers from noisy labels. Existing approaches try to alleviate noise through multi-instance learning and by providing additional information but manage to recognize mainly the top frequent relations, neglecting those in the long-tail. We propose REDSandT (Relation Extraction with Distant Supervision and Transformers), a novel distantly-supervised transformer-based RE method that manages to capture a wider set of relations through highly informative instance and label embeddings for RE by exploiting BERT’s pre-trained model, and the relationship between labels and entities, respectively. We guide REDSandT to focus solely on relational tokens by fine-tuning BERT on a structured input, including the sub-tree connecting an entity pair and the entities’ types. Using the extracted informative vectors, we shape label embeddings, which we also use as an attention mechanism over instances to further reduce noise. Finally, we represent sentences by concatenating relation and instance embeddings. Experiments in the two benchmark datasets for distantly-supervised RE, NYT-10 and GDS, show that REDSandT captures a broader set of relations with higher confidence, achieving a state-of-the-art AUC (0.424) in NYT-10 and an excellent AUC (0.862) in GDS.",
    "authors": [
        "Despina Christou",
        "Grigorios Tsoumakas"
    ],
    "venue": "IEEE Access",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "RedSandT (Relation Extraction with Distant Supervision and Transformers), a novel distantly-supervised transformer-based RE method that manages to capture a wider set of relations through highly informative instance and label embeddings for RE by exploiting BERT’s pre-trained model, and the relationship between labels and entities, respectively is proposed."
    },
    "citationCount": 30,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}