{
    "acronym": "05369fc9174130dd06a486275441d0cdfed1cd4c",
    "title": "Low-Resourced Speech Recognition for Iu Mien Language via Weakly-Supervised Phoneme-based Multilingual Pre-training",
    "seed_ids": [
        "bert",
        "f6d7c306c8f796e8dda97dc50fe747cc63c34af4"
    ],
    "s2id": "05369fc9174130dd06a486275441d0cdfed1cd4c",
    "abstract": "The mainstream automatic speech recognition (ASR) technology usually requires hundreds to thousands of hours of annotated speech data. Three approaches to low-resourced ASR are phoneme or subword based supervised pre-training, and self-supervised pre-training over multilingual data. The Iu Mien language is the main ethnic language of the Yao ethnic group in China and is low-resourced in the sense that the annotated speech is very limited. With less than 10 hours of transcribed Iu Mien language, this paper investigates and compares the three approaches for Iu Mien speech recognition. Our experiments are based on the recently released, three backbone models pretrained over the 10 languages from the CommonVoice dataset (CV-Lang10), which correspond to the three approaches for low-resourced ASR. It is found that phoneme supervision can achieve better results compared to subword supervision and self-supervision, thereby providing higher data-efficiency. Particularly, the Whistle models, i.e., obtained by the weakly-supervised phoneme-based multilingual pre-training, obtain the most competitive results.",
    "authors": [
        "Lukuan Dong",
        "Donghong Qin",
        "Fengbo Bai",
        "Fanhua Song",
        "Yan Liu",
        "Chen Xu",
        "Zhijian Ou"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Investigation and comparison of the three approaches for Iu Mien speech recognition finds that phoneme supervision can achieve better results compared to subword supervision and self-supervision, thereby providing higher data-efficiency."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}