{
    "acronym": "0557e6b4b071c65428d7b8fb9a7620839c3a578d",
    "title": "Improving Prompt Tuning with Learned Prompting Layers",
    "seed_ids": [
        "gpt2",
        "a981a57848e19adb80c4a29471fbb798ac050a8f",
        "a3184d40d390793232c99c89b57b8f65c16320b2",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "0557e6b4b071c65428d7b8fb9a7620839c3a578d",
    "abstract": "Prompt tuning prepends a soft prompt to the input embeddings or hidden states and only optimizes the prompt to adapt pretrained models (PTMs) to downstream tasks. The previous work manually selects prompt layers which are far from optimal and failed to exploit the potential of prompt tuning. In this work, we propose a novel framework, \\underline{S}elective \\underline{P}rompt \\underline{T}uning (SPT), that learns to select the proper prompt layers by inserting a prompt controlled by a learnable probabilistic gate at each intermediate layer. We further propose a novel bi-level optimization framework, SPT-DARTS, that can better optimize the learnable gates and improve the final prompt tuning performances of the learned prompt layer settings. We conduct extensive experiments with ten benchmark datasets under the full-data and few-shot scenarios. The results demonstrate that our SPT framework can perform better than the previous state-of-the-art PETuning baselines with comparable or fewer tunable parameters.",
    "authors": [
        "Wei Zhu",
        "Ming Tan"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel framework, SPT-DARTS, that learns to select the proper prompt layers by inserting a prompt controlled by a learnable probabilistic gate at each intermediate layer and can better optimize the learnable gates and improve the final prompt tuning performances of the learned prompt layer settings."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}