{
    "acronym": "056c03fe16ed91cbf0d4b60efbed7d2724a49948",
    "title": "Efficient Transformer for Direct Speech Translation",
    "seed_ids": [
        "longformer",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2"
    ],
    "s2id": "056c03fe16ed91cbf0d4b60efbed7d2724a49948",
    "abstract": "The advent of Transformer-based models has surpassed the barriers of text. When working with speech, we must face a problem: the sequence length of an audio input is not suitable for the Transformer. To bypass this problem, a usual approach is adding strided convolutional layers, to reduce the sequence length before using the Transformer. In this paper, we propose a new approach for direct Speech Translation, where thanks to an efficient Transformer we can work with a spectrogram without having to use convolutional layers before the Transformer. This allows the encoder to learn directly from the spectrogram and no information is lost. We have created an encoder-decoder model, where the encoder is an efficient Transformer -- the Longformer -- and the decoder is a traditional Transformer decoder. Our results, which are close to the ones obtained with the standard approach, show that this is a promising research direction.",
    "authors": [
        "Belen Alastruey",
        "Gerard I. Gállego",
        "M. Costa-jussà"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new approach for direct Speech Translation is proposed, where thanks to an efficient Transformer the authors can work with a spectrogram without having to use convolutional layers before the Transformer, and the encoder to learn directly from the spectrogram and no information is lost."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}