{
    "acronym": "0595dac8260443365dfbe4821787419736baaa66",
    "title": "Extending LLMs' Context Window with 100 Samples",
    "seed_ids": [
        "pi",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "2dfb9171e180dcb0af23d305e024d43d311708ab",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "6f6e2e0311589a9af045f6acd00b7dee6d19fce4",
        "60b35c6d68acced19b0c66edcfc0ee0a2c11efed",
        "594d8e1696619f3cebb7c6bffdad8e0a5592f006",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "f75d05e759447c2aedb7097728f29f9a520d9bc1",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "9dc624d7258d1a56117ca720aea953ce46b66b21",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "2e14e84ccec924ed770b58108ad1d9de6f0ca295"
    ],
    "s2id": "0595dac8260443365dfbe4821787419736baaa66",
    "abstract": "Large Language Models (LLMs) are known to have limited extrapolation ability beyond their pre-trained context window, constraining their application in downstream tasks with lengthy inputs. Recent studies have sought to extend LLMs' context window by modifying rotary position embedding (RoPE), a popular position encoding method adopted by well-known LLMs such as LLaMA, PaLM, and GPT-NeoX. However, prior works like Position Interpolation (PI) and YaRN are resource-intensive and lack comparative experiments to assess their applicability. In this work, we identify the inherent need for LLMs' attention entropy (i.e. the information entropy of attention scores) to maintain stability and introduce a novel extension to RoPE which combines adjusting RoPE's base frequency and scaling the attention logits to help LLMs efficiently adapt to a larger context window. We validate the superiority of our method in both fine-tuning performance and robustness across different context window sizes on various context-demanding tasks. Notably, our method extends the context window of LLaMA-2-7B-Chat to 16,384 with only 100 samples and 6 training steps, showcasing extraordinary efficiency. Finally, we also explore how data compositions and training curricula affect context window extension for specific downstream tasks, suggesting fine-tuning LLMs with lengthy conversations as a good starting point. We release our code and SFT data at https://github.com/GAIR-NLP/Entropy-ABF.",
    "authors": [
        "Yikai Zhang",
        "Junlong Li",
        "Pengfei Liu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel extension to RoPE is introduced which combines adjusting RoPE's base frequency and scaling the attention logits to help LLMs efficiently adapt to a larger context window and validate the superiority of the method in both fine-tuning performance and robustness across different context window sizes on various context-demanding tasks."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}