{
    "acronym": "0609513205d94646c740fc219e79b01043e80ba6",
    "title": "Domain-Agnostic Mutual Prompting for Unsupervised Domain Adaptation",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "0609513205d94646c740fc219e79b01043e80ba6",
    "abstract": "Conventional Unsupervised Domain Adaptation (UDA) strives to minimize distribution discrepancy between domains, which neglects to harness rich semantics from data and struggles to handle complex domain shifts. A promising technique is to leverage the knowledge of large-scale pre-trained vision-language models for more guided adaptation. Despite some endeavors, current methods often learn textual prompts to embed domain semantics for source and target domains separately and perform classification within each domain, limiting cross-domain knowledge transfer. Moreover, prompting only the language branch lacks flexibility to adapt both modalities dynamically. To bridge this gap, we propose Domain-Agnostic Mutual Prompting (DAMP) to exploit domain-invariant semantics by mutually aligning visual and textual embeddings. Specifically, the image contextual information is utilized to prompt the language branch in a domain-agnostic and instance-conditioned way. Meanwhile, visual prompts are imposed based on the domain-agnostic textual prompt to elicit domain-invariant visual embeddings. These two branches of prompts are learned mutually with a cross-attention module and regularized with a semantic-consistency loss and an instance-discrimination contrastive loss. Experiments on three UDA benchmarks demonstrate the superiority of DAMP over state-of-the-art approaches.",
    "authors": [
        "Zhekai Du",
        "Xinyao Li",
        "Fengling Li",
        "Ke Lu",
        "Lei Zhu",
        "Jingjing Li"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Domain-Agnostic Mutual Prompting (DAMP) is proposed to exploit domain-invariant semantics by mutually aligning visual and textual embeddings and demonstrates the superiority of DAMP over state-of-the-art approaches."
    },
    "citationCount": 3,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}