{
    "acronym": "060cee8411181e8151ab1e3212b81528accd9b8b",
    "title": "On Transforming Reinforcement Learning With Transformers: The Development Trajectory.",
    "seed_ids": [
        "transformerxl",
        "compressivetransformer",
        "860bc4f071f35d6d8529a52c2c1858d030779a6a",
        "60c8d0619481eaafdd1189af610d0e636271fed5",
        "235303a8bc1e4892efd525a38ead657422d8a519",
        "32c9b3859086d15184989454eb878638659e64c6",
        "56bc06be82c087348e638506174fa99956ef666c",
        "96ba2f6c3c7b090cfd5c16e0840d3ae3d88cad83",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "86589b6286ef3c55b8b4fccfb41a3b30b7afdf61",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "1a703f08da01cf737cce3fb9064259b3f4b44e9c",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "f51497f463566581874c941353dd9d80069c5b77",
        "59a916cdc943f0282908e6f3fa0360f4c5fb78d0",
        "104f75283ae9027eb478e7984bd26b680277ce6f",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "060cee8411181e8151ab1e3212b81528accd9b8b",
    "abstract": "Transformers, originally devised for natural language processing (NLP), have also produced significant successes in computer vision (CV). Due to their strong expression power, researchers are investigating ways to deploy transformers for reinforcement learning (RL), and transformer-based models have manifested their potential in representative RL benchmarks. In this paper, we collect and dissect recent advances concerning the transformation of RL with transformers (transformer-based RL (TRL)) to explore the development trajectory and future trends of this field. We group the existing developments into two categories: architecture enhancements and trajectory optimizations, and examine the main applications of TRL in robotic manipulation, text-based games (TBGs), navigation, and autonomous driving. Architecture enhancement methods consider how to apply the powerful transformer structure to RL problems under the traditional RL framework, facilitating more precise modeling of agents and environments compared to traditional deep RL techniques. However, these methods are still limited by the inherent defects of traditional RL algorithms, such as bootstrapping and the \"deadly triad\". Trajectory optimization methods treat RL problems as sequence modeling problems and train a joint state-action model over entire trajectories under the behavior cloning framework; such approaches are able to extract policies from static datasets and fully use the long-sequence modeling capabilities of transformers. Given these advancements, the limitations and challenges in TRL are reviewed and proposals regarding future research directions are discussed. We hope that this survey can provide a detailed introduction to TRL and motivate future research in this rapidly developing field.",
    "authors": [
        "Shengchao Hu",
        "Li Shen",
        "Ya Zhang",
        "Yixin Chen",
        "Dacheng Tao"
    ],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey collects and dissects recent advances concerning the transformation of RL with transformers (transformer-based RL (TRL), and examines the main applications of TRL in robotic manipulation, text-based games (TBGs), navigation, and autonomous driving."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}