{
    "acronym": "0627b70bf4c2f9694d8ce72f2f87cc7ffb9b276a",
    "title": "Strictly-ID-Preserved and Controllable Accessory Advertising Image Generation",
    "seed_ids": [
        "classfreediffu",
        "00b167a24f57f96294a4581bb185a57b0a4af365",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "0627b70bf4c2f9694d8ce72f2f87cc7ffb9b276a",
    "abstract": "Customized generative text-to-image models have the ability to produce images that closely resemble a given subject. However, in the context of generating advertising images for e-commerce scenarios, it is crucial that the generated subject's identity aligns perfectly with the product being advertised. In order to address the need for strictly-ID preserved advertising image generation, we have developed a Control-Net based customized image generation pipeline and have taken earring model advertising as an example. Our approach facilitates a seamless interaction between the earrings and the model's face, while ensuring that the identity of the earrings remains intact. Furthermore, to achieve a diverse and controllable display, we have proposed a multi-branch cross-attention architecture, which allows for control over the scale, pose, and appearance of the model, going beyond the limitations of text prompts. Our method manages to achieve fine-grained control of the generated model's face, resulting in controllable and captivating advertising effects.",
    "authors": [
        "Youze Xue",
        "Binghui Chen",
        "Yifeng Geng",
        "Xuansong Xie",
        "Jiansheng Chen",
        "Hongbing Ma"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work has developed a Control-Net based customized image generation pipeline and taken earring model advertising as an example, and proposed a multi-branch cross-attention architecture, which allows for control over the scale, pose, and appearance of the model, going beyond the limitations of text prompts."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}