{
    "acronym": "06353b9112ab14c26ce9d3c851c01ebe4b798177",
    "title": "TimeMixer: Decomposable Multiscale Mixing for Time Series Forecasting",
    "seed_ids": [
        "transformer",
        "016e99ccef0afb7011f3ea3b1b932611c8fb957b",
        "defecf3dc299214f4cb76a093c6eed2297eaa46f",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "30dcc0e191a376fea0e7a46f94c53872c029efc9",
        "f7890aaf985b001e9226da375f8c2289a323db90"
    ],
    "s2id": "06353b9112ab14c26ce9d3c851c01ebe4b798177",
    "abstract": "Time series forecasting is widely used in extensive applications, such as traffic planning and weather forecasting. However, real-world time series usually present intricate temporal variations, making forecasting extremely challenging. Going beyond the mainstream paradigms of plain decomposition and multiperiodicity analysis, we analyze temporal variations in a novel view of multiscale-mixing, which is based on an intuitive but important observation that time series present distinct patterns in different sampling scales. The microscopic and the macroscopic information are reflected in fine and coarse scales respectively, and thereby complex variations can be inherently disentangled. Based on this observation, we propose TimeMixer as a fully MLP-based architecture with Past-Decomposable-Mixing (PDM) and Future-Multipredictor-Mixing (FMM) blocks to take full advantage of disentangled multiscale series in both past extraction and future prediction phases. Concretely, PDM applies the decomposition to multiscale series and further mixes the decomposed seasonal and trend components in fine-to-coarse and coarse-to-fine directions separately, which successively aggregates the microscopic seasonal and macroscopic trend information. FMM further ensembles multiple predictors to utilize complementary forecasting capabilities in multiscale observations. Consequently, TimeMixer is able to achieve consistent state-of-the-art performances in both long-term and short-term forecasting tasks with favorable run-time efficiency.",
    "authors": [
        "Shiyu Wang",
        "Haixu Wu",
        "X. Shi",
        "Tengge Hu",
        "Huakun Luo",
        "Lintao Ma",
        "James Y. Zhang",
        "Jun Zhou"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes TimeMixer as a fully MLP-based architecture with Past-Decomposable-Mixing (PDM) and Future-Multipredictor-Mixing (FMM) blocks to take full advantage of disentangled multiscale series in both past extraction and future prediction phases."
    },
    "citationCount": 14,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}