{
    "acronym": "06672b8e16bf9b36300422fafddc7b548592e602",
    "title": "DT-SV: A Transformer-based Time-domain Approach for Speaker Verification",
    "seed_ids": [
        "transformerxl",
        "094563ac46d95a3d0c661e8c8761a2de103b8221"
    ],
    "s2id": "06672b8e16bf9b36300422fafddc7b548592e602",
    "abstract": "Speaker verification (SV) aims to determine whether the speaker's identity of a test utterance is the same as the reference speech. In the past few years, extracting speaker embeddings using deep neural networks for SV systems has gone mainstream. Recently, different attention mechanisms and Transformer networks have been explored widely in SV fields. However, utilizing the original Transformer in SV directly may have frame-level information waste on output features, which could lead to restrictions on capacity and discrimination of speaker embeddings. Therefore, we propose an approach to derive utterance-level speaker embeddings via a Transformer architecture that uses a novel loss function named diffluence loss to integrate the feature information of different Transformer layers. Therein, the diffluence loss aims to aggregate frame-level features into an utterance-level representation, and it could be integrated into the Transformer expediently. Besides, we also introduce a learnable mel-fbank energy feature extractor named time-domain feature extractor that computes the mel-fbank features more precisely and efficiently than the standard mel-fbank extractor. Combining Diffluence loss and Time-domain feature extractor, we propose a novel Transformer-based time-domain SV model (DT-SV) with faster training speed and higher accuracy. Experiments indicate that our proposed model can achieve better performance in comparison with other models.",
    "authors": [
        "Nan Zhang",
        "Jianzong Wang",
        "Zhenhou Hong",
        "Chendong Zhao",
        "Xiaoyang Qu",
        "Jing Xiao"
    ],
    "venue": "IEEE International Joint Conference on Neural Network",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel Transformer-based time-domain SV model with faster training speed and higher accuracy is proposed (DT-SV), and experiments indicate that the proposed model can achieve better performance in comparison with other models."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}