{
    "acronym": "066a9da13badca3791832f50f47103f31d681189",
    "title": "On “Scientific Debt” in NLP: A Case for More Rigour in Language Model Pre-Training Research",
    "seed_ids": [
        "gpt",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "b21670e8061a06ab97e7d6052c9345a326e84ff8",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "fd1b829261ba04bb92e0ab60c4f6e7cea0d99fbf",
        "981dbdf6f87f13f3f3047a925c519fc39a35202b",
        "2fd10e095b146f99da8cdc6ff58720e2e8fca36d",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "d9f1eed347959149f27002485a7fe339604fe45d",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "066a9da13badca3791832f50f47103f31d681189",
    "abstract": "This evidence-based position paper critiques current research practices within the language model pre-training literature. Despite rapid recent progress afforded by increasingly better pre-trained language models (PLMs), current PLM research practices often conflate different possible sources of model improvement, without conducting proper ablation studies and principled comparisons between different models under comparable conditions. These practices (i) leave us ill-equipped to understand which pre-training approaches should be used under what circumstances; (ii) impede reproducibility and credit assignment; and (iii) render it difficult to understand: “How exactly does each factor contribute to the progress that we have today?” We provide a case in point by revisiting the success of BERT over its baselines, ELMo and GPT-1, and demonstrate how — under comparable conditions where the baselines are tuned to a similar extent — these baselines (and even-simpler variants thereof) can, in fact, achieve competitive or better performance than BERT. These findings demonstrate how disentangling different factors of model improvements can lead to valuable new insights. We conclude with recommendations for how to encourage and incentivize this line of work, and accelerate progress towards a better and more systematic understanding of what factors drive the progress of our foundation models today.",
    "authors": [
        "Made Nindyatama Nityasya",
        "Haryo Akbarianto Wibowo",
        "Alham Fikri Aji",
        "Genta Indra Winata",
        "Radityo Eko Prasojo",
        "Phil Blunsom",
        "A. Kuncoro"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated how disentangling different factors of model improvements can lead to valuable new insights by revisiting the success of BERT over its baselines, ELMo and GPT-1, and how these baselines can, in fact, achieve competitive or better performance than BERT."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}