{
    "acronym": "067906c924810e8ffc595ff8c9c4b0b2906cca85",
    "title": "SJTU-NICT’s Supervised and Unsupervised Neural Machine Translation Systems for the WMT20 News Translation Task",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "1614aaae6713aa18116b140f78bbcfca07a78c98",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc"
    ],
    "s2id": "067906c924810e8ffc595ff8c9c4b0b2906cca85",
    "abstract": "In this paper, we introduced our joint team SJTU-NICT ‘s participation in the WMT 2020 machine translation shared task. In this shared task, we participated in four translation directions of three language pairs: English-Chinese, English-Polish on supervised machine translation track, German-Upper Sorbian on low-resource and unsupervised machine translation tracks. Based on different conditions of language pairs, we have experimented with diverse neural machine translation (NMT) techniques: document-enhanced NMT, XLM pre-trained language model enhanced NMT, bidirectional translation as a pre-training, reference language based UNMT, data-dependent gaussian prior objective, and BT-BLEU collaborative filtering self-training. We also used the TF-IDF algorithm to filter the training set to obtain a domain more similar set with the test set for finetuning. In our submissions, the primary systems won the first place on English to Chinese, Polish to English, and German to Upper Sorbian translation directions.",
    "authors": [
        "Z. Li",
        "Hai Zhao",
        "Rui Wang",
        "Kehai Chen",
        "M. Utiyama",
        "E. Sumita"
    ],
    "venue": "Conference on Machine Translation",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduced the joint team SJTU-NICT’s participation in the WMT 2020 machine translation shared task and used the TF-IDF algorithm to filter the training set to obtain a domain more similar set with the test set for finetuning."
    },
    "citationCount": 14,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}