{
    "acronym": "069e0d896da7c79faeee4cf057548d5da7ce885e",
    "title": "FlauBERT: Unsupervised Language Model Pre-training for French",
    "seed_ids": [
        "gpt",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "5a3749929bf5fb8b1f98a7b2a43c3b957bcf6c88",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc"
    ],
    "s2id": "069e0d896da7c79faeee4cf057548d5da7ce885e",
    "abstract": "Language models have become a key step to achieve state-of-the art results in many different Natural Language Processing (NLP) tasks. Leveraging the huge amount of unlabeled texts nowadays available, they provide an efficient way to pre-train continuous word representations that can be fine-tuned for a downstream task, along with their contextualization at the sentence level. This has been widely demonstrated for English using contextualized representations (Dai and Le, 2015; Peters et al., 2018; Howard and Ruder, 2018; Radford et al., 2018; Devlin et al., 2019; Yang et al., 2019b). In this paper, we introduce and share FlauBERT, a model learned on a very large and heterogeneous French corpus. Models of different sizes are trained using the new CNRS (French National Centre for Scientific Research) Jean Zay supercomputer. We apply our French language models to diverse NLP tasks (text classification, paraphrasing, natural language inference, parsing, word sense disambiguation) and show that most of the time they outperform other pre-training approaches. Different versions of FlauBERT as well as a unified evaluation protocol for the downstream tasks, called FLUE (French Language Understanding Evaluation), are shared to the research community for further reproducible experiments in French NLP.",
    "authors": [
        "Hang Le",
        "Loïc Vial",
        "Jibril Frej",
        "Vincent Segonne",
        "Maximin Coavoux",
        "B. Lecouteux",
        "A. Allauzen",
        "Benoit Crabb'e",
        "L. Besacier",
        "D. Schwab"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces and shares FlauBERT, a model learned on a very large and heterogeneous French corpus and applies it to diverse NLP tasks and shows that most of the time they outperform other pre-training approaches."
    },
    "citationCount": 359,
    "influentialCitationCount": 41,
    "code": null,
    "description": null,
    "url": null
}