{
    "acronym": "06a8f2e3c4266196b008851f1ec7ef9f340809da",
    "title": "Advancing Regular Language Reasoning in Linear Recurrent Neural Networks",
    "seed_ids": [
        "dssm",
        "liquids4",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "f393aff1593c2d370ec0ae004910d18e40524967",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "c6d38add1b7bbc10f0da37a90e3f1b51ee5fb617",
        "a30ac45ac5b7bd2148d3fb80ee7f3c29724e3170",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "06a8f2e3c4266196b008851f1ec7ef9f340809da",
    "abstract": "In recent studies, linear recurrent neural networks (LRNNs) have achieved Transformer-level performance in natural language and long-range modeling, while offering rapid parallel training and constant inference cost. With the resurgence of interest in LRNNs, we study whether they can learn the hidden rules in training sequences, such as the grammatical structures of regular language. We theoretically analyze some existing LRNNs and discover their limitations in modeling regular language. Motivated by this analysis, we propose a new LRNN equipped with a block-diagonal and input-dependent transition matrix. Experiments suggest that the proposed model is the only LRNN capable of performing length extrapolation on regular language tasks such as Sum, Even Pair, and Modular Arithmetic. The code is released at https://github.com/tinghanf/RegluarLRNN.",
    "authors": [
        "Ting-Han Fan",
        "Ta-Chung Chi",
        "Alexander I. Rudnicky"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a new LRNN equipped with a block-diagonal and input-dependent transition matrix and suggests that the proposed model is the only LRNN capable of performing length extrapolation on regular language tasks such as Sum, Even Pair, and Modular Arithmetic."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}