{
    "acronym": "06edda0310b4ec7c5012d012349252a3a77521b6",
    "title": "Prompt-Augmented Linear Probing: Scaling Beyond The Limit of Few-shot In-Context Learners",
    "seed_ids": [
        "gpt2",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "319b84be7a843250bc81d7086f79a4126d550277",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "06edda0310b4ec7c5012d012349252a3a77521b6",
    "abstract": "Through in-context learning (ICL), large-scale language models are effective few-shot learners without additional model fine-tuning. However, the ICL performance does not scale well with the number of available training sample as it is limited by the inherent input length constraint of the underlying language model. Meanwhile, many studies have revealed that language models are also powerful feature extractors, allowing them to be utilized in a black-box manner and enabling the linear probing paradigm, where lightweight discriminators are trained on top of the pre-extracted input representations. This paper proposes prompt-augmented linear probing (PALP), a hybrid of linear probing and ICL, which leverages the best of both worlds. PALP inherits the scalability of linear probing and the capability of enforcing language models to derive more meaningful representations via tailoring input into a more conceivable form. Throughout in-depth investigations on various datasets, we verified that PALP significantly closes the gap between ICL in the data-hungry scenario and fine-tuning in the data-abundant scenario with little training overhead, potentially making PALP a strong alternative in a black-box scenario.",
    "authors": [
        "Hyunsoo Cho",
        "Hyuhng Joon Kim",
        "Junyeob Kim",
        "Sang-Woo Lee",
        "Sang-goo Lee",
        "Kang Min Yoo",
        "Taeuk Kim"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 14,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}