{
    "acronym": "0702ac9db3ea20810ffdb9f35bde85cdfaf27a3d",
    "title": "Learning Long Range Dependencies on Graphs via Random Walks",
    "seed_ids": [
        "transformer",
        "mamba",
        "2dda6da7375bf5e8bcf60f87b17ba10757f3bc57",
        "1df04f33a8ef313cc2067147dbb79c3ca7c5c99f",
        "38c48a1cd296d16dc9c56717495d6e44cc354444",
        "59b7448f816908cfb49a2ab5e63b2fa5786387f7",
        "277dd73bfeb5c46513ce305136b0e71fcd2a311c",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4"
    ],
    "s2id": "0702ac9db3ea20810ffdb9f35bde85cdfaf27a3d",
    "abstract": "Message-passing graph neural networks (GNNs), while excelling at capturing local relationships, often struggle with long-range dependencies on graphs. Conversely, graph transformers (GTs) enable information exchange between all nodes but oversimplify the graph structure by treating them as a set of fixed-length vectors. This work proposes a novel architecture, NeuralWalker, that overcomes the limitations of both methods by combining random walks with message passing. NeuralWalker achieves this by treating random walks as sequences, allowing for the application of recent advances in sequence models in order to capture long-range dependencies within these walks. Based on this concept, we propose a framework that offers (1) more expressive graph representations through random walk sequences, (2) the ability to utilize any sequence model for capturing long-range dependencies, and (3) the flexibility by integrating various GNN and GT architectures. Our experimental evaluations demonstrate that NeuralWalker achieves significant performance improvements on 19 graph and node benchmark datasets, notably outperforming existing methods by up to 13% on the PascalVoc-SP and COCO-SP datasets. Code is available at https://github.com/BorgwardtLab/NeuralWalker.",
    "authors": [
        "Dexiong Chen",
        "Till Hendrik Schulz",
        "Karsten Borgwardt"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel architecture, NeuralWalker, that overcomes the limitations of both GNN and GT methods by combining random walks with message passing, and achieves significant performance improvements on 19 graph and node benchmark datasets."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}