{
    "acronym": "071e0191ddabcddb59669f68bf57bfc0f7f234db",
    "title": "In Tree Structure Should Sentence Be Generated",
    "seed_ids": [
        "bert",
        "c0b52e2eb308d1b823af3582956d246e47899be5",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280"
    ],
    "s2id": "071e0191ddabcddb59669f68bf57bfc0f7f234db",
    "abstract": "Generative models reliant on sequential autoregression have been at the forefront of language generation for an extensive period, particularly following the introduction of widely acclaimed transformers. Despite its excellent performance, there are always some issues that we face today. For example, problems such as hallucinations and getting trapped in a logic loop may occur. To enhance the performance of existing systems, this paper introduces a new method for generating sequences in natural language, which involves generating the targeted sentence in a tree-traversing order. The paper includes an illustration of the theoretical basis and validity of the approach, as well as a comparison of its fundamentals with the diffusion model in graphic generation. Finally, a module called SenTree is introduced for generating an approximating binary tree. It is already available at https://github.com/arklyg/sentree. Additionally, a joint training framework based on this approach is proposed, incorporating the intrinsics of generative adversarial networks.",
    "authors": [
        "Yaguang Li",
        "Xin Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new method for generating sequences in natural language, which involves generating the targeted sentence in a tree-traversing order, and a joint training framework based on this approach is proposed, incorporating the intrinsics of generative adversarial networks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}