{
    "acronym": "07fa8c8a703abd7496f4781e9dee53d5de9c8717",
    "title": "Neural Shufﬂe-Exchange Networks − Sequence Processing in O( n log n ) Time",
    "seed_ids": [
        "universaltrans",
        "2a31319e73d4486716168b65cdf7559baeda18ce"
    ],
    "s2id": "07fa8c8a703abd7496f4781e9dee53d5de9c8717",
    "abstract": "A key requirement in sequence to sequence processing is the modeling of long range dependencies. To this end, a vast majority of the state-of-the-art models use attention mechanism which is of O( n 2 ) complexity that leads to slow execution for long sequences. We introduce a new Shufﬂe-Exchange neural network model for sequence to sequence tasks which have O(log n ) depth and O( n log n ) total complexity. We show that this model is powerful enough to infer efﬁcient algorithms for common algorithmic benchmarks including sorting, addition and multiplication. We evaluate our architecture on the challenging LAMBADA question answering dataset and compare it with the state-of-the-art models which use attention. Our model achieves competitive accuracy and scales to sequences with more than a hundred thousand of elements. We are conﬁdent that the proposed model has the potential for building more efﬁcient architectures for processing large interrelated data in language modeling, music generation and other application domains.",
    "authors": [
        "Kārlis Freivalds",
        "Emils Ozolins",
        "A. Sostaks"
    ],
    "venue": "",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new Shufﬂe-Exchange neural network model for sequence to sequence tasks which have O(log n ) depth and O( n log n ) total complexity is introduced and it is shown that this model is powerful enough to infer efﬁcient algorithms for common algorithmic benchmarks including sorting, addition and multiplication."
    },
    "citationCount": 20,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}