{
    "acronym": "0809c278fcdec2ce297da3a9d6e031fc192263f6",
    "title": "User-friendly Image Editing with Minimal Text Input: Leveraging Captioning and Injection Techniques",
    "seed_ids": [
        "classfreediffu",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "0809c278fcdec2ce297da3a9d6e031fc192263f6",
    "abstract": "Recent text-driven image editing in diffusion models has shown remarkable success. However, the existing methods assume that the user's description sufficiently grounds the contexts in the source image, such as objects, background, style, and their relations. This assumption is unsuitable for real-world applications because users have to manually engineer text prompts to find optimal descriptions for different images. From the users' standpoint, prompt engineering is a labor-intensive process, and users prefer to provide a target word for editing instead of a full sentence. To address this problem, we first demonstrate the importance of a detailed text description of the source image, by dividing prompts into three categories based on the level of semantic details. Then, we propose simple yet effective methods by combining prompt generation frameworks, thereby making the prompt engineering process more user-friendly. Extensive qualitative and quantitative experiments demonstrate the importance of prompts in text-driven image editing and our method is comparable to ground-truth prompts.",
    "authors": [
        "Sunwoo Kim",
        "Wooseok Jang",
        "Hyunsung Kim",
        "Junho Kim",
        "Yunjey Choi",
        "Seung Wook Kim",
        "Gayeong Lee"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work demonstrates the importance of a detailed text description of the source image, by dividing prompts into three categories based on the level of semantic details, and proposes simple yet effective methods by combining prompt generation frameworks, thereby making the prompt engineering process more user-friendly."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}