{
    "acronym": "085d1dbae0159686503269d56fb2fc1091373355",
    "title": "LIDAO: Towards Limited Interventions for Debiasing (Large) Language Models",
    "seed_ids": [
        "gpt2",
        "c1043ea52f602764b5b863d082ef81995f2adff5",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "812867453701f0929579e481bd15dfb0ebee1d7e",
        "473e55ded26b201b834ae73966474299528ec48d",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "5d22b241836e30d5b0d852b463951ab7e3245ea4",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "085d1dbae0159686503269d56fb2fc1091373355",
    "abstract": "Large language models (LLMs) have achieved impressive performance on various natural language generation tasks. Nonetheless, they suffer from generating negative and harmful contents that are biased against certain demographic groups (e.g., female), raising severe fairness concerns. As remedies, prior works intervened the generation by removing attitude or demographic information, inevitably degrading the generation quality and resulting in notable \\textit{fairness-fluency} trade-offs. However, it is still under-explored to what extent the fluency \\textit{has to} be affected in order to achieve a desired level of fairness. In this work, we conduct the first formal study from an information-theoretic perspective. We show that previous approaches are excessive for debiasing and propose LIDAO, a general framework to debias a (L)LM at a better fluency provably. We further robustify LIDAO in adversarial scenarios, where a carefully-crafted prompt may stimulate LLMs exhibiting instruction-following abilities to generate texts with fairness issue appears only when the prompt is also taken into account. Experiments on three LMs ranging from 0.7B to 7B parameters demonstrate the superiority of our method.",
    "authors": [
        "Tianci Liu",
        "Haoyu Wang",
        "Shiyang Wang",
        "Yu Cheng",
        "Jing Gao"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work shows that previous approaches are excessive for debiasing and proposes LIDAO, a general framework to debias a (L)LM at a better fluency provably and robustify LIDAO in adversarial scenarios, where a carefully-crafted prompt may stimulate LLMs exhibiting instruction-following abilities to generate texts with fairness issue appears only when the prompt is also taken into account."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}