{
    "acronym": "0862b15cbcd407ad0f4e696edb8da07e0af09699",
    "title": "Chinese Fine‐Grained Geological Named Entity Recognition With Rules and FLAT",
    "seed_ids": [
        "transformerxl"
    ],
    "s2id": "0862b15cbcd407ad0f4e696edb8da07e0af09699",
    "abstract": "Geological named entity recognition (NER) is an essential prerequisite to realizing geological information extraction and information retrieval and is an actual means for accomplishing structured reconstruction of unstructured geological data. Existing geological NER methods mainly focus on coarse‐grained geological entity recognition, but geological entities are fine‐grained. To solve this problem, a Chinese fine‐grained geological entity corpus encompassing 21 types of fine‐grained labels is constructed. In addition, in this article, a fine‐grained geological entity recognition model based on Bidirectional Encoder Representations from Transformer (BERT)‐Flat‐Lattice Transformer is designed. This paper names this method FGNER (Fine‐grained Geological Named Entity Recognition) which adds geological naming rules to revise the model results to improve the recognition of complex geological entities. The fine‐grained geological entity recognition method is evaluated using regional geological literature reports as experimental data. The experimental results show that the precision, recall, and F1‐score of the FGNER model are 95.73%, 89.26%, and 92.05%, respectively, thus achieving better performance than baseline models, such as BERT‐Conditional Random Field.",
    "authors": [
        "Siying Chen",
        "Weihua Hua",
        "Xiuguo Liu",
        "Xiaotong Deng",
        "Xinling Zeng",
        "Jianchao Duan"
    ],
    "venue": "Earth and Space Science",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The method FGNER (Fine‐grained Geological Named Entity Recognition), which adds geological naming rules to revise the model results to improve the recognition of complex geological entities, achieves better performance than baseline models, such as BERT‐Conditional Random Field."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}