{
    "acronym": "08652b56be3d445b07f3d382d89b994d198dda8a",
    "title": "DESED: Dialogue-based Explanation for Sentence-level Event Detection",
    "seed_ids": [
        "gpt",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "08652b56be3d445b07f3d382d89b994d198dda8a",
    "abstract": "Many recent sentence-level event detection efforts focus on enriching sentence semantics, e.g., via multi-task or prompt-based learning. Despite the promising performance, these methods commonly depend on label-extensive manual annotations or require domain expertise to design sophisticated templates and rules. This paper proposes a new paradigm, named dialogue-based explanation, to enhance sentence semantics for event detection. By saying dialogue-based explanation of an event, we mean explaining it through a consistent information-intensive dialogue, with the original event description as the start utterance. We propose three simple dialogue generation methods, whose outputs are then fed into a hybrid attention mechanism to characterize the complementary event semantics. Extensive experimental results on two event detection datasets verify the effectiveness of our method and suggest promising research opportunities in the dialogue-based explanation paradigm.",
    "authors": [
        "Yinyi Wei",
        "Shuaipeng Liu",
        "Jianwei Lv",
        "Xiangyu Xi",
        "Hailei Yan",
        "Wei Ye",
        "Tong Mo",
        "Fan Yang",
        "Guanglu Wan"
    ],
    "venue": "International Conference on Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a new paradigm, named dialogue-based explanation, to enhance sentence semantics for event detection, by explaining it through a consistent information-intensive dialogue, with the original event description as the start utterance."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}