{
    "acronym": "0888b965a1d9f9264fb54d91193341315aa2fb69",
    "title": "Multivariate Time Series Forecasting: A Review",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "0888b965a1d9f9264fb54d91193341315aa2fb69",
    "abstract": "Multivariate time series forecasting is a critical task with applications across various domains, including finance, energy demand, and climate modeling. This review paper, provides a comprehensive overview of methodologies and advancements in multivariate time series forecasting, focusing on deep learning architectures, ensemble methods, and modeling techniques. Traditional approaches such as recurrent neural networks (RNNs) and convolutional neural networks (CNNs) have paved the way for modeling sequential data, but challenges remain in capturing long-term dependencies. Recent advancements in transformer-based architectures and graph neural networks (GNNs) have addressed these challenges, offering enhanced accuracy and interpretability. Ensemble methods, leveraging the strengths of multiple models, have emerged as effective strategies for improving forecast robustness. The review discusses key methodologies, including hybrid models, attention mechanisms, and deep learning architectures, highlighting their strengths and limitations. Through interdisciplinary collaboration and methodological innovation, researchers can address complex forecasting problems, ultimately benefiting society across a wide range of applications.",
    "authors": [
        "Kasun Mendis",
        "Manjusri Wickramasinghe",
        "Pasindu Marasinghe"
    ],
    "venue": "CVIPPR",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This review paper, provides a comprehensive overview of methodologies and advancements in multivariate time series forecasting, focusing on deep learning architectures, ensemble methods, and modeling techniques."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}