{
    "acronym": "08ec1848527cd46e34b04ff401b01785cf04e935",
    "title": "Eye Gaze and Self-attention: How Humans and Transformers Attend Words in Sentences",
    "seed_ids": [
        "bigbird",
        "transformerxl",
        "6e8f35c6d54acb14109c9b792a62609eac8a7b5e",
        "97a531f96a8d9a4c1d379637daf7dcc714db1b35",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "08ec1848527cd46e34b04ff401b01785cf04e935",
    "abstract": "Attention describes cognitive processes that are important to many human phenomena including reading. The term is also used to describe the way in which transformer neural networks perform natural language processing. While attention appears to be very different under these two contexts, this paper presents an analysis of the correlations between transformer attention and overt human attention during reading tasks. An extensive analysis of human eye tracking datasets showed that the dwell times of human eye movements were strongly correlated with the attention patterns occurring in the early layers of pre-trained transformers such as BERT. Additionally, the strength of a correlation was not related to the number of parameters within a transformer. This suggests that something about the transformers’ architecture determined how closely the two measures were correlated.",
    "authors": [
        "Joshua Bensemann",
        "A. Peng",
        "Diana Benavides Prado",
        "Yang Chen",
        "N. Tan",
        "P. Corballis",
        "Patricia Riddle",
        "Michael Witbrock"
    ],
    "venue": "Workshop on Cognitive Modeling and Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An analysis of the correlations between transformer attention and overt human attention during reading tasks showed that the dwell times of human eye movements were strongly correlated with the attention patterns occurring in the early layers of pre-trained transformers such as BERT."
    },
    "citationCount": 10,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}