{
    "acronym": "098639fc538cf726197dbf7ee111884fb981be01",
    "title": "Beyond Gait: Learning Knee Angle for Seamless Prosthesis Control in Multiple Scenarios",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "098639fc538cf726197dbf7ee111884fb981be01",
    "abstract": "Deep learning models have become a powerful tool in knee angle estimation for lower limb prostheses, owing to their adaptability across various gait phases and locomotion modes. Current methods utilize Multi-Layer Perceptrons (MLP), Long-Short Term Memory Networks (LSTM), and Convolutional Neural Networks (CNN), predominantly analyzing motion information from the thigh. Contrary to these approaches, our study introduces a holistic perspective by integrating whole-body movements as inputs. We propose a transformer-based probabilistic framework, termed the Angle Estimation Probabilistic Model (AEPM), that offers precise angle estimations across extensive scenarios beyond walking. AEPM achieves an overall RMSE of 6.70 degrees, with an RMSE of 3.45 degrees in walking scenarios. Compared to the state of the art, AEPM has improved the prediction accuracy for walking by 11.31%. Our method can achieve seamless adaptation between different locomotion modes. Also, this model can be utilized to analyze the synergy between the knee and other joints. We reveal that the whole body movement has valuable information for knee movement, which can provide insights into designing sensors for prostheses. The code is available at https://github.com/penway/Beyond-Gait-AEPM.",
    "authors": [
        "Pengwei Wang",
        "Yilong Chen",
        "Wan Su",
        "Jie Wang",
        "Teng Ma",
        "Haoyong Yu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The whole body movement has valuable information for knee movement, which can provide insights into designing sensors for prostheses, and the transformer-based probabilistic framework AEPM is proposed, that offers precise angle estimations across extensive scenarios beyond walking."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}