{
    "acronym": "0a1580fc94cc075380986b62262fca298e320fb8",
    "title": "Justice as a Service",
    "seed_ids": [
        "gpt",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "0a1580fc94cc075380986b62262fca298e320fb8",
    "abstract": "In this paper we address an emerging service, called Justice as a Service (JaaS), that has been defined as an on-demand service, powered by tech, that challenges private and public companies by representing the consumer in their fight for justice/compensation based on laws, consumers’ rights, and contract of carriage. Indeed, in recent years we have witnessed the birth of several JaaS companies, that are devoted to a certain type of claim such as compensation for flight delay or cancellation, or refunds for late shipping.\nHowever, as we will discuss in the paper, we do believe that these are only the first generation of JaaS systems, i.e. the ones that solve easy problems. The advances in Natural Language Processing models such as the very recent GPT-3, together with the availability of suits data in electronic form, will soon allow the rise of more complex systems, able either to assist lawyers in the preparation of cases or to assist the end user in more involved legal issues.\nIn the paper, we discuss the technical and legal challenges of these new systems.",
    "authors": [
        "P. Fantozzi",
        "L. Laura",
        "A. Nuzzo",
        "Riccardo Piselli"
    ],
    "venue": "International Conference on Exploring Services Science",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper addresses an emerging service, called Justice as a Service (JaaS), that has been defined as an on-demand service, powered by tech, that challenges private and public companies by representing the consumer in their fight for justice/compensation based on laws, consumers’ rights, and contract of carriage."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}