{
    "acronym": "0a2daa6f864b62098fb0a4ab61ca76c8e799eaba",
    "title": "Learning Time-Invariant Representations for Individual Neurons from Population Dynamics",
    "seed_ids": [
        "gpt3"
    ],
    "s2id": "0a2daa6f864b62098fb0a4ab61ca76c8e799eaba",
    "abstract": "Neurons can display highly variable dynamics. While such variability presumably supports the wide range of behaviors generated by the organism, their gene expressions are relatively stable in the adult brain. This suggests that neuronal activity is a combination of its time-invariant identity and the inputs the neuron receives from the rest of the circuit. Here, we propose a self-supervised learning based method to assign time-invariant representations to individual neurons based on permutation-, and population size-invariant summary of population recordings. We fit dynamical models to neuronal activity to learn a representation by considering the activity of both the individual and the neighboring population. Our self-supervised approach and use of implicit representations enable robust inference against imperfections such as partial overlap of neurons across sessions, trial-to-trial variability, and limited availability of molecular (transcriptomic) labels for downstream supervised tasks. We demonstrate our method on a public multimodal dataset of mouse cortical neuronal activity and transcriptomic labels. We report>35% improvement in predicting the transcriptomic subclass identity and>20% improvement in predicting class identity with respect to the state-of-the-art.",
    "authors": [
        "Lu Mi",
        "Trung Le",
        "Tianxing He",
        "Eli Shlizerman",
        "U. Sümbül"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A self-supervised learning based method to assign time-invariant representations to individual neurons based on permutation-, and population size-invARIant summary of population recordings, and dynamical models to neuronal activity to learn a representation by considering the activity of both the individual and the neighboring population are proposed."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}