{
    "acronym": "0a6e71c671c50dc7e6c8ccd0e0b2f5e63801afed",
    "title": "Collaborative Neural Painting",
    "seed_ids": [
        "bert",
        "3ff7153fd6bd47d08084c7f50f8fd70026c126e7",
        "c57293882b2561e1ba03017902df9fc2f289dea2"
    ],
    "s2id": "0a6e71c671c50dc7e6c8ccd0e0b2f5e63801afed",
    "abstract": "The process of painting fosters creativity and rational planning. However, existing generative AI mostly focuses on producing visually pleasant artworks, without emphasizing the painting process. We introduce a novel task, Collaborative Neural Painting (CNP), to facilitate collaborative art painting generation between humans and machines. Given any number of user-input brushstrokes as the context or just the desired object class, CNP should produce a sequence of strokes supporting the completion of a coherent painting. Importantly, the process can be gradual and iterative, so allowing users' modifications at any phase until the completion. Moreover, we propose to solve this task using a painting representation based on a sequence of parametrized strokes, which makes it easy both editing and composition operations. These parametrized strokes are processed by a Transformer-based architecture with a novel attention mechanism to model the relationship between the input strokes and the strokes to complete. We also propose a new masking scheme to reflect the interactive nature of CNP and adopt diffusion models as the basic learning process for its effectiveness and diversity in the generative field. Finally, to develop and validate methods on the novel task, we introduce a new dataset of painted objects and an evaluation protocol to benchmark CNP both quantitatively and qualitatively. We demonstrate the effectiveness of our approach and the potential of the CNP task as a promising avenue for future research.",
    "authors": [
        "Nicola Dall’Asen",
        "Willi Menapace",
        "Elia Peruzzo",
        "E. Sangineto",
        "Yiming Wang",
        "Elisa Ricci"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a novel task, Collaborative Neural Painting (CNP), to facilitate collaborative art painting generation between humans and machines and proposes a painting representation based on a sequence of parametrized strokes, which makes it easy both editing and composition operations."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}