{
    "acronym": "0a898a2772c7c2941b83a737f1bef806710b047a",
    "title": "Evaluating multiple large language models in pediatric ophthalmology",
    "seed_ids": [
        "gpt",
        "576a3159d6c3f646d6fda6d047dfece4ea941fdd",
        "286756b2b02d6a7bc49a7ad66686f30831f26c25",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "6c761cfdb031701072582e434d8f64d436255da6",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "7a15950dc71079285a4eaf195de5aadd87c41b40",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "0a898a2772c7c2941b83a737f1bef806710b047a",
    "abstract": "IMPORTANCE The response effectiveness of different large language models (LLMs) and various individuals, including medical students, graduate students, and practicing physicians, in pediatric ophthalmology consultations, has not been clearly established yet. OBJECTIVE Design a 100-question exam based on pediatric ophthalmology to evaluate the performance of LLMs in highly specialized scenarios and compare them with the performance of medical students and physicians at different levels. DESIGN, SETTING, AND PARTICIPANTS This survey study assessed three LLMs, namely ChatGPT (GPT-3.5), GPT-4, and PaLM2, were assessed alongside three human cohorts: medical students, postgraduate students, and attending physicians, in their ability to answer questions related to pediatric ophthalmology. It was conducted by administering questionnaires in the form of test papers through the LLM network interface, with the valuable participation of volunteers. MAIN OUTCOMES AND MEASURES Mean scores of LLM and humans on 100 multiple-choice questions, as well as the answer stability, correlation, and response confidence of each LLM. RESULTS GPT-4 performed comparably to attending physicians, while ChatGPT (GPT-3.5) and PaLM2 outperformed medical students but slightly trailed behind postgraduate students. Furthermore, GPT-4 exhibited greater stability and confidence when responding to inquiries compared to ChatGPT (GPT-3.5) and PaLM2. CONCLUSIONS AND RELEVANCE Our results underscore the potential for LLMs to provide medical assistance in pediatric ophthalmology and suggest significant capacity to guide the education of medical students.",
    "authors": [
        "J. Holmes",
        "Rui Peng",
        "Yiwei Li",
        "Jinyu Hu",
        "Zheng Liu",
        "Zihao Wu",
        "Huan Zhao",
        "Xi Jiang",
        "Wei Liu",
        "Hong Wei",
        "Jie Zou",
        "Tianming Liu",
        "Yi Shao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results underscore the potential for LLMs to provide medical assistance in pediatric ophthalmology and suggest significant capacity to guide the education of medical students."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}