{
    "acronym": "0a90d5f56150eafd3ac88e4406b17496fedf529a",
    "title": "Look-back Decoding for Open-Ended Text Generation",
    "seed_ids": [
        "gpt2",
        "77ced33cba86b4d01fbfe6622c8f564c89d6a1b3",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "492a655a67e6ec7423a968cedb70eec0cdbc8e98",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "0a90d5f56150eafd3ac88e4406b17496fedf529a",
    "abstract": "Given a prefix (context), open-ended generation aims to decode texts that are coherent, which do not abruptly drift from previous topics, and informative, which do not suffer from undesired repetitions. In this paper, we propose Look-back, an improved decoding algorithm that leverages the Kullback-Leibler divergence to track the distribution distance between current and historical decoding steps. Thus Look-back can automatically predict potential repetitive phrase and topic drift, and remove tokens that may cause the failure modes, restricting the next token probability distribution within a plausible distance to the history. We perform decoding experiments on document continuation and story generation, and demonstrate that Look-back is able to generate more fluent and coherent text, outperforming other strong decoding methods significantly in both automatic and human evaluations.",
    "authors": [
        "Nan Xu",
        "Chunting Zhou",
        "Asli Celikyilmaz",
        "Xuezhe Ma"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Look-back, an improved decoding algorithm that leverages the Kullback-Leibler divergence to track the distribution distance between current and historical decoding steps, is proposed, which can automatically predict potential repetitive phrase and topic drift and remove tokens that may cause the failure modes."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}