{
    "acronym": "0ac39ef1352641533b01f07c42da0dcb8cdc81a9",
    "title": "Block Transformer: Global-to-Local Language Modeling for Fast Inference",
    "seed_ids": [
        "megabyte",
        "59f5ae64b4533ef62a883ad5b6b667a4157a1005",
        "3fd5bc3077d04965eaa3498372c39bbdd09d55e4",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "e586a4591ba0303b769f2c07cbddaf1899cb72e4",
        "412e266cddfd87c79087a88ba1e4d11b89a45a13",
        "594d8e1696619f3cebb7c6bffdad8e0a5592f006",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "bd44f34b47c8a4b6947695853fc2814ac69664a6",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "f51497f463566581874c941353dd9d80069c5b77",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad"
    ],
    "s2id": "0ac39ef1352641533b01f07c42da0dcb8cdc81a9",
    "abstract": "This paper presents the Block Transformer architecture which adopts hierarchical global-to-local modeling to autoregressive transformers to mitigate the inference bottlenecks of self-attention. To apply self-attention, the key-value (KV) cache of all previous sequences must be retrieved from memory at every decoding step. Thereby, this KV cache IO becomes a significant bottleneck in batch inference. We notice that these costs stem from applying self-attention on the global context, therefore we isolate the expensive bottlenecks of global modeling to lower layers and apply fast local modeling in upper layers. To mitigate the remaining costs in the lower layers, we aggregate input tokens into fixed size blocks and then apply self-attention at this coarse level. Context information is aggregated into a single embedding to enable upper layers to decode the next block of tokens, without global attention. Free of global attention bottlenecks, the upper layers can fully utilize the compute hardware to maximize inference throughput. By leveraging global and local modules, the Block Transformer architecture demonstrates 10-20x gains in inference throughput compared to vanilla transformers with equivalent perplexity. Our work introduces a new approach to optimize language model inference through novel application of global-to-local modeling. Code is available at https://github.com/itsnamgyu/block-transformer.",
    "authors": [
        "Namgyu Ho",
        "Sangmin Bae",
        "Taehyeon Kim",
        "Hyunjik Jo",
        "Yireun Kim",
        "Tal Schuster",
        "Adam Fisch",
        "James Thorne",
        "SeYoung Yun"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Block Transformer architecture is presented, which adopts hierarchical global-to-local modeling to autoregressive transformers to mitigate the inference bottlenecks of self-attention to optimize language model inference through novel application of global-to-local modeling."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}