{
    "acronym": "0ad942d11cec7aebddd69143b563ce2eccf063ab",
    "title": "L3Cube-HingCorpus and HingBERT: A Code Mixed Hindi-English Dataset and BERT Language Models",
    "seed_ids": [
        "gpt2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "0ad942d11cec7aebddd69143b563ce2eccf063ab",
    "abstract": "Code-switching occurs when more than one language is mixed in a given sentence or a conversation. This phenomenon is more prominent on social media platforms and its adoption is increasing over time. Therefore code-mixed NLP has been extensively studied in the literature. As pre-trained transformer-based architectures are gaining popularity, we observe that real code-mixing data are scarce to pre-train large language models. We present L3Cube-HingCorpus, the first large-scale real Hindi-English code mixed data in a Roman script. It consists of 52.93M sentences and 1.04B tokens, scraped from Twitter. We further present HingBERT, HingMBERT, HingRoBERTa, and HingGPT. The BERT models have been pre-trained on codemixed HingCorpus using masked language modelling objectives. We show the effectiveness of these BERT models on the subsequent downstream tasks like code-mixed sentiment analysis, POS tagging, NER, and LID from the GLUECoS benchmark. The HingGPT is a GPT2 based generative transformer model capable of generating full tweets. Our models show significant improvements over currently available models pre-trained on multiple languages and synthetic code-mixed datasets. We also release L3Cube-HingLID Corpus, the largest code-mixed Hindi-English language identification(LID) dataset and HingBERT-LID, a production-quality LID model to facilitate capturing of more code-mixed data using the process outlined in this work. The dataset and models are available at https://github.com/l3cube-pune/code-mixed-nlp.",
    "authors": [
        "Ravindra Nayak",
        "Raviraj Joshi"
    ],
    "venue": "WILDRE",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "L3Cube-HingCorpus, the first large-scale real Hindi-English code mixed data in a Roman script is presented, and HingBERT-LID, a production-quality LID model is released to facilitate capturing of more code-mixed data using the process outlined in this work."
    },
    "citationCount": 35,
    "influentialCitationCount": 7,
    "code": null,
    "description": null,
    "url": null
}