{
    "acronym": "0ae7bc864a66feae9e5a189a9ac24cf4c19aa0dd",
    "title": "Large Language Models are legal but they are not: Making the case for a powerful LegalLLM",
    "seed_ids": [
        "bert",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "156a66da569b68ea776c5db38e033aadb4755971",
        "fd33e77884e69f6bc099990fc2790248af2749d9",
        "afad10da0a3b83a4f2a94e8c16c84ac64338e9fe",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "cc2d1a66c701e9be9124eb95431b6c3dd79a61d3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "0ae7bc864a66feae9e5a189a9ac24cf4c19aa0dd",
    "abstract": "Realizing the recent advances from Natural Language Processing (NLP) to the legal sector poses challenging problems such as extremely long sequence lengths, specialized vocabulary that is usually only understood by legal professionals, and high amounts of data imbalance. The recent surge of Large Language Models (LLM) has begun to provide new opportunities to apply NLP in the legal domain due to their ability to handle lengthy, complex sequences. Moreover, the emergence of domain-specific LLMs has displayed extremely promising results on various tasks. In this study, we aim to quantify how general LLMs perform in comparison to legal-domain models (be it an LLM or otherwise). Specifically, we compare the zero-shot performance of three general-purpose LLMs (ChatGPT-3.5, LLaMA-70b and Falcon-180b) on the LEDGAR subset of the LexGLUE benchmark for contract provision classification. Although the LLMs were not explicitly trained on legal data, we observe that they are still able to classify the theme correctly in most cases. However, we find that their mic-F1/mac-F1 performance are upto 19.2/26.8% lesser than smaller models fine-tuned on the legal domain, thus underscoring the need for more powerful legal-domain LLMs.",
    "authors": [
        "Thanmay Jayakumar",
        "Fauzan Farooqui",
        "Luqman Farooqui"
    ],
    "venue": "NLLP",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study compares the zero-shot performance of three general-purpose LLMs on the LEDGAR subset of the LexGLUE benchmark for contract provision classification and finds that their mic-F 1/mac-F1 performance is 19.2/26.8% lesser than smaller models fine-tuned on the legal domain, thus underscoring the need for more powerful legal-domain LLMs."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}