{
    "acronym": "0b7b6a4dba7b4d400468690b6f6b3bae86253020",
    "title": "A Representative Study on Human Detection of Artificially Generated Media Across Countries",
    "seed_ids": [
        "gpt3",
        "a279d7d05ce4cf849879e6948c34613b2dade858",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "0b7b6a4dba7b4d400468690b6f6b3bae86253020",
    "abstract": "AI-generated media has become a threat to our digital society as we know it. These forgeries can be created automatically and on a large scale based on publicly available technology. Recognizing this challenge, academics and practitioners have proposed a multitude of automatic detection strategies to detect such artificial media. However, in contrast to these technical advances, the human perception of generated media has not been thoroughly studied yet. In this paper, we aim at closing this research gap. We perform the first comprehensive survey into people's ability to detect generated media, spanning three countries (USA, Germany, and China) with 3,002 participants across audio, image, and text media. Our results indicate that state-of-the-art forgeries are almost indistinguishable from\"real\"media, with the majority of participants simply guessing when asked to rate them as human- or machine-generated. In addition, AI-generated media receive is voted more human like across all media types and all countries. To further understand which factors influence people's ability to detect generated media, we include personal variables, chosen based on a literature review in the domains of deepfake and fake news research. In a regression analysis, we found that generalized trust, cognitive reflection, and self-reported familiarity with deepfakes significantly influence participant's decision across all media categories.",
    "authors": [
        "Joel Frank",
        "Franziska Herbert",
        "Jonas Ricker",
        "Lea Schönherr",
        "Thorsten Eisenhofer",
        "Asja Fischer",
        "Markus Dürmuth",
        "Thorsten Holz"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The first comprehensive survey into people's ability to detect generated media is performed, spanning three countries with 3,002 participants across audio, image, and text media and indicates that state-of-the-art forgeries are almost indistinguishable from \"real\" media."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}