{
    "acronym": "0b9adbe01131857fd56db2b42b196a149fab778e",
    "title": "A Comprehensive Survey of LLM Alignment Techniques: RLHF, RLAIF, PPO, DPO and More",
    "seed_ids": [
        "bert",
        "0f7308fbcae43d22813f70c334c2425df0b1cce1",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "0b9adbe01131857fd56db2b42b196a149fab778e",
    "abstract": "With advancements in self-supervised learning, the availability of trillions tokens in a pre-training corpus, instruction fine-tuning, and the development of large Transformers with billions of parameters, large language models (LLMs) are now capable of generating factual and coherent responses to human queries. However, the mixed quality of training data can lead to the generation of undesired responses, presenting a significant challenge. Over the past two years, various methods have been proposed from different perspectives to enhance LLMs, particularly in aligning them with human expectation. Despite these efforts, there has not been a comprehensive survey paper that categorizes and details these approaches. In this work, we aim to address this gap by categorizing these papers into distinct topics and providing detailed explanations of each alignment method, thereby helping readers gain a thorough understanding of the current state of the field.",
    "authors": [
        "Zhichao Wang",
        "Bin Bi",
        "Shiva K. Pentyala",
        "Kiran Ramnath",
        "Sougata Chaudhuri",
        "Shubham Mehrotra",
        "Zixu Zhu",
        "Xiang-Bo Mao",
        "S. Asur",
        "Na Cheng"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work categorizes various methods proposed from different perspectives to enhance LLMs into distinct topics and provides detailed explanations of each alignment method, thereby helping readers gain a thorough understanding of the current state of the field."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}