{
    "acronym": "0c2fb0031cd9d6f1c3655d778141716c570372ba",
    "title": "Using Transfer Learning To Classify Long Unstructured Texts with Small Amounts of Labeled Data",
    "seed_ids": [
        "longformer",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "adc61e21eafecfbf6ebecc570f9f913659a2bfb2",
        "a022bda79947d1f656a1164003c1b3ae9a843df9"
    ],
    "s2id": "0c2fb0031cd9d6f1c3655d778141716c570372ba",
    "abstract": ": Text classification is a traditional problem in Natural Language Processing (NLP). Most of the state-of-the-art implementations require high-quality, voluminous, labeled data. Pre-trained models on large corpora have shown beneficial for text classification and other NLP tasks, but they can only take a limited amount of symbols as input. This is a real case study that explores different machine learning strategies to classify a small amount of long, unstructured, and uneven data to find a proper method with good performance. The collected data includes texts of financing opportunities the international R&D funding organizations provided on their websites. The main goal is to find international R&D funding eligible for Brazilian researchers, sponsored by the Ministry of Science, Technology and Innovation. We use pre-training and word embedding solutions to learn the relationship of the words from other datasets with considerable similarity and larger scale. Then, using the acquired features, based on the available dataset from MCTI, we apply transfer learning plus deep learning models to improve the comprehension of each sentence. Compared to the baseline accuracy rate of 81%, based on the available datasets, and the 85% accuracy rate achieved through a Transformer-based approach, the Word2Vec-based approach improved the accuracy rate to 88%. The research results serve as a successful case of artificial intelligence in a federal government application.",
    "authors": [
        "C. A. A. Rocha",
        "M. V. P. Dib",
        "Weigang Li",
        "Andrea Nunes",
        "Allan Victor Almeida Faria",
        "D. Cajueiro",
        "Maísa Kely de Melo",
        "Victor Rafael Rezende Celestino"
    ],
    "venue": "International Conference on Web Information Systems and Technologies",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This case study explores different machine learning strategies to classify a small amount of long, unstructured, and uneven data to find a proper method with good performance in a federal government application to find international R&D funding eligible for Brazilian researchers."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}