{
    "acronym": "0c474b03e8fd385b08a40df22934c9d9b180ffb7",
    "title": "De-Diffusion Makes Text a Strong Cross-Modal Interface",
    "seed_ids": [
        "classfreediffu",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "0c474b03e8fd385b08a40df22934c9d9b180ffb7",
    "abstract": "We demonstrate text as a strong cross-modal interface. Rather than relying on deep embeddings to connect image and language as the interface representation, our approach represents an image as text, from which we enjoy the interpretability and flexibility inherent to natural language. We employ an autoencoder that uses a pre-trained text-to-image diffusion model for decoding. The encoder is trained to transform an input image into text, which is then fed into the fixed text-to-image diffusion decoder to reconstruct the original input -- a process we term De-Diffusion. Experiments validate both the precision and comprehensiveness of De-Diffusion text representing images, such that it can be readily ingested by off-the-shelf text-to-image tools and LLMs for diverse multi-modal tasks. For example, a single De-Diffusion model can generalize to provide transferable prompts for different text-to-image tools, and also achieves a new state of the art on open-ended vision-language tasks by simply prompting large language models with few-shot examples.",
    "authors": [
        "Chen Wei",
        "Chenxi Liu",
        "Siyuan Qiao",
        "Zhishuai Zhang",
        "A. Yuille",
        "Jiahui Yu"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "De-Diffusion text representing images can be readily ingested by off-the-shelf text-to-image tools and LLMs for diverse multi-modal tasks and achieves a new state of the art on open-ended vision-language tasks by simply prompting large language models with few-shot examples."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}