{
    "acronym": "0cd526723b87ae37981922992992d203448a2014",
    "title": "DilateFormer: Multi-Scale Dilated Transformer for Visual Recognition",
    "seed_ids": [
        "longformer",
        "a883336e5c2e9f46f5012343227a6be4671c9ca0",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "a9c214e846188adb645021cd7b1964b8ea1fef6f",
        "e3b56d3515b5fa19c3bd4764400754079932f718",
        "6b6ffb94626e672caffafc77097491d9ee7a8682",
        "3cbe314cc5407a6c3249815b5173f22ea15173c2",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "0cd526723b87ae37981922992992d203448a2014",
    "abstract": "As a de facto solution, the vanilla Vision Transformers (ViTs) are encouraged to model long-range dependencies between arbitrary image patches while the global attended receptive field leads to quadratic computational cost. Another branch of Vision Transformers exploits local attention inspired by CNNs, which only models the interactions between patches in small neighborhoods. Although such a solution reduces the computational cost, it naturally suffers from small attended receptive fields, which may limit the performance. In this work, we explore effective Vision Transformers to pursue a preferable trade-off between the computational complexity and size of the attended receptive field. By analyzing the patch interaction of global attention in ViTs, we observe two key properties in the shallow layers, namely locality and sparsity, indicating the redundancy of global dependency modeling in shallow layers of ViTs. Accordingly, we propose Multi-Scale Dilated Attention (MSDA) to model local and sparse patch interaction within the sliding window. With a pyramid architecture, we construct a Multi-Scale Dilated Transformer (DilateFormer) by stacking MSDA blocks at low-level stages and global multi-head self-attention blocks at high-level stages. Our experiment results show that our DilateFormer achieves state-of-the-art performance on various vision tasks. On ImageNet-1 K classification task, DilateFormer achieves comparable performance with 70% fewer FLOPs compared with existing state-of-the-art models. Our DilateFormer-Base achieves 85.6% top-1 accuracy on ImageNet-1 K classification task, 53.5% box mAP/46.1% mask mAP on COCO object detection/instance segmentation task and 51.1% MS mIoU on ADE20 K semantic segmentation task. The code is available at https://isee-ai.cn/~jiaojiayu/DilteFormer.html.",
    "authors": [
        "Jiayu Jiao",
        "Yuyao Tang",
        "Kun-Li Channing Lin",
        "Yipeng Gao",
        "Jinhua Ma",
        "Yaowei Wang",
        "Wei-Shi Zheng"
    ],
    "venue": "IEEE transactions on multimedia",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work analyzes the patch interaction of global attention in ViTs and proposes Multi-Scale Dilated Attention (MSDA) to model local and sparse patch interaction within the sliding window, indicating the redundancy of global dependency modeling in shallow layers of ViTs."
    },
    "citationCount": 35,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}