{
    "acronym": "0ce85c95bd0563c50f36784d87153f37a48dc1a1",
    "title": "CodeArt: Better Code Models by Attention Regularization When Symbols Are Lacking",
    "seed_ids": [
        "bert",
        "daa7b3f8d5610cd2dd1badde8c3a3e6f58726aa3",
        "0b0debb710366cdff461938c80763eace1651af6",
        "4b27f18bff43d605805c92696a979714ced0b805",
        "06e36261b21af2943e464a562c92c09dac292a82",
        "0646bb09db4d1ba24150e69b71edcd4aff691b3c",
        "0fe2636446cd686830da3d971b31a004d6094b3c"
    ],
    "s2id": "0ce85c95bd0563c50f36784d87153f37a48dc1a1",
    "abstract": "Transformer based code models have impressive performance in many software engineering tasks. However, their effectiveness degrades when symbols are missing or not informative. The reason is that the model may not learn to pay attention to the right correlations/contexts without the help of symbols. We propose a new method to pre-train general code models when symbols are lacking. We observe that in such cases, programs degenerate to something written in a very primitive language. We hence propose to use program analysis to extract contexts a priori (instead of relying on symbols and masked language modeling as in vanilla models). We then leverage a novel attention masking method to only allow the model attending to these contexts, e.g., bi-directional program dependence transitive closures and token co-occurrences. In the meantime, the inherent self-attention mechanism is utilized to learn which of the allowed attentions are more important compared to others. To realize the idea, we enhance the vanilla tokenization and model architecture of a BERT model, \n \nconstruct and utilize attention masks, and introduce a new pre-training algorithm. We pre-train this BERT-like model from scratch, using a dataset of 26 million stripped binary functions with explicit program dependence information extracted by our tool. We apply the model in three downstream tasks: binary similarity, type inference, and malware family classification. Our pre-trained model can improve the SOTAs in these tasks from 53% to 64%, 49% to 60%, and 74% to 94%, respectively. It also substantially outperforms other general pre-training techniques of code understanding models.",
    "authors": [
        "Zian Su",
        "Xiangzhe Xu",
        "Ziyang Huang",
        "Zhuo Zhang",
        "Yapeng Ye",
        "Jianjun Huang",
        "Xiangyu Zhang"
    ],
    "venue": "Proc. ACM Softw. Eng.",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work enhances the vanilla tokenization and model architecture of a BERT model, construct and utilize attention masks, and introduces a new pre-training algorithm that substantially outperforms other general pre-training techniques of code understanding models."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}