{
    "acronym": "0cf7d980b62555bbed101821742de9558bd7b0e0",
    "title": "Parameter-Efficient Transformer with Hybrid Axial-Attention for Medical Image Segmentation",
    "seed_ids": [
        "axialattn",
        "a9c214e846188adb645021cd7b1964b8ea1fef6f",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06",
        "dc35daba3fb34b2e6a5b12530badb7b799262bbf"
    ],
    "s2id": "0cf7d980b62555bbed101821742de9558bd7b0e0",
    "abstract": "Transformers to their powerful capability to use ﬂexible self-attention mechanism. However, due to lacking intrinsic inductive bias in modeling visual structural information, they generally require a large-scale pre-training schedule, limiting the clinical applications over expensive small-scale medical data. To this end, we propose a parameter-efﬁcient transformer to explore intrinsic inductive bias via position information for medical image segmentation. Speciﬁcally, we empirically investigate how different position encoding strategies affect the prediction quality of the region of interest (ROI), and observe that ROIs are sensitive to the position encoding strategies. Motivated by this, we present a novel Hybrid Axial-Attention (HAA), a form of position self-attention that can be equipped with spatial pixel-wise information and relative position information as inductive bias. Moreover, we introduce a gating mechanism to alleviate the burden of training schedule, resulting in efﬁcient feature selection over small-scale datasets. Experiments on the BraTS and Covid19 datasets prove the superiority of our method over the baseline and previous works. Internal workﬂow visualization with interpretability is conducted to better validate our success.",
    "authors": [
        "Yiyue Hu",
        "Lei Zhang",
        "Nan Mu",
        "Leijun Liu"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel Hybrid Axial-Attention (HAA) is presented, a form of position self-attention that can be equipped with spatial pixel-wise information and relative position information as inductive bias and introduced a gating mechanism to alleviate the burden of training schedule."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}