{
    "acronym": "0d3f348aad501c4d45dc7e2f3811c0fa7c514f01",
    "title": "ALens: An Adaptive Domain-Oriented Abstract Writing Training Tool for Novice Researchers",
    "seed_ids": [
        "longt5",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "0d3f348aad501c4d45dc7e2f3811c0fa7c514f01",
    "abstract": "The significance of novice researchers acquiring proficiency in writing abstracts has been extensively documented in the field of higher education, where they often encounter challenges in this process. Traditionally, students have been advised to enroll in writing training courses as a means to develop their abstract writing skills. Nevertheless, this approach frequently falls short in providing students with personalized and adaptable feedback on their abstract writing. To address this gap, we initially conducted a formative study to ascertain the user requirements for an abstract writing training tool. Subsequently, we proposed a domain-specific abstract writing training tool called ALens, which employs rhetorical structure parsing to identify key concepts, evaluates abstract drafts based on linguistic features, and employs visualization techniques to analyze the writing patterns of exemplary abstracts. A comparative user study involving an alternative abstract writing training tool has been conducted to demonstrate the efficacy of our approach.",
    "authors": [
        "Chen Cheng",
        "Ziang Li",
        "Zhenhui Peng",
        "Quan Li"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A domain-specific abstract writing training tool called ALens is proposed, which employs rhetorical structure parsing to identify key concepts, evaluates abstract drafts based on linguistic features, and employs visualization techniques to analyze the writing patterns of exemplary abstracts."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}