{
    "acronym": "0dcbf11176db2a55d43b19c1765f1759e13f368b",
    "title": "A Historical Survey of Advances in Transformer Architectures",
    "seed_ids": [
        "bigbird",
        "etc",
        "f35016b3180808fa97d59acbdecf47d6e2ed2819",
        "a9c72a0aedd209c2f565d09fd46dd27c78585a91",
        "dd1139cfc609c2f3263d02e97176d5275caebc0a",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "333212e246fb65f7c9d43862021e78f007c48449",
        "bf80051ca9ae1e76e2bdbdcf44df559e7eb73cb1",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "8af925f4edf45131b5b6fed8aa655089d58692fa",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "d6b414487787d0b6efd735a3236a690ad13aae70",
        "830995ef17cc291c13f42dfd9f462137de1d2179",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "0dcbf11176db2a55d43b19c1765f1759e13f368b",
    "abstract": "In recent times, transformer-based deep learning models have risen in prominence in the field of machine learning for a variety of tasks such as computer vision and text generation. Given this increased interest, a historical outlook at the development and rapid progression of transformer-based models becomes imperative in order to gain an understanding of the rise of this key architecture. This paper presents a survey of key works related to the early development and implementation of transformer models in various domains such as generative deep learning and as backbones of large language models. Previous works are classified based on their historical approaches, followed by key works in the domain of text-based applications, image-based applications, and miscellaneous applications. A quantitative and qualitative analysis of the various approaches is presented. Additionally, recent directions of transformer-related research such as those in the biomedical and timeseries domains are discussed. Finally, future research opportunities, especially regarding the multi-modality and optimization of the transformer training process, are identified.",
    "authors": [
        "Ali Reza Sajun",
        "Imran Zualkernan",
        "Donthi Sankalpa"
    ],
    "venue": "Applied Sciences",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A survey of key works related to the early development and implementation of transformer models in various domains such as generative deep learning and as backbones of large language models is presented."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}