{
    "acronym": "0dcd241afa426b287da651c13c61bb26f7c546dd",
    "title": "Efficient and Degree-Guided Graph Generation via Discrete Diffusion Modeling",
    "seed_ids": [
        "d3pms",
        "8b20edda4a0013d628b9c4e9e4b42a5f1310b12f",
        "9714b88d4d984426d901fc539c7c69d03290ce12"
    ],
    "s2id": "0dcd241afa426b287da651c13c61bb26f7c546dd",
    "abstract": "Diffusion-based generative graph models have been proven effective in generating high-quality small graphs. However, they need to be more scalable for generating large graphs containing thousands of nodes desiring graph statistics. In this work, we propose EDGE, a new diffusion-based generative graph model that addresses generative tasks with large graphs. To improve computation efficiency, we encourage graph sparsity by using a discrete diffusion process that randomly removes edges at each time step and finally obtains an empty graph. EDGE only focuses on a portion of nodes in the graph at each denoising step. It makes much fewer edge predictions than previous diffusion-based models. Moreover, EDGE admits explicitly modeling the node degrees of the graphs, further improving the model performance. The empirical study shows that EDGE is much more efficient than competing methods and can generate large graphs with thousands of nodes. It also outperforms baseline models in generation quality: graphs generated by our approach have more similar graph statistics to those of the training graphs.",
    "authors": [
        "Xiaohui Chen",
        "Jiaxing He",
        "Xuhong Han",
        "Liping Liu"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes EDGE, a new diffusion-based generative graph model that addresses generative tasks with large graphs by using a discrete diffusion process that randomly removes edges at each time step and finally obtains an empty graph."
    },
    "citationCount": 26,
    "influentialCitationCount": 8,
    "code": null,
    "description": null,
    "url": null
}