{
    "acronym": "0e846cef0497af8623f8476613a3da8bad6cc7b9",
    "title": "RL4CO: an Extensive Reinforcement Learning for Combinatorial Optimization Benchmark",
    "seed_ids": [
        "flashattn",
        "647369ee45ecead812991f860caa8a96c6617063",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "5f90d43e6ece5c6ee6e8186e4b57d46c85377713",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c"
    ],
    "s2id": "0e846cef0497af8623f8476613a3da8bad6cc7b9",
    "abstract": "Deep reinforcement learning (RL) has recently shown significant benefits in solving combinatorial optimization (CO) problems, reducing reliance on domain expertise, and improving computational efficiency. However, the field lacks a unified benchmark for easy development and standardized comparison of algorithms across diverse CO problems. To fill this gap, we introduce RL4CO, a unified and extensive benchmark with in-depth library coverage of 23 state-of-the-art methods and more than 20 CO problems. Built on efficient software libraries and best practices in implementation, RL4CO features modularized implementation and flexible configuration of diverse RL algorithms, neural network architectures, inference techniques, and environments. RL4CO allows researchers to seamlessly navigate existing successes and develop their unique designs, facilitating the entire research process by decoupling science from heavy engineering. We also provide extensive benchmark studies to inspire new insights and future work. RL4CO has attracted numerous researchers in the community and is open-sourced at https://github.com/ai4co/rl4co.",
    "authors": [
        "Federico Berto",
        "Chuanbo Hua",
        "Junyoung Park",
        "Minsu Kim",
        "Hyeon-Seob Kim",
        "Jiwoo Son",
        "Haeyeon Kim",
        "Joungho Kim",
        "Jinkyoo Park"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "RL4CO is introduced, a unified and extensive benchmark with in-depth library coverage of 23 state-of-the-art methods and more than 20 CO problems that allows researchers to seamlessly navigate existing successes and develop their unique designs, facilitating the entire research process by decoupling science from heavy engineering."
    },
    "citationCount": 13,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}