{
    "acronym": "0ea10f2132233b4f5d7cf701300cd0055e93e2d8",
    "title": "Ethos: Rectifying Language Models in Orthogonal Parameter Space",
    "seed_ids": [
        "gpt2",
        "7f1a473834eea608980e4e04cce21be18d65b9b6",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "0ea10f2132233b4f5d7cf701300cd0055e93e2d8",
    "abstract": "Language models (LMs) have greatly propelled the research on natural language processing. However, LMs also raise concerns regarding the generation of biased or toxic content and the potential disclosure of private information from the training dataset. In this work, we present a new efficient approach, Ethos, that rectifies LMs to mitigate toxicity and bias in outputs and avoid privacy leakage. Ethos is built on task arithmetic. However, unlike current task arithmetic algorithms, Ethos distinguishes general beneficial and undesired knowledge when reconstructing task vectors. Specifically, Ethos first obtains a set of principal components from the pre-trained models using singular value decomposition. Then, by projecting the task vector onto principal components, Ethos identifies the principal components that encode general or undesired knowledge. Ethos performs negating using the task vector with undesired knowledge only, thereby minimizing collateral damage on general model utility. We demonstrate the efficacy of our approach on three different tasks: debiasing, detoxification, and memorization unlearning. Evaluations show Ethos is more effective in removing undesired knowledge and maintaining the overall model performance compared to current task arithmetic methods.",
    "authors": [
        "Lei Gao",
        "Yue Niu",
        "Tingting Tang",
        "A. Avestimehr",
        "Murali Annavaram"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new efficient approach, Ethos, is presented that rectifies LMs to mitigate toxicity and bias in outputs and avoid privacy leakage and is more effective in removing undesired knowledge and maintaining the overall model performance compared to current task arithmetic methods."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}