{
    "acronym": "0ea22780c42536f488c097431c037aa45aac0b2d",
    "title": "Neurocache: Efficient Vector Retrieval for Long-range Language Modeling",
    "seed_ids": [
        "gpt3",
        "4ea5ca620122e6a9a2b000444d36491cebf49c7c",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "dbc368bc8b49347dd27679894524fa62f88492c9",
        "465471bb5bf1a945549d6291c2d23367966b4957",
        "4e3935ef7da6bcbb202ec7f8b285c313cadcd044",
        "f51497f463566581874c941353dd9d80069c5b77",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "0ea22780c42536f488c097431c037aa45aac0b2d",
    "abstract": "This paper introduces Neurocache, an approach to extend the effective context size of large language models (LLMs) using an external vector cache to store its past states. Like recent vector retrieval approaches, Neurocache uses an efficient k-nearest-neighbor (kNN) algorithm to retrieve relevant past states and incorporate them into the attention process. Neurocache improves upon previous methods by (1) storing compressed states, which reduces cache size; (2) performing a single retrieval operation per token which increases inference speed; and (3) extending the retrieval window to neighboring states, which improves both language modeling and downstream task accuracy. Our experiments show the effectiveness of Neurocache both for models trained from scratch and for pre-trained models such as Llama2-7B and Mistral-7B when enhanced with the cache mechanism. We also compare Neurocache with text retrieval methods and show improvements in single-document question-answering and few-shot learning tasks. We made the source code available under: https://github.com/alisafaya/neurocache",
    "authors": [
        "Ali Safaya",
        "Deniz Yuret"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Neurocache is an approach to extend the effective context size of large language models (LLMs) using an external vector cache to store its past states using an efficient k-nearest-neighbor algorithm to retrieve relevant past states and incorporate them into the attention process."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}