{
    "acronym": "0eacc694fb44dd8cc944d0bd8aad05a44603f79b",
    "title": "Calculon: a Methodology and Tool for High-Level Codesign of Systems and Large Language Models",
    "seed_ids": [
        "gpt3",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "0eacc694fb44dd8cc944d0bd8aad05a44603f79b",
    "abstract": "This paper presents a parameterized analytical performance model of transformer-based Large Language Models (LLMs) for guiding high-level algorithm-architecture codesign studies. This model de-rives from an extensive survey of performance optimizations that have been proposed for the training and inference of LLMs; the model's parameters capture application characteristics, the hardware system, and the space of implementation strategies. With such a model, we can systematically explore a joint space of hardware and software configurations to identify optimal system designs under given constraints, like the total amount of system memory. We implemented this model and methodology in a Python-based open-source tool called Calculon. Using it, we identified novel system designs that look significantly different from current inference and training systems, showing quantitatively the estimated potential to achieve higher efficiency, lower cost, and better scalability.",
    "authors": [
        "Mikhail Isaev",
        "Nic Mcdonald",
        "Larry Dennison",
        "R. Vuduc"
    ],
    "venue": "International Conference for High Performance Computing, Networking, Storage and Analysis",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A parameterized analytical performance model of transformer-based Large Language Models is presented for guiding high-level algorithm-architecture codesign studies, showing quantitatively the estimated potential to achieve higher efficiency, lower cost, and better scalability."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}