{
    "acronym": "0ed7f8a4ac96b3792ec5e395187df22af707fdc5",
    "title": "RNNs, CNNs and Transformers in Human Action Recognition: A Survey and A Hybrid Model",
    "seed_ids": [
        "transformer",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530",
        "94b69cf199fa0b6c842e17fe5d6174a9d161c3df",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b"
    ],
    "s2id": "0ed7f8a4ac96b3792ec5e395187df22af707fdc5",
    "abstract": "Human Action Recognition (HAR) encompasses the task of monitoring human activities across various domains, including but not limited to medical, educational, entertainment, visual surveillance, video retrieval, and the identification of anomalous activities. Over the past decade, the field of HAR has witnessed substantial progress by leveraging Convolutional Neural Networks (CNNs) to effectively extract and comprehend intricate information, thereby enhancing the overall performance of HAR systems. Recently, the domain of computer vision has witnessed the emergence of Vision Transformers (ViTs) as a potent solution. The efficacy of transformer architecture has been validated beyond the confines of image analysis, extending their applicability to diverse video-related tasks. Notably, within this landscape, the research community has shown keen interest in HAR, acknowledging its manifold utility and widespread adoption across various domains. This article aims to present an encompassing survey that focuses on CNNs and the evolution of Recurrent Neural Networks (RNNs) to ViTs given their importance in the domain of HAR. By conducting a thorough examination of existing literature and exploring emerging trends, this study undertakes a critical analysis and synthesis of the accumulated knowledge in this field. Additionally, it investigates the ongoing efforts to develop hybrid approaches. Following this direction, this article presents a novel hybrid model that seeks to integrate the inherent strengths of CNNs and ViTs.",
    "authors": [
        "Khaled Alomar",
        "Halil Ibrahim Aysel",
        "Xiaohao Cai"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel hybrid model that seeks to integrate the inherent strengths of CNNs and ViTs is presented that seeks to integrate the inherent strengths of CNNs and ViTs in Human Action Recognition systems."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}