{
    "acronym": "0f63da47402dd8774ae3800ef27e2e4e4b244bbb",
    "title": "Graph Attention Network-based Block Propagation with Optimal AoI and Reputation in Web 3.0",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "0f63da47402dd8774ae3800ef27e2e4e4b244bbb",
    "abstract": "Web 3.0 is recognized as a pioneering paradigm that empowers users to securely oversee data without reliance on a centralized authority. Blockchains, as a core technology to realize Web 3.0, can facilitate decentralized and transparent data management. Nevertheless, the evolution of blockchain-enabled Web 3.0 is still in its nascent phase, grappling with challenges such as ensuring efficiency and reliability to enhance block propagation performance. In this paper, we design a Graph Attention Network (GAT)-based reliable block propagation optimization framework for blockchain-enabled Web 3.0. We first innovatively apply a data-freshness metric called age of block to measure block propagation efficiency in public blockchains. To achieve the reliability of block propagation, we introduce a reputation mechanism based on the subjective logic model, including the local and recommended opinions to calculate the miner reputation value. Moreover, considering that the GAT possesses the excellent ability to process graph-structured data, we utilize the GAT with reinforcement learning to obtain the optimal block propagation trajectory. Numerical results demonstrate that the proposed scheme exhibits the most outstanding block propagation efficiency and reliability compared with traditional routing mechanisms.",
    "authors": [
        "Jiana Liao",
        "Jinbo Wen",
        "Jiawen Kang",
        "Changyan Yi",
        "Yang Zhang",
        "Yutao Jiao",
        "D. Niyato",
        "Dong In Kim",
        "Shengli Xie"
    ],
    "venue": "IEEE Transactions on Cognitive Communications and Networking",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Graph Attention Network (GAT)-based reliable block propagation optimization framework for blockchain-enabled Web 3.0 that exhibits the most outstanding block propagation efficiency and reliability compared with traditional routing mechanisms."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}