{
    "acronym": "0fcdb282372cd1ee920dc96d7e2b3f7fa01c9847",
    "title": "Automating Customer Needs Analysis: A Comparative Study of Large Language Models in the Travel Industry",
    "seed_ids": [
        "bert",
        "b842b83a7ff5dff8e3b83915d8c15423b6085728",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda"
    ],
    "s2id": "0fcdb282372cd1ee920dc96d7e2b3f7fa01c9847",
    "abstract": "In the rapidly evolving landscape of Natural Language Processing (NLP), Large Language Models (LLMs) have emerged as powerful tools for many tasks, such as extracting valuable insights from vast amounts of textual data. In this study, we conduct a comparative analysis of LLMs for the extraction of travel customer needs from TripAdvisor posts. Leveraging a diverse range of models, including both open-source and proprietary ones such as GPT-4 and Gemini, we aim to elucidate their strengths and weaknesses in this specialized domain. Through an evaluation process involving metrics such as BERTScore, ROUGE, and BLEU, we assess the performance of each model in accurately identifying and summarizing customer needs. Our findings highlight the efficacy of opensource LLMs, particularly Mistral 7B, in achieving comparable performance to larger closed models while offering affordability and customization benefits. Additionally, we underscore the importance of considering factors such as model size, resource requirements, and performance metrics when selecting the most suitable LLM for customer needs analysis tasks. Overall, this study contributes valuable insights for businesses seeking to leverage advanced NLP techniques to enhance customer experience and drive operational efficiency in the travel industry.",
    "authors": [
        "Simone Barandoni",
        "F. Chiarello",
        "Lorenzo Cascone",
        "Emiliano Marrale",
        "Salvatore Puccio"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A comparative analysis of LLMs for the extraction of travel customer needs from TripAdvisor posts highlights the efficacy of opensource LLMs, particularly Mistral 7B, in achieving comparable performance to larger closed models while offering affordability and customization benefits."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}