{
    "acronym": "0fe9c9fcc19c7b682d88266e9cf9d6f97464a3d4",
    "title": "Decision-Focused Summarization",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "0fe9c9fcc19c7b682d88266e9cf9d6f97464a3d4",
    "abstract": "Relevance in summarization is typically de- fined based on textual information alone, without incorporating insights about a particular decision. As a result, to support risk analysis of pancreatic cancer, summaries of medical notes may include irrelevant information such as a knee injury. We propose a novel problem, decision-focused summarization, where the goal is to summarize relevant information for a decision. We leverage a predictive model that makes the decision based on the full text to provide valuable insights on how a decision can be inferred from text. To build a summary, we then select representative sentences that lead to similar model decisions as using the full text while accounting for textual non-redundancy. To evaluate our method (DecSum), we build a testbed where the task is to summarize the first ten reviews of a restaurant in support of predicting its future rating on Yelp. DecSum substantially outperforms text-only summarization methods and model-based explanation methods in decision faithfulness and representativeness. We further demonstrate that DecSum is the only method that enables humans to outperform random chance in predicting which restaurant will be better rated in the future.",
    "authors": [
        "Chao-Chun Hsu",
        "Chenhao Tan"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel problem, decision-focused summarization, where the goal is to summarize relevant information for a decision, and leverages a predictive model that makes the decision based on the full text to provide valuable insights on how a decision can be inferred from text."
    },
    "citationCount": 12,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}