{
    "acronym": "101914972192c4fa0c7eab6ffc72f13d3ae1dde0",
    "title": "State-Free Inference of State-Space Models: The Transfer Function Approach",
    "seed_ids": [
        "s4",
        "s4d",
        "mamba",
        "dssm",
        "s5",
        "hyenadistill",
        "5c104f905fcacf390270f619f232a2ba4eb873f2",
        "cb0ac335adda4ceef9987cbcbca9129e71c37f0a",
        "77fde89a0f28cae77fd488ee3b641dee716e9c77",
        "a7d68b1702af08ce4dbbf2cd0b083e744ae5c6be",
        "f393aff1593c2d370ec0ae004910d18e40524967",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "a30ac45ac5b7bd2148d3fb80ee7f3c29724e3170",
        "ca444821352a4bd91884413d8070446e2960715a",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "1d5c8c6e5a774d2fef8d92bd28670a6345a97f7a",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d"
    ],
    "s2id": "101914972192c4fa0c7eab6ffc72f13d3ae1dde0",
    "abstract": "We approach designing a state-space model for deep learning applications through its dual representation, the transfer function, and uncover a highly efficient sequence parallel inference algorithm that is state-free: unlike other proposed algorithms, state-free inference does not incur any significant memory or computational cost with an increase in state size. We achieve this using properties of the proposed frequency domain transfer function parametrization, which enables direct computation of its corresponding convolutional kernel's spectrum via a single Fast Fourier Transform. Our experimental results across multiple sequence lengths and state sizes illustrates, on average, a 35% training speed improvement over S4 layers -- parametrized in time-domain -- on the Long Range Arena benchmark, while delivering state-of-the-art downstream performances over other attention-free approaches. Moreover, we report improved perplexity in language modeling over a long convolutional Hyena baseline, by simply introducing our transfer function parametrization. Our code is available at https://github.com/ruke1ire/RTF.",
    "authors": [
        "Rom N. Parnichkun",
        "Stefano Massaroli",
        "Alessandro Moro",
        "Jimmy T.H. Smith",
        "Ramin M. Hasani",
        "Mathias Lechner",
        "Qi An",
        "Christopher R'e",
        "Hajime Asama",
        "Stefano Ermon",
        "Taiji Suzuki",
        "Atsushi Yamashita",
        "Michael Poli"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work uncovers a highly efficient sequence parallel inference algorithm that is state-free: unlike other proposed algorithms, state-free inference does not incur any significant memory or computational cost with an increase in state size."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}