{
    "acronym": "10416503e32c89d9b629c34c45fa0ac39a79fbe1",
    "title": "NTIRE 2024 Quality Assessment of AI-Generated Content Challenge",
    "seed_ids": [
        "bert",
        "cf694df964caa156ec306b45d3a3127533cb458f",
        "9550076d9930dd3533ab9276126f1a9265fad7b4",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "4990f7542f0600e0501a7e7a931b32eb7cb804d5",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "10416503e32c89d9b629c34c45fa0ac39a79fbe1",
    "abstract": "This paper reports on the NTIRE 2024 Quality Assessment of AI-Generated Content Challenge, which will be held in conjunction with the New Trends in Image Restoration and Enhancement Workshop (NTIRE) at CVPR 2024. This challenge is to address a major challenge in the field of image and video processing, namely, Image Quality Assessment (IQA) and Video Quality Assessment (VQA) for AI-Generated Content (AIGC). The challenge is divided into the image track and the video track. The image track uses the AIGIQA-20K, which contains 20,000 AI-Generated Images (AIGIs) generated by 15 popular generative models. The image track has a total of 318 registered participants. A total of 1,646 submissions are received in the development phase, and 221 submissions are received in the test phase. Finally, 16 participating teams submitted their models and fact sheets. The video track uses the T2VQA-DB, which contains 10,000 AI-Generated Videos (AIGVs) generated by 9 popular Text-to-Video (T2V) models. A total of 196 participants have registered in the video track. A total of 991 submissions are received in the development phase, and 185 submissions are received in the test phase. Finally, 12 participating teams submitted their models and fact sheets. Some methods have achieved better results than baseline methods, and the winning methods in both tracks have demonstrated superior prediction performance on AIGC.",
    "authors": [
        "Xiaohong Liu",
        "Xiongkuo Min",
        "Guangtao Zhai",
        "Chunyi Li",
        "Tengchuan Kou",
        "Wei Sun",
        "Haoning Wu",
        "Yixuan Gao",
        "Y. Cao",
        "Zicheng Zhang",
        "Xiele Wu",
        "R. Timofte",
        "Sandeep Mishra",
        "Qi Yan"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This challenge is to address a major challenge in the field of image and video processing, namely, Image Quality Assessment (IQA) and Video Quality Assessment (VQA) for AI-Generated Content (AIGC)."
    },
    "citationCount": 14,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}