{
    "acronym": "107cc3711b6d29357eafcc253a1a6cb618829467",
    "title": "Reply with Sticker: New Dataset and Model for Sticker Retrieval",
    "seed_ids": [
        "bert",
        "1e12fcff9c7d6a1bad379da6d3368ee605081903",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5"
    ],
    "s2id": "107cc3711b6d29357eafcc253a1a6cb618829467",
    "abstract": "Using stickers in online chatting is very prevalent on social media platforms, where the stickers used in the conversation can express someone's intention/emotion/attitude in a vivid, tactful, and intuitive way. Existing sticker retrieval research typically retrieves stickers based on context and the current utterance delivered by the user. That is, the stickers serve as a supplement to the current utterance. However, in the real-world scenario, using stickers to express what we want to say rather than as a supplement to our words only is also important. Therefore, in this paper, we create a new dataset for sticker retrieval in conversation, called \\textbf{StickerInt}, where stickers are used to reply to previous conversations or supplement our words\\footnote{We believe that the release of this dataset will provide a more complete paradigm than existing work for the research of sticker retrieval in the open-domain online conversation.}. Based on the created dataset, we present a simple yet effective framework for sticker retrieval in conversation based on the learning of intention and the cross-modal relationships between conversation context and stickers, coined as \\textbf{Int-RA}. Specifically, we first devise a knowledge-enhanced intention predictor to introduce the intention information into the conversation representations. Subsequently, a relation-aware sticker selector is devised to retrieve the response sticker via cross-modal relationships. Extensive experiments on the created dataset show that the proposed model achieves state-of-the-art performance in sticker retrieval\\footnote{The dataset and source code of this work are released at \\url{https://github.com/HITSZ-HLT/Int-RA}.}.",
    "authors": [
        "Bin Liang",
        "Bingbing Wang",
        "Zhixin Bai",
        "Qiwei Lang",
        "Mingwei Sun",
        "Kaiheng Hou",
        "Kam-Fai Wong",
        "Ruifeng Xu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A knowledge-enhanced intention predictor is devised to introduce the intention information into the conversation representations, and a relation-aware sticker selector is devised to retrieve the response sticker via cross-modal relationships."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}