{
    "acronym": "1098ca3dbda5778c2bf6c9e8cbb9bc7a02249e10",
    "title": "Staged Training for Transformer Language Models",
    "seed_ids": [
        "gpt2",
        "0822f8d7e6a72a65e65f147d3a8d8fccd485da40",
        "5a3749929bf5fb8b1f98a7b2a43c3b957bcf6c88",
        "d931f84abfc4550c10ceb113b142c8eb3e07571e",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1098ca3dbda5778c2bf6c9e8cbb9bc7a02249e10",
    "abstract": "The current standard approach to scaling transformer language models trains each model size from a different random initialization. As an alternative, we consider a staged training setup that begins with a small model and incrementally increases the amount of compute used for training by applying a\"growth operator\"to increase the model depth and width. By initializing each stage with the output of the previous one, the training process effectively re-uses the compute from prior stages and becomes more efficient. Our growth operators each take as input the entire training state (including model parameters, optimizer state, learning rate schedule, etc.) and output a new training state from which training continues. We identify two important properties of these growth operators, namely that they preserve both the loss and the\"training dynamics\"after applying the operator. While the loss-preserving property has been discussed previously, to the best of our knowledge this work is the first to identify the importance of preserving the training dynamics (the rate of decrease of the loss during training). To find the optimal schedule for stages, we use the scaling laws from (Kaplan et al., 2020) to find a precise schedule that gives the most compute saving by starting a new stage when training efficiency starts decreasing. We empirically validate our growth operators and staged training for autoregressive language models, showing up to 22% compute savings compared to a strong baseline trained from scratch. Our code is available at https://github.com/allenai/staged-training.",
    "authors": [
        "Sheng Shen",
        "Pete Walsh",
        "K. Keutzer",
        "Jesse Dodge",
        "Matthew E. Peters",
        "Iz Beltagy"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "To find the optimal schedule for stages, this work uses the scaling laws from (Kaplan et al., 2020) to find a precise schedule that gives the most compute saving by starting a new stage when training efficiency starts decreasing."
    },
    "citationCount": 26,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}