{
    "acronym": "1134e8fbfe610034d7b143597f20bb0d4afd3e0c",
    "title": "Are Semi-Dense Detector-Free Methods Good at Matching Local Features?",
    "seed_ids": [
        "lineartransformer",
        "0d9b8ccb1135b8e380dd8015b080158c6aae3ae5",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "6f68e1bb253925d8431588555d3010419f322e04"
    ],
    "s2id": "1134e8fbfe610034d7b143597f20bb0d4afd3e0c",
    "abstract": "Semi-dense detector-free approaches (SDF), such as LoFTR, are currently among the most popular image matching methods. While SDF methods are trained to establish correspondences between two images, their performances are almost exclusively evaluated using relative pose estimation metrics. Thus, the link between their ability to establish correspondences and the quality of the resulting estimated pose has thus far received little attention. This paper is a first attempt to study this link. We start with proposing a novel structured attention-based image matching architecture (SAM). It allows us to show a counter-intuitive result on two datasets (MegaDepth and HPatches): on the one hand SAM either outperforms or is on par with SDF methods in terms of pose/homography estimation metrics, but on the other hand SDF approaches are significantly better than SAM in terms of matching accuracy. We then propose to limit the computation of the matching accuracy to textured regions, and show that in this case SAM often surpasses SDF methods. Our findings highlight a strong correlation between the ability to establish accurate correspondences in textured regions and the accuracy of the resulting estimated pose/homography. Our code will be made available.",
    "authors": [
        "Matthieu Vilain",
        "R'emi Giraud",
        "Hugo Germain",
        "Guillaume Bourmaud"
    ],
    "venue": "VISIGRAPP : VISAPP",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel structured attention-based image matching architecture (SAM) is proposed, and a strong correlation between the ability to establish accurate correspondences in textured regions and the accuracy of the resulting estimated pose/homography is highlighted."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}