{
    "acronym": "11396462f5f5d709ac84ac2a44a1e5f9fba2dacb",
    "title": "AbsPyramid: Benchmarking the Abstraction Ability of Language Models with a Unified Entailment Graph",
    "seed_ids": [
        "bert",
        "d567a35ef739cb5e531d66e9b8007e50ce2d4bea",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "11396462f5f5d709ac84ac2a44a1e5f9fba2dacb",
    "abstract": "Cognitive research indicates that abstraction ability is essential in human intelligence, which remains under-explored in language models. In this paper, we present AbsPyramid, a unified entailment graph of 221K textual descriptions of abstraction knowledge. While existing resources only touch nouns or verbs within simplified events or specific domains, AbsPyramid collects abstract knowledge for three components of diverse events to comprehensively evaluate the abstraction ability of language models in the open domain. Experimental results demonstrate that current LLMs face challenges comprehending abstraction knowledge in zero-shot and few-shot settings. By training on our rich abstraction knowledge, we find LLMs can acquire basic abstraction abilities and generalize to unseen events. In the meantime, we empirically show that our benchmark is comprehensive to enhance LLMs across two previous abstraction tasks.",
    "authors": [
        "Zhaowei Wang",
        "Haochen Shi",
        "Weiqi Wang",
        "Tianqing Fang",
        "Hongming Zhang",
        "Sehyun Choi",
        "Xin Liu",
        "Yangqiu Song"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "AbsPyramid is presented, a unified entailment graph of 221K textual descriptions of abstraction knowledge that collects abstract knowledge for three components of diverse events to comprehensively evaluate the abstraction ability of language models in the open domain."
    },
    "citationCount": 8,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}