{
    "acronym": "117a9f9227ebe4acc67ff8a52eb9db2ab16390c8",
    "title": "Data Management For Large Language Models: A Survey",
    "seed_ids": [
        "gpt3",
        "1ebcf1884390c28f24b3adaf5a7aba5b9453b48b",
        "11cf88dce827bd67cbfa60400306318022e736d5",
        "5471114e37448bea2457b74894b1ecb92bbcfdf6",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "7ca41cc5fc364b713aba5b573ae4ada801fd788a",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "117a9f9227ebe4acc67ff8a52eb9db2ab16390c8",
    "abstract": "Data plays a fundamental role in the training of Large Language Models (LLMs). Effective data management, particularly in the formulation of a well-suited training dataset, holds significance for enhancing model performance and improving training efficiency during pretraining and supervised fine-tuning phases. Despite the considerable importance of data management, the current research community still falls short in providing a systematic analysis of the rationale behind management strategy selection, its consequential effects, methodologies for evaluating curated datasets, and the ongoing pursuit of improved strategies. Consequently, the exploration of data management has attracted more and more attention among the research community. This survey provides a comprehensive overview of current research in data management within both the pretraining and supervised fine-tuning stages of LLMs, covering various noteworthy aspects of data management strategy design: data quantity, data quality, domain/task composition, etc. Looking toward the future, we extrapolate existing challenges and outline promising directions for development in this field. Therefore, this survey serves as a guiding resource for practitioners aspiring to construct powerful LLMs through effective data management practices. The collection of the latest papers is available at https://github.com/ZigeW/data_management_LLM.",
    "authors": [
        "Zige Wang",
        "Wanjun Zhong",
        "Yufei Wang",
        "Qi Zhu",
        "Fei Mi",
        "Baojun Wang",
        "Lifeng Shang",
        "Xin Jiang",
        "Qun Liu"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey provides a comprehensive overview of current research in data management within both the pretraining and supervised fine-tuning stages of LLMs, covering various noteworthy aspects of data management strategy design: data quantity, data quality, domain/task composition, etc."
    },
    "citationCount": 13,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}