{
    "acronym": "119ee96ef4a9293462da3d4d2db32f2d58f90e8d",
    "title": "ILCiteR: Evidence-grounded Interpretable Local Citation Recommendation",
    "seed_ids": [
        "transformer",
        "bert"
    ],
    "s2id": "119ee96ef4a9293462da3d4d2db32f2d58f90e8d",
    "abstract": "Existing Machine Learning approaches for local citation recommendation directly map or translate a query, which is typically a claim or an entity mention, to citation-worthy research papers. Within such a formulation, it is challenging to pinpoint why one should cite a specific research paper for a particular query, leading to limited recommendation interpretability. To alleviate this, we introduce the evidence-grounded local citation recommendation task, where the target latent space comprises evidence spans for recommending specific papers. Using a distantly-supervised evidence retrieval and multi-step re-ranking framework, our proposed system, ILCiteR, recommends papers to cite for a query grounded on similar evidence spans extracted from the existing research literature. Unlike past formulations that simply output recommendations, ILCiteR retrieves ranked lists of evidence span and recommended paper pairs. Secondly, previously proposed neural models for citation recommendation require expensive training on massive labeled data, ideally after every significant update to the pool of candidate papers. In contrast, ILCiteR relies solely on distant supervision from a dynamic evidence database and pre-trained Transformer-based Language Models without any model training. We contribute a novel dataset for the evidence-grounded local citation recommendation task and demonstrate the efficacy of our proposed conditional neural rank-ensembling approach for re-ranking evidence spans.",
    "authors": [
        "Sayar Ghosh Roy",
        "Jiawei Han"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces the evidence-grounded local citation recommendation task, and contributes a novel dataset for the evidence-grounded local citation recommendation task and demonstrates the efficacy of the proposed conditional neural rank-ensembling approach for re-ranking evidence spans."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}