{
    "acronym": "11beca761c3079f7612204ed1b241ee8832107c9",
    "title": "Deepfake Text Detection in the Wild",
    "seed_ids": [
        "longformer",
        "1c13af186d1e177b85ef1ec3fc7b8d33ec314cfd",
        "a279d7d05ce4cf849879e6948c34613b2dade858",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "11beca761c3079f7612204ed1b241ee8832107c9",
    "abstract": "Recent advances in large language models have enabled them to reach a level of text generation comparable to that of humans. These models show powerful capabilities across a wide range of content, including news article writing, story generation, and scientiﬁc writing. Such capability further narrows the gap between human-authored and machine-generated texts, highlighting the importance of deepfake text detection to avoid potential risks such as fake news propagation and plagia-rism. However, previous work has been limited in that they testify methods on testbeds of speciﬁc domains or certain language models. In practical scenarios, the detector faces texts from various domains or LLMs without knowing their sources. To this end, we build a wild testbed by gathering texts from various human writings and deepfake texts generated by different LLMs. Human annotators are only slightly better than random guessing at identifying machine-generated texts. Empirical results on automatic detection meth-ods further showcase the challenges of deep-fake text detection in a wild testbed. In addition, out-of-distribution poses a greater challenge for a detector to be employed in realistic application scenarios. We release our resources at https://github.com/yafuly/ DeepfakeTextDetect .",
    "authors": [
        "Yafu Li",
        "Qintong Li",
        "Leyang Cui",
        "Wei Bi",
        "Longyue Wang",
        "Linyi Yang",
        "Shuming Shi",
        "Yue Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A wild testbed is built by gathering texts from various human writings and deepfake texts generated by different LLMs to showcase the challenges of deep-fake text detection in a wild testbed and show empirical results on automatic detection meth-ods."
    },
    "citationCount": 45,
    "influentialCitationCount": 6,
    "code": null,
    "description": null,
    "url": null
}