{
    "acronym": "11cf88dce827bd67cbfa60400306318022e736d5",
    "title": "D4: Improving LLM Pretraining via Document De-Duplication and Diversification",
    "seed_ids": [
        "gpt2",
        "9e16d8cc6096ec0d2733a4ecf41ce09d9a4bd19c",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "9405cc0d6169988371b2755e573cc28650d14dfe",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "11cf88dce827bd67cbfa60400306318022e736d5",
    "abstract": "Over recent years, an increasing amount of compute and data has been poured into training large language models (LLMs), usually by doing one-pass learning on as many tokens as possible randomly selected from large-scale web corpora. While training on ever-larger portions of the internet leads to consistent performance improvements, the size of these improvements diminishes with scale, and there has been little work exploring the effect of data selection on pre-training and downstream performance beyond simple de-duplication methods such as MinHash. Here, we show that careful data selection (on top of de-duplicated data) via pre-trained model embeddings can speed up training (20% efficiency gains) and improves average downstream accuracy on 16 NLP tasks (up to 2%) at the 6.7B model scale. Furthermore, we show that repeating data intelligently consistently outperforms baseline training (while repeating random data performs worse than baseline training). Our results indicate that clever data selection can significantly improve LLM pre-training, calls into question the common practice of training for a single epoch on as much data as possible, and demonstrates a path to keep improving our models past the limits of randomly sampling web data.",
    "authors": [
        "Kushal Tirumala",
        "Daniel Simig",
        "Armen Aghajanyan",
        "Ari S. Morcos"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results indicate that clever data selection can significantly improve LLM pre-training, calls into question the common practice of training for a single epoch on as much data as possible, and demonstrates a path to keep improving the authors' models past the limits of randomly sampling web data."
    },
    "citationCount": 42,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}