{
    "acronym": "11dda1081d32b607ea89b7e1028052af5583b25d",
    "title": "Do Language Models Enjoy Their Own Stories? Prompting Large Language Models for Automatic Story Evaluation",
    "seed_ids": [
        "gpt2",
        "gpt3",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "df7bf316e7bad359e87b10544155be09336720ca",
        "e7c698bdace380f7183dedbe657686f1885f615c",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "11dda1081d32b607ea89b7e1028052af5583b25d",
    "abstract": "Storytelling is an integral part of human experience and plays a crucial role in social interactions. Thus, Automatic Story Evaluation (ASE) and Generation (ASG) could benefit society in multiple ways, but they are challenging tasks which require high-level human abilities such as creativity, reasoning and deep understanding. Meanwhile, Large Language Models (LLM) now achieve state-of-the-art performance on many NLP tasks. In this paper, we study whether LLMs can be used as substitutes for human annotators for ASE. We perform an extensive analysis of the correlations between LLM ratings, other automatic measures, and human annotations, and we explore the influence of prompting on the results and the explainability of LLM behaviour. Most notably, we find that LLMs outperform current automatic measures for system-level evaluation but still struggle at providing satisfactory explanations for their answers.",
    "authors": [
        "Cyril Chhun",
        "Fabian M. Suchanek",
        "Chloé Clavel"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An extensive analysis of the correlations between LLM ratings, other automatic measures, and human annotations, and the influence of prompting on the results and the explainability of LLM behaviour finds that LLMs outperform current automatic measures for system-level evaluation but still struggle at providing satisfactory explanations for their answers."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}