{
    "acronym": "11e56b35fa81ddb00dc96329c077c5b39c8f9e75",
    "title": "A Glitch in the Matrix? Locating and Detecting Language Model Grounding with Fakepedia",
    "seed_ids": [
        "gpt2",
        "cd471b5ef162906ef3d9a84398b3f98e9ee4bf56",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "11e56b35fa81ddb00dc96329c077c5b39c8f9e75",
    "abstract": "Large language models (LLMs) have an impressive ability to draw on novel information supplied in their context. Yet the mechanisms underlying this contextual grounding remain unknown, especially in situations where contextual information contradicts factual knowledge stored in the parameters, which LLMs also excel at recalling. Favoring the contextual information is critical for retrieval-augmented generation methods, which enrich the context with up-to-date information, hoping that grounding can rectify outdated or noisy stored knowledge. We present a novel method to study grounding abilities using Fakepedia, a novel dataset of counterfactual texts constructed to clash with a model's internal parametric knowledge. In this study, we introduce Fakepedia, a counterfactual dataset designed to evaluate grounding abilities when the internal parametric knowledge clashes with the contextual information. We benchmark various LLMs with Fakepedia and conduct a causal mediation analysis of LLM components when answering Fakepedia queries, based on our Masked Grouped Causal Tracing (MGCT) method. Through this analysis, we identify distinct computational patterns between grounded and ungrounded responses. We finally demonstrate that distinguishing grounded from ungrounded responses is achievable through computational analysis alone. Our results, together with existing findings about factual recall mechanisms, provide a coherent narrative of how grounding and factual recall mechanisms interact within LLMs.",
    "authors": [
        "Giovanni Monea",
        "Maxime Peyrard",
        "Martin Josifoski",
        "Vishrav Chaudhary",
        "Jason Eisner",
        "Emre Kiciman",
        "Hamid Palangi",
        "Barun Patra",
        "Robert West"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study introduces Fakepedia, a counterfactual dataset designed to evaluate grounding abilities when the internal parametric knowledge clashes with the contextual information, and identifies distinct computational patterns between grounded and ungrounded responses."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}