{
    "acronym": "122dbf4c968a448fb2dde6c5c4a10f2697364531",
    "title": "ManiTweet: A New Benchmark for Identifying Manipulation of News on Social Media",
    "seed_ids": [
        "longformer",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "42f8a3da7021bc725fa14fdb63fa9c7c9fc934f6",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "122dbf4c968a448fb2dde6c5c4a10f2697364531",
    "abstract": "Considerable advancements have been made to tackle the misrepresentation of information derived from reference articles in the domains of fact-checking and faithful summarization. However, an unaddressed aspect remains - the identification of social media posts that manipulate information within associated news articles. This task presents a significant challenge, primarily due to the prevalence of personal opinions in such posts. We present a novel task, identifying manipulation of news on social media, which aims to detect manipulation in social media posts and identify manipulated or inserted information. To study this task, we have proposed a data collection schema and curated a dataset called ManiTweet, consisting of 3.6K pairs of tweets and corresponding articles. Our analysis demonstrates that this task is highly challenging, with large language models (LLMs) yielding unsatisfactory performance. Additionally, we have developed a simple yet effective basic model that outperforms LLMs significantly on the ManiTweet dataset. Finally, we have conducted an exploratory analysis of human-written tweets, unveiling intriguing connections between manipulation and the domain and factuality of news articles, as well as revealing that manipulated sentences are more likely to encapsulate the main story or consequences of a news outlet.",
    "authors": [
        "Kung-Hsiang Huang",
        "Hou Pong Chan",
        "K. McKeown",
        "Heng Ji"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An exploratory analysis of human-written tweets reveals intriguing connections between manipulation and the domain and factuality of news articles, as well as revealing that manipulated sentences are more likely to encapsulate the main story or consequences of a news outlet."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}