{
    "acronym": "12640af46eaf4c16125557b517a2d37fca70a82d",
    "title": "Ripple Attention for Visual Perception with Sub-quadratic Complexity",
    "seed_ids": [
        "performer",
        "rfa",
        "0d508600d77d8a7e6a655cdb6d139779732f649f",
        "08ffdec40291a2ccb5f8a6cc048b01247fb34b96",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "054e307c1edf4b28137ffcbce980fe81f0647d20",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "1a703f08da01cf737cce3fb9064259b3f4b44e9c",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "5a9bc55f6332e38f62eb509b684147a1d4f10fd9"
    ],
    "s2id": "12640af46eaf4c16125557b517a2d37fca70a82d",
    "abstract": "Transformer architectures are now central to sequence modeling tasks. At its heart is the attention mechanism, which enables effective modeling of long-term dependencies in a sequence. Recently, transformers have been successfully applied in the computer vision domain, where 2D images are first segmented into patches and then treated as 1D sequences. Such linearization, however, impairs the notion of spatial locality in images, which bears important visual clues. To bridge the gap, we propose ripple attention, a sub-quadratic attention mechanism for vision transformers. Built upon the recent kernel-based efficient attention mechanisms, we design a novel dynamic programming algorithm that weights contributions of different tokens to a query with respect to their relative spatial distances in the 2D space in linear observed time. Extensive experiments and analyses demonstrate the effectiveness of ripple attention on various visual tasks.",
    "authors": [
        "Lin Zheng",
        "Huijie Pan",
        "Lingpeng Kong"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work designs a novel dynamic programming algorithm that weights contributions of different tokens to a query with respect to their relative spatial distances in the 2D space in linear observed time, and demonstrates the effectiveness of ripple attention on various visual tasks."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}