{
    "acronym": "12975ab22e9bee532404337a944b5c509a35cde5",
    "title": "Visual Correspondence Hallucination: Towards Geometric Reasoning",
    "seed_ids": [
        "lineartransformer",
        "6f68e1bb253925d8431588555d3010419f322e04"
    ],
    "s2id": "12975ab22e9bee532404337a944b5c509a35cde5",
    "abstract": "Given a pair of partially overlapping source and target images and a keypoint in the source image, the keypoint's correspondent in the target image can be either visible, occluded or outside the field of view. Local feature matching methods are only able to identify the correspondent's location when it is visible, while humans can also hallucinate its location when it is occluded or outside the field of view through geometric reasoning. In this paper, we bridge this gap by training a network to output a peaked probability distribution over the correspondent's location, regardless of this correspondent being visible, occluded, or outside the field of view. We experimentally demonstrate that this network is indeed able to hallucinate correspondences on pairs of images captured in scenes that were not seen at training-time. We also apply this network to an absolute camera pose estimation problem and find it is significantly more robust than state-of-the-art local feature matching-based competitors.",
    "authors": [
        "Hugo Germain",
        "V. Lepetit",
        "Guillaume Bourmaud"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper trains a network to output a peaked probability distribution over the correspondent's location, regardless of this correspondent being visible, occluded, or outside the field of view, and finds it is significantly more robust than state-of-the-art local feature matching-based competitors."
    },
    "citationCount": 11,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}