{
    "acronym": "12daedd80a4f860960c5b50314d09d6827f4fd4a",
    "title": "Controllable Text Generation with Neurally-Decomposed Oracle",
    "seed_ids": [
        "gpt2",
        "a6238191cc43c41a544caadcf8b00947293cf099",
        "76a786b1acd6d1aca56e12a8a1db34569fdf9f3a",
        "b6c4a96e09b9f11e7c70e7f1fbe3f3971b92762d",
        "1f479fe113b0a4a5d6da08e0632395d3273fd3dd",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "8ace90207a1792f5a8b06f06fba3d5ef43d1bf57",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "12daedd80a4f860960c5b50314d09d6827f4fd4a",
    "abstract": "We propose a general and efficient framework to control auto-regressive generation models with NeurAlly-Decomposed Oracle (NADO). Given a pre-trained base language model and a sequence-level boolean oracle function, we propose to decompose the oracle function into token-level guidance to steer the base model in text generation. Specifically, the token-level guidance is approximated by a neural model trained with examples sampled from the base model, demanding no additional auxiliary labeled data. Based on posterior regularization, we present the closed-form optimal solution to incorporate the token-level guidance into the base model for controllable generation. We further provide a theoretical analysis of how the approximation quality of NADO affects the controllable generation results. Experiments conducted on two applications: (1) text generation with lexical constraints and (2) machine translation with formality control demonstrate that our framework efficiently guides the base model towards the given oracle while maintaining high generation quality.",
    "authors": [
        "Tao Meng",
        "Sidi Lu",
        "Nanyun Peng",
        "Kai-Wei Chang"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a general and efficient framework to control auto-regressive generation models with NeurAlly-Decomposed Oracle (NADO), and presents the closed-form optimal solution to incorporate the token-level guidance into the base model for controllable generation."
    },
    "citationCount": 26,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}