{
    "acronym": "12dcf2547aa4b8524b93f6a07d898b37feeef8af",
    "title": "A Novel ML classifier Using Modern Hopfield Neural Networks",
    "seed_ids": [
        "hopfield",
        "264fb3355fe11c9063bc9e466d438f720d15ef52"
    ],
    "s2id": "12dcf2547aa4b8524b93f6a07d898b37feeef8af",
    "abstract": "State-of-the-art classification neural networks, used for images and various data types, are complex and require significant energy and computational resources relying on super-vised gradient back-propagation. In contrast, the Hopfield Neural Network (HNN) is simpler, being a single-layer, fully connected network that mimics the human brain's associative memory network, making it easy to implement and computationally efficient. Its compatibility with oscillatory neural networks (ONNs) makes it ideal for lightweight machine learning applications in the Internet of Things (IoT) era. Normally, HNN has been primarily used for associative memory aiding in image processing, pattern recognition, and more, but this paper introduces it as a classifier. The proposed HNN classifier is adaptable to various datasets, including images and tabular data, and requires zero training time, making it suitable for resource-limited environments. It represents a significant leap in classification, with the highest accuracy reported for HNN classifiers to the best of our knowl-edge, achieving 96% accuracy on the MNIST dataset, a 36% percentage improvement over previous models.",
    "authors": [
        "Mohamed Abdelkarim",
        "Hanan Ahmed Kamal",
        "Doaa Shawky"
    ],
    "venue": "International Conference on Multimodal Interaction",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed HNN classifier is adaptable to various datasets, including images and tabular data, and requires zero training time, making it suitable for resource-limited environments."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}