{
    "acronym": "12f4ecdca95f13e87716267ced16284e58b5332a",
    "title": "PopALM: Popularity-Aligned Language Models for Social Media Trendy Response Prediction",
    "seed_ids": [
        "gpt2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "6ebfbc954b9975d2f2651f380b9bdf46ae963178",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "12f4ecdca95f13e87716267ced16284e58b5332a",
    "abstract": "Social media platforms are daily exhibiting millions of events. To preliminarily predict the mainstream public reaction to these events, we study trendy response prediction to automatically generate top-liked user replies to social media events. While previous works focus on generating responses without factoring in popularity, we propose Popularity-Aligned Language Models (PopALM) to distinguish responses liked by a larger audience through reinforcement learning. Recognizing the noisy labels from user “likes”, we tailor-make curriculum learning in proximal policy optimization (PPO) to help models capture the essential samples for easy-to-hard training. In experiments, we build a large-scale Weibo dataset for trendy response prediction, and its results show that PopALM can help boost the performance of advanced language models.",
    "authors": [
        "Erxin Yu",
        "Jing Li",
        "Chunpu Xu"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes Popularity-Aligned Language Models (PopALM) to distinguish responses liked by a larger audience through reinforcement learning, and tailor-make curriculum learning in proximal policy optimization (PPO) to help models capture the essential samples for easy-to-hard training."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}