{
    "acronym": "1306680402070eecd37da6bb0d531017166c5f80",
    "title": "The Piano Inpainting Application",
    "seed_ids": [
        "lineartransformer",
        "eb0931c39904a40c6cb4aa35c9b21d5e3b7dc856",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "ce510c6cfeac703706460680e977c54554840830",
        "59a916cdc943f0282908e6f3fa0360f4c5fb78d0",
        "24a70db0bbb5f486126477e32a6a44ab917a4b11",
        "fb507ada871d1e8c29e376dbf7b7879689aa89f9"
    ],
    "s2id": "1306680402070eecd37da6bb0d531017166c5f80",
    "abstract": "Autoregressive models are now capable of generating high-quality minute-long expressive MIDI piano performances. Even though this progress suggests new tools to assist music composition, we observe that generative algorithms are still not widely used by artists due to the limited control they offer, prohibitive inference times or the lack of integration within musicians' workflows. In this work, we present the Piano Inpainting Application (PIA), a generative model focused on inpainting piano performances, as we believe that this elementary operation (restoring missing parts of a piano performance) encourages human-machine interaction and opens up new ways to approach music composition. Our approach relies on an encoder-decoder Linear Transformer architecture trained on a novel representation for MIDI piano performances termed Structured MIDI Encoding. By uncovering an interesting synergy between Linear Transformers and our inpainting task, we are able to efficiently inpaint contiguous regions of a piano performance, which makes our model suitable for interactive and responsive A.I.-assisted composition. Finally, we introduce our freely-available Ableton Live PIA plugin, which allows musicians to smoothly generate or modify any MIDI clip using PIA within a widely-used professional Digital Audio Workstation.",
    "authors": [
        "Gaëtan Hadjeres",
        "Léopold Crestel"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents the Piano Inpainting Application (PIA), a generative model focused on inpainting piano performances, as it believes that this elementary operation (restoring missing parts of a piano performance) encourages human-machine interaction and opens up new ways to approach music composition."
    },
    "citationCount": 21,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}