{
    "acronym": "130850322b067af6961d49c84b04e8eee0002842",
    "title": "CAMELoT: Towards Large Language Models with Training-Free Consolidated Associative Memory",
    "seed_ids": [
        "transformerxl",
        "compressivetransformer",
        "b069c32fcd77160f944ab3ba71ab6f0cfb782c68",
        "80980cd10d19f021c14a6b7eee871b6a5d328024",
        "2f7364d8e5cf94315bf8905f57de9c5543e9a4bf",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "130850322b067af6961d49c84b04e8eee0002842",
    "abstract": "Large Language Models (LLMs) struggle to handle long input sequences due to high memory and runtime costs. Memory-augmented models have emerged as a promising solution to this problem, but current methods are hindered by limited memory capacity and require costly re-training to integrate with a new LLM. In this work, we introduce an associative memory module which can be coupled to any pre-trained (frozen) attention-based LLM without re-training, enabling it to handle arbitrarily long input sequences. Unlike previous methods, our associative memory module consolidates representations of individual tokens into a non-parametric distribution model, dynamically managed by properly balancing the novelty and recency of the incoming data. By retrieving information from this consolidated associative memory, the base LLM can achieve significant (up to 29.7% on Arxiv) perplexity reduction in long-context modeling compared to other baselines evaluated on standard benchmarks. This architecture, which we call CAMELoT (Consolidated Associative Memory Enhanced Long Transformer), demonstrates superior performance even with a tiny context window of 128 tokens, and also enables improved in-context learning with a much larger set of demonstrations.",
    "authors": [
        "Zexue He",
        "Leonid Karlinsky",
        "Donghyun Kim",
        "Julian McAuley",
        "Dmitry Krotov",
        "Rogério Feris"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces an associative memory module which can be coupled to any pre-trained (frozen) attention-based LLM without re-training, enabling it to handle arbitrarily long input sequences, and demonstrates superior performance even with a tiny context window of 128 tokens."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}