{
    "acronym": "1321cda5cb160285de0548a999b4b941156ba764",
    "title": "Threads of Subtlety: Detecting Machine-Generated Texts Through Discourse Motifs",
    "seed_ids": [
        "longformer",
        "4ad189079046bf9df0f8ece7545e42dc00e13b9f",
        "5156b3be33abbc3267b2d41e35537bf33c149420",
        "1c13af186d1e177b85ef1ec3fc7b8d33ec314cfd",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "11beca761c3079f7612204ed1b241ee8832107c9"
    ],
    "s2id": "1321cda5cb160285de0548a999b4b941156ba764",
    "abstract": "With the advent of large language models (LLM), the line between human-crafted and machine-generated texts has become increasingly blurred. This paper delves into the inquiry of identifying discernible and unique linguistic properties in texts that were written by humans, particularly uncovering the underlying discourse structures of texts beyond their surface structures. Introducing a novel methodology, we leverage hierarchical parse trees and recursive hypergraphs to unveil distinctive discourse patterns in texts produced by both LLMs and humans. Empirical findings demonstrate that, although both LLMs and humans generate distinct discourse patterns influenced by specific domains, human-written texts exhibit more structural variability, reflecting the nuanced nature of human writing in different domains. Notably, incorporating hierarchical discourse features enhances binary classifiers' overall performance in distinguishing between human-written and machine-generated texts, even on out-of-distribution and paraphrased samples. This underscores the significance of incorporating hierarchical discourse features in the analysis of text patterns. The code and dataset are available at https://github.com/minnesotanlp/threads-of-subtlety.",
    "authors": [
        "Zae Myung Kim",
        "Kwang Hee Lee",
        "Preston Zhu",
        "Vipul Raheja",
        "Dongyeop Kang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper delves into the inquiry of identifying discernible and unique linguistic properties in texts that were written by humans, particularly uncovering the underlying discourse structures of texts beyond their surface structures, using hierarchical parse trees and recursive hypergraphs."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}