{
    "acronym": "133c1a50c67cbebdc71b94b0e0455a97fed943f0",
    "title": "Bilingual Language Modeling, A transfer learning technique for Roman Urdu",
    "seed_ids": [
        "gpt",
        "069e0d896da7c79faeee4cf057548d5da7ce885e",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "133c1a50c67cbebdc71b94b0e0455a97fed943f0",
    "abstract": "Pretrained language models are now of widespread use in Natural Language Processing. Despite their success, applying them to Low Resource languages is still a huge challenge. Although Multilingual models hold great promise, applying them to specific low-resource languages e.g. Roman Urdu can be excessive. In this paper, we show how the code-switching property of languages may be used to perform cross-lingual transfer learning from a corresponding high resource language. We also show how this transfer learning technique termed Bilingual Language Modeling can be used to produce better performing models for Roman Urdu. To enable training and experimentation, we also present a collection of novel corpora for Roman Urdu extracted from various sources and social networking sites, e.g. Twitter. We train Monolingual, Multilingual, and Bilingual models of Roman Urdu - the proposed bilingual model achieves 23% accuracy compared to the 2% and 11% of the monolingual and multilingual models respectively in the Masked Language Modeling (MLM) task.",
    "authors": [
        "Usama Khalid",
        "M. O. Beg",
        "Muhammad Umair Arshad"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown how the code-switching property of languages may be used to perform cross-lingual transfer learning from a corresponding high resource language and how this transfer learning technique termed Bilingual Language Modeling can be used for Roman Urdu."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}