{
    "acronym": "135521c4432193178966a5ec24343f1a1599d541",
    "title": "VLLaVO: Mitigating Visual Gap through LLMs",
    "seed_ids": [
        "gpt3",
        "42a30dc5470f54ec249f25d3c31e05d7c376c8e3",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "135521c4432193178966a5ec24343f1a1599d541",
    "abstract": "Recent advances achieved by deep learning models rely on the independent and identically distributed assumption, hindering their applications in real-world scenarios with domain shifts. To tackle this issue, cross-domain learning aims at extracting domain-invariant knowledge to reduce the domain shift between training and testing data. However, in visual cross-domain learning, traditional methods concentrate solely on the image modality, disregarding the potential benefits of incorporating the text modality. In this work, we propose VLLaVO, combining Vision language models and Large Language models as Visual cross-dOmain learners. VLLaVO uses vision-language models to convert images into detailed textual descriptions. A large language model is then finetuned on textual descriptions of the source/target domain generated by a designed instruction template. Extensive experimental results under domain generalization and unsupervised domain adaptation settings demonstrate the effectiveness of the proposed method.",
    "authors": [
        "Shuhao Chen",
        "Yulong Zhang",
        "Weisen Jiang",
        "Jiangang Lu",
        "Yu Zhang"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes VLLaVO, combining Vision language models and Large Language models as Visual cross-dOmain learners, using vision-language models to convert images into detailed textual descriptions and finetuned on textual descriptions of the source/target domain generated by a designed instruction template."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}