{
    "acronym": "137678f05e803cefca1ce941ef270f9fbaf6e11f",
    "title": "BigFive: A Chinese Textual Dataset Supporting Psychology Knowledge Graph Construction",
    "seed_ids": [
        "bert"
    ],
    "s2id": "137678f05e803cefca1ce941ef270f9fbaf6e11f",
    "abstract": "Obtaining the personalities of users conveyed by their published short texts has a wide and important range of applications, from detecting abnormal behavior of online users to accurately customization recommendation. Advancement in this area can be improved using large-scale datasets with coarse- and fine-grained typologies, adaptable to multiple downstream tasks, i.e., psychology knowledge graph construction and intelligence collection of psychological questionaries. Although the LIWC lexicon helps personality prediction, the larger volume of textual dataset related to Big Five personality types still cannot meet the requirements of researches and applications, especially for tasks in Chinese. Therefore, this paper introduces BigFive, a large, high quality Chinese textual dataset manually annotated by the psychological experts. BigFive contains 13,478 Chinese phrases that belong to five categories (coarse-grained) and 30 categories (fine-grained). The reliability of five categories grouped by personality level and 30 categories grouped by dimension level is demonstrated via a detailed data analysis. In addition, a strong baseline is build based on a fine-tuning BERT model. Our BERT-based model achieves an average F1-score of. 33 (std=.24) in terms of 30 categories and an average F1-score of. 66 (std=.05) in terms of five categories. The experimental results suggest that there is much room for improvement.",
    "authors": [
        "Qingren Wang",
        "Ao Liu",
        "Kang Yan",
        "Juan Hou",
        "Wei Li"
    ],
    "venue": "2023 IEEE International Conference on Knowledge Graph (ICKG)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "BigFive is introduced, a large, high quality Chinese textual dataset manually annotated by the psychological experts that contains 13,478 Chinese phrases that belong to five categories (coarse-grained) and 30 categories (fine-grained) and the reliability of five categories grouped by personality level and 30 categories grouped by dimension level is demonstrated via a detailed data analysis."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}