{
    "acronym": "13965d8d68217308ff8c7e738ced637739c6a1b8",
    "title": "Bridging Language and Items for Retrieval and Recommendation",
    "seed_ids": [
        "bert",
        "84725855d10b531eb8cbe54935dda0440c2fc750",
        "11628f656257e75e46447ac21cdaa86c4b340a0a",
        "56e5674a4e9daf6af1e230dcc46a4c3c170892d4"
    ],
    "s2id": "13965d8d68217308ff8c7e738ced637739c6a1b8",
    "abstract": "This paper introduces BLaIR, a series of pretrained sentence embedding models specialized for recommendation scenarios. BLaIR is trained to learn correlations between item metadata and potential natural language context, which is useful for retrieving and recommending items. To pretrain BLaIR, we collect Amazon Reviews 2023, a new dataset comprising over 570 million reviews and 48 million items from 33 categories, significantly expanding beyond the scope of previous versions. We evaluate the generalization ability of BLaIR across multiple domains and tasks, including a new task named complex product search, referring to retrieving relevant items given long, complex natural language contexts. Leveraging large language models like ChatGPT, we correspondingly construct a semi-synthetic evaluation set, Amazon-C4. Empirical results on the new task, as well as conventional retrieval and recommendation tasks, demonstrate that BLaIR exhibit strong text and item representation capacity. Our datasets, code, and checkpoints are available at: https://github.com/hyp1231/AmazonReviews2023.",
    "authors": [
        "Yupeng Hou",
        "Jiacheng Li",
        "Zhankui He",
        "An Yan",
        "Xiusi Chen",
        "Julian McAuley"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "BLaIR, a series of pretrained sentence embedding models specialized for recommendation scenarios, is introduced, and empirical results on the new task, as well as conventional retrieval and recommendation tasks, demonstrate that BLaIR exhibit strong text and item representation capacity."
    },
    "citationCount": 14,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}