{
    "acronym": "139ebdcaa3d5f60a3c5289bb61d5865141886d51",
    "title": "Optical Transformers",
    "seed_ids": [
        "gpt2",
        "5eda60d4940d4185df45c5703e103458171d465d",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "139ebdcaa3d5f60a3c5289bb61d5865141886d51",
    "abstract": "The rapidly increasing size of deep-learning models has caused renewed and growing interest in alternatives to digital computers to dramatically reduce the energy cost of running state-of-the-art neural networks. Optical matrix-vector multipliers are best suited to performing computations with very large operands, which suggests that large Transformer models could be a good target for optical computing. To test this idea, we performed small-scale optical experiments with a prototype accelerator to demonstrate that Transformer operations can run on optical hardware despite noise and errors. Using simulations, validated by our experiments, we then explored the energy efficiency of optical implementations of Transformers and identified scaling laws for model performance with respect to optical energy usage. We found that the optical energy per multiply-accumulate (MAC) scales as $\\frac{1}{d}$ where $d$ is the Transformer width, an asymptotic advantage over digital systems. We conclude that with well-engineered, large-scale optical hardware, it may be possible to achieve a $100 \\times$ energy-efficiency advantage for running some of the largest current Transformer models, and that if both the models and the optical hardware are scaled to the quadrillion-parameter regime, optical computers could have a $>8,000\\times$ energy-efficiency advantage over state-of-the-art digital-electronic processors that achieve 300 fJ/MAC. We analyzed how these results motivate and inform the construction of future optical accelerators along with optics-amenable deep-learning approaches. With assumptions about future improvements to electronics and Transformer quantization techniques (5$\\times$ cheaper memory access, double the digital--analog conversion efficiency, and 4-bit precision), we estimated that optical computers' advantage against current 300-fJ/MAC digital processors could grow to $>100,000\\times$.",
    "authors": [
        "Maxwell G. Anderson",
        "Shifan Ma",
        "Tianyu Wang",
        "Logan G. Wright",
        "P. McMahon"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": null,
    "citationCount": 11,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}