{
    "acronym": "1436ee75f8dded44de157cf778a96bdaf6b20a76",
    "title": "Hierarchical multimodal transformers for Multi-Page DocVQA",
    "seed_ids": [
        "bigbird",
        "longformer",
        "182ba87b08726063765f3bed20ca53adf6e1f472",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "1436ee75f8dded44de157cf778a96bdaf6b20a76",
    "abstract": "Document Visual Question Answering (DocVQA) refers to the task of answering questions from document images. Existing work on DocVQA only considers single-page documents. However, in real scenarios documents are mostly composed of multiple pages that should be processed altogether. In this work we extend DocVQA to the multi-page scenario. For that, we first create a new dataset, MP-DocVQA, where questions are posed over multi-page documents instead of single pages. Second, we propose a new hierarchical method, Hi-VT5, based on the T5 architecture, that overcomes the limitations of current methods to process long multi-page documents. The proposed method is based on a hierarchical transformer architecture where the encoder summarizes the most relevant information of every page and then, the decoder takes this summarized information to generate the final answer. Through extensive experimentation, we demonstrate that our method is able, in a single stage, to answer the questions and provide the page that contains the relevant information to find the answer, which can be used as a kind of explainability measure.",
    "authors": [
        "Rubèn Pérez Tito",
        "Dimosthenis Karatzas",
        "Ernest Valveny"
    ],
    "venue": "Pattern Recognition",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work creates a new dataset, MP-DocVQA, and proposes a new hierarchical method, Hi-VT5, based on the T5 architecture, that overcomes the limitations of current methods to process long multi-page documents."
    },
    "citationCount": 24,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}