{
    "acronym": "145192bfb7bbae61d006339d84758f6a39a1a8cb",
    "title": "Free-form Conversation with Human and Symbolic Avatars in Mixed Reality",
    "seed_ids": [
        "gpt3",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "145192bfb7bbae61d006339d84758f6a39a1a8cb",
    "abstract": "The integration of large language models and mixed reality technologies has enabled users to engage in free-form conversations with virtual agents across different “realities”. However, if and how the agent’s visual representation, especially when combined with mixed reality environments, will affect the conversation content or user experience is not yet fully understood. In this work, we design and conduct a user study involving two types of visual representations (a human avatar and a symbolic avatar) and two mixed reality environments (virtual reality and augmented reality), facilitating a free-form conversation experience with GPT-3 powered agents. We found evidence that the use of virtual or augmented realities can influence conversation content. Users chatting with avatars in virtual reality made significantly more references to the location or the space, suggesting they tended to perceive conversations as occurring in the agent’s space, whereas the physical AR environment was perhaps more perceived as the user’s space. Conversations with the human avatar improve user recall of the conversation, even though there is no evidence of increased information extracted during the conversation. These observations and our analysis of post-study questionnaires suggest that human avatars can positively impact user memory and experience. We hope our findings and the open-source implementation will help facilitate future research on free-form conversational agents in mixed reality.",
    "authors": [
        "Jiarui Zhu",
        "Radha Kumaran",
        "Chengyuan Xu",
        "Tobias Höllerer"
    ],
    "venue": "International Symposium on Mixed and Augmented Reality",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Evidence that the use of virtual or augmented realities can influence conversation content is found and it is suggested that human avatars can positively impact user memory and experience."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}