{
    "acronym": "145b706e88a17c1b45588af77c4e0aa9a92bdee3",
    "title": "Can Language Model Moderators Improve the Health of Online Discourse?",
    "seed_ids": [
        "gpt3",
        "f78fe02f681a0a9a6867b007bd39e3884de64a91",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "36c50e6638dddc8324eef9bfa064bfcab80cbef4",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "31ced335258047c2b6703165887d87048b8acc98"
    ],
    "s2id": "145b706e88a17c1b45588af77c4e0aa9a92bdee3",
    "abstract": "Conversational moderation of online communities is crucial to maintaining civility for a constructive environment, but it is challenging to scale and harmful to moderators. The inclusion of sophisticated natural language generation modules as a force multiplier to aid human moderators is a tantalizing prospect, but adequate evaluation approaches have so far been elusive. In this paper, we establish a systematic definition of conversational moderation effectiveness grounded on moderation literature and establish design criteria for conducting realistic yet safe evaluation. We then propose a comprehensive evaluation framework to assess models’ moderation capabilities independently of human intervention. With our framework, we conduct the first known study of language models as conversational moderators, finding that appropriately prompted models that incorporate insights from social science can provide specific and fair feedback on toxic behavior but struggle to influence users to increase their levels of respect and cooperation.",
    "authors": [
        "Hyundong Justin Cho",
        "Shuai Liu",
        "Taiwei Shi",
        "Darpan Jain",
        "Basem Rizk",
        "Yuyang Huang",
        "Zixun Lu",
        "Nuan Wen",
        "Jonathan Gratch",
        "Emilio Ferrera",
        "Jonathan May"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "With this framework, the first known study of language models as conversational moderators is conducted, finding that appropriately prompted models that incorporate insights from social science can provide specific and fair feedback on toxic behavior but struggle to influence users to increase their levels of respect and cooperation."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}