{
    "acronym": "14adcf7fa62c26b5aec6db83d56a836e3052143d",
    "title": "Controllable Slogan Generation with Diffusion",
    "seed_ids": [
        "diffusionlm",
        "diffuseq",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "7a15950dc71079285a4eaf195de5aadd87c41b40"
    ],
    "s2id": "14adcf7fa62c26b5aec6db83d56a836e3052143d",
    "abstract": "Slogans form an important part of any marketing campaign. Catchy and effective slogans get remembered by the target audience which leads to a long-term word of mouth and reputation, which is crucial for any product. There have been multiple attempts before to generate slogans from product description using language models. But most of these approaches are limited in variance and control. In this paper, we propose an approach that makes use of diffusion to fine-tune a BERT model to generate a slogan in the context of the input text description along with additional control parameters such as sentiment and number of named entities in a plug-and-play manner which provides scalability. We also evaluate the performance of our model with existing approaches to slogan generation and demonstrate the potential of this approach while also providing better control over slogan generated.",
    "authors": [
        "Vedant Kulkarni",
        "Devansh Mundada",
        "Ved Patwardhan",
        "Yash Pawar",
        "Pranjali P. Joshi"
    ],
    "venue": "International Conference on Computing Communication Control and automation",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes an approach that makes use of diffusion to fine-tune a BERT model to generate a slogan in the context of the input text description along with additional control parameters such as sentiment and number of named entities in a plug-and-play manner which provides scalability."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}