{
    "acronym": "14c3cf58192774b9b6fc6188df99efd6ab5fc739",
    "title": "Better Aligning Text-to-Image Models with Human Preference",
    "seed_ids": [
        "classfreediffu",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "82482585e94192b4e9913727e461f89cd08e9725",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "14c3cf58192774b9b6fc6188df99efd6ab5fc739",
    "abstract": "Recent years have witnessed a rapid growth of deep generative models, with text-to-image models gaining significant attention from the public. However, existing models often generate images that do not align well with human aesthetic preferences, such as awkward combinations of limbs and facial expressions. To address this issue, we collect a dataset of human choices on generated images from the Stable Foundation Discord channel. Our experiments demonstrate that current evaluation metrics for generative models do not correlate well with human choices. Thus, we train a human preference classiﬁer with the collected dataset and derive a Human Preference Score (HPS) based on the classiﬁer. Using the HPS, we propose a simple yet effective method to adapt Stable Diffusion to better align with human aesthetic preferences. Our experiments show that the HPS outperforms CLIP in predicting human choices and has good generalization capability towards images generated from other models. By tuning Stable Diffusion with the guidance of the HPS, the adapted model is able to generate images that are more preferred by human users. The project page is available here: https://tgxs002.github.io/align sd web/.",
    "authors": [
        "Xiaoshi Wu",
        "Keqiang Sun",
        "Feng Zhu",
        "Rui Zhao",
        "Hongsheng Li"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a simple yet effective method to adapt Stable Diffusion to better align with human aesthetic preferences and shows that the HPS outperforms CLIP in predicting human choices and has good generalization capability towards images generated from other models."
    },
    "citationCount": 72,
    "influentialCitationCount": 8,
    "code": null,
    "description": null,
    "url": null
}