{
    "acronym": "15736f7c205d961c00378a938daffaacb5a0718d",
    "title": "Human Motion Diffusion Model",
    "seed_ids": [
        "classfreediffu",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999"
    ],
    "s2id": "15736f7c205d961c00378a938daffaacb5a0718d",
    "abstract": "Natural and expressive human motion generation is the holy grail of computer animation. It is a challenging task, due to the diversity of possible motion, human perceptual sensitivity to it, and the difficulty of accurately describing it. Therefore, current generative solutions are either low-quality or limited in expressiveness. Diffusion models, which have already shown remarkable generative capabilities in other domains, are promising candidates for human motion due to their many-to-many nature, but they tend to be resource hungry and hard to control. In this paper, we introduce Motion Diffusion Model (MDM), a carefully adapted classifier-free diffusion-based generative model for the human motion domain. MDM is transformer-based, combining insights from motion generation literature. A notable design-choice is the prediction of the sample, rather than the noise, in each diffusion step. This facilitates the use of established geometric losses on the locations and velocities of the motion, such as the foot contact loss. As we demonstrate, MDM is a generic approach, enabling different modes of conditioning, and different generation tasks. We show that our model is trained with lightweight resources and yet achieves state-of-the-art results on leading benchmarks for text-to-motion and action-to-motion. https://guytevet.github.io/mdm-page/ .",
    "authors": [
        "Guy Tevet",
        "Sigal Raab",
        "Brian Gordon",
        "Yonatan Shafir",
        "Daniel Cohen-Or",
        "Amit H. Bermano"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Motion Diffusion Model (MDM), a carefully adapted classifier-free diffusion-based generative model for the human motion domain, is introduced, a transformer-based approach, enabling different modes of conditioning, and different generation tasks."
    },
    "citationCount": 450,
    "influentialCitationCount": 157,
    "code": null,
    "description": null,
    "url": null
}