{
    "acronym": "157b77d86ea0440e3462fbfaf620ed7d81b6256f",
    "title": "SketchGPT: Autoregressive Modeling for Sketch Generation and Recognition",
    "seed_ids": [
        "gpt2",
        "gpt3",
        "42b3a039a666caab2881bfef244d3ce074b7f529",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "157b77d86ea0440e3462fbfaf620ed7d81b6256f",
    "abstract": "We present SketchGPT, a flexible framework that employs a sequence-to-sequence autoregressive model for sketch generation, and completion, and an interpretation case study for sketch recognition. By mapping complex sketches into simplified sequences of abstract primitives, our approach significantly streamlines the input for autoregressive modeling. SketchGPT leverages the next token prediction objective strategy to understand sketch patterns, facilitating the creation and completion of drawings and also categorizing them accurately. This proposed sketch representation strategy aids in overcoming existing challenges of autoregressive modeling for continuous stroke data, enabling smoother model training and competitive performance. Our findings exhibit SketchGPT's capability to generate a diverse variety of drawings by adding both qualitative and quantitative comparisons with existing state-of-the-art, along with a comprehensive human evaluation study. The code and pretrained models will be released on our official GitHub.",
    "authors": [
        "Adarsh Tiwari",
        "Sanket Biswas",
        "Josep Llad'os"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "SketchGPT leverages the next token prediction objective strategy to understand sketch patterns, facilitating the creation and completion of drawings and also categorizing them accurately, enabling smoother model training and competitive performance."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}