{
    "acronym": "15a782b48fd26f2ce63ab1259e647c3656ce43c7",
    "title": "Split-and-Denoise: Protect large language model inference with local differential privacy",
    "seed_ids": [
        "gpt2",
        "385c2ee0bf829676d1a5aacfc697fc6a9d245ed5",
        "d1101476c85ae324142440e9f568ecbf41625be5",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "15a782b48fd26f2ce63ab1259e647c3656ce43c7",
    "abstract": "Large Language Models (LLMs) excel in natural language understanding by capturing hidden semantics in vector space. This process enriches the value of text embeddings for various downstream tasks, thereby fostering the Embedding-as-a-Service (EaaS) business model. However, the risk of privacy leakage due to direct text transmission to servers remains a critical concern. To address this, we introduce Split-N-Denoise (SnD), an private inference framework that splits the model to execute the token embedding layer on the client side at minimal computational cost. This allows the client to introduce noise prior to transmitting the embeddings to the server, and subsequently receive and denoise the perturbed output embeddings for downstream tasks. Our approach is designed for the inference stage of LLMs and requires no modifications to the model parameters. Extensive experiments demonstrate SnD's effectiveness in optimizing the privacy-utility tradeoff across various LLM architectures and diverse downstream tasks. The results reveal an improvement in performance under the same privacy budget compared to the baselines by over 10\\% on average, offering clients a privacy-preserving solution for local privacy protection.",
    "authors": [
        "Peihua Mai",
        "Ran Yan",
        "Zhe Huang",
        "Youjia Yang",
        "Yan Pang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Split-N-Denoise (SnD) is introduced, an private inference framework that splits the model to execute the token embedding layer on the client side at minimal computational cost, offering clients a privacy-preserving solution for local privacy protection."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}