{
    "acronym": "15fa42c1a2cc0f2df3cfd8f668958688a4b7afb6",
    "title": "Unlocking Pixels for Reinforcement Learning via Implicit Attention",
    "seed_ids": [
        "performer",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "cec7872b194aadf54140578b9be52939eb1112e9",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87"
    ],
    "s2id": "15fa42c1a2cc0f2df3cfd8f668958688a4b7afb6",
    "abstract": "There has recently been significant interest in training reinforcement learning (RL) agents in vision-based environments. This poses many challenges, such as high dimensionality and the potential for observational overfitting through spurious correlations. A promising approach to solve both of these problems is an attention bottleneck, which provides a simple and effective framework for learning high performing policies, even in the presence of distractions. However, due to poor scalability of attention architectures, these methods cannot be applied beyond low resolution visual inputs, using large patches (thus small attention matrices). In this paper we make use of new efficient attention algorithms, recently shown to be highly effective for Transformers, and demonstrate that these techniques can be successfully adopted for the RL setting. This allows our attention-based controllers to scale to larger visual inputs, and facilitate the use of smaller patches, even individual pixels, improving generalization. We show this on a range of tasks from the Distracting Control Suite to vision-based quadruped robots locomotion. We provide rigorous theoretical analysis of the proposed algorithm.",
    "authors": [
        "K. Choromanski",
        "Deepali Jain",
        "Jack Parker-Holder",
        "Xingyou Song",
        "Valerii Likhosherstov",
        "Anirban Santara",
        "Aldo Pacchiano",
        "Yunhao Tang",
        "Adrian Weller"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "New efficient attention algorithms, recently shown to be highly effective for Transformers, are used and it is demonstrated that these techniques can be successfully adopted for the RL setting, and this allows attention-based controllers to scale to larger visual inputs, and facilitate the use of smaller patches, even individual pixels, improving generalization."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}