{
    "acronym": "15fe066d4f466c118e83b85f57f1c9bdb1a74281",
    "title": "The promises of large language models for protein design and modeling",
    "seed_ids": [
        "gpt",
        "gpt2",
        "gpt3",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "15fe066d4f466c118e83b85f57f1c9bdb1a74281",
    "abstract": "The recent breakthroughs of Large Language Models (LLMs) in the context of natural language processing have opened the way to significant advances in protein research. Indeed, the relationships between human natural language and the “language of proteins” invite the application and adaptation of LLMs to protein modelling and design. Considering the impressive results of GPT-4 and other recently developed LLMs in processing, generating and translating human languages, we anticipate analogous results with the language of proteins. Indeed, protein language models have been already trained to accurately predict protein properties, generate novel functionally characterized proteins, achieving state-of-the-art results. In this paper we discuss the promises and the open challenges raised by this novel and exciting research area, and we propose our perspective on how LLMs will affect protein modeling and design.",
    "authors": [
        "Giorgio Valentini",
        "Dario Malchiodi",
        "J. Gliozzo",
        "M. Mesiti",
        "Mauricio Soto Gomez",
        "Alberto Cabri",
        "J. Reese",
        "E. Casiraghi",
        "Peter N. Robinson"
    ],
    "venue": "Frontiers Bioinform.",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The promises and the open challenges raised by this novel and exciting research area are discussed, and a perspective on how LLMs will affect protein modeling and design is proposed."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}