{
    "acronym": "166b53765f33d7e5881e7dc73ae481c65fcf6bdc",
    "title": "Entropy Rate Estimation for English via a Large Cognitive Experiment Using Mechanical Turk",
    "seed_ids": [
        "transformerxl"
    ],
    "s2id": "166b53765f33d7e5881e7dc73ae481c65fcf6bdc",
    "abstract": "The entropy rate h of a natural language quantifies the complexity underlying the language. While recent studies have used computational approaches to estimate this rate, their results rely fundamentally on the performance of the language model used for prediction. On the other hand, in 1951, Shannon conducted a cognitive experiment to estimate the rate without the use of any such artifact. Shannon’s experiment, however, used only one subject, bringing into question the statistical validity of his value of h=1.3 bits per character for the English language entropy rate. In this study, we conducted Shannon’s experiment on a much larger scale to reevaluate the entropy rate h via Amazon’s Mechanical Turk, a crowd-sourcing service. The online subjects recruited through Mechanical Turk were each asked to guess the succeeding character after being given the preceding characters until obtaining the correct answer. We collected 172,954 character predictions and analyzed these predictions with a bootstrap technique. The analysis suggests that a large number of character predictions per context length, perhaps as many as 103, would be necessary to obtain a convergent estimate of the entropy rate, and if fewer predictions are used, the resulting h value may be underestimated. Our final entropy estimate was h≈1.22 bits per character.",
    "authors": [
        "Geng Ren",
        "Shuntaro Takahashi",
        "Kumiko Tanaka-Ishii"
    ],
    "venue": "Entropy",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study conducted Shannon's experiment on a much larger scale to reevaluate the entropy rate h via Amazon’s Mechanical Turk, a crowd-sourcing service, and collected 172,954 character predictions and analyzed these predictions with a bootstrap technique."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}