{
    "acronym": "16d83e930a4dab2d49f5d276838ddce79df3f787",
    "title": "Should ChatGPT be Biased? Challenges and Risks of Bias in Large Language Models",
    "seed_ids": [
        "gpt",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "bd44f34b47c8a4b6947695853fc2814ac69664a6",
        "fd1b829261ba04bb92e0ab60c4f6e7cea0d99fbf",
        "7a15950dc71079285a4eaf195de5aadd87c41b40",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "16d83e930a4dab2d49f5d276838ddce79df3f787",
    "abstract": "As generative language models, exemplified by ChatGPT, continue to advance in their capabilities, the spotlight on biases inherent in these models intensifies. This paper delves into the distinctive challenges and risks associated with biases specifically in large-scale language models. We explore the origins of biases, stemming from factors such as training data, model specifications, algorithmic constraints, product design, and policy decisions. Our examination extends to the ethical implications arising from the unintended consequences of biased model outputs. In addition, we analyze the intricacies of mitigating biases, acknowledging the inevitable persistence of some biases, and consider the consequences of deploying these models across diverse applications, including virtual assistants, content generation, and chatbots. Finally, we provide an overview of current approaches for identifying, quantifying, and mitigating biases in language models, underscoring the need for a collaborative, multidisciplinary effort to craft AI systems that embody equity, transparency, and responsibility. This article aims to catalyze a thoughtful discourse within the AI community, prompting researchers and developers to consider the unique role of biases in the domain of generative language models and the ongoing quest for ethical AI.",
    "authors": [
        "Emilio Ferrara"
    ],
    "venue": "First Monday",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper delves into the distinctive challenges and risks associated with biases specifically in large-scale language models, exploring the origins of biases, stemming from factors such as training data, model specifications, algorithmic constraints, product design, and policy decisions."
    },
    "citationCount": 151,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}