{
    "acronym": "1702e4a4431dda73f06141b87491ad7da3c65bf4",
    "title": "Enhancing Peer Review with AI-Powered Suggestion Generation Assistance: Investigating the Design Dynamics",
    "seed_ids": [
        "gpt2",
        "gpt3",
        "76912f2d895788189c301286d486b31e5b99a33d",
        "a022bda79947d1f656a1164003c1b3ae9a843df9",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1702e4a4431dda73f06141b87491ad7da3c65bf4",
    "abstract": "While writing peer reviews resembles an important task in science, education, and large organizations, providing fruitful suggestions to peers is not a straightforward task, as different user interaction designs of text suggestion interfaces can have diverse effects on user behaviors when writing the review text. Generative language models might be able to support humans in formulating reviews with textual suggestions. Previous systems use two designs for providing text suggestions, but do not empirically evaluate them: inline and list of suggestions. To investigate the effects of embedding NLP text generation models in the two designs, we collected user requirements to implement Hamta as an example of assistants providing reviewers with text suggestions. Our experiment on comparing the two designs on 31 participants indicates that people using the inline interface provided longer reviews on average, while participants using the list of suggestions experienced more ease of use in using our tool. The results shed light on important design findings for embedding text generation models in user-centered assistants.",
    "authors": [
        "Seyed Parsa Neshaei",
        "Roman Rietsche",
        "Xiaotian Su",
        "Thiemo Wambsganss"
    ],
    "venue": "International Conference on Intelligent User Interfaces",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An experiment on comparing the two designs for providing text suggestions indicates that people using the inline interface provided longer reviews on average, while participants using the list of suggestions experienced more ease of use in using the tool."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}