{
    "acronym": "170707b7866aba73fe824bac855124e49532fd1b",
    "title": "Denseformer for Single Image Deraining",
    "seed_ids": [
        "metaformer",
        "b52844a746dafd8a5051cef49abbbda64a312605"
    ],
    "s2id": "170707b7866aba73fe824bac855124e49532fd1b",
    "abstract": "Abstract Image is one of the most important forms of information expression in multimedia. It is the key factor to determine the visual effect of multimedia software. As an image restoration task, image deraining can effectively restore the original information of the image, which is conducive to the downstream task. In recent years, with the development of deep learning technology, CNN and Transformer structures have shone brightly in computer vision. In this paper, we summarize the key to success of these structures in the past, and on this basis, we introduce the concept of a layer aggregation mechanism to describe how to reuse the information of the previous layer to better extract the features of the current layer. Based on this layer aggregation mechanism, we build the rain removal network called DenseformerNet. Our network strengthens feature promotion and encourages feature reuse, allowing better information and gradient flow. Through a large number of experiments, we prove that our model is efficient and effective, and expect to bring some illumination to the future rain removal network.",
    "authors": [
        "Tianming Wang",
        "Kaige Wang",
        "Qing Li"
    ],
    "venue": "International Journal of Applied Mathematics and Computer Sciences",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces the concept of a layer aggregation mechanism to describe how to reuse the information of the previous layer to better extract the features of the current layer, and builds the rain removal network called DenseformerNet."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}