{
    "acronym": "17455350c5e541e66284765e5463293ce77d790d",
    "title": "SemEval-2024 Task 3: Multimodal Emotion Cause Analysis in Conversations",
    "seed_ids": [
        "bert",
        "ba0a5a1e7dda8f48ea572eab3748c17d5d7c9d6d",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f"
    ],
    "s2id": "17455350c5e541e66284765e5463293ce77d790d",
    "abstract": "The ability to understand emotions is an essential component of human-like artificial intelligence, as emotions greatly influence human cognition, decision making, and social interactions. In addition to emotion recognition in conversations, the task of identifying the potential causes behind an individual’s emotional state in conversations, is of great importance in many application scenarios. We organize SemEval-2024 Task 3, named Multimodal Emotion Cause Analysis in Conversations, which aims at extracting all pairs of emotions and their corresponding causes from conversations. Under different modality settings, it consists of two subtasks: Textual Emotion-Cause Pair Extraction in Conversations (TECPE) and Multimodal Emotion-Cause Pair Extraction in Conversations (MECPE). The shared task has attracted 143 registrations and 216 successful submissions.In this paper, we introduce the task, dataset and evaluation settings, summarize the systems of the top teams, and discuss the findings of the participants.",
    "authors": [
        "Fanfan Wang",
        "Heqing Ma",
        "Jianfei Yu",
        "Rui Xia",
        "Erik Cambria"
    ],
    "venue": "International Workshop on Semantic Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The task, dataset and evaluation settings are introduced, the systems of the top teams are summarized, and the findings of the participants are discussed."
    },
    "citationCount": 18,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}