{
    "acronym": "179184c80053c84fd1186553ad63408bbcdae026",
    "title": "BERT Based Models for Sentiment Classification for Generating Insights from Olympics",
    "seed_ids": [
        "bert",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "179184c80053c84fd1186553ad63408bbcdae026",
    "abstract": "The COVID-19 pandemic forced the Olympics to be held without spectators. As a result, most people tuned in to watch the Olympics from their homes. People expressed their emotions regarding sporting events through micro-blogging sites like Twitter. Even though research on the sentiment classification of sporting events has been done in the past, they usually focus on a single sport. The amount of material regarding sentiment classification and analysis of multi-sporting events is sparse. This necessitates the development of an efficient model which can accurately classify sentiments in multi-sports tweets. A sentiment classification of the recent Olympics would give an understanding of how people reacted to the Olympics and what influenced their reactions the most.In this paper, we focus on the recently held Tokyo 2020 Olympics. The dataset has been gathered from Twitter during the Olympics. The data has been classed into 3 emotion categories: Happy, Neutral and Sad. We develop several classification models on the BERT embeddings and conduct experiments to arrive at the most effective model. Upon sentiment classification of the entire dataset, a temporal analysis of the annotated corpus is performed to reveal how the change points in the data correlate to real-world events. This demonstrated how offline sporting events like the Olympics correlate with emotions in the virtual space.",
    "authors": [
        "Mohammad Basit",
        "Salman Shaikh",
        "Zubaida Fatima",
        "Bashir Alam"
    ],
    "venue": "2023 International Conference on Innovation and Intelligence for Informatics, Computing, and Technologies (3ICT)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper develops several classification models on the BERT embeddings and conducts experiments to arrive at the most effective model, and demonstrates how offline sporting events like the Olympics correlate with emotions in the virtual space."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}