{
    "acronym": "17bb36fd4dbcfb52a7a5f8f7ba0a69d0211ccd83",
    "title": "COLARE: Commit Classification via Fine-grained Context-aware Representation of Code Changes",
    "seed_ids": [
        "transformer",
        "bert",
        "bb58f2f63888456a3e04a56a18996ab8dacdb257",
        "33172567ab1dff9ca32c8d995d88bbff466f3236",
        "0fe2636446cd686830da3d971b31a004d6094b3c"
    ],
    "s2id": "17bb36fd4dbcfb52a7a5f8f7ba0a69d0211ccd83",
    "abstract": "Commit classification for maintenance activities is of critical importance for both industry and academia. State-of-the-art approaches either treat code changes as plain text or rely on manually identified features. Directly applying the most advanced model of code change representation into commit classification faces two limitations: (1) coarse-grained diff comparison neglects the distance of modified code lines; (2) missing key context information of hunk modification and file categories. This study proposes a novel classification model, COLARE, which compares code changes at the hunk level, takes fine-grained features based on categories of changed files, and aggregates with the representation of commit messages. The evaluation results show that our model outperforms state-of-the-art techniques by 7.24% and 7.35% in accuracy and macro F1 score, respectively. We also manually labeled a multi-language dataset and evaluated our approach, The results further confirm that our approach achieves the best performance over three baselines, including ChatGPT (3.5). The evaluation of the ablation study demonstrates the effectiveness of the major components in our technique.",
    "authors": [
        "Qunhong Zeng",
        "Yuxia Zhang",
        "Zeyu Sun",
        "Yujie Guo",
        "Hui Liu"
    ],
    "venue": "IEEE International Conference on Software Analysis, Evolution, and Reengineering",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel classification model is proposed, COLARE, which compares code changes at the hunk level, takes fine-grained features based on categories of changed files, and aggregates with the representation of commit messages, and outperforms state-of-the-art techniques."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}