{
    "acronym": "17c83ba6474fd3f46248cf80d8e80e54f75ba892",
    "title": "From Efficient Multimodal Models to World Models: A Survey",
    "seed_ids": [
        "sparsetransformer",
        "efc50d7ee5bcd8039ba5d686d7d943be3ff199b0",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "70e91e16eb321067d9402710e14a40cf28311f73",
        "e342165a614588878ad0f4bc9bacf3905df34d08",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "657329c633709dd1ac34a30d57341b186b1a47c2"
    ],
    "s2id": "17c83ba6474fd3f46248cf80d8e80e54f75ba892",
    "abstract": "Multimodal Large Models (MLMs) are becoming a significant research focus, combining powerful large language models with multimodal learning to perform complex tasks across different data modalities. This review explores the latest developments and challenges in MLMs, emphasizing their potential in achieving artificial general intelligence and as a pathway to world models. We provide an overview of key techniques such as Multimodal Chain of Thought (M-COT), Multimodal Instruction Tuning (M-IT), and Multimodal In-Context Learning (M-ICL). Additionally, we discuss both the fundamental and specific technologies of multimodal models, highlighting their applications, input/output modalities, and design characteristics. Despite significant advancements, the development of a unified multimodal model remains elusive. We discuss the integration of 3D generation and embodied intelligence to enhance world simulation capabilities and propose incorporating external rule systems for improved reasoning and decision-making. Finally, we outline future research directions to address these challenges and advance the field.",
    "authors": [
        "Xinji Mai",
        "Zeng Tao",
        "Junxiong Lin",
        "Haoran Wang",
        "Yang Chang",
        "Yanlan Kang",
        "Yan Wang",
        "Wenqiang Zhang"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The integration of 3D generation and embodied intelligence to enhance world simulation capabilities and propose incorporating external rule systems for improved reasoning and decision-making are discussed."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}