{
    "acronym": "17fbffb05fa14e21d1c506fd5f0f568b955fe983",
    "title": "Do All Languages Cost the Same? Tokenization in the Era of Commercial Language Models",
    "seed_ids": [
        "alibi",
        "594d8e1696619f3cebb7c6bffdad8e0a5592f006",
        "d78df936a717f278e89221f74f3f894e90d8c1fe",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "76a786b1acd6d1aca56e12a8a1db34569fdf9f3a",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "17fbffb05fa14e21d1c506fd5f0f568b955fe983",
    "abstract": "Language models have graduated from being research prototypes to commercialized products offered as web APIs, and recent works have highlighted the multilingual capabilities of these products. The API vendors charge their users based on usage, more specifically on the number of ``tokens'' processed or generated by the underlying language models. What constitutes a token, however, is training data and model dependent with a large variance in the number of tokens required to convey the same information in different languages. In this work, we analyze the effect of this non-uniformity on the fairness of an API's pricing policy across languages. We conduct a systematic analysis of the cost and utility of OpenAI's language model API on multilingual benchmarks in 22 typologically diverse languages. We show evidence that speakers of a large number of the supported languages are overcharged while obtaining poorer results. These speakers tend to also come from regions where the APIs are less affordable to begin with. Through these analyses, we aim to increase transparency around language model APIs' pricing policies and encourage the vendors to make them more equitable.",
    "authors": [
        "Orevaoghene Ahia",
        "Sachin Kumar",
        "Hila Gonen",
        "Jungo Kasai",
        "David R. Mortensen",
        "Noah A. Smith",
        "Yulia Tsvetkov"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work conducts a systematic analysis of the cost and utility of OpenAI's language model API on multilingual benchmarks in 22 typologically diverse languages and shows evidence that speakers of a large number of the supported languages are overcharged while obtaining poorer results."
    },
    "citationCount": 43,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}