{
    "acronym": "182cce908d1a70dd514679d7635a0346915479e0",
    "title": "UniDM: A Unified Framework for Data Manipulation with Large Language Models",
    "seed_ids": [
        "gpt3",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "182cce908d1a70dd514679d7635a0346915479e0",
    "abstract": "Designing effective data manipulation methods is a long standing problem in data lakes. Traditional methods, which rely on rules or machine learning models, require extensive human efforts on training data collection and tuning models. Recent methods apply Large Language Models (LLMs) to resolve multiple data manipulation tasks. They exhibit bright benefits in terms of performance but still require customized designs to fit each specific task. This is very costly and can not catch up with the requirements of big data lake platforms. In this paper, inspired by the cross-task generality of LLMs on NLP tasks, we pave the first step to design an automatic and general solution to tackle with data manipulation tasks. We propose UniDM, a unified framework which establishes a new paradigm to process data manipulation tasks using LLMs. UniDM formalizes a number of data manipulation tasks in a unified form and abstracts three main general steps to solve each task. We develop an automatic context retrieval to allow the LLMs to retrieve data from data lakes, potentially containing evidence and factual information. For each step, we design effective prompts to guide LLMs to produce high quality results. By our comprehensive evaluation on a variety of benchmarks, our UniDM exhibits great generality and state-of-the-art performance on a wide variety of data manipulation tasks.",
    "authors": [
        "Yichen Qian",
        "Yongyi He",
        "Rong Zhu",
        "Jintao Huang",
        "Zhijian Ma",
        "Haibin Wang",
        "Yaohua Wang",
        "Xiuyu Sun",
        "Defu Lian",
        "Bolin Ding",
        "Jingren Zhou"
    ],
    "venue": "Conference on Machine Learning and Systems",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes UniDM, a unified framework which establishes a new paradigm to process data manipulation tasks using LLMs, which formalizes a number of data manipulation tasks in a unified form and abstracts three main general steps to solve each task."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}