{
    "acronym": "183ff1cfd2370cbcf4088780bf1f6e8d6db8be0f",
    "title": "LoCo: Locally Constrained Training-Free Layout-to-Image Synthesis",
    "seed_ids": [
        "classfreediffu",
        "2078ff863ad47339d4cf1a167c2ea63da260f127",
        "115f8fd513c38214ea15ceb49add5b970831cd7e",
        "2af61d71dd06cb509d4460eca9503dc2a177dba5",
        "00b167a24f57f96294a4581bb185a57b0a4af365",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "183ff1cfd2370cbcf4088780bf1f6e8d6db8be0f",
    "abstract": "Recent text-to-image diffusion models have reached an unprecedented level in generating high-quality images. However, their exclusive reliance on textual prompts often falls short in precise control of image compositions. In this paper, we propose LoCo, a training-free approach for layout-to-image Synthesis that excels in producing high-quality images aligned with both textual prompts and layout instructions. Specifically, we introduce a Localized Attention Constraint (LAC), leveraging semantic affinity between pixels in self-attention maps to create precise representations of desired objects and effectively ensure the accurate placement of objects in designated regions. We further propose a Padding Token Constraint (PTC) to leverage the semantic information embedded in previously neglected padding tokens, improving the consistency between object appearance and layout instructions. LoCo seamlessly integrates into existing text-to-image and layout-to-image models, enhancing their performance in spatial control and addressing semantic failures observed in prior methods. Extensive experiments showcase the superiority of our approach, surpassing existing state-of-the-art training-free layout-to-image methods both qualitatively and quantitatively across multiple benchmarks.",
    "authors": [
        "Peiang Zhao",
        "Han Li",
        "Ruiyang Jin",
        "S. K. Zhou"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "LoCo is proposed, a training-free approach for layout-to-image Synthesis that excels in producing high-quality images aligned with both textual prompts and layout instructions, and introduces a Localized Attention Constraint (LAC), leveraging semantic affinity between pixels in self-attention maps."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}