{
    "acronym": "186c7e80de21eda4272687c2ee1542af0e66f20a",
    "title": "KnowLog: Knowledge Enhanced Pretrained Language Model for Log Understanding",
    "seed_ids": [
        "bert",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "f6245b3e6270e4dc2e279c4b728030523dffcff4",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "d0086b86103a620a86bc918746df0aa642e2a8a3"
    ],
    "s2id": "186c7e80de21eda4272687c2ee1542af0e66f20a",
    "abstract": "Logs as semi-structured text are rich in semantic information, making their comprehensive understanding crucial for automated log analysis. With the recent success of pretrained language models in natural language processing, many studies have leveraged these models to understand logs. Despite their successes, existing pretrained language models still suffer from three weaknesses. Firstly, these models fail to understand domain-specific terminol-ogy, especially abbreviations. Secondly, these models struggle to adequately capture the complete log context information. Thirdly, these models have difficulty in obtaining universal representations of different styles of the same logs. To address these challenges, we introduce KnowLog, a knowledge-enhanced pretrained language model for log understanding. Specifically, to solve the previous two challenges, we exploit abbreviations and natural language de-scriptions of logs from public documentation as local and global knowledge, respectively, and leverage this knowledge by designing novel pretraining tasks for enhancing the model. To solve the last challenge, we design a contrastive learning-based pretraining task to obtain universal representations. We evaluate KnowLog by fine-tuning it on six different log understanding tasks. Extensive experiments demonstrate that KnowLog significantly enhances log understanding and achieves state-of-the-art results compared to existing pretrained language models without knowledge enhancement. Moreover, we conduct additional experiments in transfer learning and low-resource scenarios, showcasing the substantial advantages of KnowLog. Our source code and detailed experimental data are available at https://github.com/LeaperOvO/KnowLog.",
    "authors": [
        "Lipeng Ma",
        "Weidong Yang",
        "Bo Xu",
        "Sihang Jiang",
        "Ben Fei",
        "Jiaqing Liang",
        "Mingjie Zhou",
        "Yanghua Xiao"
    ],
    "venue": "International Conference on Software Engineering",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "KnowLog is introduced, a knowledge-enhanced pretrained language model for log understanding that significantly enhances log understanding and achieves state-of-the-art results compared to existing pretrained language models without knowledge enhancement."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}