{
    "acronym": "1898b09f11fd3d7cc5cd9669b96cc7f28002ca44",
    "title": "HRVQA: A Visual Question Answering Benchmark for High-Resolution Aerial Images",
    "seed_ids": [
        "scattn",
        "f4238bd2385a52413ccbacfd9e409a650235bd13"
    ],
    "s2id": "1898b09f11fd3d7cc5cd9669b96cc7f28002ca44",
    "abstract": "Visual question answering (VQA) is an important and challenging multimodal task in computer vision. Recently, a few efforts have been made to bring VQA task to aerial images, due to its potential real-world applications in disaster monitoring, urban planning, and digital earth product generation. However, not only the huge variation in the appearance, scale and orientation of the concepts in aerial images, but also the scarcity of the well-annotated datasets restricts the development of VQA in this domain. In this paper, we introduce a new dataset, HRVQA, which provides collected 53512 aerial images of 1024*1024 pixels and semi-automatically generated 1070240 QA pairs. To benchmark the understanding capability of VQA models for aerial images, we evaluate the relevant methods on HRVQA. Moreover, we propose a novel model, GFTransformer, with gated attention modules and a mutual fusion module. The experiments show that the proposed dataset is quite challenging, especially the specific attribute related questions. Our method achieves superior performance in comparison to the previous state-of-the-art approaches. The dataset and the source code will be released at https://hrvqa.nl/.",
    "authors": [
        "Kun Li",
        "G. Vosselman",
        "M. Yang"
    ],
    "venue": "Isprs Journal of Photogrammetry and Remote Sensing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new dataset, HRVQA, is introduced, which provides collected aerial images of 1024*1024 pixels and semi-automatically generated QA pairs and a novel model, GFTransformer, with gated attention modules and a mutual fusion module is proposed."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}