{
    "acronym": "18bd0822f1a605ac8215337597e652ad693cbd93",
    "title": "Progress Note Understanding - Assessment and Plan Reasoning: Overview of the 2022 N2C2 Track 3 Shared Task",
    "seed_ids": [
        "longformer",
        "f30e95be411456a709e7cb9a8b3a3e557bd0356a",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "18bd0822f1a605ac8215337597e652ad693cbd93",
    "abstract": "Daily progress notes are a common note type in the electronic health record (EHR) where healthcare providers document the patient's daily progress and treatment plans. The EHR is designed to document all the care provided to patients, but it also enables note bloat with extraneous information that distracts from the diagnoses and treatment plans. Applications of natural language processing (NLP) in the EHR is a growing field with the majority of methods in information extraction. Few tasks use NLP methods for downstream diagnostic decision support. We introduced the 2022 National NLP Clinical Challenge (N2C2) Track 3: Progress Note Understanding - Assessment and Plan Reasoning as one step towards a new suite of tasks. The Assessment and Plan Reasoning task focuses on the most critical components of progress notes, Assessment and Plan subsections where health problems and diagnoses are contained. The goal of the task was to develop and evaluate NLP systems that automatically predict causal relations between the overall status of the patient contained in the Assessment section and its relation to each component of the Plan section which contains the diagnoses and treatment plans. The goal of the task was to identify and prioritize diagnoses as the first steps in diagnostic decision support to find the most relevant information in long documents like daily progress notes. We present the results of the 2022 N2C2 Track 3 and provide a description of the data, evaluation, participation and system performance.",
    "authors": [
        "Yanjun Gao",
        "Dmitriy Dligach",
        "Timothy Miller",
        "M. Churpek",
        "Ozlem Uzuner",
        "M. Afshar"
    ],
    "venue": "Journal of Biomedical Informatics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The 2022 National NLP Clinical Challenge (N2C2) Track 3: Progress Note Understanding - Assessment and Plan Reasoning was introduced and the goal was to develop and evaluate NLP systems that automatically predict causal relations between the overall status of the patient contained in the Assessment section and its relation to each component of the Plan section."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}