{
    "acronym": "18c5d668117a268a4c07e80e8ae89f0302784890",
    "title": "Leveraging Commonsense for Object Localisation in Partial Scenes",
    "seed_ids": [
        "rela",
        "a7721b6523971394a8bd4bfda139122ef59b22cd"
    ],
    "s2id": "18c5d668117a268a4c07e80e8ae89f0302784890",
    "abstract": "We propose an end-to-end solution to address the problem of object localisation in partial scenes, where we aim to estimate the position of an object in an unknown area given only a partial 3D scan of the scene. We propose a novel scene representation to facilitate the geometric reasoning, Directed Spatial Commonsense Graph (D-SCG), a spatial scene graph that is enriched with additional concept nodes from a commonsense knowledge base. Specifically, the nodes of D-SCG represent the scene objects and the edges are their relative positions. Each object node is then connected via different commonsense relationships to a set of concept nodes. With the proposed graph-based scene representation, we estimate the unknown position of the target object using a Graph Neural Network that implements a sparse attentional message passing mechanism. The network first predicts the relative positions between the target object and each visible object by learning a rich representation of the objects via aggregating both the object nodes and the concept nodes in D-SCG. These relative positions then are merged to obtain the final position. We evaluate our method using Partial ScanNet, improving the state-of-the-art by 5.9% in terms of the localisation accuracy at a 8x faster training speed.",
    "authors": [
        "Francesco Giuliari",
        "Geri Skenderi",
        "M. Cristani",
        "A. D. Bue",
        "Yiming Wang"
    ],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An end-to-end solution to address the problem of object localisation in partial scenes, where the position of an object in an unknown area given only a partial 3D scan of the scene is estimated using a Graph Neural Network that implements a sparse attentional message passing mechanism."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}