{
    "acronym": "19364cfcab16062fc851fcfb903e104305cbcd84",
    "title": "Predicting Linguistically Sophisticated Social Determinants of Health Disparities with Neural Networks: The Case of LGBTQ+ Minority Stress",
    "seed_ids": [
        "bert"
    ],
    "s2id": "19364cfcab16062fc851fcfb903e104305cbcd84",
    "abstract": "LGBTQ+ minority stress is a pervasive form of anti-LGBTQ+ adverse events and psychological strain that drives health inequities among LGBTQ+ people. Minority stress is also linguistically sophisticated (e.g., composed of cultural idioms, psycholinguistic permutations, and lexical density). Because minority stress is a linguistically sophisticated social determinant of health disparities, it is challenging to detect using natural language processing (NLP). Using 5,789 human-annotated Reddit posts from the LGBTQ+ Minority Stress on Social Media (MiSSoM+) Dataset, we investigated and compared the performance of four neural networks and two traditional machine learning architectures in modeling minority stress at both the factor (i.e., separate components of minority stress) and composite level. A novel hybrid model combining Bidirectional Encoder Representations from Transformers and convolutional neural network (BERT-CNN) improved the prediction of composite minority stress (F1 = 0.84). Our experiments on separate factors of minority stress are the first to demonstrate that hybrid neural network models can detect semantically complex expressions of prejudiced events (F1 = 0.87), expected rejection (F1 = 0.92), internalized stigma (F1 = 0.91), identity concealment (F1 = 0.92), and minority coping (F1 = 0.84). We also substantially improved the prediction of gender dysphoria (F1 = 0.94)—a conceptually new candidate component of minority stress. Big data analytics may not be a panacea for the problem of minority stress, but our work joins a growing literature base to show that deep learning models are remarkable in detecting linguistically sophisticated social determinants of health disparities in big data, thus providing evidence in support of the potential benefit from the innovative use of such technology in eliminating group-specific health inequities.",
    "authors": [
        "C. Cascalheira",
        "Santosh Chapagain",
        "Ryan E. Flinn",
        "Yuxuan Zhao",
        "S. F. Boubrahimi",
        "Dannie Klooster",
        "Alejandra Gonzalez",
        "Emily M. Lund",
        "Danica Laprade",
        "Jillian R. Scheer",
        "S. M. Hamdi"
    ],
    "venue": "BigData Congress [Services Society]",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work joins a growing literature base to show that deep learning models are remarkable in detecting linguistically sophisticated social determinants of health disparities in big data, thus providing evidence in support of the potential benefit from the innovative use of such technology in eliminating group-specific health inequities."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}