{
    "acronym": "19ea2be43b43b69e546b69af1f9b2f13b1ec0616",
    "title": "MotionPerceiver: Real-Time Occupancy Forecasting for Embedded Systems",
    "seed_ids": [
        "perceiverio"
    ],
    "s2id": "19ea2be43b43b69e546b69af1f9b2f13b1ec0616",
    "abstract": "This work introduces a novel and adaptable architecture designed for real-time occupancy forecasting that outperforms existing state-of-the-art models on the Waymo Open Motion Dataset in Soft IOU. The proposed model uses recursive latent state estimation with learned transformer-based functions to effectively update and evolve the state. This enables highly efficient real-time inference on embedded systems, as profiled on an Nvidia Xavier AGX. Our model, MotionPerceiver, achieves this by encoding a scene into a latent state that evolves in time through self-attention mechanisms. Additionally, it incorporates relevant scene observations, such as traffic signals, road topology and agent detections, through cross-attention mechanisms. This forms an efficient data-streaming architecture, that contrasts with the expensive, fixed-sequence input common in existing models. The architecture also offers the distinct advantage of generating occupancy predictions through localized querying based on a point-of-interest, as opposed to generating fixed-size occupancy images that render potentially irrelevant regions.",
    "authors": [
        "Bryce Ferenczi",
        "Michael Burke",
        "T. Drummond"
    ],
    "venue": "IEEE Robotics and Automation Letters",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel and adaptable architecture designed for real-time occupancy forecasting that outperforms existing state-of-the-art models on the Waymo Open Motion Dataset in Soft IOU, using recursive latent state estimation with learned transformer-based functions to effectively update and evolve the state."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}