{
    "acronym": "1a15a59aab9fb59d66572e101fa02bd544a1ba7e",
    "title": "Flow Matching for Conditional Text Generation in a Few Sampling Steps",
    "seed_ids": [
        "diffusionlm",
        "diffuseq",
        "a8e6a8480543efdfd5189a19c6c54a40d2cc6efe",
        "f2f85068c9e22a4d8fe6b58e2d92e2d30bc10578",
        "094490a5035c6c151b45d0ad5961186ab0eeb5b4",
        "5fa10872ef8037853ff7c8baf5f77fb55a918eca",
        "020a50f6a7154850ac81e3cde69ad8198ded6751",
        "a1186d7d9a9ef258c76afef1177e4f348061a537",
        "22775e58932cdfbd273a2a835a22c5d86800a458",
        "2c6ac935c826002976722ca8d3319f691975687e",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "24425954960ce968e5f14360fbdd0605abcadfcf",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1a15a59aab9fb59d66572e101fa02bd544a1ba7e",
    "abstract": "Diffusion models are a promising tool for high-quality text generation. However, current models face multiple drawbacks including slow sampling, noise schedule sensitivity, and misalignment between the training and sampling stages. In this paper, we introduce FlowSeq, which bypasses all current drawbacks by leveraging flow matching for conditional text generation. FlowSeq can generate text in a few steps by training with a novel anchor loss, alleviating the need for expensive hyperparameter optimization of the noise schedule prevalent in diffusion models. We extensively evaluate our proposed method and show competitive performance in tasks such as question generation, open-domain dialogue, and paraphrasing tasks.",
    "authors": [
        "Vincent Tao Hu",
        "Di Wu",
        "Yuki M. Asano",
        "P. Mettes",
        "Basura Fernando",
        "Bjorn Ommer",
        "Cees G. M. Snoek"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "FlowSeq is introduced, which bypasses all current drawbacks by leveraging flow matching for conditional text generation and can generate text in a few steps by training with a novel anchor loss, alleviating the need for expensive hyperparameter optimization of the noise schedule prevalent in diffusion models."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}