{
    "acronym": "1a3fd184d4e982c0e86d65d50a2335babae36588",
    "title": "Hybrid Extractive/Abstractive Summarization Using Pre-Trained Sequence-to-Sequence Models",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "0b5d7a79205b44952e24025ce5d46e9f3aa401a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1a3fd184d4e982c0e86d65d50a2335babae36588",
    "abstract": ". Typical document summarization methods can be either ex-tractive, by selecting appropriate parts of the input text to include in the summary, or abstractive, by generating new text with basis on a meaningful representation of the source text. In both cases, the current state-of-the-art involves the use of pre-trained neural language models based on the Transformer architecture. Most of these approaches are unable to process input text beyond a limited small number of tokens. This paper advances a hybrid summarization approach based on a single T5 model, which ﬁrst selects important sentences from the source text, and subsequently produces an abstractive summary from the selected sentences. In doing this, we reduce the overall computational requirements associated to the use of Transformer models, and mitigate the eﬀects of their input size limitations, while ensuring a good performance. Through experiments with diﬀerent datasets, we show that our method achieves comparable results to current state-of-the-art models, while maintaining relatively low computational requirements.",
    "authors": [
        "D. Coimbra"
    ],
    "venue": "",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper advances a hybrid summarization approach based on a single T5 model, which first selects important sentences from the source text, and subsequently produces an abstractive summary from the selected sentences."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}