{
    "acronym": "1aab384f6a442510fe4df609169e107edd6ded92",
    "title": "Generative Pre-Trained Transformer-Based Reinforcement Learning for Testing Web Application Firewalls",
    "seed_ids": [
        "gpt2",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "7a15950dc71079285a4eaf195de5aadd87c41b40",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1aab384f6a442510fe4df609169e107edd6ded92",
    "abstract": "Web Application Firewalls (WAFs) are widely deployed to protect key web applications against multiple security threats, so it is important to test WAFs regularly to prevent attackers from bypassing them easily. Machine-learning-based black-box WAF testing is gaining more attention, though existing learning-based approaches have strict requirements on the source and scale of payload data and suffer from the local optimum problem, limiting their effectiveness and practical application. We propose GPTFuzzer, a practical and effective generation-based approach to test WAFs by generating attack payloads token-by-token. Specifically, we fine-tune a Generative Pre-trained Transformer language model with reinforcement learning to make GPTFuzzer have the least restrictions on payload data and thus more applicable in practice, and we use reward modeling and KL-divergence penalty to improve the effectiveness of our approach and mitigate the local optimum issue. We implement GPTFuzzer and evaluate it on two well-known open-source WAFs against three kinds of common attacks. Experimental results show that GPTFuzzer significantly outperforms state-of-the-art approaches, i.e., ML-Driven and RAT, finding up to 7.8× (3.2× on average) more bypassing payloads within 1,250,000 requests, or finding out all bypassing payloads using up to 8.1× (3.3× on average) fewer requests.",
    "authors": [
        "Hongliang Liang",
        "Xiangyu Li",
        "Da Xiao",
        "Jie Liu",
        "Yanjie Zhou",
        "Aibo Wang",
        "Jin Li"
    ],
    "venue": "IEEE Transactions on Dependable and Secure Computing",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "GPTFuzzer is proposed, a practical and effective generation-based approach to test WAFs by generating attack payloads token-by-token and significantly outperforms state-of-the-art approaches, i.e., ML-Driven and RAT."
    },
    "citationCount": 3,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}