{
    "acronym": "1aee5bf8fbae3f96697793d75fffcc9a72775ad4",
    "title": "Will Longformers PAN Out for Authorship Verification? Notebook for PAN at CLEF 2020",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "1aee5bf8fbae3f96697793d75fffcc9a72775ad4",
    "abstract": "Authorship veriﬁcation, the task of identifying if two text excerpts are from the same author, is an important part of evaluating the veracity and authenticity of writings and is one of the challenges for this year’s PAN @ CLEF 2020 event. In this paper, we describe our PAN authorship veriﬁcation submission system, a neural network that learns useful features for authorship veriﬁcation from fanﬁction texts and their corresponding fandoms. Our system uses the Longformer, a variant of state-of-the-art transformer models, that is pre-trained on large amounts of text. This model combines global self-attention and local self-attention to enable efﬁcient processing of long text inputs (like the fanﬁction data used for PAN @ CLEF 2020), and we augment the pre-trained Longformer model with additional fully-connected layers and ﬁne-tune it to learn features that are useful for author veriﬁcation. Finally, our model incorporates fandom information via the use of a multi-task loss function that optimizes for both authorship veriﬁcation and topic correspondence, allowing it to learn useful fandom features for author veriﬁcation indirectly. On a held-out subset of the PAN-provided “large training” set, our Longformer-based system attained a 0.963 overall veriﬁ-cation score, outperforming the PAN text compression baseline by 32.8% relative. However, on the ofﬁcial PAN test set, our system attained a 0.685 overall score, underperforming the PAN text compression baseline by 7.6% relative.",
    "authors": [
        "Juanita Ordoñez",
        "Rafael A. Rivera Soto",
        "Barry Y. Chen"
    ],
    "venue": "Conference and Labs of the Evaluation Forum",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper describes the PAN authorship veriﬁcation submission system, a neural network that learns useful features for authorship veriﬁcation from fanﬁction texts and their corresponding fandoms and incorporates fandom information via the use of a multi-task loss function that optimizes for both authorship veriﬁcation and topic correspondence."
    },
    "citationCount": 13,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}