{
    "acronym": "1b1facc943dc61f31bc9581833e2a12b52b9e54d",
    "title": "A Study of Recent Advancements in Deep Learning for Natural Language Processing",
    "seed_ids": [
        "gpt",
        "5161e4a6a6c276960d0db610acb7807f5fdf4c7c",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1b1facc943dc61f31bc9581833e2a12b52b9e54d",
    "abstract": "Natural Language Processing has gained interests and progress over the last decade. Its success can be attributed to the recent advances made in the field of Deep Learning. This review provides a detailed overview of recent advancements in deep learning techniques specially in the last decade (2013–2023) used for Natural Language Processing, including the architectural changes and capability enhancements. In this review we discussed the advancements in application areas like language modeling, machine translation and dependency parsing, while also comparing the models presented in each application areas. We compared the language models against their size, parameters, deep learning technique, features and drawbacks; dependency parsing models against their unlabeled and labeled accuracy scores, and machine translation models against their BLEU scores for WMT'14 English-French and English-German tasks. We also explored the potential challenges and limitations in these areas. Finally, we reviewed the current state-of-the-art multimodal model like GPT-4 and discussed how these models are evolving towards a general form of artificial intelligence.",
    "authors": [
        "Aditya Raj",
        "Rajni Jindal",
        "Aditya Kumar Singh",
        "Ajay Pal"
    ],
    "venue": "International Workshop on Artificial Intelligence and Cognition",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A detailed overview of recent advancements in deep learning techniques specially in the last decade (2013–2023) used for Natural Language Processing, including the architectural changes and capability enhancements is provided."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}