{
    "acronym": "1b47b319cdb8ddc6fb15e28c7ee32dfc04a771b2",
    "title": "Democratizing Ethical Assessment of Natural Language Generation Models",
    "seed_ids": [
        "gpt2",
        "fd1b829261ba04bb92e0ab60c4f6e7cea0d99fbf",
        "76a786b1acd6d1aca56e12a8a1db34569fdf9f3a",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1b47b319cdb8ddc6fb15e28c7ee32dfc04a771b2",
    "abstract": "Natural language generation models are computer systems that generate coherent language when prompted with a sequence of words as context. Despite their ubiquity and many beneficial applications, language generation models also have the potential to inflict social harms by generating discriminatory language, hateful speech, profane content, and other harmful material. Ethical assessment of these models is therefore critical. But it is also a challenging task, requiring an expertise in several specialized domains, such as computational linguistics and social justice. While significant strides have been made by the research community in this domain, accessibility of such ethical assessments to the wider population is limited due to the high entry barriers. This article introduces a new tool to democratize and standardize ethical assessment of natural language generation models: Tool for Ethical Assessment of Language generation models (TEAL), a component of Credo AI Lens, an open-source assessment framework.",
    "authors": [
        "A. Rasekh",
        "Ian W. Eisenberg"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new tool to democratize and standardize ethical assessment of natural language generation models: Tool for Ethical Assessment of Language generation models (TEAL), a component of Credo AI Lens, an open-source assessment framework."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}