{
    "acronym": "1b492746ee3a304a13950cad1a59861b9ee44645",
    "title": "A Complete Survey on Generative AI (AIGC): Is ChatGPT from GPT-4 to GPT-5 All You Need?",
    "seed_ids": [
        "gpt",
        "7b6a8c6d44e0f77bf930484e438d77b7465a69fb",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "9714b88d4d984426d901fc539c7c69d03290ce12",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "a225d5d846ba5110232ed5bb32d54ea742b1c2d4",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "b90c090f7928a78d85d952737488be1ef8587ae5",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "479eaafcee15a44b632b3cab41491b517e1531fe",
        "ce510c6cfeac703706460680e977c54554840830",
        "25db56fc85fe15625c3375064a35e908ba6dfd2a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "535bbc71ef9f8a8c6180c599ded774ff6f4f8258",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "71cc838d8a50a0d62cc9c679536f1f25b2ea6b7f",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1b492746ee3a304a13950cad1a59861b9ee44645",
    "abstract": "As ChatGPT goes viral, generative AI (AIGC, a.k.a AI-generated content) has made headlines everywhere because of its ability to analyze and create text, images, and beyond. With such overwhelming media coverage, it is almost impossible for us to miss the opportunity to glimpse AIGC from a certain angle. In the era of AI transitioning from pure analysis to creation, it is worth noting that ChatGPT, with its most recent language model GPT-4, is just a tool out of numerous AIGC tasks. Impressed by the capability of the ChatGPT, many people are wondering about its limits: can GPT-5 (or other future GPT variants) help ChatGPT unify all AIGC tasks for diversified content creation? Toward answering this question, a comprehensive review of existing AIGC tasks is needed. As such, our work comes to fill this gap promptly by offering a first look at AIGC, ranging from its techniques to applications. Modern generative AI relies on various technical foundations, ranging from model architecture and self-supervised pretraining to generative modeling methods (like GAN and diffusion models). After introducing the fundamental techniques, this work focuses on the technological development of various AIGC tasks based on their output type, including text, images, videos, 3D content, etc., which depicts the full potential of ChatGPT's future. Moreover, we summarize their significant applications in some mainstream industries, such as education and creativity content. Finally, we discuss the challenges currently faced and present an outlook on how generative AI might evolve in the near future.",
    "authors": [
        "Chaoning Zhang",
        "Chenshuang Zhang",
        "Sheng Zheng",
        "Yu Qiao",
        "Chenghao Li",
        "Mengchun Zhang",
        "Sumit Kumar Dam",
        "Chu Myaet Thwal",
        "Ye Lin Tun",
        "Le Luang Huy",
        "Donguk kim",
        "S. Bae",
        "Lik-Hang Lee",
        "Yang Yang",
        "Heng Tao Shen",
        "In-So Kweon",
        "Choong-Seon Hong"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work focuses on the technological development of various AIGC tasks based on their output type, including text, images, videos, 3D content, etc., which depicts the full potential of ChatGPT's future."
    },
    "citationCount": 122,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}