{
    "acronym": "1b5f065d2594d5b13d48a2afb3b97fff028c1fcb",
    "title": "Learning to Cut via Hierarchical Sequence/Set Model for Efficient Mixed-Integer Programming",
    "seed_ids": [
        "transformer",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "1b5f065d2594d5b13d48a2afb3b97fff028c1fcb",
    "abstract": "Cutting planes (cuts) play an important role in solving mixed-integer linear programs (MILPs), which formulate many important real-world applications. Cut selection heavily depends on (P1) which cuts to prefer and (P2) how many cuts to select. Although modern MILP solvers tackle (P1)-(P2) by human-designed heuristics, machine learning carries the potential to learn more effective heuristics. However, many existing learning-based methods learn which cuts to prefer, neglecting the importance of learning how many cuts to select. Moreover, we observe that (P3) what order of selected cuts to prefer significantly impacts the efficiency of MILP solvers as well. To address these challenges, we propose a novel hierarchical sequence/set model (HEM) to learn cut selection policies. Specifically, HEM is a bi-level model: (1) a higher-level module that learns how many cuts to select, (2) and a lower-level module-that formulates the cut selection as a sequence/set to sequence learning problem-to learn policies selecting an ordered subset with the cardinality determined by the higher-level module. To the best of our knowledge, HEM is the first data-driven methodology that well tackles (P1)-(P3) simultaneously. Experiments demonstrate that HEM significantly improves the efficiency of solving MILPs on eleven challenging MILP benchmarks, including two Huawei's real problems.",
    "authors": [
        "Jie Wang",
        "Zhihai Wang",
        "Xijun Li",
        "Yufei Kuang",
        "Zhihao Shi",
        "Fangzhou Zhu",
        "Mingxuan Yuan",
        "Jianguo Zeng",
        "Yongdong Zhang",
        "Feng Wu"
    ],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "HEM is the first data-driven methodology that well tackles (P1)-(P3) simultaneously and significantly improves the efficiency of solving MILPs on eleven challenging MILP benchmarks, including two Huawei's real problems."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}