{
    "acronym": "1c15a9bb3405510313a6303fadbcc37e149816bb",
    "title": "CUHK at SemEval-2020 Task 4: CommonSense Explanation, Reasoning and Prediction with Multi-task Learning",
    "seed_ids": [
        "gpt",
        "01f2b214962997260020279bd1fd1f8f372249d4",
        "710d183174844da5b7f392667f3cc25d2b098dde",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "7ebed46b7f3ec913e508e6468304fcaea832eda1",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47"
    ],
    "s2id": "1c15a9bb3405510313a6303fadbcc37e149816bb",
    "abstract": "This paper describes our system submitted to task 4 of SemEval 2020: Commonsense Validation and Explanation (ComVE) which consists of three sub-tasks. The task is to directly validate the given sentence whether or not to make sense and require the model to explain it. Based on BERT architecture with the multi-task setting, we propose an effective and interpretable “Explain, Reason and Predict” (ERP) system to solve the three sub-tasks about commonsense: (a) Validation, (b) Reasoning, and (c) Explanation. Inspired by cognitive studies of common sense, our system first generates a reason or understanding of the sentences and then choose which one statement makes sense, which is achieved by multi-task learning. During the post-evaluation, our system has reached 92.9% accuracy in subtask A (rank 11), 89.7% accuracy in subtask B (rank 9), and BLEU score of 12.9 in subtask C (rank 8).",
    "authors": [
        "Hongru Wang",
        "Xiangru Tang",
        "Sunny Lai",
        "K. Leung"
    ],
    "venue": "International Workshop on Semantic Evaluation",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes an effective and interpretable “Explain, Reason and Predict” (ERP) system to solve the three sub-tasks about commonsense: validation, reasoning, and Explanation."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}