{
    "acronym": "1c66c41ff22adf66bb9b06d87d5a2ab7b8ee8de7",
    "title": "Large Language Model (LLM) for Telecommunications: A Comprehensive Survey on Principles, Key Techniques, and Opportunities",
    "seed_ids": [
        "transformer",
        "gpt3",
        "bert",
        "4ae95f6dcdf5d4e2269869f23b205b358f2b7b17",
        "f45f85fa1beaa795c24c4ff86f1f2deece72252f",
        "16f01c1b3ddd0b2abd5ddfe4fdb3f74767607277",
        "663dc434fabc1cf1d3e85fff3f7ddcd313035d18",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "83edcfbb206ddad38a971d605da09390604248ea",
        "5b7f5488c380cf5085a5dd93e993ad293b225eee",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "863171ed35ca0035074f73bb202b153cc346f2f3",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "7a15950dc71079285a4eaf195de5aadd87c41b40",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a"
    ],
    "s2id": "1c66c41ff22adf66bb9b06d87d5a2ab7b8ee8de7",
    "abstract": "Large language models (LLMs) have received considerable attention recently due to their outstanding comprehension and reasoning capabilities, leading to great progress in many fields. The advancement of LLM techniques also offers promising opportunities to automate many tasks in the telecommunication (telecom) field. After pre-training and fine-tuning, LLMs can perform diverse downstream tasks based on human instructions, paving the way to artificial general intelligence (AGI)-enabled 6G. Given the great potential of LLM technologies, this work aims to provide a comprehensive overview of LLM-enabled telecom networks. In particular, we first present LLM fundamentals, including model architecture, pre-training, fine-tuning, inference and utilization, model evaluation, and telecom deployment. Then, we introduce LLM-enabled key techniques and telecom applications in terms of generation, classification, optimization, and prediction problems. Specifically, the LLM-enabled generation applications include telecom domain knowledge, code, and network configuration generation. After that, the LLM-based classification applications involve network security, text, image, and traffic classification problems. Moreover, multiple LLM-enabled optimization techniques are introduced, such as automated reward function design for reinforcement learning and verbal reinforcement learning. Furthermore, for LLM-aided prediction problems, we discussed time-series prediction models and multi-modality prediction problems for telecom. Finally, we highlight the challenges and identify the future directions of LLM-enabled telecom networks.",
    "authors": [
        "Hao Zhou",
        "Chengming Hu",
        "Ye Yuan",
        "Yufei Cui",
        "Yili Jin",
        "Can Chen",
        "Haolun Wu",
        "Dun Yuan",
        "Li Jiang",
        "Di Wu",
        "Xue Liu",
        "Charlie Zhang",
        "Xianbin Wang",
        "Jiangchuan Liu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents LLM fundamentals, including model architecture, pre-training, fine-tuning, inference and utilization, model evaluation, and telecom deployment, and introduces LLM-enabled key techniques and telecom applications in terms of generation, classification, optimization, and prediction problems."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}