{
    "acronym": "1c76caee0fd659253a042e91f87ea85b26a29594",
    "title": "Explore the Limits of Omni-modal Pretraining at Scale",
    "seed_ids": [
        "transformer",
        "486c2df78cbb770a90a55f7fa3fe19102fba2c24",
        "5fc1a3a49e8f1d106118b69d1d6be3b6caa23da0",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "5e00596fa946670d894b1bdaeff5a98e3867ef13",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1c76caee0fd659253a042e91f87ea85b26a29594",
    "abstract": "We propose to build omni-modal intelligence, which is capable of understanding any modality and learning universal representations. In specific, we propose a scalable pretraining paradigm, named Multimodal Context (MiCo), which can scale up the numbers of modalities and amount of data, together with the model parameters, in the pretraining process. With MiCo, the pretrained models show significant emergent abilities in multimodal learning, which are evaluated on the following tasks: i) single-modality perception benchmarks of 10 different modalities, ii) 25 cross-modality understanding tasks of retrieval, question-answering, captioning, and iii) 18 multimodal large language model benchmarks. Our models establish 37 new records for state-of-the-art performance. We hope that our research could contribute to the development of omni-modal intelligence. Code and Models are at https://github.com/invictus717/MiCo",
    "authors": [
        "Yiyuan Zhang",
        "Handong Li",
        "Jing Liu",
        "Xiangyu Yue"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A scalable pretraining paradigm, named Multimodal Context (MiCo), which can scale up the numbers of modalities and amount of data, together with the model parameters, in the pretraining process, is proposed, which shows significant emergent abilities in multimodal learning."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}