{
    "acronym": "1ce933c4108355594292d1a18c4c2d7e8a40832f",
    "title": "Foundation models in molecular biology",
    "seed_ids": [
        "transformer",
        "bert",
        "0f4780f3f42dbe9755d54495ae17244cc88a7483",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1ce933c4108355594292d1a18c4c2d7e8a40832f",
    "abstract": "Determining correlations between molecules at various levels is an important topic in molecular biology. Large language models have demonstrated a remarkable ability to capture correlations from large amounts of data in the field of natural language processing as well as image generation, and correlations captured from data using large language models can also be applicable to solving a wide range of specific tasks, hence large language models are also referred to as foundation models. The massive amount of data that exists in the field of molecular biology provides an excellent basis for the development of foundation models, and the recent emergence of foundation models in the field of molecular biology has really pushed the entire field forward. We summarize the foundation models developed based on RNA sequence data, DNA sequence data, protein sequence data, single-cell transcriptome data, and spatial transcriptome data respectively, and further discuss the research directions for the development of foundation models in molecular biology.",
    "authors": [
        "Yunda Si",
        "Jiawei Zou",
        "Yicheng Gao",
        "Guohui Chuai",
        "Qi Liu",
        "Luonan Chen"
    ],
    "venue": "Biophysics Reports",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work summarizes the foundation models developed based on RNA sequence data, DNA sequence data, protein sequence data, single-cell transcriptome data, and spatial transcriptome data respectively, and further discusses the research directions for the development of foundation models in molecular biology."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}