{
    "acronym": "1d0687f6de0d4c6fc45ca40a86532d6a2b4d7502",
    "title": "Developing a Large-Scale Language Model to Unveil and Alleviate Gender and Age Biases in Australian Job Ads",
    "seed_ids": [
        "gpt2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1d0687f6de0d4c6fc45ca40a86532d6a2b4d7502",
    "abstract": "This study explores the use of large-scale language models to detect and diminish gender and age biases in job ads. After training and testing various models, including RoBERTa, ALBERT, and GPT-2, RoBERTa performed the best in identifying such biases. Analysis revealed significant male bias in industries such as information and communication technology, manufacturing, transportation and logistics, and services. Age bias was also observed, favoring younger applicants over older candidates. Additionally, the study explores the use of ChatGPT’s natural language generation to address gender bias. Two versions of job ads were generated: one using gender-neutral language and the other intentionally incorporating feminizing language. User research showed that both versions significantly improved the attraction of female candidates and reduced gender bias. Overall, the study provides a comprehensive analysis of gender and age biases in Australian job ads, develops bias detectors with large-scale language models, and explores natural language generation to mitigate gender bias. By addressing these biases, the study aims to create a more inclusive and fair job market.",
    "authors": [
        "Ruochen Mao",
        "Liming Tan",
        "Rezza Moieni"
    ],
    "venue": "BigData Congress [Services Society]",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study explores the use of large-scale language models to detect and diminish gender and age biases in job ads, develops bias detectors with large-scale language models, and explores natural language generation to mitigate gender bias."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}