{
    "acronym": "1d2a8a04236369f3620092704838da06ed148cae",
    "title": "Hierarchical Multi-Task Learning for Fabric Component Analysis Based on NIR Spectral Signals",
    "seed_ids": [
        "gmlp",
        "eecc0a575c5f76abc634a1e31f4f0bcec0ea74c8"
    ],
    "s2id": "1d2a8a04236369f3620092704838da06ed148cae",
    "abstract": "Near Infrared (NIR) Spectral signal has been successfully applied to fabric component analysis (FCA), which is used to identify the category of the textile (defined as a classification task) and its corresponding content for that category (defined as a regression problem). Unlike conventional classification tasks, the prediction results usually contain more than two types of materials, i.e., classes. In addition, the spectral curves belonging to the same parent fiber are similar and thus lead to the problem that the intra-class variance is usually larger than the inter-class variance. The paper proposes a hierarchical architecture for Multi-Label Classification (MLC) and Multi-Output Regression (MOR) to simultaneously identify fabric classes and their contents, i.e., fabric component analysis. In addition, two constraints are applied to the loss function for final classification and regression results. Experimental results conducted on the FEAT-NIR dataset show that the proposed method successfully obtains the best performance compared to the baselines.",
    "authors": [
        "Joseph Kim",
        "Dong Wu",
        "M. Chi",
        "Gaoqi Xu"
    ],
    "venue": "IEEE International Conference on Acoustics, Speech, and Signal Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The paper proposes a hierarchical architecture for Multi-Label Classification (MLC) and Multi-Output Regression (MOR) to simultaneously identify fabric classes and their contents, i.e., fabric component analysis."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}