{
    "acronym": "1d5b042786004871b3c2c1ca6c4b4c50da1c8508",
    "title": "SEPSIS: I Can Catch Your Lies - A New Paradigm for Deception Detection",
    "seed_ids": [
        "bert",
        "270f3bea8ca801870a6cc56b4d36f7f2019c9ed0"
    ],
    "s2id": "1d5b042786004871b3c2c1ca6c4b4c50da1c8508",
    "abstract": "Deception is the intentional practice of twisting information. It is a nuanced societal practice deeply intertwined with human societal evolution, characterized by a multitude of facets. This research explores the problem of deception through the lens of psychology, employing a framework that categorizes deception into three forms: lies of omission, lies of commission, and lies of influence. The primary focus of this study is specifically on investigating only lies of omission. We propose a novel framework for deception detection leveraging NLP techniques. We curated an annotated dataset of 876,784 samples by amalgamating a popular large-scale fake news dataset and scraped news headlines from the Twitter handle of Times of India, a well-known Indian news media house. Each sample has been labeled with four layers, namely: (i) the type of omission (speculation, bias, distortion, sounds factual, and opinion), (ii) colors of lies(black, white, etc), and (iii) the intention of such lies (to influence, etc) (iv) topic of lies (political, educational, religious, etc). We present a novel multi-task learning pipeline that leverages the dataless merging of fine-tuned language models to address the deception detection task mentioned earlier. Our proposed model achieved an F1 score of 0.87, demonstrating strong performance across all layers including the type, color, intent, and topic aspects of deceptive content. Finally, our research explores the relationship between lies of omission and propaganda techniques. To accomplish this, we conducted an in-depth analysis, uncovering compelling findings. For instance, our analysis revealed a significant correlation between loaded language and opinion, shedding light on their interconnectedness. To encourage further research in this field, we will be making the models and dataset available with the MIT License, making it favorable for open-source research.",
    "authors": [
        "Anku Rani",
        "Dwip Dalal",
        "Shreya Gautam",
        "Pankaj Gupta",
        "Vinija Jain",
        "Aman Chadha",
        "Amit P. Sheth",
        "Amitava Das"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel multi-task learning pipeline that leverages the dataless merging of fine-tuned language models to address the deception detection task mentioned earlier is presented, demonstrating strong performance across all layers including the type, color, intent, and topic aspects of deceptive content."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}