{
    "acronym": "1d8cff65deddb04acdc681e6ea9d5270efab187a",
    "title": "Empirical Sufficiency Lower Bounds for Language Modeling with Locally-Bootstrapped Semantic Structures",
    "seed_ids": [
        "gpt2",
        "1ec16018e9152c50bbaed1d49c3077b9fb6d2838",
        "97a531f96a8d9a4c1d379637daf7dcc714db1b35",
        "5a2263092f49540fd0e049050a96882ff29b00c3",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee",
        "f6fbb6809374ca57205bd2cf1421d4f4fa04f975",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1d8cff65deddb04acdc681e6ea9d5270efab187a",
    "abstract": "In this work we build upon negative results from an attempt at language modeling with predicted semantic structure, in order to establish empirical lower bounds on what could have made the attempt successful.More specifically, we design a concise binary vector representation of semantic structure at the lexical level and evaluate in-depth how good an incremental tagger needs to be in order to achieve better-than-baseline performance with an end-to-end semantic-bootstrapping language model. We envision such a system as consisting of a (pretrained) sequential-neural component and a hierarchical-symbolic component working together to generate text with low surprisal and high linguistic interpretability.We find that (a) dimensionality of the semantic vector representation can be dramatically reduced without losing its main advantages and (b) lower bounds on prediction quality cannot be established via a single score alone, but need to take the distributions of signal and noise into account.",
    "authors": [
        "Jakob Prange",
        "Emmanuele Chersoni"
    ],
    "venue": "STARSEM",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A concise binary vector representation of semantic structure at the lexical level is designed and in-depth how good an incremental tagger needs to be in order to achieve better-than-baseline performance with an end-to-end semantic-bootstrapping language model is evaluated."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}