{
    "acronym": "1d9a05ee06ff108b6efb455a63b422ca73b6086d",
    "title": "Unlocking the Potential of Large Language Models for Clinical Text Anonymization: A Comparative Study",
    "seed_ids": [
        "gpt",
        "bert",
        "fef7e9eeed1ec5f0ba28ff88699f2965cf4d8c40"
    ],
    "s2id": "1d9a05ee06ff108b6efb455a63b422ca73b6086d",
    "abstract": "Automated clinical text anonymization has the potential to unlock the widespread sharing of textual health data for secondary usage while assuring patient privacy and safety. Despite the proposal of many complex and theoretically successful anonymization solutions in literature, these techniques remain flawed. As such, clinical institutions are still reluctant to apply them for open access to their data. Recent advances in developing Large Language Models (LLMs) pose a promising opportunity to further the field, given their capability to perform various tasks. This paper proposes six new evaluation metrics tailored to the challenges of generative anonymization with LLMs. Moreover, we present a comparative study of LLM-based methods, testing them against two baseline techniques. Our results establish LLM-based models as a reliable alternative to common approaches, paving the way toward trustworthy anonymization of clinical text.",
    "authors": [
        "David Pissarra",
        "Isabel Curioso",
        "Joao Alveira",
        "Duarte Pereira",
        "Bruno Ribeiro",
        "Tomas Souper",
        "Vasco Gomes",
        "A. Carreiro",
        "Vitor Rolla"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes six new evaluation metrics tailored to the challenges of generative anonymization with LLMs, establishing LLM-based models as a reliable alternative to common approaches, paving the way toward trustworthy anonymization of clinical text."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}