{
    "acronym": "1db3951e1649d023a05c868398614a1fc85b8027",
    "title": "Enabling CMF Estimation in Data-Constrained Scenarios: A Semantic-Encoding Knowledge Mining Model",
    "seed_ids": [
        "bert"
    ],
    "s2id": "1db3951e1649d023a05c868398614a1fc85b8027",
    "abstract": "Availability of more accurate Crash Modification Factors (CMFs) is crucial for evaluating the effectiveness of various road safety treatments and prioritizing infrastructure investment accordingly. While customized study for each countermeasure scenario is desired, the conventional CMF estimation approaches rely heavily on the availability of crash data at specific sites. This dependency may hinder the development of CMFs when it is impractical to collect data for recent implementations. Additionally, the transferability of CMF knowledge faces challenges, as the intrinsic similarities between different safety countermeasure scenarios are not fully explored. Aiming to fill these gaps, this study introduces a novel knowledge-mining framework for CMF prediction. This framework delves into the connections of existing countermeasure scenarios and reduces the reliance of CMF estimation on crash data availability and manual data collection. Specifically, it draws inspiration from human comprehension processes and introduces advanced Natural Language Processing (NLP) techniques to extract intricate variations and patterns from existing CMF knowledge. It effectively encodes unstructured countermeasure scenarios into machine-readable representations and models the complex relationships between scenarios and CMF values. This new data-driven framework provides a cost-effective and adaptable solution that complements the case-specific approaches for CMF estimation, which is particularly beneficial when availability of crash data imposes constraints. Experimental validation using real-world CMF Clearinghouse data demonstrates the effectiveness of this new approach, which shows significant accuracy improvements compared to the baseline methods. This approach provides insights into new possibilities of harnessing accumulated transportation knowledge in various applications.",
    "authors": [
        "Yanlin Qi",
        "Jia Li",
        "Michael Zhang"
    ],
    "venue": "Accident Analysis and Prevention",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study introduces a novel knowledge-mining framework for CMF prediction that draws inspiration from human comprehension processes and introduces advanced Natural Language Processing (NLP) techniques to extract intricate variations and patterns from existing CMF knowledge."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}