{
    "acronym": "1dcb8d28c3c000bc3365dab82c81eddd14c31aec",
    "title": "LOLA: LLM-Assisted Online Learning Algorithm for Content Experiments",
    "seed_ids": [
        "bert",
        "5be7e6b04c5a240cff340034aae2b57c677e211f",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "1dcb8d28c3c000bc3365dab82c81eddd14c31aec",
    "abstract": "In the rapidly evolving digital content landscape, media firms and news publishers require automated and efficient methods to enhance user engagement. This paper introduces the LLM-Assisted Online Learning Algorithm (LOLA), a novel framework that integrates Large Language Models (LLMs) with adaptive experimentation to optimize content delivery. Leveraging a large-scale dataset from Upworthy, which includes 17,681 headline A/B tests, we first investigate three pure-LLM approaches: prompt-based methods, embedding-based classification models, and fine-tuned open-source LLMs. We find that prompt-based approaches perform poorly, achieving no more than 65\\% accuracy in identifying the catchier headline. In contrast, both OpenAI-embedding-based classification models and fine-tuned Llama-3 with 8 billion parameters achieve an accuracy of around 82-84\\%. We then introduce LOLA, which combines the best pure-LLM approach with the Upper Confidence Bound algorithm to allocate traffic and maximize clicks adaptively. Our numerical experiments on Upworthy data show that LOLA outperforms the standard A/B test method (the current status quo at Upworthy), pure bandit algorithms, and pure-LLM approaches, particularly in scenarios with limited experimental traffic. Our approach is scalable and applicable to content experiments across various settings where firms seek to optimize user engagement, including digital advertising and social media recommendations.",
    "authors": [
        "Zikun Ye",
        "Hema Yoganarasimhan",
        "Yufeng Zheng"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The LLM-Assisted Online Learning Algorithm (LOLA) is introduced, a novel framework that integrates Large Language Models (LLMs) with adaptive experimentation to optimize content delivery and is scalable and applicable to content experiments across various settings where firms seek to optimize user engagement."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}