{
    "acronym": "1e17e4259b9d89841a40199e2de0d31792dfee71",
    "title": "Interpretation of Intracardiac Electrograms Through Textual Representations",
    "seed_ids": [
        "bigbird",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7"
    ],
    "s2id": "1e17e4259b9d89841a40199e2de0d31792dfee71",
    "abstract": "Understanding the irregular electrical activity of atrial fibrillation (AFib) has been a key challenge in electrocardiography. For serious cases of AFib, catheter ablations are performed to collect intracardiac electrograms (EGMs). EGMs offer intricately detailed and localized electrical activity of the heart and are an ideal modality for interpretable cardiac studies. Recent advancements in artificial intelligence (AI) has allowed some works to utilize deep learning frameworks to interpret EGMs during AFib. Additionally, language models (LMs) have shown exceptional performance in being able to generalize to unseen domains, especially in healthcare. In this study, we are the first to leverage pretrained LMs for finetuning of EGM interpolation and AFib classification via masked language modeling. We formulate the EGM as a textual sequence and present competitive performances on AFib classification compared against other representations. Lastly, we provide a comprehensive interpretability study to provide a multi-perspective intuition of the model's behavior, which could greatly benefit the clinical use.",
    "authors": [
        "William Jongwon Han",
        "Diana Gomez",
        "Avi Alok",
        "Chaojing Duan",
        "Michael A. Rosenberg",
        "Douglas Weber",
        "Emerson Liu",
        "Ding Zhao"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study is the first to leverage pretrained LMs for finetuning of EGM interpolation and AFib classification via masked language modeling and formulate the EGM as a textual sequence and present competitive performances on AFib classification compared against other representations."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}