{
    "acronym": "1e8fcf495dbc386591fcbab75df75ac41a503859",
    "title": "Single Cells Are Spatial Tokens: Transformers for Spatial Transcriptomic Data Imputation",
    "seed_ids": [
        "performer",
        "277dd73bfeb5c46513ce305136b0e71fcd2a311c",
        "c49ac1f916d6d2edeb187e6619c8d23acd95eb21",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "a9c214e846188adb645021cd7b1964b8ea1fef6f",
        "0d508600d77d8a7e6a655cdb6d139779732f649f",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "1e8fcf495dbc386591fcbab75df75ac41a503859",
    "abstract": "Spatially resolved transcriptomics brings exciting breakthroughs to single-cell analysis by providing physical locations along with gene expression. However, as a cost of the extremely high spatial resolution, the cellular level spatial transcriptomic data suffer significantly from missing values. While a standard solution is to perform imputation on the missing values, most existing methods either overlook spatial information or only incorporate localized spatial context without the ability to capture long-range spatial information. Using multi-head self-attention mechanisms and positional encoding, transformer models can readily grasp the relationship between tokens and encode location information. In this paper, by treating single cells as spatial tokens, we study how to leverage transformers to facilitate spatial tanscriptomics imputation. In particular, investigate the following two key questions: (1) $\\textit{how to encode spatial information of cells in transformers}$, and (2) $\\textit{ how to train a transformer for transcriptomic imputation}$. By answering these two questions, we present a transformer-based imputation framework, SpaFormer, for cellular-level spatial transcriptomic data. Extensive experiments demonstrate that SpaFormer outperforms existing state-of-the-art imputation algorithms on three large-scale datasets while maintaining superior computational efficiency.",
    "authors": [
        "Haifang Wen",
        "Wenzhuo Tang",
        "Wei Jin",
        "Jiayuan Ding",
        "Renming Liu",
        "Feng Shi",
        "Yuying Xie",
        "Jiliang Tang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "By treating single cells as spatial tokens, this paper investigates how to leverage transformers to facilitate spatial tanscriptomics imputation and presents a transformer-based imputation framework, SpaFormer, for cellular-level spatial transcriptomic data."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}