{
    "acronym": "1e909e2a8cdacdcdff125ebcc566f37cb869a1c8",
    "title": "A Survey on Hallucination in Large Language Models: Principles, Taxonomy, Challenges, and Open Questions",
    "seed_ids": [
        "gpt",
        "gpt2",
        "gpt3",
        "a72975eb88eb31f193e9587e7415cb04e7bcdbee",
        "233e48a00e5172819b36d3834cd0f4335b7ed595",
        "6327740b98005b5c9d090e5f1d474ff656d4174b",
        "465471bb5bf1a945549d6291c2d23367966b4957",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "0e3d6a7c9c04cf3ba9c902724548846a5ade04b4",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "fd1b829261ba04bb92e0ab60c4f6e7cea0d99fbf",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1e909e2a8cdacdcdff125ebcc566f37cb869a1c8",
    "abstract": "The emergence of large language models (LLMs) has marked a significant breakthrough in natural language processing (NLP), leading to remarkable advancements in text understanding and generation. Nevertheless, alongside these strides, LLMs exhibit a critical tendency to produce hallucinations, resulting in content that is inconsistent with real-world facts or user inputs. This phenomenon poses substantial challenges to their practical deployment and raises concerns over the reliability of LLMs in real-world scenarios, which attracts increasing attention to detect and mitigate these hallucinations. In this survey, we aim to provide a thorough and in-depth overview of recent advances in the field of LLM hallucinations. We begin with an innovative taxonomy of LLM hallucinations, then delve into the factors contributing to hallucinations. Subsequently, we present a comprehensive overview of hallucination detection methods and benchmarks. Additionally, representative approaches designed to mitigate hallucinations are introduced accordingly. Finally, we analyze the challenges that highlight the current limitations and formulate open questions, aiming to delineate pathways for future research on hallucinations in LLMs.",
    "authors": [
        "Lei Huang",
        "Weijiang Yu",
        "Weitao Ma",
        "Weihong Zhong",
        "Zhangyin Feng",
        "Haotian Wang",
        "Qianglong Chen",
        "Weihua Peng",
        "Xiaocheng Feng",
        "Bing Qin",
        "Ting Liu"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey aims to provide a thorough and in-depth overview of recent advances in the field of LLM hallucinations, and presents a comprehensive overview of hallucination detection methods and benchmarks."
    },
    "citationCount": 151,
    "influentialCitationCount": 7,
    "code": null,
    "description": null,
    "url": null
}