{
    "acronym": "1e99d24f9e853f2f3f5718aef201a5550f02147b",
    "title": "A Simple Latent Diffusion Approach for Panoptic Segmentation and Mask Inpainting",
    "seed_ids": [
        "analogbits",
        "13925d7d5952b1ba5960dfe2c44d977be109b636",
        "c5349e515efe3513682ba62da122be5756650af1",
        "8f48171bf05474449777d9bbf6766d480332e09f",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "1e99d24f9e853f2f3f5718aef201a5550f02147b",
    "abstract": "Panoptic and instance segmentation networks are often trained with specialized object detection modules, complex loss functions, and ad-hoc post-processing steps to manage the permutation-invariance of the instance masks. This work builds upon Stable Diffusion and proposes a latent diffusion approach for panoptic segmentation, resulting in a simple architecture that omits these complexities. Our training consists of two steps: (1) training a shallow autoencoder to project the segmentation masks to latent space; (2) training a diffusion model to allow image-conditioned sampling in latent space. This generative approach unlocks the exploration of mask completion or inpainting. The experimental validation on COCO and ADE20k yields strong segmentation results. Finally, we demonstrate our model's adaptability to multi-tasking by introducing learnable task embeddings.",
    "authors": [
        "Wouter Van Gansbeke",
        "Bert De Brabandere"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work builds upon Stable Diffusion and proposes a latent diffusion approach for panoptic segmentation, resulting in a simple architecture that omits these complexities and demonstrates the model's adaptability to multi-tasking by introducing learnable task embeddings."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}