{
    "acronym": "1ec3409eaad97a256e4177efeafd411dae9a344d",
    "title": "Goal-Conditioned Predictive Coding as an Implicit Planner for Offline Reinforcement Learning",
    "seed_ids": [
        "gpt",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "1ec3409eaad97a256e4177efeafd411dae9a344d",
    "abstract": "Recent work has demonstrated the effectiveness of formulating decision making as a supervised learning problem on ofﬂine-collected trajectories. However, the beneﬁts of performing sequence modeling on trajectory data is not yet clear. In this work we investigate if sequence modeling has the capability to condense trajectories into useful representations that can contribute to policy learning. To achieve this, we adopt a two-stage framework that ﬁrst summarizes trajectories with sequence modeling techniques, and then employs these representations to learn a policy along with a desired goal. This design allows many existing supervised ofﬂine RL methods to be considered as speciﬁc instances of our framework. Within this framework, we introduce Goal-Conditioned Predicitve Coding (GCPC), an approach that brings powerful trajectory representations and leads to performant policies. We conduct extensive empirical evaluations on AntMaze, FrankaKitchen and Locomotion environments, and observe that sequence modeling has a signiﬁcant impact on some decision making tasks. In addition, we demonstrate that GCPC learns a goal-conditioned latent representation about the future, which serves as an “implicit planner”, and enables competitive performance on all three benchmarks.",
    "authors": [
        "Zilai Zeng",
        "Ce Zhang",
        "Shijie Wang",
        "Chen Sun"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work investigates if sequence modeling has the capability to condense trajectories into useful representations that can contribute to policy learning, and introduces Goal-Conditioned Predicitve Coding (GCPC), an approach that brings powerful trajectory representations and leads to performant policies."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}