{
    "acronym": "1f02078a3d20ed5163156fc15d1722ac54a64c3b",
    "title": "Infographics Generator: A Smart Application for Visual Summarization",
    "seed_ids": [
        "gpt3",
        "85e3cf70079adb1db8b1b50321a5d336edc1c3fa",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "1f02078a3d20ed5163156fc15d1722ac54a64c3b",
    "abstract": "Visuals help in quickly interpreting complex information. Infographics are visual representations of information, that use charts, icons, or graphical illustrations with minimal text. Manually summarizing information into an infographic representation is not only a time-consuming activity but also requires additional skills in terms of tools and domain knowledge. Here we present a novel idea to perform a smart info-graphical summarization of any audio, video, voice, text input, using generative AI techniques. The input contents are fed into a preprocessor, which uses video converters and speech-to-text algorithms, to consolidate the input into a single text document. From this text, a summary is generated by using pre-trained language models. Along with it, the keywords associated with each of the summary entries are extracted. Based on the keywords, the most relevant icons and graphic assets are picked from the image library. A suitable infographic template is identified based on the topic and an intuitive infographic is generated. An infographic not only provides a quick overview of the contents but also reduces the cognitive load or the mental energy required to interpret the contents otherwise. This solution can thus provide a crisp summary in near real-time.",
    "authors": [
        "Manoj Nath",
        "Lakshmi Ethirajan"
    ],
    "venue": "International Conference on Developments in eSystems Engineering",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel idea to perform a smart info-graphical summarization of any audio, video, voice, text input, using generative AI techniques to provide a crisp summary in near real-time is presented."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}