{
    "acronym": "1f132aedd064314a02569cc05f2b9369d35dc4f3",
    "title": "Dior-CVAE: Pre-trained Language Models and Diffusion Priors for Variational Dialog Generation",
    "seed_ids": [
        "diffusionlm",
        "2c6ac935c826002976722ca8d3319f691975687e",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "06cd65936fdb2d2a5d51ca7fd612c48fbffc228e",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "9ae4666bf38e820292f8a889cb4a9fd796d2dba1",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "ba2a423d8c7ae6cfa3424fb13bdbe3a35e5f2273",
        "25db56fc85fe15625c3375064a35e908ba6dfd2a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "6ebfbc954b9975d2f2651f380b9bdf46ae963178",
        "791c3c30f2af10ac06f4fbc5b1e8960064aacbc7"
    ],
    "s2id": "1f132aedd064314a02569cc05f2b9369d35dc4f3",
    "abstract": "Current variational dialog models have employed pre-trained language models (PLMs) to parameterize the likelihood and posterior distributions. However, the Gaussian assumption made on the prior distribution is incompatible with these distributions, thus restricting the diversity of generated responses. These models also suffer from posterior collapse, i.e., the decoder tends to ignore latent variables and directly access information captured in the encoder through the cross-attention mechanism. In this work, we propose Dior-CVAE, a hierarchical conditional variational autoencoder (CVAE) with diffusion priors to address these challenges. We employ a diffusion model to increase the complexity of the prior distribution and its compatibility with the distributions produced by a PLM. Also, we propose memory dropout to the cross-attention mechanism, which actively encourages the use of latent variables for response generation. Overall, experiments across two commonly used open-domain dialog datasets show that our method can generate more diverse responses without large-scale dialog pre-training. Code is available at https://github.com/UKPLab/dior-cvae.",
    "authors": [
        "Tianyu Yang",
        "Thy Thy Tran",
        "Iryna Gurevych"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work employs a diffusion model to increase the complexity of the prior distribution and its compatibility with the distributions produced by a PLM, and proposes memory dropout to the cross-attention mechanism, which actively encourages the use of latent variables for response generation."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}