{
    "acronym": "1f7e1154c5dc51a2f715885ec2a11ed837a4ce0e",
    "title": "Learning to Compare Financial Reports for Financial Forecasting",
    "seed_ids": [
        "longformer",
        "5397ef2da78aac248826b66156bed824d8aa03fb",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "fd2d713249e07274ab376fa4284af0d54f69d2bf"
    ],
    "s2id": "1f7e1154c5dc51a2f715885ec2a11ed837a4ce0e",
    "abstract": "Public companies in the US are required to publish annual reports that detail their recent financial performance, present the current state of ongoing business operations, and discuss future prospects. However, they typically contain over 25,000 words across all sections, large amounts of industry and legal jargon, and a high percentage of boilerplate content that does not change much year-to-year. These unique characteristics present challenges for many generic pretrained language models because it is likely that only a small percentage of the long report that reflects salient information contains meaningful signal about the future prospects of the company. In this work, we curate a large-scale dataset of paired financial reports and introduce two novel, challenging tasks of predicting long-horizon company risk and correlation that evaluate the ability of the model to recognize cross-document relationships with complex, nuanced signals. We explore and present a comprehensive set of methods and experiments, and establish strong baselines designed to learn to identify subtle similarities and differences between long documents. Furthermore, we demonstrate that it is possible to predict company risk and correlation solely from the text of their financial reports and further that modeling the cross-document interactions at a fine-grained level provides significant benefit. Finally, we probe the best performing model through quantitative and qualitative interpretability methods to reveal some insight into the underlying task signal.",
    "authors": [
        "Ross Koval",
        "Nicholas Andrews",
        "Xifeng Yan"
    ],
    "venue": "Findings",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work curates a large-scale dataset of paired financial reports and introduces two novel, challenging tasks of predicting long-horizon company risk and correlation that evaluate the ability of the model to recognize cross-document relationships with complex, nuanced signals."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}