{
    "acronym": "1f86bf1e334200ec0481349255559fbfe7a33caa",
    "title": "MAPL: Parameter-Efficient Adaptation of Unimodal Pre-Trained Models for Vision-Language Few-Shot Prompting",
    "seed_ids": [
        "gpt",
        "gpt2",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "7f71875f8214dffa4f3276da123c4990a6d437cc",
        "5e00596fa946670d894b1bdaeff5a98e3867ef13",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "1f86bf1e334200ec0481349255559fbfe7a33caa",
    "abstract": "Large pre-trained models have proved to be remarkable zero- and (prompt-based) few-shot learners in unimodal vision and language tasks. We propose MAPL, a simple and parameter-efficient method that reuses frozen pre-trained unimodal models and leverages their strong generalization capabilities in multimodal vision-language (VL) settings. MAPL learns a lightweight mapping between the representation spaces of unimodal models using aligned image-text data, and can generalize to unseen VL tasks from just a few in-context examples. The small number of trainable parameters makes MAPL effective at low-data and in-domain learning. Moreover, MAPL’s modularity enables easy extension to other pre-trained models. Extensive experiments on several visual question answering and image captioning benchmarks show that MAPL achieves superior or competitive performance compared to similar methods while training orders of magnitude fewer parameters. MAPL can be trained in just a few hours using modest computational resources and public datasets. We release our code and pre-trained model weights at https://github.com/oscmansan/mapl.",
    "authors": [
        "Oscar Mañas",
        "Pau Rodríguez López",
        "Saba Ahmadi",
        "Aida Nematzadeh",
        "Yash Goyal",
        "Aishwarya Agrawal"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "MAPL is a simple and parameter-efficient method that reuses frozen pre-trained unimodal models and leverages their strong generalization capabilities in multimodal vision-language (VL) settings and learns a lightweight mapping between the representation spaces of unimmodal models using aligned image-text data."
    },
    "citationCount": 35,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}