{
    "acronym": "1fa3c5beaa16571da920cfa096255fb63d194c57",
    "title": "Complex Event Schema Induction with Knowledge-Enriched Diffusion Model",
    "seed_ids": [
        "d3pms",
        "a1186d7d9a9ef258c76afef1177e4f348061a537",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "1fa3c5beaa16571da920cfa096255fb63d194c57",
    "abstract": "The concept of a complex event schema per-tains to the graph structure that represents real-world knowledge of events and their multi-dimensional relationships. However, previous studies on event schema induction have been hindered by challenges such as error propagation and data quality issues. To tackle these challenges, we propose a knowledge-enriched discrete diffusion model. Specifically, we distill the abundant event scenario knowledge of Large Language Models (LLMs) through an object-oriented Python style prompt. We incorporate this knowledge into the training data, enhancing its quality. Subsequently, we employ a discrete diffusion process to generate all nodes and links simultaneously in a non-auto-regressive manner to tackle the problem of error propagation. Additionally, we devise an entity relationship prediction module to complete entity relationships between event arguments. Experimental results demonstrate that our approach achieves outstanding performance across a range of evaluation metrics. 1",
    "authors": [
        "Yupu Hao",
        "Pengfei Cao",
        "Yubo Chen",
        "Kang Liu",
        "Jiexin Xu",
        "Huaijun Li",
        "Xiaojian Jiang",
        "Jun Zhao"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work distill the abundant event scenario knowledge of Large Language Models through an object-oriented Python style prompt, and employs a discrete diffusion process to generate all nodes and links simultaneously in a non-auto-regressive manner to tackle the problem of error propagation."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}