{
    "acronym": "200050c1f51e2c930e62b078c6ce20f2a6675468",
    "title": "A Pre-training Based Personalized Dialogue Generation Model with Persona-sparse Data",
    "seed_ids": [
        "gpt",
        "497b1a8711d5f5f0a27254fd4a1bba16ad0d9625",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c",
        "791c3c30f2af10ac06f4fbc5b1e8960064aacbc7",
        "535bbc71ef9f8a8c6180c599ded774ff6f4f8258",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "200050c1f51e2c930e62b078c6ce20f2a6675468",
    "abstract": "Endowing dialogue systems with personas is essential to deliver more human-like conversations. However, this problem is still far from well explored due to the difficulties of both embodying personalities in natural languages and the persona sparsity issue observed in most dialogue corpora. This paper proposes a pre-training based personalized dialogue model that can generate coherent responses using persona-sparse dialogue data. In this method, a pre-trained language model is used to initialize an encoder and decoder, and personal attribute embeddings are devised to model richer dialogue contexts by encoding speakers' personas together with dialogue histories. Further, to incorporate the target persona in the decoding process and to balance its contribution, an attention routing structure is devised in the decoder to merge features extracted from the target persona and dialogue contexts using dynamically predicted weights. Our model can utilize persona-sparse dialogues in a unified manner during the training process, and can also control the amount of persona-related features to exhibit during the inference process. Both automatic and manual evaluation demonstrates that the proposed model outperforms state-of-the-art methods for generating more coherent and persona consistent responses with persona-sparse data.",
    "authors": [
        "Yinhe Zheng",
        "Rongsheng Zhang",
        "Xiaoxi Mao",
        "Minlie Huang"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A pre-training based personalized dialogue model that can generate coherent responses using persona-sparse dialogue data and outperforms state-of-the-art methods for generating more coherent and persona consistent responses with persona-Sparse data is proposed."
    },
    "citationCount": 138,
    "influentialCitationCount": 14,
    "code": null,
    "description": null,
    "url": null
}