{
    "acronym": "200b2380b5d525a0e0d4826ea6f7eec38c013a8c",
    "title": "PlagBench: Exploring the Duality of Large Language Models in Plagiarism Generation and Detection",
    "seed_ids": [
        "bert",
        "1c13af186d1e177b85ef1ec3fc7b8d33ec314cfd",
        "adc13ef61e47628e9efcdca0c27654370e46dae5",
        "7cb5e9570b562d12df7bbca1cdf5bfcd33ae504b",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "11beca761c3079f7612204ed1b241ee8832107c9"
    ],
    "s2id": "200b2380b5d525a0e0d4826ea6f7eec38c013a8c",
    "abstract": "Recent literature has highlighted potential risks to academic integrity associated with large language models (LLMs), as they can memorize parts of training instances and reproduce them in the generated texts without proper attribution. In addition, given their capabilities in generating high-quality texts, plagiarists can exploit LLMs to generate realistic paraphrases or summaries indistinguishable from original work. In response to possible malicious use of LLMs in plagiarism, we introduce PlagBench, a comprehensive dataset consisting of 46.5K synthetic plagiarism cases generated using three instruction-tuned LLMs across three writing domains. The quality of PlagBench is ensured through fine-grained automatic evaluation for each type of plagiarism, complemented by human annotation. We then leverage our proposed dataset to evaluate the plagiarism detection performance of five modern LLMs and three specialized plagiarism checkers. Our findings reveal that GPT-3.5 tends to generates paraphrases and summaries of higher quality compared to Llama2 and GPT-4. Despite LLMs' weak performance in summary plagiarism identification, they can surpass current commercial plagiarism detectors. Overall, our results highlight the potential of LLMs to serve as robust plagiarism detection tools.",
    "authors": [
        "Jooyoung Lee",
        "Toshini Agrawal",
        "Adaku Uchendu",
        "Thai Le",
        "Jinghui Chen",
        "Dongwon Lee"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "PlagBench is introduced, a comprehensive dataset consisting of 46.5K synthetic plagiarism cases generated using three instruction-tuned LLMs across three writing domains and reveals that LLMs' weak performance in summary plagiarism identification can surpass current commercial plagiarism detectors."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}