{
    "acronym": "200fcd964f41efe0c35a3f888a520ede08a3269c",
    "title": "From Interpolation to Extrapolation: Complete Length Generalization for Arithmetic Transformers",
    "seed_ids": [
        "longformer",
        "alibi",
        "5215a3cfd67fdc6eb0201822dd0004bd4b830f91",
        "1ec3a3ff77cb4b424499b3805ecc90182ecd8f8b",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "6f6e2e0311589a9af045f6acd00b7dee6d19fce4",
        "af385c0fdd0eda2bbf429bea6fedffc327c8a180",
        "5735e49e501c8e51e9be4079592e46e047747b03",
        "4d17732d90440682b0500f4e209c6cc4fac20e0e",
        "c6d38add1b7bbc10f0da37a90e3f1b51ee5fb617",
        "d6c5aab433d9871cabc01ffb1e5e1ea89141155b",
        "e528466e2aff981511d4ca6e063211297c0b4175",
        "7072db6eddb85ecd2c117365d91bd694760f726e",
        "67ee20536c30a225b86902af2f091e28e5e19b40",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "8cef9900c04d7f661c08f4b5b1ed4337ace042a3"
    ],
    "s2id": "200fcd964f41efe0c35a3f888a520ede08a3269c",
    "abstract": "In this paper, we investigate the inherent capabilities of transformer models in learning arithmetic algorithms, such as addition and parity. Through experiments and attention analysis, we identify a number of crucial factors for achieving optimal length generalization. We show that transformer models are able to generalize to long lengths with the help of targeted attention biasing. In particular, our solution solves the Parity task, a well-known and theoretically proven failure mode for Transformers. We then introduce Attention Bias Calibration (ABC), a calibration stage that enables the model to automatically learn the proper attention biases, which we show to be connected to mechanisms in relative position encoding. We demonstrate that using ABC, the transformer model can achieve unprecedented near-perfect length generalization on certain arithmetic tasks. In addition, we show that ABC bears remarkable similarities to RPE and LoRA, which may indicate the potential for applications to more complex tasks.",
    "authors": [
        "Shaoxiong Duan",
        "Yining Shi"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that using ABC, the transformer model can achieve unprecedented near-perfect length generalization on certain arithmetic tasks, and it is shown that ABC bears remarkable similarities to RPE and LoRA, which may indicate the potential for applications to more complex tasks."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}