{
    "acronym": "2016e814eed00b0c0a9358e193e29854e0ed526f",
    "title": "Long-Range Modeling of Source Code Files with eWASH: Extended Window Access by Syntax Hierarchy",
    "seed_ids": [
        "performer",
        "reformer",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "2016e814eed00b0c0a9358e193e29854e0ed526f",
    "abstract": "Statistical language modeling and translation with transformers have found many successful applications in program understanding and generation tasks, setting high benchmarks for tools in modern software development environments. The finite context window of these neural models means, however, that they will be unable to leverage the entire relevant context of large files and packages for any given task. While there are many efforts to extend the context window, we introduce an architecture-independent approach for leveraging the syntactic hierarchies of source code for incorporating entire file-level context into a fixed-length window. Using concrete syntax trees of each source file we extract syntactic hierarchies and integrate them into context window by selectively removing from view more specific, less relevant scopes for a given task. We evaluate this approach on code generation tasks and joint translation of natural language and source code in Python programming language, achieving a new state-of-the-art in code completion and summarization for Python in the CodeXGLUE benchmark. We also introduce new CodeXGLUE benchmarks for user-experience-motivated tasks: code completion with normalized literals, method body completion/code summarization conditioned on file-level context.",
    "authors": [
        "Colin B. Clement",
        "Shuai Lu",
        "Xiaoyu Liu",
        "Michele Tufano",
        "Dawn Drain",
        "Nan Duan",
        "Neel Sundaresan",
        "Alexey Svyatkovskiy"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces an architecture-independent approach for leveraging the syntactic hierarchies of source code for incorporating entire file-level context into a fixed-length window."
    },
    "citationCount": 23,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}