{
    "acronym": "2046b2da23eb2f79744eb391d902da9cedf87947",
    "title": "Large Language Models(LLMs) on Tabular Data: Prediction, Generation, and Understanding - A Survey",
    "seed_ids": [
        "gpt3",
        "bert",
        "1e909e2a8cdacdcdff125ebcc566f37cb869a1c8",
        "16f01c1b3ddd0b2abd5ddfe4fdb3f74767607277",
        "d84cf745c534c010b8e55e5a4a04878906848dc3",
        "d62c4d00b277e948956b6610ce2644e88fe1577b",
        "4e1cac32403c6caff15aa8c2a3560031bb05c6d4",
        "394bd431e522b86581086bcb5cd9be161cf1cdf4",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "25d3a4e048d0020ba9cffc6442ebd4e7bb548a55",
        "b92628d13e8d090d042232fe6ae0b8998634b893",
        "b21670e8061a06ab97e7d6052c9345a326e84ff8",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd"
    ],
    "s2id": "2046b2da23eb2f79744eb391d902da9cedf87947",
    "abstract": "Recent breakthroughs in large language modeling have facilitated rigorous exploration of their application in diverse tasks related to tabular data modeling, such as prediction, tabular data synthesis, question answering, and table understanding. Each task presents unique challenges and opportunities. However, there is currently a lack of comprehensive review that summarizes and compares the key techniques, metrics, datasets, models, and optimization approaches in this research domain. This survey aims to address this gap by consolidating recent progress in these areas, offering a thorough survey and taxonomy of the datasets, metrics, and methodologies utilized. It identifies strengths, limitations, unexplored territories, and gaps in the existing literature, while providing some insights for future research directions in this vital and rapidly evolving field. It also provides relevant code and datasets references. Through this comprehensive review, we hope to provide interested readers with pertinent references and insightful perspectives, empowering them with the necessary tools and knowledge to effectively navigate and address the prevailing challenges in the field.",
    "authors": [
        "Xi Fang",
        "Weijie Xu",
        "Fiona Anting Tan",
        "Jiani Zhang",
        "Ziqing Hu",
        "Yanjun Qi",
        "Scott Nickleach",
        "Diego Socolinsky",
        "Srinivasan H. Sengamedu",
        "Christos Faloutsos"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey aims to address the gap by consolidating recent progress in these areas, offering a thorough survey and taxonomy of the datasets, metrics, and methodologies utilized, while providing some insights for future research directions in this vital and rapidly evolving field."
    },
    "citationCount": 9,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}