{
    "acronym": "204e81f59339fc28e63d20df64778fc49d3edc01",
    "title": "BAITSAO: Building A Foundation Model for Drug Synergy Analysis Powered by Language Models",
    "seed_ids": [
        "gpt3",
        "a9f7761b740c85444b86f581801a471340007a0d",
        "584ca135b61482fd89247113da87d784f738dbfa",
        "316a011bf461d3a96965fb9f69398888da19bd9f",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d"
    ],
    "s2id": "204e81f59339fc28e63d20df64778fc49d3edc01",
    "abstract": "Drug synergy prediction is a challenging and important task in the treatment of complex diseases including cancer. In this manuscript, we present a novel Foundation Model, known as BAITSAO, for tasks related to drug synergy prediction with a unified pipeline to handle different datasets. We construct the training datasets for BAITSAO based on the context-enriched embeddings from Large Language Models for the initial representation of drugs and cell lines. After demonstrating the relevance of these embeddings, we pre-train BAITSAO with a large-scale drug synergy database under a multi-task learning framework with rigorous selections of tasks. We demonstrate the superiority of the model architecture and the pre-trained strategies of BAITSAO over other methods through comprehensive benchmark analysis. Moreover, we investigate the sensitivity of BAITSAO and illustrate its unique functions including new drug discoveries, drug combinations-gene interaction, and multi-drug synergy predictions.",
    "authors": [
        "Tianyu Liu",
        "Tinyi Chu",
        "Xiao Luo",
        "Hongyu Zhao"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This manuscript presents a novel Foundation Model, known as BAITSAO, for tasks related to drug synergy prediction with a unified pipeline to handle different datasets and demonstrates the superiority of the model architecture and the pre-trained strategies of BAITSAO over other methods through comprehensive benchmark analysis."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}