{
    "acronym": "205c17d567a6178031454519ba45e57b5c809d9d",
    "title": "AffectON: Incorporating Affect Into Dialog Generation",
    "seed_ids": [
        "gpt",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "205c17d567a6178031454519ba45e57b5c809d9d",
    "abstract": "Due to its expressivity, natural language is paramount for explicit and implicit affective state communication among humans. The same linguistic inquiry (e.g., How are you?) might induce responses with different affects depending on the affective state of the conversational partner(s) and the context of the conversation. Yet, most dialog systems do not consider affect as constitutive aspect of response generation. In this article, we introduce AffectON, an approach for generating affective responses during inference. For generating language in a targeted affect, our approach leverages a probabilistic language model and an affective space. AffectON is language model agnostic, since it can work with probabilities generated by any language model (e.g., sequence-to-sequence models, neural language models, n-grams). Hence, it can be employed for both affective dialog and affective language generation. We experimented with affective dialog generation and evaluated the generated text objectively and subjectively. For the subjective part of the evaluation, we designed a custom user interface for rating and provided recommendations for the design of such interfaces. The results, both subjective and objective demonstrate that our approach is successful in pulling the generated language toward the targeted affect, with little sacrifice in syntactic coherence.",
    "authors": [
        "Zana Buçinca",
        "Y. Yemez",
        "E. Erzin",
        "T. M. Sezgin"
    ],
    "venue": "IEEE Transactions on Affective Computing",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "In this article, AffectON is introduced, an approach for generating affective responses during inference that leverages a probabilistic language model and an affective space and can be employed for both affective dialog and affective language generation."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}