{
    "acronym": "20777da1b38306a398ba4d2ace5bf25d59051b79",
    "title": "Comparative Graph-based Summarization of Scientific Papers Guided by Comparative Citations",
    "seed_ids": [
        "gpt"
    ],
    "s2id": "20777da1b38306a398ba4d2ace5bf25d59051b79",
    "abstract": "With the rapid growth of scientific papers, understanding the changes and trends in a research area is rather time-consuming. The first challenge is to find related and comparable articles for the research. Comparative citations compare co-cited papers in a citation sentence and can serve as good guidance for researchers to track a research area. We thus go through comparative citations to find comparable objects and build a comparative scientific summarization corpus (CSSC). And then, we propose the comparative graph-based summarization (CGSUM) method to create comparative summaries using citations as guidance. The comparative graph is constructed using sentences as nodes and three different relationships of sentences as edges. The relationship that sentences occur in the same paper is used to calculate the salience of sentences, the relationship that sentences occur in two different papers is used to calculate the difference between sentences, and the relationship that sentences are related to citations is used to calculate the commonality of sentences. Experiments show that CGSUM outperforms comparative baselines on CSSC and performs well on DUC2006 and DUC2007.",
    "authors": [
        "Jingqiang Chen",
        "Chaoxiang Cai",
        "Xiaorui Jiang",
        "Kejia Chen"
    ],
    "venue": "International Conference on Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The comparative graph-based summarization (CGSUM) method is proposed to create comparative summaries using citations as guidance and shows that CGSUM outperforms comparative baselines on CSSC and performs well on DUC2006 and DUC2007."
    },
    "citationCount": 4,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}