{
    "acronym": "20d4f6b3cab0816f40fd75f5a54d1073c662f5e3",
    "title": "Seventeenth-Century Spanish American Notary Records for Fine-Tuning Spanish Large Language Models",
    "seed_ids": [
        "bert"
    ],
    "s2id": "20d4f6b3cab0816f40fd75f5a54d1073c662f5e3",
    "abstract": "Large language models have gained tremendous popularity in domains such as e-commerce, finance, healthcare, and education. Fine-tuning is a common approach to customize an LLM on a domain-specific dataset for a desired downstream task. In this paper, we present a valuable resource for fine-tuning LLMs developed for the Spanish language to perform a variety of tasks such as classification, masked language modeling, clustering, and others. Our resource is a collection of handwritten notary records from the seventeenth century obtained from the National Archives of Argentina. This collection contains a combination of original images and transcribed text (and metadata) of 160+ pages that were handwritten by two notaries, namely, Estenban Agreda de Vergara and Nicolas de Valdivia y Brisuela nearly 400 years ago. Through empirical evaluation, we demonstrate that our collection can be used to fine-tune Spanish LLMs for tasks such as classification and masked language modeling, and can outperform pre-trained Spanish models and ChatGPT-3.5/ChatGPT-4o. Our resource will be an invaluable resource for historical text analysis and is publicly available on GitHub.",
    "authors": [
        "Shraboni Sarker",
        "Ahmad Tamim Hamad",
        "Hulayyil Alshammari",
        "Viviana Grieco",
        "Praveen Rao"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper presents a valuable resource for fine-tuning LLMs developed for the Spanish language to perform a variety of tasks such as classification, masked language modeling, clustering, and others, and demonstrates that it can outperform pre-trained Spanish models and ChatGPT-3.5/ChatGPT-4o."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}