{
    "acronym": "20e6bbcbeb5d06059b1d0353e9145097b62fafac",
    "title": "xMTrans: Temporal Attentive Cross-Modality Fusion Transformer for Long-Term Traffic Prediction",
    "seed_ids": [
        "transformer",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "30dcc0e191a376fea0e7a46f94c53872c029efc9"
    ],
    "s2id": "20e6bbcbeb5d06059b1d0353e9145097b62fafac",
    "abstract": "Traffic predictions play a crucial role in intelligent transportation systems. The rapid development of IoT devices allows us to collect different kinds of data with high correlations to traffic predictions, fostering the development of efficient multi-modal traffic prediction models. Until now, there are few studies focusing on utilizing advantages of multi-modal data for traffic predictions. In this paper, we introduce a novel temporal attentive cross-modality transformer model for long-term traffic predictions, namely xMTrans, with capability of exploring the temporal correlations between the data of two modalities: one target modality (for prediction, e.g., traffic congestion) and one support modality (e.g., people flow). We conducted extensive experiments to evaluate our proposed model on traffic congestion and taxi demand predictions using real-world datasets. The results showed the superiority of xMTrans against recent state-of-the-art methods on long-term traffic predictions. In addition, we also conducted a comprehensive ablation study to further analyze the effectiveness of each module in xMTrans.",
    "authors": [
        "H. Ung",
        "Hao Niu",
        "Minh-Son Dao",
        "Shinya Wada",
        "A. Minamikawa"
    ],
    "venue": "International Conference on Mobile Data Management",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel temporal attentive cross-modality transformer model for long-term traffic predictions, namely xMTrans, with capability of exploring the temporal correlations between the data of two modalities, showing the superiority of xMTrans against recent state-of-the-art methods on long-term traffic predictions."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}