{
    "acronym": "210cbfbef3bf476af3a51555f94cb59b7223f0c8",
    "title": "Kernel Attention Transformer for Histopathology Whole Slide Image Analysis and Assistant Cancer Diagnosis",
    "seed_ids": [
        "nystromformer",
        "4f3888ea13bef9403d6c7a96c14a85575a79bce0",
        "6fa1cfc4f97f03a8485692418c7aa1a06c574a85",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "210cbfbef3bf476af3a51555f94cb59b7223f0c8",
    "abstract": "Transformer has been widely used in histopathology whole slide image analysis. However, the design of token-wise self-attention and positional embedding strategy in the common Transformer limits its effectiveness and efficiency when applied to gigapixel histopathology images. In this paper, we propose a novel kernel attention Transformer (KAT) for histopathology WSI analysis and assistant cancer diagnosis. The information transmission in KAT is achieved by cross-attention between the patch features and a set of kernels related to the spatial relationship of the patches on the whole slide images. Compared to the common Transformer structure, KAT can extract the hierarchical context information of the local regions of the WSI and provide diversified diagnosis information. Meanwhile, the kernel-based cross-attention paradigm significantly reduces the computational amount. The proposed method was evaluated on three large-scale datasets and was compared with 8 state-of-the-art methods. The experimental results have demonstrated the proposed KAT is effective and efficient in the task of histopathology WSI analysis and is superior to the state-of-the-art methods.",
    "authors": [
        "Yushan Zheng",
        "Jun Li",
        "Jun Shi",
        "Feng-ying Xie",
        "Jianguo Huai",
        "M. Cao",
        "Zhi-guo Jiang"
    ],
    "venue": "IEEE Transactions on Medical Imaging",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed kernel attention Transformer (KAT) for histopathology WSI analysis and assistant cancer diagnosis can extract the hierarchical context information of the local regions of the WSI and provide diversified diagnosis information and the kernel-based cross-attention paradigm significantly reduces the computational amount."
    },
    "citationCount": 12,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}