{
    "acronym": "21115266c11c5c890dc356e25f4a18eafb7ecabf",
    "title": "Towards AI-Driven Healthcare: Systematic Optimization, Linguistic Analysis, and Clinicians’ Evaluation of Large Language Models for Smoking Cessation Interventions",
    "seed_ids": [
        "gpt2",
        "gpt3",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "98962528d113b47fd72ebe7ff205fb6a14d0d9e3",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "21115266c11c5c890dc356e25f4a18eafb7ecabf",
    "abstract": "Creating intervention messages for smoking cessation is a labor-intensive process. Advances in Large Language Models (LLMs) offer a promising alternative for automated message generation. Two critical questions remain: 1) How to optimize LLMs to mimic human expert writing, and 2) Do LLM-generated messages meet clinical standards? We systematically examined the message generation and evaluation processes through three studies investigating prompt engineering (Study 1), decoding optimization (Study 2), and expert review (Study 3). We employed computational linguistic analysis in LLM assessment and established a comprehensive evaluation framework, incorporating automated metrics, linguistic attributes, and expert evaluations. Certified tobacco treatment specialists assessed the quality, accuracy, credibility, and persuasiveness of LLM-generated messages, using expert-written messages as the benchmark. Results indicate that larger LLMs, including ChatGPT, OPT-13B, and OPT-30B, can effectively emulate expert writing to generate well-written, accurate, and persuasive messages, thereby demonstrating the capability of LLMs in augmenting clinical practices of smoking cessation interventions.",
    "authors": [
        "Paul Calle",
        "Ruosi Shao",
        "Yunlong Liu",
        "Emily T Hébert",
        "Darla E. Kendzor",
        "JM Neil",
        "Michael S. Businelle",
        "Chongle Pan"
    ],
    "venue": "International Conference on Human Factors in Computing Systems",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Results indicate that larger LLMs, including ChatGPT, OPT-13B, and OPT-30B, can effectively emulate expert writing to generate well-written, accurate, and persuasive messages, thereby demonstrating the capability of LLMs in augmenting clinical practices of smoking cessation interventions."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}