{
    "acronym": "211b6cd50993de7dd77aa03231a06f8a733b41d8",
    "title": "Boosting Crowd Counting via Multifaceted Attention",
    "seed_ids": [
        "longformer",
        "3cbe314cc5407a6c3249815b5173f22ea15173c2",
        "2e1db8cb373f4d4a51d44308b7a457886d855fbb",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "211b6cd50993de7dd77aa03231a06f8a733b41d8",
    "abstract": "This paper focuses on the challenging crowd counting task. As large-scale variations often exist within crowd images, neither fixed-size convolution kernel of CNN nor fixed-size attention of recent vision transformers can well handle this kind of variations. To address this problem, we propose a Multifaceted Attention Network (MAN) to improve transformer models in local spatial relation encoding. MAN incorporates global attention from vanilla transformer, learnable local attention, and instance attention into a counting model. Firstly, the local Learnable Region Attention (LRA) is proposed to assign attention exclusive for each feature location dynamically. Secondly, we design the Local Attention Regularization to supervise the training of LRA by minimizing the deviation among the attention for different feature locations. Finally, we provide an Instance Attention mechanism to focus on the most important instances dynamically during training. Extensive experiments on four challenging crowd counting datasets namely ShanghaiTech, UCF-QNRF, JHU++, and NWPU have validated the proposed method. Code: https://github.com/LoraLinH/Boosting-Crowd-Counting-via-Multifaceted-Attention.",
    "authors": [
        "Hui Lin",
        "Zhiheng Ma",
        "Rongrong Ji",
        "Yaowei Wang",
        "Xiaopeng Hong"
    ],
    "venue": "Computer Vision and Pattern Recognition",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Multifaceted Attention Network (MAN) is proposed to improve transformer models in local spatial relation encoding and an Instance Attention mechanism is provided to focus on the most important instances dynamically during training."
    },
    "citationCount": 98,
    "influentialCitationCount": 16,
    "code": null,
    "description": null,
    "url": null
}