{
    "acronym": "2193d898e556ad2ac14f0ababf02f90e6fdfe663",
    "title": "DecBERT: Enhancing the Language Understanding of BERT with Causal Attention Masks",
    "seed_ids": [
        "gpt",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "7072db6eddb85ecd2c117365d91bd694760f726e",
        "0822f8d7e6a72a65e65f147d3a8d8fccd485da40",
        "8cef9900c04d7f661c08f4b5b1ed4337ace042a3",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "2ff74d426e712522030057624510c03713fa77ba",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2193d898e556ad2ac14f0ababf02f90e6fdfe663",
    "abstract": "Since 2017, the Transformer-based models play critical roles in various downstream Natural Language Processing tasks. However, a common limitation of the attention mechanism utilized in Transformer Encoder is that it cannot automatically capture the information of word order, so explicit position embeddings are generally required to be fed into the target model. In contrast, Transformer Decoder with the causal attention masks is naturally sensitive to the word order. In this work, we focus on improving the position encoding ability of BERT with the causal attention masks. Furthermore, we propose a new pre-trained language model DecBERT and evaluate it on the GLUE benchmark. Experimental results show that (1) the causal attention mask is effective for BERT on the language understanding tasks; (2) our DecBERT model without position embeddings achieve comparable performance on the GLUE benchmark; and (3) our modification accelerates the pre-training process and DecBERT w/ PE achieves better overall performance than the baseline systems when pre-training with the same amount of computational resources.",
    "authors": [
        "Ziyang Luo",
        "Yadong Xi",
        "Jing Ma",
        "Zhiwei Yang",
        "Xiaoxi Mao",
        "Changjie Fan",
        "Rongsheng Zhang"
    ],
    "venue": "NAACL-HLT",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work focuses on improving the position encoding ability of BERT with the causal attention masks, and proposes a new pre-trained language model DecBERT and evaluates it on the GLUE benchmark."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}