{
    "acronym": "219add0ef5c6e6a7073e17df3b210e9c6d594f44",
    "title": "Global insights and the impact of generative AI-ChatGPT on multidisciplinary: a systematic review and bibliometric analysis",
    "seed_ids": [
        "transformer",
        "7b6a8c6d44e0f77bf930484e438d77b7465a69fb",
        "d9c7142e6d843806c754214529ac8d190deb85f8",
        "3520882d33a9279e706e37b5e1d4878722b40fce",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "b15469d0ab3dc3a9dec037d761817b3fe546bed6"
    ],
    "s2id": "219add0ef5c6e6a7073e17df3b210e9c6d594f44",
    "abstract": "In 2022, OpenAI’s unveiling of generative AI Large Language Models (LLMs)- ChatGPT, heralded a significant leap forward in human-machine interaction through cutting-edge AI technologies. With its surging popularity, scholars across various fields have begun to delve into the myriad applications of ChatGPT. While existing literature reviews on LLMs like ChatGPT are available, there is a notable absence of systematic literature reviews (SLRs) and bibliometric analyses assessing the research’s multidisciplinary and geographical breadth. This study aims to bridge this gap by synthesizing and evaluating how ChatGPT has been integrated into diverse research areas, focusing on its scope and the geographical distribution of studies. Through a systematic review of scholarly articles, we chart the global utilization of ChatGPT across various scientific domains, exploring its contribution to advancing research paradigms and its adoption trends among di ff erent disciplines. Our findings reveal a widespread endorsement of ChatGPT across multiple fields, with significant implementations in healthcare (38.6%), computer science / IT (18.6%), and education / research (17.3%). Moreover, our demographic analysis underscores ChatGPT’s global reach and accessibility, indicating participation from 80 unique countries in ChatGPT-related research, with the most frequent countries keyword occurrence, USA (719), China (181), and India (157) leading in contributions. Additionally, our study highlights the leading roles of institutions such as King Saud University, the All India Institute of Medical Sciences, and Taipei Medical University in pioneering ChatGPT research in our dataset. This research not only sheds light on the vast opportunities and challenges posed by ChatGPT in scholarly pursuits but also acts as a pivotal resource for future inquiries. It emphasizes that the generative AI (LLM) role is revolutionizing every field. The insights provided in this paper are particularly valuable for academics, researchers, and practitioners across various disciplines, as well as policymakers looking to grasp the extensive reach and impact of generative AI technologies like ChatGPT in the global research community.",
    "authors": [
        "Nauman Khan",
        "Zahid Khan",
        "Anis Koubaa",
        "Muhammad Khurram Khan",
        "Rosli bin Salleh"
    ],
    "venue": "Connection science",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study synthesizes and evaluates how ChatGPT has been integrated into diverse research areas, focusing on its scope and the geographical distribution of studies, and charts the global utilization of ChatGPT across various scientific domains."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}