{
    "acronym": "21b90fd7afb15b202a7fa2482da12839164bf6cf",
    "title": "Any-Property-Conditional Molecule Generation with Self-Criticism using Spanning Trees",
    "seed_ids": [
        "transformer",
        "gpt2",
        "classfreediffu",
        "8b20edda4a0013d628b9c4e9e4b42a5f1310b12f",
        "5a3a04af4935302f0871bf14a4b573d477ce96be",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "21b90fd7afb15b202a7fa2482da12839164bf6cf",
    "abstract": "Generating novel molecules is challenging, with most representations leading to generative models producing many invalid molecules. Spanning Tree-based Graph Generation (STGG) is a promising approach to ensure the generation of valid molecules, outperforming state-of-the-art SMILES and graph diffusion models for unconditional generation. In the real world, we want to be able to generate molecules conditional on one or multiple desired properties rather than unconditionally. Thus, in this work, we extend STGG to multi-property-conditional generation. Our approach, STGG+, incorporates a modern Transformer architecture, random masking of properties during training (enabling conditioning on any subset of properties and classifier-free guidance), an auxiliary property-prediction loss (allowing the model to self-criticize molecules and select the best ones), and other improvements. We show that STGG+ achieves state-of-the-art performance on in-distribution and out-of-distribution conditional generation, and reward maximization.",
    "authors": [
        "Alexia Jolicoeur-Martineau",
        "A. Baratin",
        "Kisoo Kwon",
        "Boris Knyazev",
        "Yan Zhang"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work extends Spanning Tree-based Graph Generation to multi-property-conditional generation, and shows that STGG+ achieves state-of-the-art performance on in-distribution and out-of-distribution conditional generation, and reward maximization."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}