{
    "acronym": "229578bcf5cbc33e502e41d3001aedfc548ace74",
    "title": "EmoKbGAN: Emotion controlled response generation using Generative Adversarial Network for knowledge grounded conversation",
    "seed_ids": [
        "gpt2",
        "36c50e6638dddc8324eef9bfa064bfcab80cbef4",
        "15704cdfe55ddd375e7fec9e71cba9956a73972e",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "229578bcf5cbc33e502e41d3001aedfc548ace74",
    "abstract": "Neural open-domain dialogue systems often fail to engage humans in long-term interactions on popular topics such as sports, politics, fashion, and entertainment. However, to have more socially engaging conversations, we need to formulate strategies that consider emotion, relevant-facts, and user behaviour in multi-turn conversations. Establishing such engaging conversations using maximum likelihood estimation (MLE) based approaches often suffer from the problem of exposure bias. Since MLE loss evaluates the sentences at the word level, we focus on sentence-level judgment for our training purposes. In this paper, we present a method named EmoKbGAN for automatic response generation that makes use of the Generative Adversarial Network (GAN) in multiple-discriminator settings involving joint minimization of the losses provided by each attribute specific discriminator model (knowledge and emotion discriminator). Experimental results on two bechmark datasets i.e the Topical Chat and Document Grounded Conversation dataset yield that our proposed method significantly improves the overall performance over the baseline models in terms of both automated and human evaluation metrics, asserting that the model can generate fluent sentences with better control over emotion and content quality.",
    "authors": [
        "Deeksha Varshney",
        "Asif Ekbal",
        "Mrigank Tiwari",
        "Ganesh Nagaraja"
    ],
    "venue": "PLoS ONE",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper presents a method named EmoKbGAN for automatic response generation that makes use of the Generative Adversarial Network (GAN) in multiple-discriminator settings involving joint minimization of the losses provided by each attribute specific discriminator model (knowledge and emotion discriminator)."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}