{
    "acronym": "22cc1f1f8663a1d609e1892db9af4414024e5af8",
    "title": "Optimizing Large Language Models to Expedite the Development of Smart Contracts",
    "seed_ids": [
        "gpt2",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "22cc1f1f8663a1d609e1892db9af4414024e5af8",
    "abstract": "Programming has always been at the heart of technological innovation in the 21st century. With the advent of blockchain technologies and the proliferation of web3 paradigms of decentralised applications, smart contracts have been very instrumental in enabling developers to build applications that reside on decentralised blockchains. Despite the huge interest and potential of smart contracts, there is still a significant knowledge and skill gap that developers need to cross in order to build web3 applications. In light of this, we introduce MazzumaGPT, a large language model that has been optimised to generate smart contract code and aid developers to scaffold development and improve productivity. As part of this research, we outline the optimisation and fine-tuning parameters, evaluate the model's performance on functional correctness and address the limitations and broader impacts of our research.",
    "authors": [
        "Nii Osae Osae Dade",
        "Margaret Lartey-Quaye",
        "Emmanuel Teye-Kofi Odonkor",
        "Paul Ammah"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "MazzumaGPT is introduced, a large language model that has been optimised to generate smart contract code and aid developers to scaffold development and improve productivity and address the limitations and broader impacts of the research."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}