{
    "acronym": "231e768f0cd280faa0f725bb353262cb4fed08d1",
    "title": "Hierarchical Transformers Are More Efficient Language Models",
    "seed_ids": [
        "funneltransformer",
        "sparsetransformer",
        "reformer",
        "routingtransformer",
        "transformerxl",
        "axialattn",
        "5d032bd2632b6f5847767f39ce247098c6bbc563",
        "1a883522f3c0051d70be1f8cbdb8989a77395006",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "64a29bee2e1ad29547d590a3cc26274f4c537145",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "f2fc9ef411846dd577c26225ce93f50bb1fa760b",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "2e14e84ccec924ed770b58108ad1d9de6f0ca295",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06",
        "f4238bd2385a52413ccbacfd9e409a650235bd13",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "231e768f0cd280faa0f725bb353262cb4fed08d1",
    "abstract": "Transformer models yield impressive results on many NLP and sequence modeling tasks. Remarkably, Transformers can handle long sequences which allows them to produce long coherent outputs: full paragraphs produced by GPT-3 or well-structured images produced by DALL-E. These large language models are impressive but also very inefficient and costly, which limits their applications and accessibility. We postulate that having an explicit hierarchical architecture is the key to Transformers that efficiently handle long sequences. To verify this claim, we first study different ways to downsample and upsample activations in Transformers so as to make them hierarchical. We use the best performing upsampling and downsampling layers to create Hourglass - a hierarchical Transformer language model. Hourglass improves upon the Transformer baseline given the same amount of computation and can yield the same results as Transformers more efficiently. In particular, Hourglass sets new state-of-the-art for Transformer models on the ImageNet32 generation task and improves language modeling efficiency on the widely studied enwik8 benchmark.",
    "authors": [
        "Piotr Nawrot",
        "Szymon Tworkowski",
        "Michał Tyrolski",
        "Lukasz Kaiser",
        "Yuhuai Wu",
        "Christian Szegedy",
        "H. Michalewski"
    ],
    "venue": "NAACL-HLT",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Hourglass is created - a hierarchical Transformer language model that improves language modeling efficiency on the widely studied enwik8 benchmark and sets new state-of-the-art for Transformer models on the ImageNet32 generation task."
    },
    "citationCount": 40,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}