{
    "acronym": "232734a65f0d903cdd77b9dfdddb1eded79eff18",
    "title": "Sparse Factorization of Large Square Matrices",
    "seed_ids": [
        "sparsetransformer",
        "1a883522f3c0051d70be1f8cbdb8989a77395006",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "6fa1cfc4f97f03a8485692418c7aa1a06c574a85",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f6390beca54411b06f3bde424fb983a451789733"
    ],
    "s2id": "232734a65f0d903cdd77b9dfdddb1eded79eff18",
    "abstract": "Square matrices appear in many machine learning problems and models. Optimization over a large square matrix is expensive in memory and in time. Therefore an economic approximation is needed. Conventional approximation approaches factorize the square matrix into a number matrices of much lower ranks. However, the low-rank constraint is a performance bottleneck if the approximated matrix is intrinsically high-rank or close to full rank. In this paper, we propose to approximate a large square matrix with a product of sparse full-rank matrices. In the approximation, our method needs only $N(\\log N)^2$ non-zero numbers for an $N\\times N$ full matrix. We present both non-parametric and parametric ways to find the factorization. In the former, we learn the factorizing matrices directly, and in the latter, we train neural networks to map input data to the non-zero matrix entries. The sparse factorization method is tested for a variety of synthetic and real-world square matrices. The experimental results demonstrate that our method gives a better approximation when the approximated matrix is sparse and high-rank. Based on this finding, we use our parametric method as a scalable attention architecture that performs strongly in learning tasks for long sequential data and defeats Transformer and its several variants.",
    "authors": [
        "Ruslan Khalitov",
        "Tong Yu",
        "Lei Cheng",
        "Zhirong Yang"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes to approximate a large square matrix with a product of sparse full-rank matrices with a parametric method that performs strongly in learning tasks for long sequential data and defeats Transformer and its several variants."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}