{
    "acronym": "232e821d64dc251eaba228392bf77e02bc7a8997",
    "title": "A Comprehensive Survey on Evaluating Large Language Model Applications in the Medical Industry",
    "seed_ids": [
        "gpt",
        "b842b83a7ff5dff8e3b83915d8c15423b6085728",
        "6783b17fe4328f48403f57009a73f784de09f645",
        "16d83e930a4dab2d49f5d276838ddce79df3f787",
        "8a9e7290d403dd2098e5ce80d6338ae03071cf85",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "bfb33894af77576cc6975b25f93a247633119b9f",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "274f903041b1a830b37f57929d837c1706e94ec7",
        "25c7fa62d85c5d564f0b35471456e4ad4739c582",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "232e821d64dc251eaba228392bf77e02bc7a8997",
    "abstract": "Since the inception of the Transformer architecture in 2017, Large Language Models (LLMs) such as GPT and BERT have evolved significantly, impacting various industries with their advanced capabilities in language understanding and generation. These models have shown potential to transform the medical field, highlighting the necessity for specialized evaluation frameworks to ensure their effective and ethical deployment. This comprehensive survey delineates the extensive application and requisite evaluation of LLMs within healthcare, emphasizing the critical need for empirical validation to fully exploit their capabilities in enhancing healthcare outcomes. Our survey is structured to provide an in-depth analysis of LLM applications across clinical settings, medical text data processing, research, education, and public health awareness. We begin by exploring the roles of LLMs in various medical applications, detailing their evaluation based on performance in tasks such as clinical diagnosis, medical text data processing, information retrieval, data analysis, and educational content generation. The subsequent sections offer a comprehensive discussion on the evaluation methods and metrics employed, including models, evaluators, and comparative experiments. We further examine the benchmarks and datasets utilized in these evaluations, providing a categorized description of benchmarks for tasks like question answering, summarization, information extraction, bioinformatics, information retrieval and general comprehensive benchmarks. This structure ensures a thorough understanding of how LLMs are assessed for their effectiveness, accuracy, usability, and ethical alignment in the medical domain. ...",
    "authors": [
        "Yining Huang",
        "Keke Tang",
        "Meilian Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This comprehensive survey delineates the extensive application and requisite evaluation of LLMs within healthcare, emphasizing the critical need for empirical validation to fully exploit their capabilities in enhancing healthcare outcomes."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}