{
    "acronym": "23396fc54ccf8395dfca3663fb4ecac3966af996",
    "title": "CDCCA-RPPGFormer: Transformer-Like Network Based on 3D-CDC-ST and ECA for Remote Heart Rate Measurement",
    "seed_ids": [
        "metaformer"
    ],
    "s2id": "23396fc54ccf8395dfca3663fb4ecac3966af996",
    "abstract": "Remote heart rate measurement methods based on remote photoplethysmography (rPPG) signals can be divided into traditional methods, convolutional neural network (CNN) based methods, and visual transformer based methods. However, the majority of visual transformer based methods are based on multihead self-attention mechanism whose computational complexity grows quadratically with the increase in video resolution and time, impeding their deployment and application on terminal devices, particularly mobile devices. To address this issue, this paper proposes a transformer-like network named CDCCA-RPPGFormer for remote heart rate measurement. The combination of 3D spatio-temporal central difference convolution (3D-CDC-ST) and 3D efficient channel attention (ECA) convolution is used to replace the multi-head attention mechanism in the traditional transformer, which can effectively extract the rPPG signal features, focus the model on useful features, reduce noise interference, and reduce computational complexity. Afterward, the model is given the ability to accurately recover the rPPG signal by utilizing precise supervision from both the time and frequency domains. Our model achieved the lowest MAE, RMSE, and highest Pearson’s correlation coefficient (r) in both experiments on the UBFC-rPPG and PURE datasets. Compared to the CDCA-rPPGNet method using the same preprocessing method, the CDCCA-RPPGFormer method decreases MAE and RMSE by 13.3% and 8.7% on the UBFC dataset and by 10.9% and 26.7% on the PURE dataset. Meanwhile, the CDCCA-RPPGFormer method reduces MAE and RMSE on the PURE dataset by 62.7% and 62.3%, respectively, compared to the visual transformer based Physformer method. These data fully demonstrate the effectiveness of the proposed method.",
    "authors": [
        "Xiaolin Ma",
        "Zhaosen Wang",
        "Hailan Kuang",
        "Xinhua Liu"
    ],
    "venue": "2023 IEEE 3rd International Conference on Information Technology, Big Data and Artificial Intelligence (ICIBA)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The combination of 3D spatio-temporal central difference convolution (3D-CDC-ST) and 3D efficient channel attention (ECA) convolution is used to replace the multi-head attention mechanism in the traditional transformer, which can effectively extract the rPPG signal features, focus the model on useful features, reduce noise interference, and reduce computational complexity."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}