{
    "acronym": "2382a935381f8dfc1fac533b91df6f27d568c2ff",
    "title": "Deep Learning for Genomics: A Concise Overview",
    "seed_ids": [
        "transformerxl",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2382a935381f8dfc1fac533b91df6f27d568c2ff",
    "abstract": "Advancements in genomic research such as high-throughput sequencing techniques have driven modern genomic studies into \"big data\" disciplines. This data explosion is constantly challenging conventional methods used in genomics. In parallel with the urgent demand for robust algorithms, deep learning has succeeded in a variety of fields such as vision, speech, and text processing. Yet genomics entails unique challenges to deep learning since we are expecting from deep learning a superhuman intelligence that explores beyond our knowledge to interpret the genome. A powerful deep learning model should rely on insightful utilization of task-specific knowledge. In this paper, we briefly discuss the strengths of different deep learning models from a genomic perspective so as to fit each particular task with a proper deep architecture, and remark on practical considerations of developing modern deep learning architectures for genomics. We also provide a concise review of deep learning applications in various aspects of genomic research, as well as pointing out potential opportunities and obstacles for future genomics applications.",
    "authors": [
        "Tianwei Yue",
        "Haohan Wang"
    ],
    "venue": "arXiv.org",
    "year": 2018,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The strengths of different deep learning models from a genomic perspective are discussed, so as to fit each particular task with a proper deep architecture, and practical considerations of developing modern deep learning architectures for genomics are remarked on."
    },
    "citationCount": 86,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}