{
    "acronym": "23bf132afe99886f6c4cc8ed4a99f22bc4151663",
    "title": "Contrastive Prompts Improve Disentanglement in Text-to-Image Diffusion Models",
    "seed_ids": [
        "classfreediffu",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "3ff7153fd6bd47d08084c7f50f8fd70026c126e7",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "82482585e94192b4e9913727e461f89cd08e9725",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "23bf132afe99886f6c4cc8ed4a99f22bc4151663",
    "abstract": "Text-to-image diffusion models have achieved remarkable performance in image synthesis, while the text interface does not always provide fine-grained control over certain image factors. For instance, changing a single token in the text can have unintended effects on the image. This paper shows a simple modification of classifier-free guidance can help disentangle image factors in text-to-image models. The key idea of our method, Contrastive Guidance, is to characterize an intended factor with two prompts that differ in minimal tokens: the positive prompt describes the image to be synthesized, and the baseline prompt serves as a\"baseline\"that disentangles other factors. Contrastive Guidance is a general method we illustrate whose benefits in three scenarios: (1) to guide domain-specific diffusion models trained on an object class, (2) to gain continuous, rig-like controls for text-to-image generation, and (3) to improve the performance of zero-shot image editors.",
    "authors": [
        "C. Wu",
        "Fernando De la Torre"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A simple modification of classifier-free guidance can help disentangle image factors in text-to-image models with benefits to guide domain-specific diffusion models trained on an object class, to gain continuous, rig-like controls for text-to-image generation, and to improve the performance of zero-shot image editors."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}