{
    "acronym": "23e04389f8728a5736382d3662341a1a2a25e171",
    "title": "Predictive Coding or Just Feature Discovery? An Alternative Account of Why Language Models Fit Brain Data",
    "seed_ids": [
        "gpt2",
        "89711a7e91ad81874a5a0b1c3359bb67b27c0578",
        "5648f619ab888f6400c1063bff15a98de89f115b",
        "a022bda79947d1f656a1164003c1b3ae9a843df9",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "23e04389f8728a5736382d3662341a1a2a25e171",
    "abstract": "Abstract Many recent studies have shown that representations drawn from neural network language models are extremely effective at predicting brain responses to natural language. But why do these models work so well? One proposed explanation is that language models and brains are similar because they have the same objective: to predict upcoming words before they are perceived. This explanation is attractive because it lends support to the popular theory of predictive coding. We provide several analyses that cast doubt on this claim. First, we show that the ability to predict future words does not uniquely (or even best) explain why some representations are a better match to the brain than others. Second, we show that within a language model, representations that are best at predicting future words are strictly worse brain models than other representations. Finally, we argue in favor of an alternative explanation for the success of language models in neuroscience: These models are effective at predicting brain responses because they generally capture a wide variety of linguistic phenomena.",
    "authors": [
        "Richard Antonello",
        "Alexander G. Huth"
    ],
    "venue": "Neurobiology of Language",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work argues in favor of an alternative explanation for the success of language models in neuroscience: these models are effective at predicting brain responses because they generally capture a wide variety of linguistic phenomena."
    },
    "citationCount": 31,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}