{
    "acronym": "241110426ec211c3e6c8faa2af6a92aa5cd6d477",
    "title": "Orchid: Flexible and Data-Dependent Convolution for Sequence Modeling",
    "seed_ids": [
        "bert",
        "hyena",
        "m2",
        "a01e1138600499f65462ed3d51c3e76af1aad18c",
        "d53fe76bd2795a19ddf52d012917782f6f6f2c1e",
        "5c104f905fcacf390270f619f232a2ba4eb873f2",
        "f393aff1593c2d370ec0ae004910d18e40524967",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "a128b1c47e6842605fb95bceae930d2135fc38fc",
        "240300b1da360f22bf0b82c6817eacebba6deed4",
        "eaef083b9d661f42cc0d89d9d8156218f33a91d9",
        "8326dba15f6b8ee6e43c23eea3265a05e59e8135",
        "90b21dbad8969b74d704eed15a3d98722a88e464",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "5f895e84c1fea75de07b4f90da518273c2e57291",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "1a883522f3c0051d70be1f8cbdb8989a77395006",
        "e32a12b14e212506115cc6804667b3d8297917e1",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "1d5c8c6e5a774d2fef8d92bd28670a6345a97f7a",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "2a218786f4615b82389f78472e7ff22e6ce57490",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "34a4e6818d680875ff0bef9a76de0376118446d1",
        "2cf3bd0cc1382f35384e259d99e4f9744eeaed28"
    ],
    "s2id": "241110426ec211c3e6c8faa2af6a92aa5cd6d477",
    "abstract": "In the rapidly evolving field of deep learning, the demand for models that are both expressive and computationally efficient has never been more critical. This paper introduces Orchid, a novel architecture designed to address the quadratic complexity of traditional attention mechanisms without compromising the ability to capture long-range dependencies and in-context learning. At the core of this architecture lies a new data-dependent global convolution layer, which contextually adapts its kernel conditioned on input sequence using a dedicated conditioning neural network. We design two simple conditioning networks that maintain shift equivariance in our data-dependent convolution operation. The dynamic nature of the proposed convolution kernel grants Orchid high expressivity while maintaining quasilinear scalability for long sequences. We evaluate the proposed model across multiple domains, including language modeling and image classification, to highlight its performance and generality. Our experiments demonstrate that this architecture not only outperforms traditional attention-based architectures such as BERT and Vision Transformers with smaller model sizes, but also extends the feasible sequence length beyond the limitations of the dense attention layers. This achievement represents a significant step towards more efficient and scalable deep learning models for sequence modeling.",
    "authors": [
        "Mahdi Karami",
        "Ali Ghodsi"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces Orchid, a novel architecture designed to address the quadratic complexity of traditional attention mechanisms without compromising the ability to capture long-range dependencies and in-context learning."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}