{
    "acronym": "241ce066dfe79b074912a423213310c811b6abe4",
    "title": "Multiple Instance Verification",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "241ce066dfe79b074912a423213310c811b6abe4",
    "abstract": "We explore multiple-instance verification, a problem setting where a query instance is verified against a bag of target instances with heterogeneous, unknown relevancy. We show that naive adaptations of attention-based multiple instance learning (MIL) methods and standard verification methods like Siamese neural networks are unsuitable for this setting: directly combining state-of-the-art (SOTA) MIL methods and Siamese networks is shown to be no better, and sometimes significantly worse, than a simple baseline model. Postulating that this may be caused by the failure of the representation of the target bag to incorporate the query instance, we introduce a new pooling approach named ``cross-attention pooling'' (CAP). Under the CAP framework, we propose two novel attention functions to address the challenge of distinguishing between highly similar instances in a target bag. Through empirical studies on three different verification tasks, we demonstrate that CAP outperforms adaptations of SOTA MIL methods and the baseline by substantial margins, in terms of both classification accuracy and quality of the explanations provided for the classifications. Ablation studies confirm the superior ability of the new attention functions to identify key instances.",
    "authors": [
        "Xin Xu",
        "Eibe Frank",
        "G. Holmes"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Under the CAP framework, a new pooling approach named ``cross-attention pooling'' (CAP) is introduced, which proposes two novel attention functions to address the challenge of distinguishing between highly similar instances in a target bag."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}