{
    "acronym": "242dbbef9e7f624525c57645f193e0b13a90ad44",
    "title": "When Foundation Model Meets Federated Learning: Motivations, Challenges, and Future Directions",
    "seed_ids": [
        "gpt2",
        "7011bf9aa7e68fabaa1df498da6d2dd8a950f037",
        "0e3d1457a66e442fae46c8f96886dc76aef3b085",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "242dbbef9e7f624525c57645f193e0b13a90ad44",
    "abstract": "The intersection of the Foundation Model (FM) and Federated Learning (FL) provides mutual benefits, presents a unique opportunity to unlock new possibilities in AI research, and address critical challenges in AI and real-world applications. FL expands the availability of data for FMs and enables computation sharing, distributing the training process and reducing the burden on FL participants. It promotes collaborative FM development, democratizing the process and fostering inclusivity and innovation. On the other hand, FM, with its enormous size, pre-trained knowledge, and exceptional performance, serves as a robust starting point for FL, facilitating faster convergence and better performance under non-iid data. Additionally, leveraging FM to generate synthetic data enriches data diversity, reduces overfitting, and preserves privacy. By examining the interplay between FL and FM, this paper aims to deepen the understanding of their synergistic relationship, highlighting the motivations, challenges, and future directions. Through an exploration of the challenges faced by FL and FM individually and their interconnections, we aim to inspire future research directions that can further enhance both fields, driving advancements and propelling the development of privacy-preserving and scalable AI systems.",
    "authors": [
        "Weiming Zhuang",
        "Chen Chen",
        "Lingjuan Lyu"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Through an exploration of the challenges faced by FL and FM individually and their interconnections, this paper aims to inspire future research directions that can further enhance both fields, driving advancements and propelling the development of privacy-preserving and scalable AI systems."
    },
    "citationCount": 44,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}