{
    "acronym": "247a05b3b10228b1fc8da75dd03b9329cc0a8cf0",
    "title": "Novelty: Optimizing StreamingLLM for Novel Plot Generation",
    "seed_ids": [
        "streamingllm",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "6151ee4af6a3fe78f2df7c605598cd9e02b23c5b"
    ],
    "s2id": "247a05b3b10228b1fc8da75dd03b9329cc0a8cf0",
    "abstract": "Large Language Models (LLMs) struggle with the task of long-form creative writing both technically, by exhibiting undesired behavior when the context length exceeds its training sequence length, and creatively, by producing bland plots that do not develop a coherent or engaging story. While very large models with long context lengths such as GPT-4 have made strides in this area, we aim to optimize for creativity and diversity of natural language generation with computational constraints and a small underlying context window of 4k tokens. We introduce the novel approach of treating novel-writing as a streaming \"question-answer\" chapter-generating conversation between user and assistant. We produce perceptible improvements in model creativity by building a rich novel plot generation model through fine-tuning Vicuna-7b with StreamingLLM on chapter-by-chapter detailed plot summaries. We also demonstrate that different training data formats and prompt engineering at inference time can produce greater diversity of output and help prevent repetitive rabbit-holing.",
    "authors": [
        "Joyce Chen",
        "Megan Mou"
    ],
    "venue": "",
    "year": null,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The novel approach of treating novel-writing as a streaming \"question-answer\" chapter-generating conversation between user and assistant is introduced and perceptible improvements in model creativity are produced by building a rich novel plot generation model through fine-tuning Vicuna-7b with StreamingLLM on chapter-by-chapter detailed plot summaries."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}