{
    "acronym": "24927e1986ade54b4150e78526eac2761192db4c",
    "title": "Structural Extensions of Basis Pursuit: Guarantees on Adversarial Robustness",
    "seed_ids": [
        "lineartransformer",
        "6f68e1bb253925d8431588555d3010419f322e04"
    ],
    "s2id": "24927e1986ade54b4150e78526eac2761192db4c",
    "abstract": "While deep neural networks are sensitive to adversarial noise, sparse coding using the Basis Pursuit (BP) method is robust against such attacks, including its multi-layer extensions. We prove that the stability theorem of BP holds upon the following generalizations: (i) the regularization procedure can be separated into disjoint groups with different weights, (ii) neurons or full layers may form groups, and (iii) the regularizer takes various generalized forms of the $\\ell_1$ norm. This result provides the proof for the architectural generalizations of Cazenavette et al. (2021), including (iv) an approximation of the complete architecture as a shallow sparse coding network. Due to this approximation, we settled to experimenting with shallow networks and studied their robustness against the Iterative Fast Gradient Sign Method on a synthetic dataset and MNIST. We introduce classification based on the $\\ell_2$ norms of the groups and show numerically that it can be accurate and offers considerable speedups. In this family, linear transformer shows the best performance. Based on the theoretical results and the numerical simulations, we highlight numerical matters that may improve performance further.",
    "authors": [
        "D. Szeghy",
        "Mahmoud Aslan",
        "Á. Fóthi",
        "Balázs Mészáros",
        "Z. '. Milacski",
        "András Lőrincz"
    ],
    "venue": "Delta",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is proved that the stability theorem of BP holds upon the following generalizations: the regularization procedure can be separated into disjoint groups with different weights, neurons or full layers may form groups, and the regularizer takes various generalized forms of the $\\ell_1$ norm."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}