{
    "acronym": "24b951275a7a42ef36aca8352caaf6f4cd6238d2",
    "title": "HiStruct+: Improving Extractive Text Summarization with Hierarchical Structure Information",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0"
    ],
    "s2id": "24b951275a7a42ef36aca8352caaf6f4cd6238d2",
    "abstract": "Transformer-based language models usually treat texts as linear sequences. However, most texts also have an inherent hierarchical structure, i.e., parts of a text can be identified using their position in this hierarchy. In addition, section titles usually indicate the common topic of their respective sentences. We propose a novel approach to formulate, extract, encode and inject hierarchical structure information explicitly into an extractive summarization model based on a pre-trained, encoder-only Transformer language model (HiStruct+ model), which improves SOTA ROUGEs for extractive summarization on PubMed and arXiv substantially. Using various experimental settings on three datasets (i.e., CNN/DailyMail, PubMed and arXiv), our HiStruct+ model outperforms a strong baseline collectively, which differs from our model only in that the hierarchical structure information is not injected. It is also observed that the more conspicuous hierarchical structure the dataset has, the larger improvements our method gains. The ablation study demonstrates that the hierarchical position information is the main contributor to our model’s SOTA performance.",
    "authors": [
        "Qianqian Ruan",
        "Malte Ostendorff",
        "Georg Rehm"
    ],
    "venue": "Findings",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel approach to formulate, extract, encode and inject hierarchical structure information explicitly into an extractive summarization model based on a pre-trained, encoder-only Transformer language model (HiStruct+ model), which improves SOTA ROUGEs for extractives summarization on PubMed and arXiv substantially."
    },
    "citationCount": 41,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}