{
    "acronym": "24bed5e91f2ac7d97584e04c25c860f3ec2b1299",
    "title": "Memory Efficient Neural Processes via Constant Memory Attention Block",
    "seed_ids": [
        "perceiverio",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "53c3940f35b8b45d55ed49056282e1961954513d",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "67ee20536c30a225b86902af2f091e28e5e19b40"
    ],
    "s2id": "24bed5e91f2ac7d97584e04c25c860f3ec2b1299",
    "abstract": "Neural Processes (NPs) are popular meta-learning methods for efficiently modelling predictive uncertainty. Recent state-of-the-art methods, however, leverage expensive attention mechanisms, limiting their applications, particularly in low-resource settings. In this work, we propose Constant Memory Attentive Neural Processes (CMANPs), an NP variant that only requires constant memory. To do so, we first propose an efficient update operation for Cross Attention. Leveraging the update operation, we propose Constant Memory Attention Block (CMAB), a novel attention block that (i) is permutation invariant, (ii) computes its output in constant memory, and (iii) performs constant computation updates. Finally, building on CMAB, we detail Constant Memory Attentive Neural Processes. Empirically, we show CMANPs achieve state-of-the-art results on popular NP benchmarks while being significantly more memory efficient than prior methods.",
    "authors": [
        "Leo Feng",
        "Frederick Tung",
        "Hossein Hajimirsadeghi",
        "Y. Bengio",
        "M. O. Ahmed"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes Constant Memory Attentive Neural Processes (CMANPs), an NP variant that only requires constant memory that achieves state-of-the-art results on popular NP benchmarks while being significantly more memory efficient than prior methods."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}