{
    "acronym": "24ec60734b3fcad2661fd3c18ec933430058c2f7",
    "title": "HLDC: Hindi Legal Documents Corpus",
    "seed_ids": [
        "neurallegal",
        "7eb44db2322570d641548c54420dee8f7756dbab",
        "61a5ae33fc34efcdbc710004554ec57e607ce75e"
    ],
    "s2id": "24ec60734b3fcad2661fd3c18ec933430058c2f7",
    "abstract": "Many populous countries including India are burdened with a considerable backlog of legal cases. Development of automated systems that could process legal documents and augment legal practitioners can mitigate this. However, there is a dearth of high-quality corpora that is needed to develop such data-driven systems. The problem gets even more pronounced in the case of low resource languages such as Hindi. In this resource paper, we introduce the Hindi Legal Documents Corpus (HLDC), a corpus of more than 900K legal documents in Hindi. Documents are cleaned and structured to enable the development of downstream applications. Further, as a use-case for the corpus, we introduce the task of bail prediction. We experiment with a battery of models and propose a Multi-Task Learning (MTL) based model for the same. MTL models use summarization as an auxiliary task along with bail prediction as the main task. Experiments with different models are indicative of the need for further research in this area.",
    "authors": [
        "Arnav Kapoor",
        "Mudit Dhawan",
        "Anmol Goel",
        "T. Arjun",
        "Akshala Bhatnagar",
        "Vibhu Agrawal",
        "Amul Agrawal",
        "Arnab Bhattacharya",
        "P. Kumaraguru",
        "Ashutosh Modi"
    ],
    "venue": "Findings",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Hindi Legal Documents Corpus (HLDC), a corpus of more than 900K legal documents in Hindi is introduced and the task of bail prediction is introduced, as a use-case for the corpus, and a Multi-Task Learning (MTL) based model is proposed."
    },
    "citationCount": 11,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}