{
    "acronym": "24f2bd130a9e7148fbd12ba6be5aa26e5cbd4a62",
    "title": "Rethinking the Exploitation of Monolingual Data for Low-Resource Neural Machine Translation",
    "seed_ids": [
        "gpt2",
        "bert",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "24f2bd130a9e7148fbd12ba6be5aa26e5cbd4a62",
    "abstract": "The utilization of monolingual data has been shown to be a promising strategy for addressing low-resource machine translation problems. Previous studies have demonstrated the effectiveness of techniques such as back-translation and self-supervised objectives, including masked language modeling, causal language modeling, and denoise autoencoding, in improving the performance of machine translation models. However, the manner in which these methods contribute to the success of machine translation tasks and how they can be effectively combined remains an under-researched area. In this study, we carry out a systematic investigation of the effects of these techniques on linguistic properties through the use of probing tasks, including source language comprehension, bilingual word alignment, and translation fluency. We further evaluate the impact of pre-training, back-translation, and multi-task learning on bitexts of varying sizes. Our findings inform the design of more effective pipelines for leveraging monolingual data in extremely low-resource and low-resource machine translation tasks. Experiment results show consistent performance gains in seven translation directions, which provide further support for our conclusions and understanding of the role of monolingual data in machine translation.",
    "authors": [
        "Jianhui Pang",
        "Derek F. Wong",
        "Dayiheng Liu",
        "Jun Xie",
        "Baosong Yang",
        "Yu Wan",
        "Lidia S. Chao"
    ],
    "venue": "International Conference on Computational Logic",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study carries out a systematic investigation of the effects of techniques such as back-translation and self-supervised objectives on linguistic properties through the use of probing tasks, including source language comprehension, bilingual word alignment, and translation fluency on bitexts of varying sizes."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}