{
    "acronym": "250aed89693f6049d3a9a0b65a9d59b3f4c8ffbe",
    "title": "Music Generation based on Generative Adversarial Networks with Transformer",
    "seed_ids": [
        "transformerxl",
        "f07c5c540233b22f0ca154c80c713e2aed3c9606"
    ],
    "s2id": "250aed89693f6049d3a9a0b65a9d59b3f4c8ffbe",
    "abstract": "Autoregressive models based on Transformers have become the prevailing approach for generating music compositions that exhibit comprehensive musical structure. These models are typically trained by minimizing the negative log-likelihood (NLL) of the observed sequence in an autoregressive manner. However, when generating long sequences, the quality of samples from these models tends to significantly deteriorate due to exposure bias. To address this issue, we leverage classifiers trained to differentiate between real and sampled sequences to identify these failures. This observation motivates our exploration of adversarial losses as a complement to the NLL objective. We employ a pre-trained Span-BERT model as the discriminator in the Generative Adversarial Network (GAN) framework, which enhances training stability in our experiments. To optimize discrete sequences within the GAN framework, we utilize the Gumbel-Softmax trick to obtain a differentiable approximation of the sampling process. Additionally, we partition the sequences into smaller chunks to ensure that memory constraints are met. Through human evaluations and the introduction of a novel discriminative metric, we demonstrate that our approach outperforms a baseline model trained solely on likelihood maximization.",
    "authors": [
        "Ziyi Jiang",
        "Ruoxue Wu",
        "Zhenghan Chen",
        "Xiaoxuan Liang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work employs a pre-trained Span-BERT model as the discriminator in the Generative Adversarial Network (GAN) framework and utilizes the Gumbel-Softmax trick to obtain a differentiable approximation of the sampling process."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}