{
    "acronym": "253f8cf4af536f74dacfe6d4cdfb8ee0a14f0d1b",
    "title": "Let's Speak Trajectories: A Vision to Use NLP Models for Trajectory Analysis Tasks",
    "seed_ids": [
        "bert",
        "2c0b112d66d70487971bc96ef8c927464af8c8a8",
        "75352cc69a29bd5fc411e0e79737cb96b6309161",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "253f8cf4af536f74dacfe6d4cdfb8ee0a14f0d1b",
    "abstract": "The availability of trajectory data combined with various real-life practical applications has sparked the interest of the research community to design a plethora of algorithms for various trajectory analysis techniques. However, there is an apparent lack of full-fledged systems that provide the infrastructure support for trajectory analysis techniques, which hinders the applicability of most of the designed algorithms. Inspired by the tremendous success of the Bidirectional Encoder Representations from Transformers (BERT) deep learning model in solving various Natural Language Processing tasks, our vision is to have a BERT-like system for trajectory analysis tasks. We envision that in a few years, we will have such system where no one needs to worry again about each specific trajectory analysis operation. Whether it is trajectory imputation, similarity, clustering, or whatever, it would be one system that researchers, developers, and practitioners can deploy to get high accuracy for their trajectory operations. Our vision stands on a solid ground that trajectories in a space are highly analogous to statements in a language. We outline the challenges and the road to our vision. Exploratory results confirm the promise and possibility of our vision.",
    "authors": [
        "Mashaal Musleh",
        "M. Mokbel"
    ],
    "venue": "ACM Trans. Spatial Algorithms Syst.",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The vision is to have a BERT-like system for trajectory analysis tasks where no one needs to worry again about each specific trajectory analysis operation, and whether it is trajectory imputation, similarity, clustering, or whatever, it would be one system that researchers, developers, and practitioners can deploy to get high accuracy for their trajectory operations."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}