{
    "acronym": "255c526f78bbfec35d4ed73b6dd8eacd9ef2c0b3",
    "title": "RankNAS: Efficient Neural Architecture Search by Pairwise Ranking",
    "seed_ids": [
        "transformerxl",
        "ef8854a62e05c8e741894166689a9cd8352a1df0",
        "ef8d788a904ed66bd8e30ffa69bc3ea1fe57dda7",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "16c844fd4d97f3c6eb38b0d6527c87d184efedc3"
    ],
    "s2id": "255c526f78bbfec35d4ed73b6dd8eacd9ef2c0b3",
    "abstract": "This paper addresses the efficiency challenge of Neural Architecture Search (NAS) by formulating the task as a ranking problem. Previous methods require numerous training examples to estimate the accurate performance of architectures, although the actual goal is to find the distinction between “good” and “bad” candidates. Here we do not resort to performance predictors. Instead, we propose a performance ranking method (RankNAS) via pairwise ranking. It enables efficient architecture search using much fewer training examples. Moreover, we develop an architecture selection method to prune the search space and concentrate on more promising candidates. Extensive experiments on machine translation and language modeling tasks show that RankNAS can design high-performance architectures while being orders of magnitude faster than state-of-the-art NAS systems.",
    "authors": [
        "Chi Hu",
        "Chenglong Wang",
        "Xiangnan Ma",
        "Xia Meng",
        "Yinqiao Li",
        "Tong Xiao",
        "Jingbo Zhu",
        "Changliang Li"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a performance ranking method (RankNAS) via pairwise ranking that enables efficient architecture search using much fewer training examples and develops an architecture selection method to prune the search space and concentrate on more promising candidates."
    },
    "citationCount": 11,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}