{
    "acronym": "256623ff025f36d343588bcd0b966c1fd26afcf8",
    "title": "Looking for ELMo's friends: Sentence-Level Pretraining Beyond Language Modeling",
    "seed_ids": [
        "gpt"
    ],
    "s2id": "256623ff025f36d343588bcd0b966c1fd26afcf8",
    "abstract": "Work on the problem of contextualized word representation---the development of reusable neural network components for sentence understanding---has recently seen a surge of progress centered on the unsupervised pretraining task of language modeling with methods like ELMo. This paper contributes the first large-scale systematic study comparing different pretraining tasks in this context, both as complements to language modeling and as potential alternatives. The primary results of the study support the use of language modeling as a pretraining task and set a new state of the art among comparable models using multitask learning with language models. However, a closer look at these results reveals worryingly strong baselines and strikingly varied results across target tasks, suggesting that the widely-used paradigm of pretraining and freezing sentence encoders may not be an ideal platform for further work.",
    "authors": [
        "Samuel R. Bowman",
        "Ellie Pavlick",
        "Edouard Grave",
        "Benjamin Van Durme",
        "Alex Wang",
        "Jan Hula",
        "Patrick Xia",
        "R. Pappagari",
        "R. Thomas McCoy",
        "Roma Patel",
        "Najoung Kim",
        "Ian Tenney",
        "Yinghui Huang",
        "Katherin Yu",
        "Shuning Jin",
        "Berlin Chen"
    ],
    "venue": "arXiv.org",
    "year": 2018,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The primary results of the study support the use of language modeling as a pretraining task and set a new state of the art among comparable models using multitask learning with language models, and suggest that the widely-used paradigm of pretraining and freezing sentence encoders may not be an ideal platform for further work."
    },
    "citationCount": 27,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}