{
    "acronym": "258a1c928379d69478aec16e3d19bb5d47d9aee6",
    "title": "CBVS: A Large-Scale Chinese Image-Text Benchmark for Real-World Short Video Search Scenarios",
    "seed_ids": [
        "bert",
        "35bc08d8a912e1d3c52934e9537ea3fa34e1c390",
        "88dd119dba5ee747851ade8f5d517b381614d918",
        "182ba87b08726063765f3bed20ca53adf6e1f472"
    ],
    "s2id": "258a1c928379d69478aec16e3d19bb5d47d9aee6",
    "abstract": "Vision-Language Models pre-trained on large-scale image-text datasets have shown superior performance in downstream tasks such as image retrieval. Most of the images for pre-training are presented in the form of open domain common-sense visual elements. Differently, video covers in short video search scenarios are presented as user-originated contents that provide important visual summaries of videos. In addition, a portion of the video covers come with manually designed cover texts that provide semantic complements. In order to fill in the gaps in short video cover data, we establish the first large-scale cover-text benchmark for Chinese short video search scenarios. Specifically, we release two large-scale datasets CBVS-5M/10M to provide short video covers, and the manual fine-labeling dataset CBVS-20K to provide real user queries, which serves as an image-text benchmark test in the Chinese short video search field. To integrate the semantics of cover text in the case of modality missing, we propose UniCLIP where cover texts play a guiding role during training, however are not relied upon by inference. Extensive evaluation on CBVS-20K demonstrates the excellent performance of our proposal. UniCLIP has been deployed to Tencent's online video search systems with hundreds of millions of visits and achieved significant gains. The dataset and code are available at https://github.com/QQBrowserVideoSearch/CBVS-UniCLIP.",
    "authors": [
        "Xiangshuo Qiao",
        "Xianxin Li",
        "Xiaozhe Qu",
        "Jie Zhang",
        "Yang Liu",
        "Yu Luo",
        "Cihang Jin",
        "Jin Ma"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work releases two large-scale datasets CBVS-5M/10M to provide short video covers, and the manual fine-labeling dataset CBVS-20K to provide real user queries, which serves as an image-text benchmark test in the Chinese short video search field."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}