{
    "acronym": "25fd8b80c0808868b6834e2967c9de786dfb3fda",
    "title": "In-Memory Computing based Accelerator for Transformer Networks for Long Sequences",
    "seed_ids": [
        "reformer",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "25fd8b80c0808868b6834e2967c9de786dfb3fda",
    "abstract": "Transformer networks have outperformed recurrent neural networks and convolutional neural networks in various sequential tasks. However, scaling transformer networks for long sequences has been challenging because of memory and compute bottlenecks. Transformer networks are impeded by memory bandwidth limitations because of their low operation per byte ratio resulting in low utilization of GPU's computing resources. In-memory processing can mitigate memory bottlenecks by eliminating the transfer time between memory and compute units. Furthermore, transformer networks use neural attention mechanisms to characterize the relationships between sequence elements. Efficient hardware solutions have been proposed to implement efficient attention mechanisms, which include ternary content addressable memories (TCAM), crossbar arrays (XBars), and processing in-memory (PIM). However, these solutions do not implement a multi-head self-attention mechanism. We propose using a combination of XBars and CAMs to accelerate transformer networks. We improve the speed of transformer networks by (1) computing in-memory, thus minimizing the memory transfer overhead, (2) caching reusable parameters to reduce the number of operations, (3) exploiting the available parallelism in the attention mechanism, and (4) using locality sensitive hashing to filter the number of sequence elements by their importance. Our approach achieves a 200x speedup and 41x energy improvement for a sequence length of 4098.",
    "authors": [
        "Ann Franchesca Laguna",
        "A. Kazemi",
        "M. Niemier",
        "X. S. Hu"
    ],
    "venue": "Design, Automation and Test in Europe",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This approach achieves a 200x speedup and 41x energy improvement for a sequence length of 4098 by improving the speed of transformer networks by computing in-memory, thus minimizing the memory transfer overhead and using locality sensitive hashing to filter the number of sequence elements by their importance."
    },
    "citationCount": 14,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}