{
    "acronym": "273763216fffd5d4e4571edeb4352911fd6f30c5",
    "title": "Joint System-Wise Optimization for Pipeline Goal-Oriented Dialog System",
    "seed_ids": [
        "gpt",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "273763216fffd5d4e4571edeb4352911fd6f30c5",
    "abstract": "Recent work (Takanobu et al., 2020) proposed the system-wise evaluation on dialog systems and found that improvement on individual components (e.g., NLU, policy) in prior work may not necessarily bring benefit to pipeline systems in system-wise evaluation. To improve the system-wise performance, in this paper, we propose new joint system-wise optimization techniques for the pipeline dialog system. First, we propose a new data augmentation approach which automates the labeling process for NLU training. Second, we propose a novel stochastic policy parameterization with Poisson distribution that enables better exploration and offers a principled way to compute policy gradient. Third, we propose a reward bonus to help policy explore successful dialogs. Our approaches outperform the competitive pipeline systems from Takanobu et al. (2020) by big margins of 12% success rate in automatic system-wise evaluation and of 16% success rate in human evaluation on the standard multi-domain benchmark dataset MultiWOZ 2.1, and also outperform the recent state-of-the-art end-to-end trained model from DSTC9.",
    "authors": [
        "Zichuan Lin",
        "Jing Huang",
        "Bowen Zhou",
        "Xiaodong He",
        "Tengyu Ma"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Two new joint system-wise optimization techniques for the pipeline dialog system with a novel stochastic policy parameterization with Poisson distribution that enables better exploration and offers a principled way to compute policy gradient are proposed."
    },
    "citationCount": 2,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}