{
    "acronym": "273f1f91d20bb916e2fb31bfb45b09f2e13e08ca",
    "title": "Masked Language Modeling Becomes Conditional Density Estimation for Tabular Data Synthesis",
    "seed_ids": [
        "bert",
        "25d3a4e048d0020ba9cffc6442ebd4e7bb548a55"
    ],
    "s2id": "273f1f91d20bb916e2fb31bfb45b09f2e13e08ca",
    "abstract": "In this paper, our goal is to generate synthetic data for heterogeneous (mixed-type) tabular datasets with high machine learning utility (MLu). Given that the MLu performance relies on accurately approximating the conditional distributions, we focus on devising a synthetic data generation method based on conditional distribution estimation. We propose a novel synthetic data generation method, MaCoDE, by redefining the multi-class classification task of Masked Language Modeling (MLM) as histogram-based non-parametric conditional density estimation. Our proposed method enables estimating conditional densities across arbitrary combinations of target and conditional variables. Furthermore, we demonstrate that our proposed method bridges the theoretical gap between distributional learning and MLM. To validate the effectiveness of our proposed model, we conduct synthetic data generation experiments on 10 real-world datasets. Given the analogy between predicting masked input tokens in MLM and missing data imputation, we also evaluate the performance of multiple imputations on incomplete datasets with various missing data mechanisms. Moreover, our proposed model offers the advantage of enabling adjustments to data privacy levels without requiring re-training.",
    "authors": [
        "SeungHwan An",
        "Gyeongdong Woo",
        "Jaesung Lim",
        "ChangHyun Kim",
        "Sungchul Hong",
        "Jong-June Jeon"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel synthetic data generation method is proposed, MaCoDE, by redefining the multi-class classification task of Masked Language Modeling as histogram-based non-parametric conditional density estimation, which enables estimating conditional densities across arbitrary combinations of target and conditional variables."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}