{
    "acronym": "27c00c75ea9b2e71dc70e5a2708c5f065fe170a7",
    "title": "Small Character Models Match Large Word Models for Autocomplete Under Memory Constraints",
    "seed_ids": [
        "transformerxl",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "20f1c639458dd11d38f228a6dbbcfeb4c1913116"
    ],
    "s2id": "27c00c75ea9b2e71dc70e5a2708c5f065fe170a7",
    "abstract": "Autocomplete is a task where the user inputs a piece of text, termed prompt, which is conditioned by the model to generate semantically coherent continuation. Existing works for this task have primarily focused on datasets (e.g., email, chat) with high frequency user prompt patterns (or focused prompts) where word-based language models have been quite effective. In this work, we study the more challenging open-domain setting consisting of low frequency user prompt patterns (or broad prompts, e.g., prompt about 93rd academy awards) and demonstrate the effectiveness of character-based language models. We study this problem under memory-constrained settings (e.g., edge devices and smartphones), where character-based representation is effective in reducing the overall model size (in terms of parameters). We use WikiText-103 benchmark to simulate broad prompts and demonstrate that character models rival word models in exact match accuracy for the autocomplete task, when controlled for the model size. For instance, we show that a 20M parameter character model performs similar to an 80M parameter word model in the vanilla setting. We further propose novel methods to improve character models by incorporating inductive bias in the form of compositional information and representation transfer from large word models. Datasets and code used in this work are available at https://github.com/UBC-NLP/char_autocomplete.",
    "authors": [
        "Ganesh Jawahar",
        "Subhabrata Mukherjee",
        "Debadeepta Dey",
        "Muhammad Abdul-Mageed",
        "L. Lakshmanan",
        "C. C. T. Mendes",
        "Gustavo de Rosa",
        "S. Shah"
    ],
    "venue": "SUSTAINLP",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work studies the more challenging open-domain setting consisting of low frequency user prompt patterns (or broad prompts) and demonstrates the effectiveness of character-based language models and proposes novel methods to improve character models by incorporating inductive bias in the form of compositional information and representation transfer from large word models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}