{
    "acronym": "27ca7def733a5e81fbc977244e27431ab6e7d78a",
    "title": "An effective context‐focused hierarchical mechanism for task‐oriented dialogue response generation",
    "seed_ids": [
        "gpt2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "27ca7def733a5e81fbc977244e27431ab6e7d78a",
    "abstract": "Task‐oriented dialogue system (TOD) is one kind of application of artificial intelligence (AI). The response generation module is a key component of TOD for replying to user's questions and concerns in sequential natural words. In the past few years, the works on response generation have attracted increasing research attention and have seen much progress. However, existing works ignore the fact that not each turn of dialogue history contributes to the dialogue response generation and give little consideration to the different weights of utterances in a dialogue history. In this article, we propose a hierarchical memory network mechanism with two steps to filter out unnecessary information of dialogue history. First, an utterance‐level memory network distributes various weights to each utterance (coarse‐grained). Second, a token‐level memory network assigns higher weights to keywords based on the former's output (fine‐grained). Furthermore, the output of the token‐level memory network will be employed to query the knowledge base (KB) to capture the dialogue‐related information. In the decoding stage, we take a gated‐mechanism to generate response word by word from dialogue history, vocabulary, or KB. Experiments show that the proposed model achieves superior results compared with state‐of‐the‐art models on several public datasets. Further analysis demonstrates the effectiveness of the proposed method and the robustness of the model in the case of an incomplete training set.",
    "authors": [
        "Meng Zhao",
        "Zejun Jiang",
        "Lifang Wang",
        "Ronghan Li",
        "Xinyu Lu",
        "Zhongtian Hu",
        "Daqing Chen"
    ],
    "venue": "International Conference on Climate Informatics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A hierarchical memory network mechanism with two steps to filter out unnecessary information of dialogue history is proposed and achieves superior results compared with state‐of‐the‐art models on several public datasets."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}