{
    "acronym": "280c1b65b7271601e68420e6d6d85db7f63f4c03",
    "title": "Put Attention to Temporal Saliency Patterns of Multi-Horizon Time Series",
    "seed_ids": [
        "linformer",
        "reformer",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "2cf3bd0cc1382f35384e259d99e4f9744eeaed28"
    ],
    "s2id": "280c1b65b7271601e68420e6d6d85db7f63f4c03",
    "abstract": "Detection (TSD), on top of the attention mechanism and apply it to multi-horizon time series prediction. We renovate the traditional encoder-decoder architecture by making as a series of deep convolutional blocks to work in tandem with the multi-head self-attention. The proposed TSD approach facilitates the multiresolution of saliency patterns upon condensed multi-heads, thus progressively enhancing complex time series forecasting. Experimental results illustrate that our proposed approach has signiﬁcantly outperformed existing state-of-the-art methods across multiple standard benchmark datasets in many far-horizon forecasting settings. Overall, TSD achieves 31% and 46% relative improvement over the current state-of-the-art models in multivariate and univariate time series forecasting scenarios on standard benchmarks. The Git repository is available at https://github.com/duongtrung/time-series-temporal-saliency-patterns .",
    "authors": [
        "Nghia Duong-Trung",
        "Stefan Born",
        "Kiran Madhusudhanan",
        "Randolf Scholz",
        "Johannes Burchert",
        "Danh Le Phuoc",
        "Lars Schmidt-Thieme"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The traditional encoder-decoder architecture is renovated by making as a series of deep convolutional blocks to work in tandem with the multi-head self-attention to facilitate the multiresolution of saliency patterns upon condensed multi-heads, thus progressively enhancing complex time series forecasting."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}