{
    "acronym": "285ed94ec0f6cdeabcaffed3ee1f100933aea996",
    "title": "Anatomy of Neural Language Models",
    "seed_ids": [
        "gpt",
        "gpt2",
        "gpt3",
        "bert",
        "8af69a903a14657ec96b93c4b6e139771beec106",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "285ed94ec0f6cdeabcaffed3ee1f100933aea996",
    "abstract": "The fields of generative AI and transfer learning have experienced remarkable advancements in recent years especially in the domain of Natural Language Processing (NLP). Transformers have been at the heart of these advancements where the cutting-edge transformer-based Language Models (LMs) have led to new state-of-the-art results in a wide spectrum of applications. While the number of research works involving neural LMs is exponentially increasing, their vast majority are high-level and far from self-contained. Consequently, a deep understanding of the literature in this area is a tough task especially in the absence of a unified mathematical framework explaining the main types of neural LMs. We address the aforementioned problem in this tutorial where the objective is to explain neural LMs in a detailed, simplified and unambiguous mathematical framework accompanied by clear graphical illustrations. Concrete examples on widely used models like BERT and GPT2 are explored. Finally, since transformers pretrained on language-modeling-like tasks have been widely adopted in computer vision and time series applications, we briefly explore some examples of such solutions in order to enable readers to understand how transformers work in the aforementioned domains and compare this use with the original one in NLP.",
    "authors": [
        "Majd Saleh",
        "St'ephane Paquelet"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This tutorial aims to explain neural LMs in a detailed, simplified and unambiguous mathematical framework accompanied by clear graphical illustrations to enable readers to understand how transformers work in the aforementioned domains."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}