{
    "acronym": "286a643cebfa8149f02ead76b0be31caa7d8735f",
    "title": "xLSTMTime : Long-term Time Series Forecasting With xLSTM",
    "seed_ids": [
        "xlstm",
        "afeeb8f5018eebb1a1d334b94dbbfc48d167efef",
        "a7d68b1702af08ce4dbbf2cd0b083e744ae5c6be",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f"
    ],
    "s2id": "286a643cebfa8149f02ead76b0be31caa7d8735f",
    "abstract": "In recent years, transformer-based models have gained prominence in multivariate long-term time series forecasting (LTSF), demonstrating significant advancements despite facing challenges such as high computational demands, difficulty in capturing temporal dynamics, and managing long-term dependencies. The emergence of LTSF-Linear, with its straightforward linear architecture, has notably outperformed transformer-based counterparts, prompting a reevaluation of the transformer's utility in time series forecasting. In response, this paper presents an adaptation of a recent architecture termed extended LSTM (xLSTM) for LTSF. xLSTM incorporates exponential gating and a revised memory structure with higher capacity that has good potential for LTSF. Our adopted architecture for LTSF termed as xLSTMTime surpasses current approaches. We compare xLSTMTime's performance against various state-of-the-art models across multiple real-world da-tasets, demonstrating superior forecasting capabilities. Our findings suggest that refined recurrent architectures can offer competitive alternatives to transformer-based models in LTSF tasks, po-tentially redefining the landscape of time series forecasting.",
    "authors": [
        "Musleh Alharthi",
        "Ausif Mahmood"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An adaptation of a recent architecture termed extended LSTM (xLSTM) for LTSF incorporates exponential gating and a revised memory structure with higher capacity that has good potential for LTSF, suggesting that refined recurrent architectures can offer competitive alternatives to transformer-based models in LTSF tasks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}