{
    "acronym": "286b88d695b7528355382c2557eee1b248949765",
    "title": "Effect of Private Deliberation: Deception of Large Language Models in Game Play",
    "seed_ids": [
        "gpt3",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d"
    ],
    "s2id": "286b88d695b7528355382c2557eee1b248949765",
    "abstract": "Integrating large language model (LLM) agents within game theory demonstrates their ability to replicate human-like behaviors through strategic decision making. In this paper, we introduce an augmented LLM agent, called the private agent, which engages in private deliberation and employs deception in repeated games. Utilizing the partially observable stochastic game (POSG) framework and incorporating in-context learning (ICL) and chain-of-thought (CoT) prompting, we investigated the private agent’s proficiency in both competitive and cooperative scenarios. Our empirical analysis demonstrated that the private agent consistently achieved higher long-term payoffs than its baseline counterpart and performed similarly or better in various game settings. However, we also found inherent deficiencies of LLMs in certain algorithmic capabilities crucial for high-quality decision making in games. These findings highlight the potential for enhancing LLM agents’ performance in multi-player games using information-theoretic approaches of deception and communication with complex environments.",
    "authors": [
        "Kristijan Poje",
        "Mario Brcic",
        "Mihael Kovač",
        "Marina Bagić Babac"
    ],
    "venue": "Entropy",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An augmented large language model agent is introduced, called the private agent, which engages in private deliberation and employs deception in repeated games to highlight the potential for enhancing LLM agents’ performance in multi-player games using information-theoretic approaches of deception and communication with complex environments."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}