{
    "acronym": "28709eca90cac4102518fce9d9b4982ea949d20a",
    "title": "Survey of Neural Text Representation Models",
    "seed_ids": [
        "transformerxl",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "2a31319e73d4486716168b65cdf7559baeda18ce",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "28709eca90cac4102518fce9d9b4982ea949d20a",
    "abstract": "In natural language processing, text needs to be transformed into a machine-readable representation before any processing. The quality of further natural language processing tasks greatly depends on the quality of those representations. In this survey, we systematize and analyze 50 neural models from the last decade. The models described are grouped by the architecture of neural networks as shallow, recurrent, recursive, convolutional, and attention models. Furthermore, we categorize these models by representation level, input level, model type, and model supervision. We focus on task-independent representation models, discuss their advantages and drawbacks, and subsequently identify the promising directions for future neural text representation models. We describe the evaluation datasets and tasks used in the papers that introduced the models and compare the models based on relevant evaluations. The quality of a representation model can be evaluated as its capability to generalize to multiple unrelated tasks. Benchmark standardization is visible amongst recent models and the number of different tasks models are evaluated on is increasing.",
    "authors": [
        "Karlo Babić",
        "Sanda Martinčić-Ipšić",
        "A. Meštrović"
    ],
    "venue": "Inf.",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey systematize and analyze 50 neural models from the last decade, focusing on task-independent representation models, discuss their advantages and drawbacks, and subsequently identify the promising directions for future neural text representation models."
    },
    "citationCount": 30,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}