{
    "acronym": "291e43ce63feccdd54cc5061613b81cc0a4d8000",
    "title": "Decoy Effect In Search Interaction: Understanding User Behavior and Measuring System Vulnerability",
    "seed_ids": [
        "bert"
    ],
    "s2id": "291e43ce63feccdd54cc5061613b81cc0a4d8000",
    "abstract": "This study examines the decoy effect's underexplored influence on user search interactions and methods for measuring information retrieval (IR) systems' vulnerability to this effect. It explores how decoy results alter users' interactions on search engine result pages, focusing on metrics like click-through likelihood, browsing time, and perceived document usefulness. By analyzing user interaction logs from multiple datasets, the study demonstrates that decoy results significantly affect users' behavior and perceptions. Furthermore, it investigates how different levels of task difficulty and user knowledge modify the decoy effect's impact, finding that easier tasks and lower knowledge levels lead to higher engagement with target documents. In terms of IR system evaluation, the study introduces the DEJA-VU metric to assess systems' susceptibility to the decoy effect, testing it on specific retrieval tasks. The results show differences in systems' effectiveness and vulnerability, contributing to our understanding of cognitive biases in search behavior and suggesting pathways for creating more balanced and bias-aware IR evaluations.",
    "authors": [
        "Nuo Chen",
        "Jiqun Liu",
        "Hanpei Fang",
        "Yuankai Luo",
        "Tetsuya Sakai",
        "Xiao-Ming Wu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The study explores how decoy results alter users' interactions on search engine result pages, focusing on metrics like click-through likelihood, browsing time, and perceived document usefulness, and demonstrates that decoy results significantly affect users' behavior and perceptions."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}