{
    "acronym": "29584ed6d68a06fdf91440a018f6bc83a44fd177",
    "title": "Paragraph-level Rationale Extraction through Regularization: A case study on European Court of Human Rights Cases",
    "seed_ids": [
        "neurallegal",
        "5d22b241836e30d5b0d852b463951ab7e3245ea4"
    ],
    "s2id": "29584ed6d68a06fdf91440a018f6bc83a44fd177",
    "abstract": "Interpretability or explainability is an emerging research field in NLP. From a user-centric point of view, the goal is to build models that provide proper justification for their decisions, similar to those of humans, by requiring the models to satisfy additional constraints. To this end, we introduce a new application on legal text where, contrary to mainstream literature targeting word-level rationales, we conceive rationales as selected paragraphs in multi-paragraph structured court cases. We also release a new dataset comprising European Court of Human Rights cases, including annotations for paragraph-level rationales. We use this dataset to study the effect of already proposed rationale constraints, i.e., sparsity, continuity, and comprehensiveness, formulated as regularizers. Our findings indicate that some of these constraints are not beneficial in paragraph-level rationale extraction, while others need re-formulation to better handle the multi-label nature of the task we consider. We also introduce a new constraint, singularity, which further improves the quality of rationales, even compared with noisy rationale supervision. Experimental results indicate that the newly introduced task is very challenging and there is a large scope for further research.",
    "authors": [
        "Ilias Chalkidis",
        "Manos Fergadiotis",
        "D. Tsarapatsanis",
        "Nikolaos Aletras",
        "Ion Androutsopoulos",
        "Prodromos Malakasiotis"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new application on legal text is introduced where rationales are conceived as selected paragraphs in multi-paragraph structured court cases, and a new constraint, singularity, is introduced, which further improves the quality of rationales, even compared with noisy rationale supervision."
    },
    "citationCount": 91,
    "influentialCitationCount": 16,
    "code": null,
    "description": null,
    "url": null
}