{
    "acronym": "29712cb8f8e8dc3a574f92b0ad535380b0516b6e",
    "title": "tsGT: Stochastic Time Series Modeling With Transformer",
    "seed_ids": [
        "transformer",
        "gpt3",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "29712cb8f8e8dc3a574f92b0ad535380b0516b6e",
    "abstract": "Time series methods are of fundamental importance in virtually any field of science that deals with temporally structured data. Recently, there has been a surge of deterministic transformer models with time series-specific architectural biases. In this paper, we go in a different direction by introducing tsGT, a stochastic time series model built on a general-purpose transformer architecture. We focus on using a well-known and theoretically justified rolling window backtesting and evaluation protocol. We show that tsGT outperforms the state-of-the-art models on MAD and RMSE, and surpasses its stochastic peers on QL and CRPS, on four commonly used datasets. We complement these results with a detailed analysis of tsGT's ability to model the data distribution and predict marginal quantile values.",
    "authors": [
        "Lukasz Kuci'nski",
        "Witold Drzewakowski",
        "Mateusz Olko",
        "Piotr Kozakowski",
        "Lukasz Maziarka",
        "Marta Emilia Nowakowska",
        "Lukasz Kaiser",
        "Piotr Milo's"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces tsGT, a stochastic time series model built on a general-purpose transformer architecture that outperforms the state-of-the-art models on MAD and RMSE, and surpasses its stochastic peers on QL and CRPS, on four commonly used datasets."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}