{
    "acronym": "29757a8cb432cb26d039c707cc95e07ed7883050",
    "title": "Shift Pose: A Lightweight Transformer-like Neural Network for Human Pose Estimation",
    "seed_ids": [
        "gmlp",
        "b52844a746dafd8a5051cef49abbbda64a312605",
        "fbf68eb0cf8237cef59ebdb301569c79b9676ff9",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "29757a8cb432cb26d039c707cc95e07ed7883050",
    "abstract": "High-performing, real-time pose detection and tracking in real-time will enable computers to develop a finer-grained and more natural understanding of human behavior. However, the implementation of real-time human pose estimation remains a challenge. On the one hand, the performance of semantic keypoint tracking in live video footage requires high computational resources and large parameters, which limiting the accuracy of pose estimation. On the other hand, some transformer-based models were proposed recently with outstanding performance and much fewer parameters and FLOPs. However, the self-attention module in the transformer is not computationally friendly, which makes it difficult to apply these excellent models to real-time jobs. To overcome the above problems, we propose a transformer-like model, named ShiftPose, which is regression-based approach. The ShiftPose does not contain any self-attention module. Instead, we replace the self-attention module with a non-parameter operation called the shift operator. Meanwhile, we adapt the bridge–branch connection, instead of a fully-branched connection, such as HRNet, as our multi-resolution integration scheme. Specifically, the bottom half of our model adds the previous output, as well as the output from the top half of our model, corresponding to its resolution. Finally, the simple, yet promising, disentangled representation (SimDR) was used in our study to make the training process more stable. The experimental results on the MPII datasets were 86.4 PCKH, 29.1PCKH@0.1. On the COCO dataset, the results were 72.2 mAP and 91.5 AP50, 255 fps on GPU, with 10.2M parameters, and 1.6 GFLOPs. In addition, we tested our model for single-stage 3D human pose estimation and draw several useful and exploratory conclusions. The above results show good performance, and this paper provides a new method for high-performance, real-time attitude detection and tracking.",
    "authors": [
        "Haijian Chen",
        "Xinyun Jiang",
        "Yonghui Dai"
    ],
    "venue": "Italian National Conference on Sensors",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A transformer-like model, named ShiftPose, which is regression-based approach, that provides a new method for high-performance, real-time attitude detection and tracking and uses the simple, yet promising, disentangled representation (SimDR) to make the training process more stable."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}