{
    "acronym": "29a037e391f29fed7a01f31a52d850eaeae8644a",
    "title": "Topical Segmentation of Spoken Narratives: A Test Case on Holocaust Survivor Testimonies",
    "seed_ids": [
        "gpt2",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "e7c698bdace380f7183dedbe657686f1885f615c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "29a037e391f29fed7a01f31a52d850eaeae8644a",
    "abstract": "The task of topical segmentation is well studied, but previous work has mostly addressed it in the context of structured, well-defined segments, such as segmentation into paragraphs, chapters, or segmenting text that originated from multiple sources. We tackle the task of segmenting running (spoken) narratives, which poses hitherto unaddressed challenges. As a test case, we address Holocaust survivor testimonies, given in English. Other than the importance of studying these testimonies for Holocaust research, we argue that they provide an interesting test case for topical segmentation, due to their unstructured surface level, relative abundance (tens of thousands of such testimonies were collected), and the relatively confined domain that they cover. We hypothesize that boundary points between segments correspond to low mutual information between the sentences proceeding and following the boundary. Based on this hypothesis, we explore a range of algorithmic approaches to the task, building on previous work on segmentation that uses generative Bayesian modeling and state-of-the-art neural machinery. Compared to manually annotated references, we find that the developed approaches show considerable improvements over previous work.",
    "authors": [
        "Eitan Wagner",
        "Renana Keydar",
        "Amit Pinchevski",
        "Omri Abend"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A range of algorithmic approaches to segmentation are explored, building on previous work on segmentation that uses generative Bayesian modeling and state-of-the-art neural machinery, and find that the developed approaches show considerable improvements over previous work."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}