{
    "acronym": "29c2fcba27398bc7eea60ca9579075d230e16cc0",
    "title": "RIFF: Learning to Rephrase Inputs for Few-shot Fine-tuning of Language Models",
    "seed_ids": [
        "bert",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "29c2fcba27398bc7eea60ca9579075d230e16cc0",
    "abstract": "Pre-trained Language Models (PLMs) can be accurately fine-tuned for downstream text processing tasks. Recently, researchers have introduced several parameter-efficient fine-tuning methods that optimize input prompts or adjust a small number of model parameters (e.g LoRA). In this study, we explore the impact of altering the input text of the original task in conjunction with parameter-efficient fine-tuning methods. To most effectively rewrite the input text, we train a few-shot paraphrase model with a Maximum-Marginal Likelihood objective. Using six few-shot text classification datasets, we show that enriching data with paraphrases at train and test time enhances the performance beyond what can be achieved with parameter-efficient fine-tuning alone. The code used for our experiments can be found at https://github.com/SaeedNajafi/RIFF.",
    "authors": [
        "Saeed Najafi",
        "Alona Fyshe"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The impact of altering the input text of the original task in conjunction with parameter-efficient fine-tuning methods is explored and it is shown that enriching data with paraphrases at train and test time enhances the performance beyond what can be achieved with parameter-efficient fine-tuning alone."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}