{
    "acronym": "2a09ebbfcca1a6994eeb472cd4159f5f3858dbf9",
    "title": "LongCoder: A Long-Range Pre-trained Language Model for Code Completion",
    "seed_ids": [
        "gpt2",
        "bigbird",
        "longformer",
        "sparsetransformer",
        "4b27f18bff43d605805c92696a979714ced0b805",
        "c49ac1f916d6d2edeb187e6619c8d23acd95eb21",
        "2016e814eed00b0c0a9358e193e29854e0ed526f",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "49cf6a22a5dac5bc98b653534af65ffa0bc0e76d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2a09ebbfcca1a6994eeb472cd4159f5f3858dbf9",
    "abstract": "In this paper, we introduce a new task for code completion that focuses on handling long code input and propose a sparse Transformer model, called LongCoder, to address this task. LongCoder employs a sliding window mechanism for self-attention and introduces two types of globally accessible tokens - bridge tokens and memory tokens - to improve performance and efficiency. Bridge tokens are inserted throughout the input sequence to aggregate local information and facilitate global interaction, while memory tokens are included to highlight important statements that may be invoked later and need to be memorized, such as package imports and definitions of classes, functions, or structures. We conduct experiments on a newly constructed dataset that contains longer code context and the publicly available CodeXGLUE benchmark. Experimental results demonstrate that LongCoder achieves superior performance on code completion tasks compared to previous models while maintaining comparable efficiency in terms of computational resources during inference. All the codes and data are available at https://github.com/microsoft/CodeBERT.",
    "authors": [
        "Daya Guo",
        "Canwen Xu",
        "Nan Duan",
        "Jian Yin",
        "Julian McAuley"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new task for code completion that focuses on handling long code input is introduced and a sparse Transformer model, called LongCoder, is proposed, to address this task and achieves superior performance on code completion tasks compared to previous models while maintaining comparable efficiency in terms of computational resources during inference."
    },
    "citationCount": 30,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}