{
    "acronym": "2a218786f4615b82389f78472e7ff22e6ce57490",
    "title": "ConvBERT: Improving BERT with Span-based Dynamic Convolution",
    "seed_ids": [
        "lighdynconv",
        "8af925f4edf45131b5b6fed8aa655089d58692fa",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "65f788fb964901e3f1149a0a53317535ca85ed7d",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "16c844fd4d97f3c6eb38b0d6527c87d184efedc3",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2a218786f4615b82389f78472e7ff22e6ce57490",
    "abstract": "Pre-trained language models like BERT and its variants have recently achieved impressive performance in various natural language understanding tasks. However, BERT heavily relies on the global self-attention block and thus suffers large memory footprint and computation cost. Although all its attention heads query on the whole input sequence for generating the attention map from a global perspective, we observe some heads only need to learn local dependencies, which means the existence of computation redundancy. We therefore propose a novel span-based dynamic convolution to replace these self-attention heads to directly model local dependencies. The novel convolution heads, together with the rest self-attention heads, form a new mixed attention block that is more efficient at both global and local context learning. We equip BERT with this mixed attention design and build a ConvBERT model. Experiments have shown that ConvBERT significantly outperforms BERT and its variants in various downstream tasks, with lower training cost and fewer model parameters. Remarkably, ConvBERTbase model achieves 86.4 GLUE score, 0.7 higher than ELECTRAbase, while using less than 1/4 training cost. Code and pre-trained models will be released.",
    "authors": [
        "Zihang Jiang",
        "Weihao Yu",
        "Daquan Zhou",
        "Yunpeng Chen",
        "Jiashi Feng",
        "Shuicheng Yan"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel span-based dynamic convolution is proposed to replace these self-attention heads to directly model local dependencies and form a new mixed attention block that is more efficient at both global and local context learning."
    },
    "citationCount": 135,
    "influentialCitationCount": 13,
    "code": null,
    "description": null,
    "url": null
}