{
    "acronym": "2a3d3eeda974703f1727ff724f1078bd5e6b2e1f",
    "title": "TherapyBot: a chatbot for mental well-being using transformers",
    "seed_ids": [
        "transformer",
        "b90c090f7928a78d85d952737488be1ef8587ae5",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2a3d3eeda974703f1727ff724f1078bd5e6b2e1f",
    "abstract": "The field of natural language processing (NLP) and conversational artificial intelligence (AI) has one ingenious application in the psychological space. Depression and anxiety are two major issues that the world is facing, with close to 41% of adults reporting these symptoms in the United States alone, as of December 2020. It has also been observed that most of the people are not open about it. As a result, it is critical to address this issue on a global scale. Developed countries reportedly have 9 psychiatrists per 100,000 people. One way to mitigate this is the use of chatbots. We propose a transformer-based methodology to build a therapy bot that has been trained on a combination of open-domain conversations from a publicly available dataset and therapist-client conversations from a self-constructed dataset. This end-to-end data-driven model shows quality performance in conversations and adds value by aiding in the case of mental health issues. The proposed architecture is proven to be effective in its usability in the psychological space for both single-turn and multi-turn dialogue. The performance of the proposed system shows loss is 0.29 and perplexity is 1.34, both metrics keeps gradually decreasing and it means an improvement in performance of chatbots system.",
    "authors": [
        "D. Dharrao",
        "S. Gite"
    ],
    "venue": "International Journal of Advances in Applied Sciences",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a transformer-based methodology to build a therapy bot that has been trained on a combination of open-domain conversations from a publicly available dataset and therapist-client conversations from a self-constructed dataset that shows quality performance in conversations and adds value by aiding in the case of mental health issues."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}