{
    "acronym": "2a846580c64bbdcfc2e73cbff7fc013c7707e514",
    "title": "Validation in Forensic Text Comparison: Issues and Opportunities",
    "seed_ids": [
        "bert"
    ],
    "s2id": "2a846580c64bbdcfc2e73cbff7fc013c7707e514",
    "abstract": "It has been argued in forensic science that the empirical validation of a forensic inference system or methodology should be performed by replicating the conditions of the case under investigation and using data relevant to the case. This study demonstrates that the above requirement for validation is also critical in forensic text comparison (FTC); otherwise, the trier-of-fact may be misled for their final decision. Two sets of simulated experiments are performed: one fulfilling the above validation requirement and the other overlooking it, using mismatch in topics as a case study. Likelihood ratios (LRs) are calculated via a Dirichlet-multinomial model, followed by logistic-regression calibration. The derived LRs are assessed by means of the log-likelihood-ratio cost, and they are visualized using Tippett plots. Following the experimental results, this paper also attempts to describe some of the essential research required in FTC by highlighting some central issues and challenges unique to textual evidence. Any deliberations on these issues and challenges will contribute to making a scientifically defensible and demonstrably reliable FTC available.",
    "authors": [
        "Shunichi Ishihara",
        "Sonia Kulkarni",
        "Michael J. Carne",
        "Sabine Ehrhardt",
        "Andrea Nini"
    ],
    "venue": "Languages",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study demonstrates that the above requirement for validation is also critical in forensic text comparison (FTC); otherwise, the trier-of-fact may be misled for their final decision."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}