{
    "acronym": "2ace8667f2b331001136391cae237d50c0db6383",
    "title": "Training Spiking Neural Networks Using Lessons From Deep Learning",
    "seed_ids": [
        "spikegpt",
        "9f52317ea9c5a6804b978987ff2a6557f98b5b2c"
    ],
    "s2id": "2ace8667f2b331001136391cae237d50c0db6383",
    "abstract": "The brain is the perfect place to look for inspiration to develop more efficient neural networks. The inner workings of our synapses and neurons provide a glimpse at what the future of deep learning might look like. This article serves as a tutorial and perspective showing how to apply the lessons learned from several decades of research in deep learning, gradient descent, backpropagation, and neuroscience to biologically plausible spiking neural networks (SNNs). We also explore the delicate interplay between encoding data as spikes and the learning process; the challenges and solutions of applying gradient-based learning to SNNs; the subtle link between temporal backpropagation and spike timing-dependent plasticity; and how deep learning might move toward biologically plausible online learning. Some ideas are well accepted and commonly used among the neuromorphic engineering community, while others are presented or justified for the first time here. A series of companion interactive tutorials complementary to this article using our Python package, snnTorch, are also made available: https://snntorch.readthedocs.io/en/latest/tutorials/index.html.",
    "authors": [
        "J. Eshraghian",
        "Max Ward",
        "Emre Neftci",
        "Xinxin Wang",
        "Gregor Lenz",
        "Girish Dwivedi",
        "Bennamoun",
        "Doo Seok Jeong",
        "Wei Lu"
    ],
    "venue": "Proceedings of the IEEE",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The delicate interplay between encoding data as spikes and the learning process is explored; the challenges and solutions of applying gradient-based learning to SNNs; the subtle link between temporal backpropagation and spike timing-dependent plasticity; and how deep learning might move toward biologically plausible online learning."
    },
    "citationCount": 262,
    "influentialCitationCount": 32,
    "code": null,
    "description": null,
    "url": null
}