{
    "acronym": "2af00c926ad96b9b27c4d3899d26262625a4d17c",
    "title": "CLosER: Conversational Legal Longformer with Expertise-Aware Passage Response Ranker for Long Contexts",
    "seed_ids": [
        "longformer",
        "156a66da569b68ea776c5db38e033aadb4755971",
        "5e0bf5d58b224c6261cc714139a54681a7917149",
        "f30e95be411456a709e7cb9a8b3a3e557bd0356a",
        "4e885ce070664e8eb3278659d0b20c7deed34029",
        "1e3e65e7773b7869d9bd7f5394b54199e48195e6",
        "f6245b3e6270e4dc2e279c4b728030523dffcff4",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "15cc6dac02a458f587712880e8b9c15bb97bbbeb"
    ],
    "s2id": "2af00c926ad96b9b27c4d3899d26262625a4d17c",
    "abstract": "In this paper, we investigate the task of response ranking in conversational legal search. We propose a novel method for conversational passage response retrieval (ConvPR) for long conversations in domains with mixed levels of expertise. Conversational legal search is challenging because the domain includes long, multi-participant dialogues with domain-specific language. Furthermore, as opposed to other domains, there typically is a large knowledge gap between the questioner (a layperson) and the responders (lawyers), participating in the same conversation. We collect and release a large-scale real-world dataset called LegalConv with nearly one million legal conversations from a legal community question answering (CQA) platform. We address the particular challenges of processing legal conversations, with our novel Conversational Legal Longformer with Expertise-Aware Response Ranker, called CLosER. The proposed method has two main innovations compared to state-of-the-art methods for ConvPR: (i) Expertise-Aware Post-Training; a learning objective that takes into account the knowledge gap difference between participants to the conversation; and (ii) a simple but effective strategy for re-ordering the context utterances in long conversations to overcome the limitations of the sparse attention mechanism of the Longformer architecture. Evaluation on LegalConv shows that our proposed method substantially and significantly outperforms existing state-of-the-art models on the response selection task. Our analysis indicates that our Expertise-Aware PostTraining, i.e., continued pre-training or domain/task adaptation, plays an important role in the achieved effectiveness. Our proposed method is generalizable to other tasks with domain-specific challenges and can facilitate future research on conversational search in other domains.",
    "authors": [
        "Arian Askari",
        "Mohammad Aliannejadi",
        "Amin Abolghasemi",
        "E. Kanoulas",
        "S. Verberne"
    ],
    "venue": "International Conference on Information and Knowledge Management",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Evaluation on LegalConv shows that the proposed method substantially and significantly outperforms existing state-of-the-art models on the response selection task and indicates that the Expertise-Aware PostTraining, i.e., continued pre-training or domain/task adaptation, plays an important role in the achieved effectiveness."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}