{
    "acronym": "2b3321ddb2f28015dc677f3fee9ba9e3333c93d7",
    "title": "Recent Advances in Large Language Models for Healthcare",
    "seed_ids": [
        "transformer",
        "b3c1fad1f5f8f0213b6d3f3458fa86205a3434f7",
        "848909fbae167f21589bfc7a54fbf27e306b883c",
        "16d83e930a4dab2d49f5d276838ddce79df3f787",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "25425e299101b13ec2872417a14f961f4f8aa18e",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "7649011fd3271921f7cfafba24865f38c0ef3038",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "53c3940f35b8b45d55ed49056282e1961954513d",
        "b76e98a0a023d37c6534aa2ead09c8ff595f0bae",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2b3321ddb2f28015dc677f3fee9ba9e3333c93d7",
    "abstract": "Recent advances in the field of large language models (LLMs) underline their high potential for applications in a variety of sectors. Their use in healthcare, in particular, holds out promising prospects for improving medical practices. As we highlight in this paper, LLMs have demonstrated remarkable capabilities in language understanding and generation that could indeed be put to good use in the medical field. We also present the main architectures of these models, such as GPT, Bloom, or LLaMA, composed of billions of parameters. We then examine recent trends in the medical datasets used to train these models. We classify them according to different criteria, such as size, source, or subject (patient records, scientific articles, etc.). We mention that LLMs could help improve patient care, accelerate medical research, and optimize the efficiency of healthcare systems such as assisted diagnosis. We also highlight several technical and ethical issues that need to be resolved before LLMs can be used extensively in the medical field. Consequently, we propose a discussion of the capabilities offered by new generations of linguistic models and their limitations when deployed in a domain such as healthcare.",
    "authors": [
        "Khalid Nassiri",
        "Moulay A. Akhloufi"
    ],
    "venue": "BioMedInformatics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper presents the main architectures of large language models, such as GPT, Bloom, or LLaMA, composed of billions of parameters, and examines recent trends in the medical datasets used to train these models."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}