{
    "acronym": "2b628f22b032f580f6eb49c60a8cf31ec01cfa0f",
    "title": "Automatic Modulation Recognition of Underwater Acoustic Signals Using a Two-Stream Transformer",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "2b628f22b032f580f6eb49c60a8cf31ec01cfa0f",
    "abstract": "Automatic modulation recognition (AMR) of underwater acoustic (UWA) signals is incredibly challenging due to the complexity of UWA channels and the severity of ocean noise. In the presence of noise interference, single-modal features fail to fully represent the characteristics of different modulated signals. While the in-phase/quadrature (I/Q) and time–frequency maps can adequately represent the signal features in the time, frequency, and time–frequency domains, the direct integration of the two modalities is ineffective because of the variations in shape, information granularity, and noise manifestation. To address the low recognition rate caused by the above issues, we propose a two-stream transformer (TSTR)-based network for AMR of UWA signals. First, the input preprocessing layer obtains the I/Q and time–frequency features from the received signals. Then, the feature capture layer (FCL) extracts high-dimensional signal features in the time, frequency, and time–frequency domains. Finally, the classification layer estimates the modulation of the signals. A multihead self-attention module with adaptive soft thresholding is used in the FCL to provide noise reduction and redundant feature rejection while retaining context information. Moreover, multiscale ghost convolution is employed to address the inability of the transformer to efficiently extract spatial characteristics from the signals. Results are presented using real UWA channels from the Watermark data set for two different seas which show that the TSTR improves recognition by 1.2% and 5.9% over the best existing model. Further, it has better generalization capabilities and the model has a small number of parameters so the time complexity is low.",
    "authors": [
        "Juan Li",
        "Qingning Jia",
        "Xuerong Cui",
        "Ieee T. Aaron Gulliver Senior Member",
        "Ieee Bin Jiang Member",
        "Shibao Li",
        "Jungang Yang",
        "T. A. Gulliver"
    ],
    "venue": "IEEE Internet of Things Journal",
    "year": 2024,
    "tldr": null,
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}