{
    "acronym": "2b7200e4eef9c37ff7ba40f9bc9311e45c654b89",
    "title": "Modern Internet Search Analytics: Is There a Difference in What Patients are Searching Regarding the Operative and Nonoperative Management of Scoliosis?",
    "seed_ids": [
        "bert"
    ],
    "s2id": "2b7200e4eef9c37ff7ba40f9bc9311e45c654b89",
    "abstract": "STUDY DESIGN\nObservational Study.\n\n\nOBJECTIVES\nThis study aimed to investigate the most searched types of questions and online resources implicated in the operative and nonoperative management of scoliosis.\n\n\nMETHODS\nSix terms related to operative and nonoperative scoliosis treatment were searched on Google's People Also Ask section on October 12, 2023. The Rothwell classification was used to sort questions into fact, policy, or value categories, and associated websites were classified by type. Fischer's exact tests compared question type and websites encountered between operative and nonoperative questions. Statistical significance was set at the .05 level.\n\n\nRESULTS\nThe most common questions concerning operative and nonoperative management were fact (53.4%) and value (35.5%) questions, respectively. The most common subcategory pertaining to operative and nonoperative questions were specific activities/restrictions (21.7%) and evaluation of treatment (33.3%), respectively. Questions on indications/management (13.2% vs 31.2%, P < .001) and evaluation of treatment (10.1% vs 33.3%, P < .001) were associated with nonoperative scoliosis management. Medical practice websites were the most common website to which questions concerning operative (31.9%) and nonoperative (51.4%) management were directed to. Operative questions were more likely to be directed to academic websites (21.7% vs 10.0%, P = .037) and less likely to be directed to medical practice websites (31.9% vs 51.4%, P = .007) than nonoperative questions.\n\n\nCONCLUSIONS\nDuring scoliosis consultations, spine surgeons should emphasize the postoperative recovery process and efficacy of conservative treatment modalities for the operative and nonoperative management of scoliosis, respectively. Future research should assess the impact of website encounters on patients' decision-making.",
    "authors": [
        "Paul G Mastrokostas",
        "Leonidas E Mastrokostas",
        "Ahmed K. Emara",
        "Ian J Wellington",
        "Elizabeth Ginalis",
        "John K Houten",
        "A. Khalsa",
        "Ahmed Saleh",
        "Afshin E. Razi",
        "Mitchell K Ng"
    ],
    "venue": "Global Spine Journal",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "During scoliosis consultations, spine surgeons should emphasize the postoperative recovery process and efficacy of conservative treatment modalities for the operative and nonoperative management of scoliosis, respectively."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}