{
    "acronym": "2bff508779af191e7950b16cea8c4a9d0fc341e5",
    "title": "Overview of the MedVidQA 2022 Shared Task on Medical Video Question-Answering",
    "seed_ids": [
        "bigbird",
        "longformer",
        "f30e95be411456a709e7cb9a8b3a3e557bd0356a",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "270f3bea8ca801870a6cc56b4d36f7f2019c9ed0",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0"
    ],
    "s2id": "2bff508779af191e7950b16cea8c4a9d0fc341e5",
    "abstract": "In this paper, we present an overview of the MedVidQA 2022 shared task, collocated with the 21st BioNLP workshop at ACL 2022. The shared task addressed two of the challenges faced by medical video question answering: (I) a video classification task that explores new approaches to medical video understanding (labeling), and (ii) a visual answer localization task. Visual answer localization refers to the identification of the relevant temporal segments (start and end timestamps) in the video where the answer to the medical question is being shown or illustrated. A total of thirteen teams participated in the shared task challenges, with eleven system descriptions submitted to the workshop. The descriptions present monomodal and multi-modal approaches developed for medical video classification and visual answer localization. This paper describes the tasks, the datasets, evaluation metrics, and baseline systems for both tasks. Finally, the paper summarizes the techniques and results of the evaluation of the various approaches explored by the participating teams.",
    "authors": [
        "D. Gupta",
        "Dina Demner-Fushman"
    ],
    "venue": "Workshop on Biomedical Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An overview of the MedVidQA 2022 shared task, collocated with the 21st BioNLP workshop at ACL 2022, addressed two of the challenges faced by medical video question answering: a video classification task that explores new approaches to medical video understanding (labeling), and a visual answer localization task."
    },
    "citationCount": 9,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}