{
    "acronym": "2c38ab72d91a27c62d774689924e8d53e821fe06",
    "title": "Hypernymy Understanding Evaluation of Text-to-Image Models via WordNet Hierarchy",
    "seed_ids": [
        "classfreediffu",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "2c38ab72d91a27c62d774689924e8d53e821fe06",
    "abstract": "Text-to-image synthesis has recently attracted widespread attention due to rapidly improving quality and numerous practical applications. However, the language understanding capabilities of text-to-image models are still poorly understood, which makes it difficult to reason about prompt formulations that a given model would understand well. In this work, we measure the capability of popular text-to-image models to understand $\\textit{hypernymy}$, or the\"is-a\"relation between words. We design two automatic metrics based on the WordNet semantic hierarchy and existing image classifiers pretrained on ImageNet. These metrics both enable broad quantitative comparison of linguistic capabilities for text-to-image models and offer a way of finding fine-grained qualitative differences, such as words that are unknown to models and thus are difficult for them to draw. We comprehensively evaluate popular text-to-image models, including GLIDE, Latent Diffusion, and Stable Diffusion, showing how our metrics can provide a better understanding of the individual strengths and weaknesses of these models.",
    "authors": [
        "Anton Baryshnikov",
        "Max Ryabinin"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work measures the capability of popular text-to-image models to understand $\\textit{hypernymy}$, or the\"is-a\"relation between words, and designs two automatic metrics based on the WordNet semantic hierarchy and existing image classifiers pretrained on ImageNet to enable broad quantitative comparison of linguistic capabilities."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}