{
    "acronym": "2c5460afa19ad6fc2568b7e210115acacc14a40c",
    "title": "An Overview on Language Models: Recent Developments and Outlook",
    "seed_ids": [
        "gpt2",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "8af69a903a14657ec96b93c4b6e139771beec106",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "83b8108014e3db4f46354a28ae68193f143c4e7e",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "62dc8ddb4907db4b889c5e93673d9b3c189d1f25",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "5e9c85235210b59a16bdd84b444a904ae271f7e7",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2c5460afa19ad6fc2568b7e210115acacc14a40c",
    "abstract": "Language modeling studies the probability distributions over strings of texts. It is one of the most fundamental tasks in natural language processing (NLP). It has been widely used in text generation, speech recognition, machine translation, etc. Conventional language models (CLMs) aim to predict the probability of linguistic sequences in a causal manner, while pre-trained language models (PLMs) cover broader concepts and can be used in both causal sequential modeling and fine-tuning for downstream applications. PLMs have their own training paradigms (usually self-supervised) and serve as foundation models in modern NLP systems. This overview paper provides an introduction to both CLMs and PLMs from five aspects, i.e., linguistic units, architectures, training methods, evaluation methods, and applications. Furthermore, we discuss the relationship between CLMs and PLMs and shed light on the future directions of language modeling in the pre-trained era.",
    "authors": [
        "Chengwei Wei",
        "Yun Cheng Wang",
        "Bin Wang",
        "C.-C. Jay Kuo"
    ],
    "venue": "APSIPA Transactions on Signal and Information Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This overview paper provides an introduction to both CLMs and PLMs from five aspects, i.e., linguistic units, architectures, training methods, evaluation methods, and applications."
    },
    "citationCount": 28,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}