{
    "acronym": "2c69ee2e7eef507db7e91d77e62af8c35feaaf66",
    "title": "LRM-Zero: Training Large Reconstruction Models with Synthesized Data",
    "seed_ids": [
        "transformer",
        "0c4f46e4dcae5527018e6432fb60cfe8c3354e97",
        "f65db0fc08e01bb41a7a69197b090765a7063f95",
        "1206b05eae5a06ba662ae79fb291b50e359c4f42",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "2c69ee2e7eef507db7e91d77e62af8c35feaaf66",
    "abstract": "We present LRM-Zero, a Large Reconstruction Model (LRM) trained entirely on synthesized 3D data, achieving high-quality sparse-view 3D reconstruction. The core of LRM-Zero is our procedural 3D dataset, Zeroverse, which is automatically synthesized from simple primitive shapes with random texturing and augmentations (e.g., height fields, boolean differences, and wireframes). Unlike previous 3D datasets (e.g., Objaverse) which are often captured or crafted by humans to approximate real 3D data, Zeroverse completely ignores realistic global semantics but is rich in complex geometric and texture details that are locally similar to or even more intricate than real objects. We demonstrate that our LRM-Zero, trained with our fully synthesized Zeroverse, can achieve high visual quality in the reconstruction of real-world objects, competitive with models trained on Objaverse. We also analyze several critical design choices of Zeroverse that contribute to LRM-Zero's capability and training stability. Our work demonstrates that 3D reconstruction, one of the core tasks in 3D vision, can potentially be addressed without the semantics of real-world objects. The Zeroverse's procedural synthesis code and interactive visualization are available at: https://desaixie.github.io/lrm-zero/.",
    "authors": [
        "Desai Xie",
        "Sai Bi",
        "Zhixin Shu",
        "Kai Zhang",
        "Zexiang Xu",
        "Yi Zhou",
        "Soren Pirk",
        "Arie E. Kaufman",
        "Xin Sun",
        "Hao Tan"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "LRM-Zero, a Large Reconstruction Model trained entirely on synthesized 3D data, achieving high-quality sparse-view 3D reconstruction, demonstrates that 3D reconstruction, one of the core tasks in 3D vision, can be addressed without the semantics of real-world objects."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}