{
    "acronym": "2c7e346aa311fec4dda04bdf3a214ce2026d8807",
    "title": "Medical Vision Language Pretraining: A survey",
    "seed_ids": [
        "bert",
        "a42fc49a300136d60aaebb668369010ee7746150",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "461420c80d3bdc156e5db7af13264a955a6a2010",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "2c7e346aa311fec4dda04bdf3a214ce2026d8807",
    "abstract": "Medical Vision Language Pretraining (VLP) has recently emerged as a promising solution to the scarcity of labeled data in the medical domain. By leveraging paired/unpaired vision and text datasets through self-supervised learning, models can be trained to acquire vast knowledge and learn robust feature representations. Such pretrained models have the potential to enhance multiple downstream medical tasks simultaneously, reducing the dependency on labeled data. However, despite recent progress and its potential, there is no such comprehensive survey paper that has explored the various aspects and advancements in medical VLP. In this paper, we specifically review existing works through the lens of different pretraining objectives, architectures, downstream evaluation tasks, and datasets utilized for pretraining and downstream tasks. Subsequently, we delve into current challenges in medical VLP, discussing existing and potential solutions, and conclude by highlighting future directions. To the best of our knowledge, this is the first survey focused on medical VLP.",
    "authors": [
        "Prashant Shrestha",
        "Sanskar Amgain",
        "Bidur Khanal",
        "C. Linte",
        "Binod Bhattarai"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper reviews existing works through the lens of different pretraining objectives, architectures, downstream evaluation tasks, and datasets utilized for pretraining and downstream tasks, then dives into current challenges in medical VLP, discussing existing and potential solutions, and concludes by highlighting future directions."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}