{
    "acronym": "2cb91c1a9488c3bdb05eee7668ac4a77c7e18a3b",
    "title": "How Smooth Is Attention?",
    "seed_ids": [
        "gpt2",
        "148011adfae37b821407aae84fcbbf7fb4619eb6",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2cb91c1a9488c3bdb05eee7668ac4a77c7e18a3b",
    "abstract": "Self-attention and masked self-attention are at the heart of Transformers' outstanding success. Still, our mathematical understanding of attention, in particular of its Lipschitz properties - which are key when it comes to analyzing robustness and expressive power - is incomplete. We provide a detailed study of the Lipschitz constant of self-attention in several practical scenarios, discussing the impact of the sequence length $n$ and layer normalization on the local Lipschitz constant of both unmasked and masked self-attention. In particular, we show that for inputs of length $n$ in any compact set, the Lipschitz constant of self-attention is bounded by $\\sqrt{n}$ up to a constant factor and that this bound is tight for reasonable sequence lengths. When the sequence length $n$ is too large for the previous bound to be tight, which we refer to as the mean-field regime, we provide an upper bound and a matching lower bound which are independent of $n$. Our mean-field framework for masked self-attention is novel and of independent interest. Our experiments on pretrained and randomly initialized BERT and GPT-2 support our theoretical findings.",
    "authors": [
        "Val'erie Castin",
        "Pierre Ablin",
        "Gabriel Peyr'e"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that for inputs of length $n$ in any compact set, the Lipschitz constant of self-attention is bounded by $\\sqrt{n}$ up to a constant factor and that this bound is tight for reasonable sequence lengths."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}