{
    "acronym": "2d0ce78209ab0b996980f5085a9c0051cbca4d90",
    "title": "GNNavi: Navigating the Information Flow in Large Language Models by Graph Neural Network",
    "seed_ids": [
        "gpt2",
        "e1f4b94479bfcb735a1a0add178a2337def07c9b",
        "7bd4ca8706a79983d31ab74e6c79bfdfd949602e",
        "6001dce1c8f63350263e013e0e6ff69816f0a9af",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2d0ce78209ab0b996980f5085a9c0051cbca4d90",
    "abstract": "Large Language Models (LLMs) exhibit strong In-Context Learning (ICL) capabilities when prompts with demonstrations are used. However, fine-tuning still remains crucial to further enhance their adaptability. Prompt-based fine-tuning proves to be an effective fine-tuning method in low-data scenarios, but high demands on computing resources limit its practicality. We address this issue by introducing a prompt-based parameter-efficient fine-tuning (PEFT) approach. GNNavi leverages insights into ICL's information flow dynamics, which indicates that label words act in prompts as anchors for information propagation. GNNavi employs a Graph Neural Network (GNN) layer to precisely guide the aggregation and distribution of information flow during the processing of prompts by hardwiring the desired information flow into the GNN. Our experiments on text classification tasks with GPT-2 and Llama2 show GNNavi surpasses standard prompt-based fine-tuning methods in few-shot settings by updating just 0.2% to 0.5% of parameters. We compare GNNavi with prevalent PEFT approaches, such as prefix tuning, LoRA and Adapter in terms of performance and efficiency. Our analysis reveals that GNNavi enhances information flow and ensures a clear aggregation process.",
    "authors": [
        "Shuzhou Yuan",
        "Ercong Nie",
        "Michael Farber",
        "Helmut Schmid",
        "Hinrich Schütze"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "GNNavi leverages insights into ICL's information flow dynamics, which indicates that label words act in prompts as anchors for information propagation and enhances information flow and ensures a clear aggregation process."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}