{
    "acronym": "2d45032aa072dc2b7d30316989087336c6bb4016",
    "title": "Identifying while Learning for Document Event Causality Identification",
    "seed_ids": [
        "bert",
        "5f5adc7b50771979f5c8c5107ead099b8342c2f6",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "696ae02905e129731819d7d4cf28011c775d4393"
    ],
    "s2id": "2d45032aa072dc2b7d30316989087336c6bb4016",
    "abstract": "Event Causality Identification (ECI) aims to detect whether there exists a causal relation between two events in a document. Existing studies adopt a kind of identifying after learning paradigm, where events' representations are first learned and then used for the identification. Furthermore, they mainly focus on the causality existence, but ignoring causal direction. In this paper, we take care of the causal direction and propose a new identifying while learning mode for the ECI task. We argue that a few causal relations can be easily identified with high confidence, and the directionality and structure of these identified causalities can be utilized to update events' representations for boosting next round of causality identification. To this end, this paper designs an *iterative learning and identifying framework*: In each iteration, we construct an event causality graph, on which events' causal structure representations are updated for boosting causal identification. Experiments on two public datasets show that our approach outperforms the state-of-the-art algorithms in both evaluations for causality existence identification and direction identification.",
    "authors": [
        "Cheng Liu",
        "Wei Xiang",
        "Bang Wang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is argued that a few causal relations can be easily identified with high confidence, and the directionality and structure of these identified causalities can be utilized to update events' representations for boosting next round of causality identification."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}