{
    "acronym": "2d5e2280a988ad71c40aeb189b4d4dcea56b793d",
    "title": "Can Language Models Help in System Security? Investigating Log Anomaly Detection using BERT",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "cc2d1a66c701e9be9124eb95431b6c3dd79a61d3"
    ],
    "s2id": "2d5e2280a988ad71c40aeb189b4d4dcea56b793d",
    "abstract": "The log files generated by networked computer systems contain valuable information that can be used to monitor system security and stability. Recently, techniques based on Deep Learning and Natural Language Processing have been proven effective in detecting anomalous activities from system logs. The current approaches, however, have limited practical application because they rely on log templates which cannot handle variability in log content, or they require supervised training to be effective. In this paper, a novel log anomaly detection approach named LogFiT is proposed. The LogFiT model inherits the linguistic “knowledge” encoded within a pretrained BERT-based language model and fine-tunes it towards learning the linguistic structure of system logs. The LogFiT model is trained in a self-supervised manner using normal log data only. Using masked token prediction and centroid distance minimisation as training objectives, the LogFiT model learns to recognise the linguistic patterns associated with the normal log data. During inference, a discriminator function uses the LogFiT model’s top-k token prediction accuracy and computed centroid distance to determine if the input is normal or anomaly. Experiments show that LogFiT’s F1 score and specificity exceeds that of baseline models on the HDFS dataset and comparable on the BGL dataset.",
    "authors": [
        "Crispin Almodovar",
        "Fariza Sabrina",
        "Sarvnaz Karimi",
        "S. Azad"
    ],
    "venue": "Australasian Language Technology Association Workshop",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel log anomaly detection approach named LogFiT is proposed, which inherits the linguistic “knowledge” encoded within a pretrained BERT-based language model and fine-tunes it towards learning the linguistic structure of system logs."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}