{
    "acronym": "2d6bd2c05c05691c8f30eef54e01eab750295f19",
    "title": "AdaPipe: Optimizing Pipeline Parallelism with Adaptive Recomputation and Partitioning",
    "seed_ids": [
        "gpt3",
        "flashattn",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a"
    ],
    "s2id": "2d6bd2c05c05691c8f30eef54e01eab750295f19",
    "abstract": "Large language models (LLMs) have demonstrated powerful capabilities, requiring huge memory with their increasing sizes and sequence lengths, thus demanding larger parallel systems. The broadly adopted pipeline parallelism introduces even heavier and unbalanced memory consumption. Recomputation is a widely employed technique to mitigate the problem but introduces extra computation overhead. This paper proposes AdaPipe, which aims to find the optimized recomputation and pipeline stage partitioning strategy. AdaPipe employs adaptive recomputation to maximize memory utilization and reduce the computation cost of each pipeline stage. A flexible stage partitioning algorithm is also adopted to balance the computation between different stages. We evaluate AdaPipe by training two representative models, GPT-3 (175B) and Llama 2 (70B), achieving up to 1.32× and 1.22× speedup on clusters with NVIDIA GPUs and Ascend NPUs respectively.",
    "authors": [
        "Zhenbo Sun",
        "Huanqi Cao",
        "Yuanwei Wang",
        "Guanyu Feng",
        "Shengqi Chen",
        "Haojie Wang",
        "Wenguang Chen"
    ],
    "venue": "International Conference on Architectural Support for Programming Languages and Operating Systems",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes AdaPipe, which aims to find the optimized recomputation and pipeline stage partitioning strategy, and employs adaptive recomputation to maximize memory utilization and reduce the computation cost of each pipeline stage."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}