{
    "acronym": "2d79d2ea57c87912bd46ae8e8bda1b26c4773855",
    "title": "FiLM: Fill-in Language Models for Any-Order Generation",
    "seed_ids": [
        "gpt2",
        "22775e58932cdfbd273a2a835a22c5d86800a458",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2d79d2ea57c87912bd46ae8e8bda1b26c4773855",
    "abstract": "Language models have become the backbone of today's AI systems. However, their predominant left-to-right generation limits the use of bidirectional context, which is essential for tasks that involve filling text in the middle. We propose the Fill-in Language Model (FiLM), a new language modeling approach that allows for flexible generation at any position without adhering to a specific generation order. Its training extends the masked language modeling objective by adopting varying mask probabilities sampled from the Beta distribution to enhance the generative capabilities of FiLM. During inference, FiLM can seamlessly insert missing phrases, sentences, or paragraphs, ensuring that the outputs are fluent and are coherent with the surrounding context. In both automatic and human evaluations, FiLM outperforms existing infilling methods that rely on left-to-right language models trained on rearranged text segments. FiLM is easy to implement and can be either trained from scratch or fine-tuned from a left-to-right language model. Notably, as the model size grows, FiLM's perplexity approaches that of strong left-to-right language models of similar sizes, indicating FiLM's scalability and potential as a large language model.",
    "authors": [
        "Tianxiao Shen",
        "Hao Peng",
        "Ruoqi Shen",
        "Yao Fu",
        "Zaïd Harchaoui",
        "Yejin Choi"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Fill-in Language Model is proposed, a new language modeling approach that allows for flexible generation at any position without adhering to a specific generation order, and its training extends the masked language modeling objective by adopting varying mask probabilities sampled from the Beta distribution to enhance the generative capabilities of FiLM."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}