{
    "acronym": "2d88b671af49e477e3a0e85014fb853b6d3bd363",
    "title": "On the Validity of Self-Attention as Explanation in Transformer Models",
    "seed_ids": [
        "gpt",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2d88b671af49e477e3a0e85014fb853b6d3bd363",
    "abstract": "Explainability of deep learning systems is a vital requirement for many applications. However, it is still an unsolved problem. Recent self-attention based models for natural language processing, such as the Transformer or BERT, offer hope of greater explainability by providing attention maps that can be directly inspected. Nevertheless, by just looking at the attention maps one often overlooks that the attention is not over words but over hidden embeddings, which themselves can be mixed representations of multiple embeddings. We investigate to what extent the implicit assumption made in many recent papers - that hidden embeddings at all layers still correspond to the underlying words - is justified. We quantify how much embeddings are mixed based on a gradient based attribution method and find that already after the first layer less than 50% of the embedding is attributed to the underlying word, declining thereafter to a median contribution of 7.5% in the last layer. While throughout the layers the underlying word remains as the one contributing most to the embedding, we argue that attention visualizations are misleading and should be treated with care when explaining the underlying deep learning system.",
    "authors": [
        "Gino Brunner",
        "Yang Liu",
        "Damian Pascual",
        "Oliver Richter",
        "Roger Wattenhofer"
    ],
    "venue": "arXiv.org",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is argued that attention visualizations are misleading and should be treated with care when explaining the underlying deep learning system."
    },
    "citationCount": 18,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}