{
    "acronym": "2e8dae244121de00a770fa660dd05be1f9aa1927",
    "title": "Overview of the 8th Social Media Mining for Health Applications (#SMM4H) Shared Tasks at the AMIA 2023 Annual Symposium",
    "seed_ids": [
        "gpt3",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "2e8dae244121de00a770fa660dd05be1f9aa1927",
    "abstract": "The aim of the Social Media Mining for Health Applications (#SMM4H) shared tasks is to take a community-driven approach to address the natural language processing and machine learning challenges inherent to utilizing social media data for health informatics. The eighth iteration of the #SMM4H shared tasks was hosted at the AMIA 2023 Annual Symposium and consisted of five tasks that represented various social media platforms (Twitter and Reddit), languages (English and Spanish), methods (binary classification, multi-class classification, extraction, and normalization), and topics (COVID-19, therapies, social anxiety disorder, and adverse drug events). In total, 29 teams registered, representing 18 countries. In this paper, we present the annotated corpora, a technical summary of the systems, and the performance results. In general, the top-performing systems used deep neural network architectures based on pre-trained transformer models. In particular, the top-performing systems for the classification tasks were based on single models that were pre-trained on social media corpora. To facilitate future work, the datasets, totaling 61,353 posts, will remain available by request, and the CodaLab sites will remain active for a post-evaluation phase.",
    "authors": [
        "A. Klein",
        "Juan M. Banda",
        "Yuting Guo",
        "Ana Lucia Schmidt",
        "Dongfang Xu",
        "J. I. F. Amaro",
        "Raul Rodriguez-Esteban",
        "A. Sarker",
        "G. Gonzalez-Hernandez"
    ],
    "venue": "medRxiv",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The annotated corpora, a technical summary of the systems, and the performance results show that the top-performing systems for the classification tasks were based on single models that were pre-trained on social media corpora."
    },
    "citationCount": 8,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}