{
    "acronym": "2e96513b803d8d3b0e06373edd33cda4aa72df27",
    "title": "On the portability of extractive Question-Answering systems on scientific papers to real-life application scenarios",
    "seed_ids": [
        "longformer",
        "ab17c315f7ee4fe69fde2f3d8ae0e30e4e2f3a2b",
        "4e3935ef7da6bcbb202ec7f8b285c313cadcd044",
        "2c953a3c378b40dadf2e3fb486713c8608b8e282",
        "aa9c6d43b36a55b34c2e9207355d355fd94691af",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "c6c734e16f66fbfcefac7625cc64599e83292c1e"
    ],
    "s2id": "2e96513b803d8d3b0e06373edd33cda4aa72df27",
    "abstract": "There are still hurdles standing in the way of faster and more efficient knowledge consumption in industrial environments seeking to foster innovation. In this work, we address the portability of extractive Question Answering systems from academic spheres to industries basing their decisions on thorough scientific papers analysis. Keeping in mind that such industrial contexts often lack high-quality data to develop their own QA systems, we illustrate the misalignment between application requirements and cost sensitivity of such industries and some widespread practices tackling the domain-adaptation problem in the academic world. Through a series of extractive QA experiments on QASPER, we adopt the pipeline-based retriever-ranker-reader architecture for answering a question on a scientific paper and show the impact of modeling choices in different stages on the quality of answer prediction. We thus provide a characterization of practical aspects of real-life application scenarios and notice that appropriate trade-offs can be efficient and add value in those industrial environments.",
    "authors": [
        "Chyrine Tahri",
        "Xavier Tannier",
        "Patrick Haouat"
    ],
    "venue": "WIESP",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work addresses the portability of extractive Question Answering systems from academic spheres to industries basing their decisions on thorough scientific papers analysis by adopting the pipeline-based retriever-ranker-reader architecture for answering a question on a scientific paper."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}