{
    "acronym": "2e9d642b2a5ebd04b215649c697dd180086c0884",
    "title": "Legal Case Document Summarization: Extractive and Abstractive Methods and their Evaluation",
    "seed_ids": [
        "longformer",
        "034c26fbff61cd369df230fd8adba9abea4ce8a2",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "2e9d642b2a5ebd04b215649c697dd180086c0884",
    "abstract": "Summarization of legal case judgement documents is a challenging problem in Legal NLP. However, not much analyses exist on how different families of summarization models (e.g., extractive vs. abstractive) perform when applied to legal case documents. This question is particularly important since many recent transformer-based abstractive summarization models have restrictions on the number of input tokens, and legal documents are known to be very long. Also, it is an open question on how best to evaluate legal case document summarization systems. In this paper, we carry out extensive experiments with several extractive and abstractive summarization methods (both supervised and unsupervised) over three legal summarization datasets that we have developed. Our analyses, that includes evaluation by law practitioners, lead to several interesting insights on legal summarization in specific and long document summarization in general.",
    "authors": [
        "A. Shukla",
        "Paheli Bhattacharya",
        "Soham Poddar",
        "Rajdeep Mukherjee",
        "Kripabandhu Ghosh",
        "Pawan Goyal",
        "Saptarshi Ghosh"
    ],
    "venue": "AACL",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper carries out extensive experiments with several extractive and abstractive summarization methods (both supervised and unsupervised) over three legal summarization datasets that have been developed and leads to several interesting insights on legal summarizations in specific and long document summarization in general."
    },
    "citationCount": 23,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}