{
    "acronym": "2ed5d5fbcf172814d1d23838d04fafeca8f96f0b",
    "title": "SEM-POS: Grammatically and Semantically Correct Video Captioning",
    "seed_ids": [
        "gpt2",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2ed5d5fbcf172814d1d23838d04fafeca8f96f0b",
    "abstract": "Generating grammatically and semantically correct captions in video captioning is a challenging task.. The captions generated from the existing methods are either word-by-word that do not align with grammatical structure or miss key information from the input videos. To address these issues, we introduce a novel global-local fusion network, with a Global-Local Fusion Block (GLFB) that encodes and fuses features from different parts of speech (POS) components with visual-spatial features. We use novel combinations of different POS components - ’determinant + subject’, ’auxiliary verb’, ’verb’, and ’determinant + object’ for supervision of the POS blocks - Det + Subject, Aux Verb, Verb, and Det + Object respectively. The novel global-local fusion network together with POS blocks helps align the visual features with language description to generate grammatically and semantically correct captions. Extensive qualitative and quantitative experiments on benchmark MSVD and MSRVTT datasets demonstrate that the proposed approach generates more grammatically and semantically correct captions compared to the existing methods, achieving the new state-of-the-art. Ablations on the POS blocks and the GLFB demonstrate the impact of the contributions on the proposed method.",
    "authors": [
        "Asmar Nadeem",
        "A. Hilton",
        "R. Dawes",
        "Graham A. Thomas",
        "A. Mustafa"
    ],
    "venue": "2023 IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops (CVPRW)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel global-local fusion network, with a Global-Local Fusion Block (GLFB) that encodes and fuses features from different parts of speech (POS) components with visual-spatial features to generate grammatically and semantically correct captions in video captioning."
    },
    "citationCount": 3,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}