{
    "acronym": "2eddd9e63e47377cdd58b4669762175a2c251988",
    "title": "DBGANet: Dual-Branch Geometric Attention Network for Accurate 3D Tooth Segmentation",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "2eddd9e63e47377cdd58b4669762175a2c251988",
    "abstract": "Accurate segmentation of 3D dental models derived from intra-oral scanners (IOS) is one of the key steps in many digital dental applications such as orthodontics and implants. However, it is difficult to accurately segment individual teeth and gums in 3D dental models due to the following problems: 1) the shape and appearance of adjacent teeth are very similar, which is easy to be misidentified; 2) the boundary between teeth and gums is often indistinct, especially in orthodontic patients with abnormalities such as missing and crowded teeth. To solve such problems, a Dual-Branch Geometric Attention Network (DBGANet) for 3D tooth segmentation is proposed, which can capture tooth geometric structure and detailed boundary information from multi-view geometric features encoded by 3D coordinates and normal vectors. The framework contains two branches, i.e., C-branch and N-branch. First, centroid-guided separable attention is designed in the C-branch to learn global context information by modeling the spatial dependencies of tooth point clouds, which can capture the overall geometric structure of teeth to better distinguish adjacent teeth with similar appearance. Then, Gaussian neighbor attention is designed in the N-branch to encode normal vectors to highlight detailed differences between geometric features at different points, which helps to refine the boundaries of teeth and gingiva for more accurate and smooth tooth segmentation. Extensive experiments on the real-patient datasets of 3D dental models demonstrate that the proposed DBGANet significantly outperforms state-of-the-art methods.",
    "authors": [
        "Zhijie Lin",
        "Zhaoshui He",
        "Xu Wang",
        "Bing Zhang",
        "Chang Liu",
        "Wenqing Su",
        "Ji Tan",
        "Shengli Xie"
    ],
    "venue": "IEEE transactions on circuits and systems for video technology (Print)",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Dual-Branch Geometric Attention Network (DBGANet) for 3D tooth segmentation is proposed, which can capture tooth geometric structure and detailed boundary information from multi-view geometric features encoded by 3D coordinates and normal vectors."
    },
    "citationCount": 15,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}