{
    "acronym": "2eeff1edde4fc66284e7bedeb8eb8878ed4560f4",
    "title": "Efficient Detection of LLM-generated Texts with a Bayesian Surrogate Model",
    "seed_ids": [
        "gpt2",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "11beca761c3079f7612204ed1b241ee8832107c9",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2eeff1edde4fc66284e7bedeb8eb8878ed4560f4",
    "abstract": "The detection of machine-generated text, especially from large language models (LLMs), is crucial in preventing serious social problems resulting from their misuse. Some methods train dedicated detectors on specific datasets but fall short in generalizing to unseen test data, while other zero-shot ones often yield suboptimal performance. Although the recent DetectGPT has shown promising detection performance, it suffers from significant inefficiency issues, as detecting a single candidate requires querying the source LLM with hundreds of its perturbations. This paper aims to bridge this gap. Concretely, we propose to incorporate a Bayesian surrogate model, which allows us to select typical samples based on Bayesian uncertainty and interpolate scores from typical samples to other samples, to improve query efficiency. Empirical results demonstrate that our method significantly outperforms existing approaches under a low query budget. Notably, when detecting the text generated by LLaMA family models, our method with just 2 or 3 queries can outperform DetectGPT with 200 queries.",
    "authors": [
        "Zhijie Deng",
        "Hongcheng Gao",
        "Yibo Miao",
        "Hao Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Bayesian surrogate model is proposed, which allows us to select typical samples based on Bayesian uncertainty and interpolate scores from typical samples to other samples, to improve query efficiency and significantly outperforms existing approaches under a low query budget."
    },
    "citationCount": 17,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}