{
    "acronym": "2f125c28e9769e3074b453cc0371edec7ef65b5c",
    "title": "Building on Efficient Foundations: Effectively Training LLMs with Structured Feedforward Layers",
    "seed_ids": [
        "gqa",
        "d53fe76bd2795a19ddf52d012917782f6f6f2c1e",
        "4d76206515d6b33903937474273885476fc2771e",
        "6cb35dd6e1338faa0c3d6a6b0020bbcbcc18653d",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "8326dba15f6b8ee6e43c23eea3265a05e59e8135",
        "5f895e84c1fea75de07b4f90da518273c2e57291",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2f125c28e9769e3074b453cc0371edec7ef65b5c",
    "abstract": "State-of-the-art results in large language models (LLMs) often rely on scale, which becomes computationally expensive. This has sparked a research agenda to reduce these models' parameter count and computational costs without significantly impacting their performance. Our study focuses on transformer-based LLMs, specifically targeting the computationally intensive feedforward networks (FFN), which are less studied than attention blocks. We consider three candidate linear layer approximations in the FFN by combining efficient low-rank and block-diagonal matrices. In contrast to many previous works that examined these approximations, our study i) explores these structures from the training-from-scratch perspective, ii) scales up to 1.3B parameters, and iii) is conducted within recent Transformer-based LLMs rather than convolutional architectures. We first demonstrate they can lead to actual computational gains in various scenarios, including online decoding when using a pre-merge technique. Additionally, we propose a novel training regime, called \\textit{self-guided training}, aimed at improving the poor training dynamics that these approximations exhibit when used from initialization. Experiments on the large RefinedWeb dataset show that our methods are both efficient and effective for training and inference. Interestingly, these structured FFNs exhibit steeper scaling curves than the original models. Further applying self-guided training to the structured matrices with 32\\% FFN parameters and 2.5$\\times$ speed-up enables only a 0.4 perplexity increase under the same training FLOPs. Finally, we develop the wide and structured networks surpassing the current medium-sized and large-sized Transformer in perplexity and throughput performance. Our code is available at \\url{https://github.com/CLAIRE-Labo/StructuredFFN/tree/main}.",
    "authors": [
        "Xiuying Wei",
        "Skander Moalla",
        "Razvan Pascanu",
        "Caglar Gulcehre"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study focuses on transformer-based LLMs, specifically targeting the computationally intensive feedforward networks (FFN), which are less studied than attention blocks and considers three candidate linear layer approximations in the FFN by combining efficient low-rank and block-diagonal matrices."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}