{
    "acronym": "2f130a320798dba1b13fa2e2822d42273e453038",
    "title": "An Empirical Analysis of Parameter-Efficient Methods for Debiasing Pre-Trained Language Models",
    "seed_ids": [
        "gpt2",
        "8c62277dada489904a63de4dd87336c27c68fb5e",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "5e9c85235210b59a16bdd84b444a904ae271f7e7",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2f130a320798dba1b13fa2e2822d42273e453038",
    "abstract": "The increasingly large size of modern pre-trained language models not only makes them inherit more human-like biases from the training corpora, but also makes it computationally expensive to mitigate such biases. In this paper, we investigate recent parameter-efficient methods in combination with counterfactual data augmentation (CDA) for bias mitigation. We conduct extensive experiments with prefix tuning, prompt tuning, and adapter tuning on different language models and bias types to evaluate their debiasing performance and abilities to preserve the internal knowledge of a pre-trained model. We find that the parameter-efficient methods (i) are effective in mitigating gender bias, where adapter tuning is consistently the most effective one and prompt tuning is more suitable for GPT-2 than BERT, (ii) areless effective when it comes to racial and religious bias, which may be attributed to the limitations of CDA, and (iii) can perform similarly to or sometimes better than full fine-tuning with improved time and memory efficiency, as well as maintain the internal knowledge in BERT and GPT-2, evaluated via fact retrieval and downstream fine-tuning.",
    "authors": [
        "Zhongbin Xie",
        "Thomas Lukasiewicz"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Recent parameter-efficient methods in combination with counterfactual data augmentation (CDA) for bias mitigation are investigated and find that they are effective in mitigating gender bias and are less effective when it comes to racial and religious bias."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}