{
    "acronym": "2f5a60cce19c6e5ca5a527f713d3b1545d64f0ef",
    "title": "Socialformer: Social Network Inspired Long Document Modeling for Document Ranking",
    "seed_ids": [
        "bigbird",
        "longformer",
        "84daddd294fa3cc12596b5785f81c2a153d2fb1d",
        "e32a12b14e212506115cc6804667b3d8297917e1",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "9eb7860ae9777997ed17f6de623b0ab08cfc2df5",
        "63857190aaf5aab1d94b54bb257b7b03b8cb5a50",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "8382402fe166df3de499dac182e42baa51335926",
        "2cf3bd0cc1382f35384e259d99e4f9744eeaed28",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0"
    ],
    "s2id": "2f5a60cce19c6e5ca5a527f713d3b1545d64f0ef",
    "abstract": "Utilizing pre-trained language models has achieved great success for neural document ranking. Limited by the computational and memory requirements, long document modeling becomes a critical issue. Recent works propose to modify the full attention matrix in Transformer by designing sparse attention patterns. However, most of them only focus on local connections of terms within a fixed-size window. How to build suitable remote connections between terms to better model document representation remains underexplored. In this paper, we propose the model Socialformer, which introduces the characteristics of social networks into designing sparse attention patterns for long document modeling in document ranking. Specifically, we consider several attention patterns to construct a graph like social networks. Endowed with the characteristic of social networks, most pairs of nodes in such a graph can reach with a short path while ensuring the sparsity. To facilitate efficient calculation, we segment the graph into multiple subgraphs to simulate friend circles in social scenarios. Experimental results confirm the effectiveness of our model on long document modeling.",
    "authors": [
        "Yujia Zhou",
        "Zhicheng Dou",
        "Huaying Yuan",
        "Zhengyi Ma"
    ],
    "venue": "The Web Conference",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The model Socialformer is proposed, which introduces the characteristics of social networks into designing sparse attention patterns for long document modeling in document ranking and considers several attention patterns to construct a graph like social networks."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}