{
    "acronym": "2f604e6e42d79ab35fa4cf6a88540521d1a4cdc5",
    "title": "Fixed Input Parameterization for Efficient Prompting",
    "seed_ids": [
        "lineartransformer",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "1a883522f3c0051d70be1f8cbdb8989a77395006",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2f604e6e42d79ab35fa4cf6a88540521d1a4cdc5",
    "abstract": "Recent works have shown that attaching prompts to the input is effective at conditioning Language Models (LM) to perform specific tasks. However, prompts are always included in the input text during inference, even when they are fixed, thus incurring substantial computational and memory overhead. Also, there is currently no straightforward method of utilizing prompts that are longer than the maximum input length of the LMs without incurring additional costs during inference. We formally define Fixed Input Parameterization (FIP) problem that focuses on injecting the fixed prompt into the parameters of an LM to be an efficient alternative to attaching fixed prompts to the input. We show that in scenarios with long fixed prompts, FIP can be up to 280 times more efficient in terms of total FLOPs than previous approaches. We further explore methodologies for FIP and show promising results in persona-dependent conversation, semantic parsing, and zero-shot learning with task instructions. Through these explorations, we show that FIP can be a promising direction for conditioning language models, in scenarios with long and fixed prompts 1 .",
    "authors": [
        "Eunbi Choi",
        "Yongrae Jo",
        "Joel Jang",
        "Joonwon Jang",
        "Minjoon Seo"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that in scenarios with long fixed prompts, FIP can be up to 280 times more efficient in terms of total FLOPs than previous approaches and further explore methodologies for FIP and shows promising results in persona-dependent conversation, semantic parsing, and zero-shot learning with task instructions."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}