{
    "acronym": "2f66ea1a1e1b9cc13000809e4c0051195b4ebc33",
    "title": "VirtualModel: Generating Object-ID-retentive Human-object Interaction Image by Diffusion Model for E-commerce Marketing",
    "seed_ids": [
        "classfreediffu",
        "cf694df964caa156ec306b45d3a3127533cb458f",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "2f66ea1a1e1b9cc13000809e4c0051195b4ebc33",
    "abstract": "Due to the significant advances in large-scale text-to-image generation by diffusion model (DM), controllable human image generation has been attracting much attention recently. Existing works, such as Controlnet [36], T2I-adapter [20] and HumanSD [10] have demonstrated good abilities in generating human images based on pose conditions, they still fail to meet the requirements of real e-commerce scenarios. These include (1) the interaction between the shown product and human should be considered, (2) human parts like face/hand/arm/foot and the interaction between human model and product should be hyper-realistic, and (3) the identity of the product shown in advertising should be exactly consistent with the product itself. To this end, in this paper, we first define a new human image generation task for e-commerce marketing, i.e., Object-ID-retentive Human-object Interaction image Generation (OHG), and then propose a VirtualModel framework to generate human images for product shown, which supports displays of any categories of products and any types of human-object interaction. As shown in Figure 1, VirtualModel not only outperforms other methods in terms of accurate pose control and image quality but also allows for the display of user-specified product objects by maintaining the product-ID consistency and enhancing the plausibility of human-object interaction. Codes and data will be released.",
    "authors": [
        "Binghui Chen",
        "Chongyang Zhong",
        "Wangmeng Xiang",
        "Yifeng Geng",
        "Xuansong Xie"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new human image generation task for e-commerce marketing is defined, i.e., Object-ID-retentive Human-object Interaction image Generation (OHG), and a VirtualModel framework to generate human images for product shown is proposed, which supports displays of any categories of products and any types of human-object interaction."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}