{
    "acronym": "2f89071c59b71effc434f9eed8697e3152f7acd4",
    "title": "Fairness-Aware Structured Pruning in Transformers",
    "seed_ids": [
        "gpt2",
        "7ef43bacd43393ff116e6fcda6a52a6902e016d7",
        "7ea0e91c5d5dc73f2133bc46d7ebb6cb83034dae",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2f89071c59b71effc434f9eed8697e3152f7acd4",
    "abstract": "The increasing size of large language models (LLMs) has introduced challenges in their training and inference. Removing model components is perceived as a solution to tackle the large model sizes, however, existing pruning methods solely focus on performance, without considering an essential aspect for the responsible use of LLMs: model fairness. It is crucial to address the fairness of LLMs towards diverse groups, such as women, Black people, LGBTQ+, Jewish communities, among others, as they are being deployed and available to a wide audience. In this work, first, we investigate how attention heads impact fairness and performance in pre-trained transformer-based language models. We then propose a novel method to prune the attention heads that negatively impact fairness while retaining the heads critical for performance, i.e. language modeling capabilities. Our approach is practical in terms of time and resources, as it does not require fine-tuning the final pruned, and fairer, model. Our findings demonstrate a reduction in gender bias by 19%, 19.5%, 39.5%, 34.7%, 23%, and 8% for DistilGPT-2, GPT-2, GPT-Neo of two different sizes, GPT-J, and Llama 2 models, respectively, in comparison to the biased model, with only a slight decrease in performance. WARNING: This work uses language that is offensive in nature.",
    "authors": [
        "A. Zayed",
        "Gonçalo Mordido",
        "S. Shabanian",
        "Ioana Baldini",
        "Sarath Chandar"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work investigates how attention heads impact fairness and performance in pre-trained transformer-based language models and proposes a novel method to prune the attention heads that negatively impact fairness while retaining the heads critical for performance, i.e. language modeling capabilities."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}