{
    "acronym": "2f99c03d4ce75dc3e4a4fe1a3fceffc04193b9b9",
    "title": "ChatGPT-guided Semantics for Zero-shot Learning",
    "seed_ids": [
        "gpt3",
        "23c265ba884b92ecbd9d18641078d964697e4590"
    ],
    "s2id": "2f99c03d4ce75dc3e4a4fe1a3fceffc04193b9b9",
    "abstract": "Zero-shot learning (ZSL) aims to classify objects that are not observed or seen during training. It relies on class semantic description to transfer knowledge from the seen classes to the unseen classes. Existing methods of obtaining class semantics include manual attributes or automatic word vectors from language models (like word2vec). We know attribute annotation is costly, whereas automatic word vectors are relatively noisy. To address this problem, we explore how ChatGPT, a large language model, can enhance class semantics for ZSL tasks. ChatGPT can be a helpful source to obtain text descriptions for each class containing related attributes and semantics. We use the word2vec model to get a word vector using the texts from ChatGPT. Then, we enrich word vectors by combining the word embeddings from class names and descriptions generated by ChatGPT. More specifically, we leverage ChatGPT to provide extra supervision for the class description, eventually benefiting ZSL models. We evaluate our approach on various 2D image (CUB and AwA) and 3D point cloud (ModelNet10, ModelNet40, and ScanObjectNN) datasets and show that it improves ZSL performance. Our work contributes to the ZSL literature by applying ChatGPT for class semantics enhancement and proposing a novel word vector fusion method.",
    "authors": [
        "Fahimul Hoque Shubho",
        "T. Chowdhury",
        "A. Cheraghian",
        "Morteza Saberi",
        "Nabeel Mohammed",
        "Shafin Rahman"
    ],
    "venue": "International Conference on Digital Image Computing: Techniques and Applications",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work uses ChatGPT, a large language model, to provide extra supervision for the class description, eventually benefiting ZSL models and proposes a novel word vector fusion method."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}