{
    "acronym": "2fc07c84fffe2b9a591bfeb69924e4b95077b311",
    "title": "Marking: Visual Grading with Highlighting Errors and Annotating Missing Bits",
    "seed_ids": [
        "bert",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2fc07c84fffe2b9a591bfeb69924e4b95077b311",
    "abstract": "In this paper, we introduce\"Marking\", a novel grading task that enhances automated grading systems by performing an in-depth analysis of student responses and providing students with visual highlights. Unlike traditional systems that provide binary scores,\"marking\"identifies and categorizes segments of the student response as correct, incorrect, or irrelevant and detects omissions from gold answers. We introduce a new dataset meticulously curated by Subject Matter Experts specifically for this task. We frame\"Marking\"as an extension of the Natural Language Inference (NLI) task, which is extensively explored in the field of Natural Language Processing. The gold answer and the student response play the roles of premise and hypothesis in NLI, respectively. We subsequently train language models to identify entailment, contradiction, and neutrality from student response, akin to NLI, and with the added dimension of identifying omissions from gold answers. Our experimental setup involves the use of transformer models, specifically BERT and RoBERTa, and an intelligent training step using the e-SNLI dataset. We present extensive baseline results highlighting the complexity of the\"Marking\"task, which sets a clear trajectory for the upcoming study. Our work not only opens up new avenues for research in AI-powered educational assessment tools, but also provides a valuable benchmark for the AI in education community to engage with and improve upon in the future. The code and dataset can be found at https://github.com/luffycodes/marking.",
    "authors": [
        "Shashank Sonkar",
        "Naiming Liu",
        "D. B. Mallick",
        "R. Baraniuk"
    ],
    "venue": "International Conference on Artificial Intelligence in Education",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel grading task that enhances automated grading systems by performing an in-depth analysis of student responses and providing students with visual highlights, andTrain language models to identify entailment, contradiction, and neutrality from student response, akin to NLI, and with the added dimension of identifying omissions from gold answers."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}