{
    "acronym": "2fd5de4b4f75234f980157b00e4db8af7a228578",
    "title": "The Locality and Symmetry of Positional Encodings",
    "seed_ids": [
        "alibi",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "6f6e2e0311589a9af045f6acd00b7dee6d19fce4",
        "a2fc77f075f666b462d9350e7576f0ba9845c61b",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "7072db6eddb85ecd2c117365d91bd694760f726e",
        "0822f8d7e6a72a65e65f147d3a8d8fccd485da40",
        "4889ba5a8ae8b2169dd44d1d3a605bf9820bae8d",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "dc35daba3fb34b2e6a5b12530badb7b799262bbf"
    ],
    "s2id": "2fd5de4b4f75234f980157b00e4db8af7a228578",
    "abstract": "Positional Encodings (PEs) are used to inject word-order information into transformer-based language models. While they can significantly enhance the quality of sentence representations, their specific contribution to language models is not fully understood, especially given recent findings that various positional encodings are insensitive to word order. In this work, we conduct a systematic study of positional encodings in \\textbf{Bidirectional Masked Language Models} (BERT-style) , which complements existing work in three aspects: (1) We uncover the core function of PEs by identifying two common properties, Locality and Symmetry; (2) We show that the two properties are closely correlated with the performances of downstream tasks; (3) We quantify the weakness of current PEs by introducing two new probing tasks, on which current PEs perform poorly. We believe that these results are the basis for developing better PEs for transformer-based language models. The code is available at \\faGithub~ \\url{https://github.com/tigerchen52/locality\\_symmetry}",
    "authors": [
        "Lihu Chen",
        "G. Varoquaux",
        "Fabian M. Suchanek"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A systematic study of positional encodings in Bidirectional Masked Language Models (BERT-style) complements existing work in three aspects and uncovers the core function of PEs by identifying two common properties, Locality and Symmetry."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}