{
    "acronym": "2fe234d4a06e5df9d3e5bbb8c2cc45d240b2723a",
    "title": "PaperCard for Reporting Machine Assistance in Academic Writing",
    "seed_ids": [
        "gpt2",
        "8af69a903a14657ec96b93c4b6e139771beec106",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "2fe234d4a06e5df9d3e5bbb8c2cc45d240b2723a",
    "abstract": "Academic writing process has benefited from various technological developments over the years including search engines, automatic translators, and editing tools that review grammar and spelling mistakes. They have enabled human writers to become more efficient in writing academic papers, for example by helping with finding relevant literature more effectively and polishing texts. While these developments have so far played a relatively assistive role, recent advances in large-scale language models (LLMs) have enabled LLMs to play a more major role in the writing process, such as coming up with research questions and generating key contents. This raises critical questions surrounding the concept of authorship in academia. ChatGPT, a question-answering system released by OpenAI in November 2022, has demonstrated a range of capabilities that could be utilised in producing academic papers. The academic community will have to address relevant pressing questions, including whether Artificial Intelligence (AI) should be merited authorship if it made significant contributions in the writing process, or whether its use should be restricted such that human authorship would not be undermined. In this paper, we aim to address such questions, and propose a framework we name\"PaperCard\", a documentation for human authors to transparently declare the use of AI in their writing process.",
    "authors": [
        "Won Ik Cho",
        "Eunjung Cho",
        "Kyunghyun Cho"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a framework, named PaperCard, a documentation for human authors to transparently declare the use of AI in their writing process, and aims to address critical questions surrounding the concept of authorship in academia."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}