{
    "acronym": "2ff0fb7e804a47b3a7fc6957f58fb65aa01ba12a",
    "title": "ST-RetNet: A Long-term Spatial-Temporal Traffic Flow Prediction Method",
    "seed_ids": [
        "retnet",
        "240103933ffe3dac2179cc160a2bd91299357a53"
    ],
    "s2id": "2ff0fb7e804a47b3a7fc6957f58fb65aa01ba12a",
    "abstract": "Traffic flow forecasting is considered a critical task in the field of intelligent transportation systems. In this paper, to address the issue of low accuracy in long-term forecasting of spatial-temporal big data on traffic flow, we propose an innovative model called Spatial-Temporal Retentive Network (ST-RetNet). We extend the Retentive Network to address the task of traffic flow forecasting. At the spatial scale, we integrate a topological graph structure into Spatial Retentive Network(S-RetNet), utilizing an adaptive adjacency matrix to extract dynamic spatial features of the road network. We also employ Graph Convolutional Networks to extract static spatial features of the road network. These two components are then fused to capture dynamic and static spatial correlations. At the temporal scale, we propose the Temporal Retentive Network(T-RetNet), which has been demonstrated to excel in capturing long-term dependencies in traffic flow patterns compared to other time series models, including Recurrent Neural Networks based and transformer models. We achieve the spatial-temporal traffic flow forecasting task by integrating S-RetNet and T-RetNet to form ST-RetNet. Through experimental comparisons conducted on four real-world datasets, we demonstrate that ST-RetNet outperforms the state-of-the-art approaches in traffic flow forecasting.",
    "authors": [
        "Baichao Long",
        "Wang Zhu",
        "Jianli Xiao"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper achieves the spatial-temporal traffic flow forecasting task by integrating S-RetNet and T-RetNet to form ST-RetNet and demonstrates that ST-RetNet outperforms the state-of-the-art approaches in traffic flow forecasting."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}