{
    "acronym": "300a777ba6598a8ff3c949a94fd31b5573ce2654",
    "title": "Implementation of Image Generative models using ImageGPT",
    "seed_ids": [
        "gpt2",
        "5697a0ede5425954d48daa6e1893dc87bd7d8be7",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "300a777ba6598a8ff3c949a94fd31b5573ce2654",
    "abstract": "Motivated by advancements in unsupervised representation learning for natural language, this paper sought to investigate whether comparable models could also generate useful representations for images. Using a sequence Transformer, we trained the model to autonomously predict pixels. GPT-2 scale model achieved impressive results, displaying robust image representations. To achieve the desired outcome, we implemented a two-stage approach, involving pre-training and fine-tuning. During the pre-training stage, we experimented with both autoregressive and GPT objectives. Based on findings, it appears that generative image modeling remains a promising avenue for acquiring high-quality, unsupervised image representations. This study will come in useful whenever there is a need for image completion. Given any random half image, the model will try to predict completed version of the image in multiple forms, which can be extended later to facial recognition, object identification as well as it might find its use in healthcare domain.",
    "authors": [
        "Payel Dutta",
        "Kaustuv Kunal"
    ],
    "venue": "2023 International Conference on New Frontiers in Communication, Automation, Management and Security (ICCAMS)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It appears that generative image modeling remains a promising avenue for acquiring high-quality, unsupervised image representations."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}