{
    "acronym": "306113d470ca518cd501a882ffe6dd35d548d713",
    "title": "Towards End-to-End Generative Modeling of Long Videos with Memory-Efficient Bidirectional Transformers",
    "seed_ids": [
        "luna",
        "f39f24210d413b6cc785d029851b59b54ce47d88",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "af679d69fcc1d0fcf0f039aba937853bcb50a8de",
        "2d9ae4c167510ed78803735fc57ea67c3cc55a35",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06"
    ],
    "s2id": "306113d470ca518cd501a882ffe6dd35d548d713",
    "abstract": "Autoregressive transformers have shown remarkable success in video generation. However, the transformers are prohibited from directly learning the longterm dependency in videos due to the quadratic complexity of self-attention, and inherently suffering from slow inference time and error propagation due to the autoregressive process. In this paper, we propose Memory-efficient Bidirectional Transformer (MeBT) for end-to-end learning of longterm dependency in videos and fast inference. Based on recent advances in bidirectional transformers, our method learns to decode the entire spatio-temporal volume of a video in parallel from partially observed patches. The proposed transformer achieves a linear time complexity in both encoding and decoding, by projecting observable context tokens into a fixed number of latent tokens and conditioning them to decode the masked tokens through the cross-attention. Empowered by linear complexity and bidirectional modeling, our method demonstrates significant improvement over the autoregressive transformers for generating moderately long videos in both quality and speed. Videos and code are available at https://sites.google.com/view/mebt-cvpr2023.",
    "authors": [
        "J. Yoo",
        "Semin Kim",
        "Doyup Lee",
        "Chiheon Kim",
        "Seunghoon Hong"
    ],
    "venue": "Computer Vision and Pattern Recognition",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Memory-efficient Bidirectional Transformer (MeBT) is proposed for end-to-end learning of longterm dependency in videos and fast inference, and demonstrates significant improvement over the autoregressive transformers for generating moderately long videos in both quality and speed."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}