{
    "acronym": "30bfb0a8801c8e8ba65a6009027839ac34cd374e",
    "title": "On Sensitivity of Learning with Limited Labelled Data to the Effects of Randomness: Impact of Interactions and Systematic Choices",
    "seed_ids": [
        "bert",
        "7011bf9aa7e68fabaa1df498da6d2dd8a950f037",
        "dc385646887a3669ae0ee506a263d592f4f7c7a6",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a"
    ],
    "s2id": "30bfb0a8801c8e8ba65a6009027839ac34cd374e",
    "abstract": "While learning with limited labelled data can improve performance when the labels are lacking, it is also sensitive to the effects of uncontrolled randomness introduced by so-called randomness factors (e.g., varying order of data). We propose a method to systematically investigate the effects of randomness factors while taking the interactions between them into consideration. To measure the true effects of an individual randomness factor, our method mitigates the effects of other factors and observes how the performance varies across multiple runs. Applying our method to multiple randomness factors across in-context learning and fine-tuning approaches on 7 representative text classification tasks and meta-learning on 3 tasks, we show that: 1) disregarding interactions between randomness factors in existing works caused inconsistent findings due to incorrect attribution of the effects of randomness factors, such as disproving the consistent sensitivity of in-context learning to sample order even with random sample selection; and 2) besides mutual interactions, the effects of randomness factors, especially sample order, are also dependent on more systematic choices unexplored in existing works, such as number of classes, samples per class or choice of prompt format.",
    "authors": [
        "Branislav Pecher",
        "Ivan Srba",
        "M. Bieliková"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a method to systematically investigate the effects of randomness factors while taking the interactions between them into consideration, and mitigates the effects of other factors to measure the true effects of an individual randomness factor."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}