{
    "acronym": "30c593cf0714f184ca95fe6af3d1561949e7ab08",
    "title": "Deceiving Deep Learning-based Fraud SMS Detection Models through Adversarial Attacks",
    "seed_ids": [
        "bert"
    ],
    "s2id": "30c593cf0714f184ca95fe6af3d1561949e7ab08",
    "abstract": "Short Messaging Service (SMS) is one of the most extensively utilized mobile applications for communication around the world. Smishing is the technique of delivering harmful SMS to users in which intruders send malicious SMS to the victim. This content may contain links that direct the user to websites that contain harmful software and user interfaces. Researchers have acquired outstanding accuracy scores in proposing SMS spam detectors utilizing transformer-based deep learning algorithms. Despite their superior performance in Natural Language Processing-related tasks, deep learning models are vulnerable to adversarial attacks that result in misclassification. A few words or characters are altered to create adversarial text, fooling the machine into making inaccurate predictions. This research aims to analyze the security weaknesses of the smishing detection method by employing advanced attack techniques to generate adversarial text. In this study, we conducted a comparative analysis of various transformer models, including BERT, DistilBERT and RoBERTa. These models were trained on the SMS spam dataset, which is often used for detecting fraudulent SMS messages. Through our analysis, we examined and evaluated the behavior of these models to know which model is more vulnerable or which is more robust. The prospective outcomes have been assessed by the computation of Attack Success Rates (ASR) for each model. The findings indicate the feasibility of circumventing automated spam SMS detection systems, hence highlighting potential implications for existing regulatory interventions.",
    "authors": [
        "Ashish Bajaj",
        "D. Vishwakarma"
    ],
    "venue": "International Conference on Signal-Image Technology and Internet-Based Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A comparative analysis of various transformer models, including BERT, DistilBERT and RoBERTa, shows the feasibility of circumventing automated spam SMS detection systems and highlights potential implications for existing regulatory interventions."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}