{
    "acronym": "313e173855daa7976cabcf3742e011a74088062d",
    "title": "Optimal Partial Transport Based Sentence Selection for Long-form Document Matching",
    "seed_ids": [
        "longformer",
        "transformerxl",
        "6702d9ef324f5e7fd8e24163399a820dd3fcc929",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "313e173855daa7976cabcf3742e011a74088062d",
    "abstract": "One typical approach to long-form document matching is first conducting alignment between cross-document sentence pairs, and then aggregating all of the sentence-level matching signals. However, this approach could be problematic because the alignment between documents is partial — despite two documents as a whole are well-matched, most of the sentences could still be dissimilar. Those dissimilar sentences lead to spurious sentence-level matching signals which may overwhelm the real ones, increasing the difficulties of learning the matching function. Therefore, accurately selecting the key sentences for document matching is becoming a challenging issue. To address the issue, we propose a novel matching approach that equips existing document matching models with an Optimal Partial Transport (OPT) based component, namely OPT-Match, which selects the sentences that play a major role in matching. Enjoying the partial transport properties of OPT, the selected key sentences can not only effectively enhance the matching accuracy, but also be explained as the rationales for the matching results. Extensive experiments on four publicly available datasets demonstrated that existing methods equipped with OPT-Match consistently outperformed the corresponding underlying methods. Evaluations also showed that the key sentences selected by OPT-Match were consistent with human-provided rationales.",
    "authors": [
        "Weijie Yu",
        "Liang Pang",
        "Jun Xu",
        "Bing Su",
        "Zhenhua Dong",
        "Jirong Wen"
    ],
    "venue": "International Conference on Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel matching approach that equips existing document matching models with an Optimal Partial Transport (OPT) based component, namely OPT-Match, which selects the sentences that play a major role in matching, and demonstrates that existing methods equipped with OPT- match consistently outperformed the corresponding underlying methods."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}