{
    "acronym": "315d7a58fada47c5729645f0af8ddfaa0743f82f",
    "title": "Exploiting Diffusion Prior for Real-World Image Super-Resolution",
    "seed_ids": [
        "classfreediffu",
        "7d5c60dcd838c62b3c3697745bef07ed824d41d3",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "315d7a58fada47c5729645f0af8ddfaa0743f82f",
    "abstract": "We present a novel approach to leverage prior knowledge encapsulated in pre-trained text-to-image diffusion models for blind super-resolution (SR). Specifically, by employing our time-aware encoder, we can achieve promising restoration results without altering the pre-trained synthesis model, thereby preserving the generative prior and minimizing training cost. To remedy the loss of fidelity caused by the inherent stochasticity of diffusion models, we introduce a controllable feature wrapping module that allows users to balance quality and fidelity by simply adjusting a scalar value during the inference process. Moreover, we develop a progressive aggregation sampling strategy to overcome the fixed-size constraints of pre-trained diffusion models, enabling adaptation to resolutions of any size. A comprehensive evaluation of our method using both synthetic and real-world benchmarks demonstrates its superiority over current state-of-the-art approaches.",
    "authors": [
        "Jianyi Wang",
        "Zongsheng Yue",
        "Shangchen Zhou",
        "Kelvin C. K. Chan",
        "Chen Change Loy"
    ],
    "venue": "International Journal of Computer Vision",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "To remedy the loss of fidelity caused by the inherent stochasticity of diffusion models, this work introduces a controllable feature wrapping module that allows users to balance quality and fidelity by simply adjusting a scalar value during the inference process."
    },
    "citationCount": 108,
    "influentialCitationCount": 36,
    "code": null,
    "description": null,
    "url": null
}