{
    "acronym": "315f0f5d971f7e04c3ef168df48a52a4a4278829",
    "title": "Efficient Speech Translation with Dynamic Latent Perceivers",
    "seed_ids": [
        "perceiverio",
        "12809bcb734beafeb47876f42e7b438e27fe99fe",
        "a8e61923b1404eb7ae286e4ec407a3e3f925f788",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a"
    ],
    "s2id": "315f0f5d971f7e04c3ef168df48a52a4a4278829",
    "abstract": "Transformers have been the dominant architecture for Speech Translation in recent years, achieving significant improvements in translation quality. Since speech signals are longer than their textual counterparts, and due to the quadratic complexity of the Transformer, a down-sampling step is essential for its adoption in Speech Translation. Instead, in this research, we propose to ease the complexity by using a Perceiver encoder to map the speech inputs to a fixed-length latent representation. Furthermore, we introduce a novel way of training Perceivers, with Dynamic Latent Access (DLA), unlocking larger latent spaces without any additional computational overhead. Speech-to-Text Perceivers with DLA can match the performance of Transformer baselines across three language pairs in MuST-C. Finally, a DLA-trained model is easily adaptable to DLA at inference, and can be flexibly deployed with various computational budgets, without significant drops in translation quality.",
    "authors": [
        "Ioannis Tsiamas",
        "Gerard I. Gállego",
        "José A. R. Fonollosa",
        "Marta R. Costa-juss'a"
    ],
    "venue": "IEEE International Conference on Acoustics, Speech, and Signal Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This research proposes to ease the complexity of Transformer adoption by using a Perceiver encoder to map the speech inputs to a fixed-length latent representation, and introduces a novel way of training Perceivers, with Dynamic Latent Access (DLA), unlocking larger latent spaces without any additional computational overhead."
    },
    "citationCount": 2,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}