{
    "acronym": "31947145652dd384fbc8b2abef02779bb95c7a72",
    "title": "Optimizing Time Series Forecasting Architectures: A Hierarchical Neural Architecture Search Approach",
    "seed_ids": [
        "transformer",
        "f45f85fa1beaa795c24c4ff86f1f2deece72252f",
        "afeeb8f5018eebb1a1d334b94dbbfc48d167efef",
        "d6a0dfd5f39222d8924b7727a0a49f81fa247d71",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "30dcc0e191a376fea0e7a46f94c53872c029efc9",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "31947145652dd384fbc8b2abef02779bb95c7a72",
    "abstract": "The rapid development of time series forecasting research has brought many deep learning-based modules in this field. However, despite the increasing amount of new forecasting architectures, it is still unclear if we have leveraged the full potential of these existing modules within a properly designed architecture. In this work, we propose a novel hierarchical neural architecture search approach for time series forecasting tasks. With the design of a hierarchical search space, we incorporate many architecture types designed for forecasting tasks and allow for the efficient combination of different forecasting architecture modules. Results on long-term-time-series-forecasting tasks show that our approach can search for lightweight high-performing forecasting architectures across different forecasting tasks.",
    "authors": [
        "Difan Deng",
        "Marius Lindauer"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel hierarchical neural architecture search approach for time series forecasting tasks that incorporates many architecture types designed for forecasting tasks and allow for the efficient combination of different forecasting architecture modules."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}