{
    "acronym": "31a5556d5d311a17a20bc9cfb6c7fed7c4efe66d",
    "title": "Unseen Filler Generalization In Attention-based Natural Language Reasoning Models",
    "seed_ids": [
        "universaltrans"
    ],
    "s2id": "31a5556d5d311a17a20bc9cfb6c7fed7c4efe66d",
    "abstract": "Recent natural language reasoning models have achieved human-level accuracy on several benchmark datasets such as bAbI. While the results are impressive, in this paper we argue by experiment analysis that several existing attention-based models have a hard time generalizing themselves to handle name entities not seen in the training data. We thus propose Unseen Filler Generalization (UFG) as a task along with two new datasets to evaluate the filler generalization capability of a natural language reasoning model. We also propose a simple yet general strategy that can be applied to various models to handle the UFG challenge through modifying the entity occurrence distribution in the training data. Such strategy allows the model to encounter unseen entities during training, and thus not to overfit to only a few specific name entities. Our experiments show that this strategy can significantly boost the filler generalization capability of three existing models including Entity Network, Working Memory Network, and Universal Transformers.",
    "authors": [
        "Chin-Hui Chen",
        "Yi-Fu Fu",
        "Hsiao-Hua Cheng",
        "Shou-de Lin"
    ],
    "venue": "International Conference on Cognitive Machine Intelligence",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper argues by experiment analysis that several existing attention-based models have a hard time generalizing themselves to handle name entities not seen in the training data, and proposes Unseen Filler Generalization (UFG) as a task along with two new datasets to evaluate the filler generalization capability of a natural language reasoning model."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}