{
    "acronym": "31b092d23154d3467d4a92065d77e8b441dfa440",
    "title": "A Communication Theory Perspective on Prompting Engineering Methods for Large Language Models",
    "seed_ids": [
        "gpt2",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "2029349c55c1dba3493c5b3bd25152f18ba21ae2",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "92173d081b15824d22a9ef070e118744ceee8052",
        "da454295392cf4caaa39cc465734237ffe55392f",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "31b092d23154d3467d4a92065d77e8b441dfa440",
    "abstract": "The springing up of Large Language Models (LLMs) has shifted the community from single-task-orientated natural language processing (NLP) research to a holistic end-to-end multi-task learning paradigm. Along this line of research endeavors in the area, LLM-based prompting methods have attracted much attention, partially due to the technological advantages brought by prompt engineering (PE) as well as the underlying NLP principles disclosed by various prompting methods. Traditional supervised learning usually requires training a model based on labeled data and then making predictions. In contrast, PE methods directly use the powerful capabilities of existing LLMs (i.e., GPT-3 and GPT-4) via composing appropriate prompts, especially under few-shot or zero-shot scenarios. Facing the abundance of studies related to the prompting and the ever-evolving nature of this field, this article aims to (i) illustrate a novel perspective to review existing PE methods, within the well-established communication theory framework; (ii) facilitate a better/deeper understanding of developing trends of existing PE methods used in four typical tasks; (iii) shed light on promising research directions for future PE methods.",
    "authors": [
        "Yuanfeng Song",
        "Yuanqin He",
        "Xuefang Zhao",
        "Hanlin Gu",
        "Di Jiang",
        "Haijun Yang",
        "Lixin Fan",
        "Qiang Yang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel perspective is illustrated to review existingPE methods, within the well-established communication theory framework to facilitate a better/deeper understanding of developing trends of existing PE methods used in four typical tasks and shed light on promising research directions for future PE methods."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}