{
    "acronym": "31ca9175ad5042a09046bf91e1bb414ef0ae0513",
    "title": "Permutation Equivariance of Transformers and Its Applications",
    "seed_ids": [
        "gpt2",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "31ca9175ad5042a09046bf91e1bb414ef0ae0513",
    "abstract": "Revolutionizing the field of deep learning, Transformer-based models have achieved remarkable performance in many tasks. Recent research has recognized these models are robust to shuffling but are limited to inter-token permutation in the forward propagation. In this work, we propose our definition of permutation equivariance, a broader concept covering both inter- and intra- token permutation in the forward and backward propagation of neural networks. We rigorously proved that such permutation equivariance property can be satisfied on most vanilla Transformer-based models with almost no adaptation. We examine the property over a range of state-of-the-art models including ViT, Bert, GPT, and others, with experimental validations. Further, as a proof-of-concept, we explore how real-world applications including privacy-enhancing split learning, and model authorization, could exploit the permutation equivariance property, which implicates wider, intriguing application scenarios.",
    "authors": [
        "Hengyuan Xu",
        "Liyao Xiang",
        "Hang Ye",
        "Dixi Yao",
        "Pengzhi Chu",
        "Baochun Li"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work rigorously proved that such permutation equivariance property can be satisfied on most vanilla Transformer-based models with almost no adaptation, and explores how real-world applications could exploit the permutation equivariance property, which implicates wider, intriguing application scenarios."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}