{
    "acronym": "31d062bef4fa9673fce4660d0a72f330e454fd3a",
    "title": "Post-Attention Modulator for Dense Video Captioning",
    "seed_ids": [
        "transformerxl",
        "70557ea6b65846fc30729ceed224acd4ac64ca5d"
    ],
    "s2id": "31d062bef4fa9673fce4660d0a72f330e454fd3a",
    "abstract": "Dense video captioning (VC) aims at generating a paragraph-long description for events in video segments. Borrowing from the success in language modeling, Transformer-based models for VC have been shown effective also in modeling cross-domain video-text representations with cross-attention (Xatt). Despite Xatt’s effectiveness, the queries and outputs of attention, which are from different domains, tend to be weakly related. In this paper, we argue that the weak relatedness, or domain discrepancy, could impede a model from learning meaningful cross-domain representations. Hence, we propose a simple yet effective Post-Attention Modulator (PAM) that post-processes Xatt’s outputs to narrow the discrepancy. Specifically, PAM modulates and enhances the average similarity over Xatt’s queries and outputs. The modulated similarities are then utilized as a weighting basis to interpolate PAM’s outputs. In our experiments, PAM was applied to two strong VC baselines, VTransformer and MART, with two different video features on the well-known VC benchmark datasets ActivityNet Captions and YouCookII. According to the results, the proposed PAM brings consistent improvements in, e.g., CIDEr-D at most to 14.5%, as well as other metrics, BLEU and METEOR, considered.",
    "authors": [
        "Zixin Guo",
        "T. Wang",
        "J. Laaksonen"
    ],
    "venue": "International Conference on Pattern Recognition",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is argued that the weak relatedness, or domain discrepancy, could impede a model from learning meaningful cross-domain representations and proposed Post-Attention Modulator (PAM) modulates and enhances the average similarity over Xatt’s queries and outputs."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}