{
    "acronym": "31d65e179b1d00484154b3525d93846dd82f23d8",
    "title": "Inverse Scaling: When Bigger Isn't Better",
    "seed_ids": [
        "gpt2",
        "6fb0b072c4fcdc0c78218bfd1b181fd562f07cd2",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "92173d081b15824d22a9ef070e118744ceee8052",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "4d16457cded23bce6eaa91cd17aefd22af2279f0",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "31d65e179b1d00484154b3525d93846dd82f23d8",
    "abstract": "Work on scaling laws has found that large language models (LMs) show predictable improvements to overall loss with increased scale (model size, training data, and compute). Here, we present evidence for the claim that LMs may show inverse scaling, or worse task performance with increased scale, e.g., due to flaws in the training objective and data. We present empirical evidence of inverse scaling on 11 datasets collected by running a public contest, the Inverse Scaling Prize, with a substantial prize pool. Through analysis of the datasets, along with other examples found in the literature, we identify four potential causes of inverse scaling: (i) preference to repeat memorized sequences over following in-context instructions, (ii) imitation of undesirable patterns in the training data, (iii) tasks containing an easy distractor task which LMs could focus on, rather than the harder real task, and (iv) correct but misleading few-shot demonstrations of the task. We release the winning datasets at https://inversescaling.com/data to allow for further investigation of inverse scaling. Our tasks have helped drive the discovery of U-shaped and inverted-U scaling trends, where an initial trend reverses, suggesting that scaling trends are less reliable at predicting the behavior of larger-scale models than previously understood. Overall, our results suggest that there are tasks for which increased model scale alone may not lead to progress, and that more careful thought needs to go into the data and objectives for training language models.",
    "authors": [
        "I. R. McKenzie",
        "Alexander Lyzhov",
        "M. Pieler",
        "Alicia Parrish",
        "Aaron Mueller",
        "Ameya Prabhu",
        "Euan McLean",
        "Aaron Kirtland",
        "Alexis Ross",
        "Alisa Liu",
        "Andrew Gritsevskiy",
        "Daniel Wurgaft",
        "Derik Kauffman",
        "Gabriel Recchia",
        "Jiacheng Liu",
        "Joe Cavanagh",
        "Max Weiss",
        "Sicong Huang",
        "The Floating Droid",
        "Tom Tseng",
        "Tomasz Korbak",
        "Xudong Shen",
        "Yuhui Zhang",
        "Zhengping Zhou",
        "Najoung Kim",
        "Sam Bowman",
        "Ethan Perez"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Overall, the results suggest that there are tasks for which increased model scale alone may not lead to progress, and that more careful thought needs to go into the data and objectives for training language models."
    },
    "citationCount": 74,
    "influentialCitationCount": 8,
    "code": null,
    "description": null,
    "url": null
}