{
    "acronym": "31fdba3a68f286894f025e734a277e2ce94dd84c",
    "title": "MambaOut: Do We Really Need Mamba for Vision?",
    "seed_ids": [
        "gpt",
        "s4",
        "mamba",
        "47741d9e57f7a986a350f5cb20de287b1b1b8ff8",
        "cbaf689fd9ea9bc939510019d90535d6249b3367",
        "62ac3ef81e54e1d1930fb5980b236345ee2e4f32",
        "fea8a3096391a418cb9ef724e0ff9754e5a467fd",
        "5867382590f9f0ff8caf15804d20bde10845b2d2",
        "b24e899ec0f77eef2fc87a9b8e50516367aa1f97",
        "38c48a1cd296d16dc9c56717495d6e44cc354444",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "182e6c877155d7730378846380a3d1dc294fb54a",
        "fc4cbc7a75f5a3bbca59db5513231555f078fe78",
        "d1869155960e4b1b882b39171dbecd25a7eda3cd",
        "fa717a2e31f0cef4e26921f3b147a98644d2e64c",
        "ba637c4f1a170f1e2dadeadb71a63cf2b9a46de2",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "d5e999aae76d5270ef272076979c809817458212",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "2a218786f4615b82389f78472e7ff22e6ce57490",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "0b991a1a5bcdb13646ac0b6873d09bde4cc36fb5",
        "8af925f4edf45131b5b6fed8aa655089d58692fa",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "5a9bc55f6332e38f62eb509b684147a1d4f10fd9",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "31fdba3a68f286894f025e734a277e2ce94dd84c",
    "abstract": "Mamba, an architecture with RNN-like token mixer of state space model (SSM), was recently introduced to address the quadratic complexity of the attention mechanism and subsequently applied to vision tasks. Nevertheless, the performance of Mamba for vision is often underwhelming when compared with convolutional and attention-based models. In this paper, we delve into the essence of Mamba, and conceptually conclude that Mamba is ideally suited for tasks with long-sequence and autoregressive characteristics. For vision tasks, as image classification does not align with either characteristic, we hypothesize that Mamba is not necessary for this task; Detection and segmentation tasks are also not autoregressive, yet they adhere to the long-sequence characteristic, so we believe it is still worthwhile to explore Mamba's potential for these tasks. To empirically verify our hypotheses, we construct a series of models named MambaOut through stacking Mamba blocks while removing their core token mixer, SSM. Experimental results strongly support our hypotheses. Specifically, our MambaOut model surpasses all visual Mamba models on ImageNet image classification, indicating that Mamba is indeed unnecessary for this task. As for detection and segmentation, MambaOut cannot match the performance of state-of-the-art visual Mamba models, demonstrating the potential of Mamba for long-sequence visual tasks. The code is available at https://github.com/yuweihao/MambaOut",
    "authors": [
        "Weihao Yu",
        "Xinchao Wang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper conceptually concludes that Mamba is ideally suited for tasks with long-sequence and autoregressive characteristics, and constructs a series of models named MambaOut, which surpasses all visual Mamba models on ImageNet image classification and demonstrates the potential of Mamba for long-sequence visual tasks."
    },
    "citationCount": 11,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}