{
    "acronym": "3227e2165c73956a126a8d13c7bf723affcc95f7",
    "title": "ORKG-Leaderboards: a systematic workflow for mining leaderboards as a knowledge graph",
    "seed_ids": [
        "bigbird",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "3227e2165c73956a126a8d13c7bf723affcc95f7",
    "abstract": "The purpose of this work is to describe the orkg -Leaderboard software designed to extract leaderboards defined as task–dataset–metric tuples automatically from large collections of empirical research papers in artificial intelligence (AI). The software can support both the main workflows of scholarly publishing, viz. as LaTeX files or as PDF files. Furthermore, the system is integrated with the open research knowledge graph (ORKG) platform, which fosters the machine-actionable publishing of scholarly findings. Thus, the systemsss output, when integrated within the ORKG’s supported Semantic Web infrastructure of representing machine-actionable ‘resources’ on the Web, enables: (1) broadly, the integration of empirical results of researchers across the world, thus enabling transparency in empirical research with the potential to also being complete contingent on the underlying data source(s) of publications; and (2) specifically, enables researchers to track the progress in AI with an overview of the state-of-the-art across the most common AI tasks and their corresponding datasets via dynamic ORKG frontend views leveraging tables and visualization charts over the machine-actionable data. Our best model achieves performances above 90% F1 on the leaderboard extraction task, thus proving orkg -Leaderboards a practically viable tool for real-world usage. Going forward, in a sense, orkg -Leaderboards transforms the leaderboard extraction task to an automated digitalization task, which has been, for a long time in the community, a crowdsourced endeavor.",
    "authors": [
        "Salomon Kabongo KABENAMUALU",
        "J. D’Souza",
        "S. Auer"
    ],
    "venue": "International Journal on Digital Libraries",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The best model achieves performances above 90% F1 on the leaderboard extraction task, thus proving orkg -Leaderboards a practically viable tool for real-world usage."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}