{
    "acronym": "32457b4527dbcce35da25b5fc89b86bd926cc0ea",
    "title": "XDLM: Cross-lingual Diffusion Language Model for Machine Translation",
    "seed_ids": [
        "reparamdiscdiffu",
        "1f898d66acabff511a3871b82799aa73c0055402",
        "a1186d7d9a9ef258c76afef1177e4f348061a537",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "24425954960ce968e5f14360fbdd0605abcadfcf",
        "e512964293671abbdc409f313d127cbe85ffe5cd"
    ],
    "s2id": "32457b4527dbcce35da25b5fc89b86bd926cc0ea",
    "abstract": "Recently, diffusion models have excelled in image generation tasks and have also been applied to neural language processing (NLP) for controllable text generation. However, the application of diffusion models in a cross-lingual setting is less unexplored. Additionally, while pretraining with diffusion models has been studied within a single language, the potential of cross-lingual pretraining remains understudied. To address these gaps, we propose XDLM, a novel Cross-lingual diffusion model for machine translation, consisting of pretraining and fine-tuning stages. In the pretraining stage, we propose TLDM, a new training objective for mastering the mapping between different languages; in the fine-tuning stage, we build up the translation system based on the pretrained model. We evaluate the result on several machine translation benchmarks and outperformed both diffusion and Transformer baselines.",
    "authors": [
        "Linyao Chen",
        "Aosong Feng",
        "Boming Yang",
        "Zihui Li"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "XDLM is proposed, a novel Cross-lingual diffusion model for machine translation, consisting of pretraining and fine-tuning stages, and TLDM, a new training objective for mastering the mapping between different languages."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}