{
    "acronym": "3266981f8129e839d04c0a6524f1e81a2fea54d6",
    "title": "LLM4CP: Adapting Large Language Models for Channel Prediction",
    "seed_ids": [
        "transformer",
        "1c66c41ff22adf66bb9b06d87d5a2ab7b8ee8de7",
        "16f01c1b3ddd0b2abd5ddfe4fdb3f74767607277",
        "5b7f5488c380cf5085a5dd93e993ad293b225eee",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3266981f8129e839d04c0a6524f1e81a2fea54d6",
    "abstract": "Channel prediction is an effective approach for reducing the feedback or estimation overhead in massive multi-input multi-output (m-MIMO) systems. However, existing channel prediction methods lack precision due to model mismatch errors or network generalization issues. Large language models (LLMs) have demonstrated powerful modeling and generalization abilities, and have been successfully applied to cross-modal tasks, including the time series analysis. Leveraging the expressive power of LLMs, we propose a pre-trained LLM-empowered channel prediction method (LLM4CP) to predict the future downlink channel state information (CSI) sequence based on the historical uplink CSI sequence. We fine-tune the network while freezing most of the parameters of the pre-trained LLM for better cross-modality knowledge transfer. To bridge the gap between the channel data and the feature space of the LLM, preprocessor, embedding, and output modules are specifically tailored by taking into account unique channel characteristics. Simulations validate that the proposed method achieves SOTA prediction performance on full-sample, few-shot, and generalization tests with low training and inference costs.",
    "authors": [
        "Boxun Liu",
        "Xuanyu Liu",
        "Shijian Gao",
        "Xiang Cheng",
        "Liuqing Yang"
    ],
    "venue": "Journal of Communications and Information Networks",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a pre-trained LLM-empowered channel prediction method (LLM4CP) to predict the future downlink channel state information (CSI) sequence based on the historical uplink CSI sequence and demonstrates that the proposed method achieves SOTA prediction performance on full-sample, few-shot, and generalization tests with low training and inference costs."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}