{
    "acronym": "32733e5d5a18bfb2f5d79639ab5d1727cc84783d",
    "title": "Who Wrote This? The Key to Zero-Shot LLM-Generated Text Detection Is GECScore",
    "seed_ids": [
        "gpt2",
        "bert",
        "1c13af186d1e177b85ef1ec3fc7b8d33ec314cfd",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "11beca761c3079f7612204ed1b241ee8832107c9",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "32733e5d5a18bfb2f5d79639ab5d1727cc84783d",
    "abstract": "The efficacy of an large language model (LLM) generated text detector depends substantially on the availability of sizable training data. White-box zero-shot detectors, which require no such data, are nonetheless limited by the accessibility of the source model of the LLM-generated text. In this paper, we propose an simple but effective black-box zero-shot detection approach, predicated on the observation that human-written texts typically contain more grammatical errors than LLM-generated texts. This approach entails computing the Grammar Error Correction Score (GECScore) for the given text to distinguish between human-written and LLM-generated text. Extensive experimental results show that our method outperforms current state-of-the-art (SOTA) zero-shot and supervised methods, achieving an average AUROC of 98.7% and showing strong robustness against paraphrase and adversarial perturbation attacks.",
    "authors": [
        "Junchao Wu",
        "Runzhe Zhan",
        "Derek F. Wong",
        "Shu Yang",
        "Xuebo Liu",
        "Lidia S. Chao",
        "Min Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes an simple but effective black-box zero-shot detection approach, predicated on the observation that human-written texts typically contain more grammatical errors than LLM-generated texts."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}