{
    "acronym": "329a0da2f61fc5c954c0a1faf97a7b4d9c34ad07",
    "title": "DiffCap: Exploring Continuous Diffusion on Image Captioning",
    "seed_ids": [
        "diffusionlm",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "599bc7cfe98c2b57ddbe111412203a636da57be0",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "329a0da2f61fc5c954c0a1faf97a7b4d9c34ad07",
    "abstract": "Current image captioning works usually focus on generating descriptions in an autoregressive manner. However, there are limited works that focus on generating descriptions non-autoregressively, which brings more decoding diversity. Inspired by the success of diffusion models on generating natural-looking images, we propose a novel method DiffCap to apply continuous diffusions on image captioning. Unlike image generation where the output is fixed-size and continuous, image description length varies with discrete tokens. Our method transforms discrete tokens in a natural way and applies continuous diffusion on them to successfully fuse extracted image features for diffusion caption generation. Our experiments on COCO dataset demonstrate that our method uses a much simpler structure to achieve comparable results to the previous non-autoregressive works. Apart from quality, an intriguing property of DiffCap is its high diversity during generation, which is missing from many autoregressive models. We believe our method on fusing multimodal features in diffusion language generation will inspire more researches on multimodal language generation tasks for its simplicity and decoding flexibility.",
    "authors": [
        "Yufeng He",
        "Zefan Cai",
        "Xu Gan",
        "Baobao Chang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel method DiffCap to apply continuous diffusions on image captioning to fuse multi-modal features in diffusion language generation and believes it will inspire more researches on multimodal language generation tasks for its simplicity and decoding flexibility."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}