{
    "acronym": "32a6f4b74b911891a1d6547710b571485111c45f",
    "title": "MoViT: Memorizing Vision Transformers for Medical Image Analysis",
    "seed_ids": [
        "memorizingtrans",
        "0e802c0739771acf70e60d59c2df51cd7e8c50c0",
        "2d98048c2d2fcd3f6b989d2a54003808906ab4b7"
    ],
    "s2id": "32a6f4b74b911891a1d6547710b571485111c45f",
    "abstract": "The synergy of long-range dependencies from transformers and local representations of image content from convolutional neural networks (CNNs) has led to advanced architectures and increased performance for various medical image analysis tasks due to their complementary benefits. However, compared with CNNs, transformers require considerably more training data, due to a larger number of parameters and an absence of inductive bias. The need for increasingly large datasets continues to be problematic, particularly in the context of medical imaging, where both annotation efforts and data protection result in limited data availability. In this work, inspired by the human decision-making process of correlating new \"evidence\" with previously memorized \"experience\", we propose a Memorizing Vision Transformer (MoViT) to alleviate the need for large-scale datasets to successfully train and deploy transformer-based architectures. MoViT leverages an external memory structure to cache history attention snapshots during the training stage. To prevent overfitting, we incorporate an innovative memory update scheme, attention temporal moving average, to update the stored external memories with the historical moving average. For inference speedup, we design a prototypical attention learning method to distill the external memory into smaller representative subsets. We evaluate our method on a public histology image dataset and an in-house MRI dataset, demonstrating that MoViT applied to varied medical image analysis tasks, can outperform vanilla transformer models across varied data regimes, especially in cases where only a small amount of annotated data is available. More importantly, MoViT can reach a competitive performance of ViT with only 3.0% of the training data. In conclusion, MoViT provides a simple plug-in for transformer architectures which may contribute to reducing the training data needed to achieve acceptable models for a broad range of medical image analysis tasks.",
    "authors": [
        "Yiqing Shen",
        "Pengfei Guo",
        "Jinpu Wu",
        "Qi Huang",
        "Jinyuan Zhou",
        "Shanshan Jiang",
        "M. Unberath"
    ],
    "venue": "MLMI@MICCAI",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Memorizing Vision Transformer (MoViT) is proposed to alleviate the need for large-scale datasets to successfully train and deploy transformer-based architectures, and provides a simple plug-in for transformer architectures which may contribute to reducing the training data needed to achieve acceptable models for a broad range of medical image analysis tasks."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}