{
    "acronym": "32b3553d7dc8a263c63d32eeec2916d1647ab178",
    "title": "DiVAE: Photorealistic Images Synthesis with Denoising Diffusion Decoder",
    "seed_ids": [
        "classfreediffu",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8"
    ],
    "s2id": "32b3553d7dc8a263c63d32eeec2916d1647ab178",
    "abstract": "Recently most successful image synthesis models are multi stage process to combine the advantages of different methods, which always includes a VAE-like model for faithfully reconstructing embedding to image and a prior model to generate image embedding. At the same time, diffusion models have shown be capacity to generate high-quality synthetic images. Our work proposes a VQ-VAE architecture model with a diffusion decoder (DiVAE) to work as the reconstructing component in image synthesis. We explore how to input image embedding into diffusion model for excellent performance and find that simple modification on diffusion's UNet can achieve it. Training on ImageNet, Our model achieves state-of-the-art results and generates more photorealistic images specifically. In addition, we apply the DiVAE with an Auto-regressive generator on conditional synthesis tasks to perform more human-feeling and detailed samples.",
    "authors": [
        "Jie Shi",
        "Chenfei Wu",
        "Jian Liang",
        "Xiang Liu",
        "Nan Duan"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a VQ-VAE architecture model with a diffusion decoder (DiVAE) to work as the reconstructing component in image synthesis and explores how to input image embedding into diffusion model for excellent performance and finds that simple modification on diffusion's UNet can achieve it."
    },
    "citationCount": 16,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}