{
    "acronym": "32cd4caddc7799050d2e5594eee3af7160676412",
    "title": "The Longest Month: Analyzing COVID-19 Vaccination Opinions Dynamics From Tweets in the Month Following the First Vaccine Announcement",
    "seed_ids": [
        "gpt"
    ],
    "s2id": "32cd4caddc7799050d2e5594eee3af7160676412",
    "abstract": "The coronavirus outbreak has brought unprecedented measures, which forced the authorities to make decisions related to the instauration of lockdowns in the areas most hit by the pandemic. Social media has been an important support for people while passing through this difficult period. On November 9, 2020, when the first vaccine with more than 90% effective rate has been announced, the social media has reacted and people worldwide have started to express their feelings related to the vaccination, which was no longer a hypothesis but closer, each day, to become a reality. The present paper aims to analyze the dynamics of the opinions regarding COVID-19 vaccination by considering the one-month period following the first vaccine announcement, until the first vaccination took place in UK, in which the civil society has manifested a higher interest regarding the vaccination process. Classical machine learning and deep learning algorithms have been compared to select the best performing classifier. 2 349 659 tweets have been collected, analyzed, and put in connection with the events reported by the media. Based on the analysis, it can be observed that most of the tweets have a neutral stance, while the number of in favor tweets overpasses the number of against tweets. As for the news, it has been observed that the occurrence of tweets follows the trend of the events. Even more, the proposed approach can be used for a longer monitoring campaign that can help the governments to create appropriate means of communication and to evaluate them in order to provide clear and adequate information to the general public, which could increase the public trust in a vaccination campaign.",
    "authors": [
        "Liviu-Adrian Cotfas",
        "Camelia Delcea",
        "I. Roxin",
        "Corina Ioanăș",
        "D. Gherai",
        "Federico Tajariol"
    ],
    "venue": "IEEE Access",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The present paper aims to analyze the dynamics of the opinions regarding COVID-19 vaccination by considering the one-month period following the first vaccine announcement, until the first vaccination took place in UK, in which the civil society has manifested a higher interest regarding the vaccination process."
    },
    "citationCount": 96,
    "influentialCitationCount": 6,
    "code": null,
    "description": null,
    "url": null
}