{
    "acronym": "32e11cf020021c225782a3b77b5cfed4ae8e14a0",
    "title": "An Open Source Data Contamination Report for Large Language Models",
    "seed_ids": [
        "gpt3",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "32e11cf020021c225782a3b77b5cfed4ae8e14a0",
    "abstract": "Data contamination in model evaluation has become increasingly prevalent with the growing popularity of large language models. It allows models to\"cheat\"via memorisation instead of displaying true capabilities. Therefore, contamination analysis has become an crucial part of reliable model evaluation to validate results. However, existing contamination analysis is usually conducted internally by large language model developers and often lacks transparency and completeness. This paper presents an extensive data contamination report for over 15 popular large language models across six popular multiple-choice QA benchmarks. We also introduce an open-source pipeline that enables the community to perform contamination analysis on customised data and models. Our experiments reveal varying contamination levels ranging from 1\\% to 45\\% across benchmarks, with the contamination degree increasing rapidly over time. Performance analysis of large language models indicates that data contamination does not necessarily lead to increased model metrics: while significant accuracy boosts of up to 14\\% and 7\\% are observed on contaminated C-Eval and Hellaswag benchmarks, only a minimal increase is noted on contaminated MMLU. We also find larger models seem able to gain more advantages than smaller models on contaminated test sets.",
    "authors": [
        "Yucheng Li"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Performance analysis of large language models indicates that data contamination does not necessarily lead to increased model metrics: while significant accuracy boosts are observed on contaminated C-Eval and Hellaswag benchmarks, only a minimal increase is noted on contaminated MMLU."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}