{
    "acronym": "32fad3ebb40bc9e827ad8ebb250dfabc5006a17a",
    "title": "Interactive Story Visualization with Multiple Characters",
    "seed_ids": [
        "d3pms",
        "a6238191cc43c41a544caadcf8b00947293cf099",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "32fad3ebb40bc9e827ad8ebb250dfabc5006a17a",
    "abstract": "Accurate Story visualization requires several necessary elements, such as identity consistency across frames, the alignment between plain text and visual content, and a reasonable layout of objects in images. Most previous works endeavor to meet these requirements by fitting a text-to-image (T2I) model on a set of videos in the same style and with the same characters, e.g., the FlintstonesSV dataset. However, the learned T2I models typically struggle to adapt to new characters, scenes, and styles, and often lack the flexibility to revise the layout of the synthesized images. This paper proposes a system for generic interactive story visualization, capable of handling multiple novel characters and supporting the editing of layout and local structure. It is developed by leveraging the prior knowledge of large language and T2I models, trained on massive corpora. The system comprises four interconnected components: story-to-prompt generation (S2P), text-to-layout generation (T2L), controllable text-to-image generation (C-T2I), and image-to-video animation (I2V). First, the S2P module converts concise story information into detailed prompts required for subsequent stages. Next, T2L generates diverse and reasonable layouts based on the prompts, offering users the ability to adjust and refine the layout to their preferences. The core component, C-T2I, enables the creation of images guided by layouts, sketches, and actor-specific identifiers to maintain consistency and detail across visualizations. Finally, I2V enriches the visualization process by animating the generated images. Extensive experiments and a user study are conducted to validate the effectiveness and flexibility of interactive editing of the proposed system.",
    "authors": [
        "Yuan Gong",
        "Youxin Pang",
        "Xiaodong Cun",
        "Menghan Xia",
        "Haoxin Chen",
        "Longyue Wang",
        "Yong Zhang",
        "Xintao Wang",
        "Ying Shan",
        "Yujiu Yang"
    ],
    "venue": "ACM SIGGRAPH Conference and Exhibition on Computer Graphics and Interactive Techniques in Asia",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A system for generic interactive story visualization, capable of handling multiple novel characters and supporting the editing of layout and local structure is proposed, developed by leveraging the prior knowledge of large language and T2I models, trained on massive corpora."
    },
    "citationCount": 20,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}