{
    "acronym": "333212e246fb65f7c9d43862021e78f007c48449",
    "title": "A Survey of Visual Transformers",
    "seed_ids": [
        "gpt",
        "3d183fe445627003a3c5466aecd25de500b5aa8c",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "f7e449d7695fbbf43081cc820a81fe0ccb11c3db",
        "5e00596fa946670d894b1bdaeff5a98e3867ef13",
        "a9c214e846188adb645021cd7b1964b8ea1fef6f",
        "36b9d0f8610a82fd25854889d9327a04da4ff8fd",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530",
        "3cbe314cc5407a6c3249815b5173f22ea15173c2",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "6e8f35c6d54acb14109c9b792a62609eac8a7b5e",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "2e1db8cb373f4d4a51d44308b7a457886d855fbb",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "5335fe1bf347f7ad1dce1611ea4b60bd8391a090",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "333212e246fb65f7c9d43862021e78f007c48449",
    "abstract": "Transformer, an attention-based encoder–decoder model, has already revolutionized the field of natural language processing (NLP). Inspired by such significant achievements, some pioneering works have recently been done on employing Transformer-liked architectures in the computer vision (CV) field, which have demonstrated their effectiveness on three fundamental CV tasks (classification, detection, and segmentation) as well as multiple sensory data stream (images, point clouds, and vision-language data). Because of their competitive modeling capabilities, the visual Transformers have achieved impressive performance improvements over multiple benchmarks as compared with modern convolution neural networks (CNNs). In this survey, we have reviewed over 100 of different visual Transformers comprehensively according to three fundamental CV tasks and different data stream types, where taxonomy is proposed to organize the representative methods according to their motivations, structures, and application scenarios. Because of their differences on training settings and dedicated vision tasks, we have also evaluated and compared all these existing visual Transformers under different configurations. Furthermore, we have revealed a series of essential but unexploited aspects that may empower such visual Transformers to stand out from numerous architectures, e.g., slack high-level semantic embeddings to bridge the gap between the visual Transformers and the sequential ones. Finally, two promising research directions are suggested for future investment. We will continue to update the latest articles and their released source codes at https://github.com/liuyang-ict/awesome-visual-transformers.",
    "authors": [
        "Yang Liu",
        "Yao Zhang",
        "Yixin Wang",
        "Feng Hou",
        "Jin Yuan",
        "Jiang Tian",
        "Yang Zhang",
        "Zhongchao Shi",
        "Jianping Fan",
        "Zhiqiang He"
    ],
    "venue": "IEEE Transactions on Neural Networks and Learning Systems",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey has reviewed over 100 of different visual Transformers comprehensively according to three fundamental CV tasks and different data stream types, where taxonomy is proposed to organize the representative methods according to their motivations, structures, and application scenarios."
    },
    "citationCount": 194,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}