{
    "acronym": "3333cfb7c27c30ec44ad5d39922fa5c0ddc706d0",
    "title": "Towards Chapter-to-Chapter Context-Aware Literary Translation via Large Language Models",
    "seed_ids": [
        "transformer",
        "a83ddab9d09192daadef387ca6571d8c44d71703",
        "0a90d5f56150eafd3ac88e4406b17496fedf529a",
        "d4793bcb3fd92b9da9a62b15e0dc93f64e452578",
        "6151ee4af6a3fe78f2df7c605598cd9e02b23c5b"
    ],
    "s2id": "3333cfb7c27c30ec44ad5d39922fa5c0ddc706d0",
    "abstract": "Discourse phenomena in existing document-level translation datasets are sparse, which has been a fundamental obstacle in the development of context-aware machine translation models. Moreover, most existing document-level corpora and context-aware machine translation methods rely on an unrealistic assumption on sentence-level alignments. To mitigate these issues, we first curate a novel dataset of Chinese-English literature, which consists of 160 books with intricate discourse structures. Then, we propose a more pragmatic and challenging setting for context-aware translation, termed chapter-to-chapter (Ch2Ch) translation, and investigate the performance of commonly-used machine translation models under this setting. Furthermore, we introduce a potential approach of finetuning large language models (LLMs) within the domain of Ch2Ch literary translation, yielding impressive improvements over baselines. Through our comprehensive analysis, we unveil that literary translation under the Ch2Ch setting is challenging in nature, with respect to both model learning methods and translation decoding algorithms.",
    "authors": [
        "Linghao Jin",
        "Li An",
        "Xuezhe Ma"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a more pragmatic and challenging setting for context-aware translation, termed chapter-to-chapter (Ch2Ch) translation, and investigates the performance of commonly-used machine translation models under this setting."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}