{
    "acronym": "33ac9a61760d3e1d9fb6cd43f1652ebbb061c072",
    "title": "Learning-Induced Channel Extrapolation for Fluid Antenna Systems Using Asymmetric Graph Masked Autoencoder",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "33ac9a61760d3e1d9fb6cd43f1652ebbb061c072",
    "abstract": "The emerging fluid antenna systems (FASs) enable position-flexible antennas that provide a new degree of freedom for more diversity and multiplexing benefits. However, the challenge for high-resolution FAS is the acquisition of complete and accurate channel state information (CSI) within a coherence time period. In this correspondence, we study deep learning methods for CSI extrapolation in high-resolution FAS with less complexity and greater generalization ability. In so doing, we then contrive a customized solution, referred to as an asymmetric graph masked autoencoder (AGMAE), specifically designed for spatial channel extrapolation in FAS. This technique incorporates an attention mechanism, an asymmetric masked autoencoder architecture to reduce computational complexity, and utilizes the local diffusion mechanism of graph neural networks to enhance generalization. Simulation results validate the effectiveness and generality of the proposed method for the CSI acquisition of FAS.",
    "authors": [
        "Haibin Zhang",
        "Jiale Wang",
        "Chao Wang",
        "Chengcai Wang",
        "Kai-Kit Wong",
        "Bin Wang",
        "Chan-Byoung Chae"
    ],
    "venue": "IEEE Wireless Communications Letters",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This correspondence studies deep learning methods for CSI extrapolation in high-resolution FAS with less complexity and greater generalization ability, and contrive a customized solution, referred to as an asymmetric graph masked autoencoder (AGMAE), specifically designed for spatial channel extrapolation in FAS."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}