{
    "acronym": "33be243ac9dd8723e6267dea45fd6a6172d4f6a5",
    "title": "Less is More: Task-aware Layer-wise Distillation for Language Model Compression",
    "seed_ids": [
        "gpt2",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "c6c734e16f66fbfcefac7625cc64599e83292c1e",
        "80cf2a6af4200ecfca1c18fc89de16148f1cd4bf",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "33be243ac9dd8723e6267dea45fd6a6172d4f6a5",
    "abstract": "Layer-wise distillation is a powerful tool to compress large models (i.e. teacher models) into small ones (i.e., student models). The student distills knowledge from the teacher by mimicking the hidden representations of the teacher at every intermediate layer. However, layer-wise distillation is difficult. Since the student has a smaller model capacity than the teacher, it is often under-fitted. Furthermore, the hidden representations of the teacher contain redundant information that the student does not necessarily need for the target task's learning. To address these challenges, we propose a novel Task-aware layEr-wise Distillation (TED). TED designs task-aware filters to align the hidden representations of the student and the teacher at each layer. The filters select the knowledge that is useful for the target task from the hidden representations. As such, TED reduces the knowledge gap between the two models and helps the student to fit better on the target task. We evaluate TED in two scenarios: continual pre-training and fine-tuning. TED demonstrates significant and consistent improvements over existing distillation methods in both scenarios. Code is available at https://github.com/cliang1453/task-aware-distillation.",
    "authors": [
        "Chen Liang",
        "Simiao Zuo",
        "Qingru Zhang",
        "Pengcheng He",
        "Weizhu Chen",
        "Tuo Zhao"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 35,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}