{
    "acronym": "33f3f31f871070f19b0c3e967a24e322bfc178f2",
    "title": "Retrieval-Augmented Diffusion Models",
    "seed_ids": [
        "classfreediffu",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "a225d5d846ba5110232ed5bb32d54ea742b1c2d4",
        "0e802c0739771acf70e60d59c2df51cd7e8c50c0",
        "82482585e94192b4e9913727e461f89cd08e9725",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8"
    ],
    "s2id": "33f3f31f871070f19b0c3e967a24e322bfc178f2",
    "abstract": "Generative image synthesis with diffusion models has recently achieved excellent visual quality in several tasks such as text-based or class-conditional image synthesis. Much of this success is due to a dramatic increase in the computational capacity invested in training these models. This work presents an alternative approach: inspired by its successful application in natural language processing, we propose to complement the diffusion model with a retrieval-based approach and to introduce an explicit memory in the form of an external database. During training, our diffusion model is trained with similar visual features retrieved via CLIP and from the neighborhood of each training instance. By leveraging CLIP’s joint image-text embedding space, our model achieves highly competitive performance on tasks for which it has not been explicitly trained, such as class-conditional or text-image synthesis, and can be conditioned on both text and image embeddings. Moreover, we can apply our approach to unconditional generation, where it achieves state-of-the-art performance. Our approach incurs low computational and memory overheads and is easy to implement. We discuss its relationship to concurrent work and will publish code and pretrained models soon.",
    "authors": [
        "A. Blattmann",
        "Robin Rombach",
        "K. Oktay",
        "B. Ommer"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes to complement the diffusion model with a retrieval-based approach and to introduce an explicit memory in the form of an external database to achieve highly competitive performance on tasks for which it has not been explicitly trained."
    },
    "citationCount": 87,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}