{
    "acronym": "34566fc32cafb91ed3abf0dc1c90d4f152708732",
    "title": "Can Machines Generate Personalized Music? A Hybrid Favorite-Aware Method for User Preference Music Transfer",
    "seed_ids": [
        "transformerxl",
        "4c64c35198453662882afd63d618a832c7d8c1b2",
        "ce510c6cfeac703706460680e977c54554840830",
        "24a70db0bbb5f486126477e32a6a44ab917a4b11"
    ],
    "s2id": "34566fc32cafb91ed3abf0dc1c90d4f152708732",
    "abstract": "User preference music transfer (UPMT) is a new problem in music style transfer that can be applied to many scenarios but remains understudied. Transferring an arbitrary song to fit a user’s preferences increases musical diversity and improves user engagement, which can greatly benefit individuals’ mental health. Most music style transfer approaches rely on data-driven methods. In general, however, constructing a large training dataset is challenging because users can rarely provide enough of their favorite songs. To address this problem, this paper proposes a novel hybrid method called User Preference Transformer (UP-Transformer) which uses prior knowledge of only one piece of a user’s favorite music. Based on the distribution of music events in the provided music, we propose a new favorite-aware loss function to fine-tune the Transformer-based model. Two steps are proposed in the transfer phase to achieve UPMT based on the extracted music pattern in a user’s favorite music. Additionally, to alleviate the problem of evaluating melodic similarity in music style transfer, we propose a new concept called pattern similarity (PS) to measure the similarity between two pieces of music. Statistical tests indicate that the results of PS are consistent with the similarity score in a qualitative experiment. Furthermore, experimental results on subjects show that the transferred music achieves better performance in musicality, similarity, and user preferences.",
    "authors": [
        "Zhejing Hu",
        "Yan Liu",
        "Gong Chen",
        "Yongxu Liu"
    ],
    "venue": "IEEE transactions on multimedia",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel hybrid method called User Preference Transformer (UP-Transformer) is proposed which uses prior knowledge of only one piece of a user’s favorite music to achieve UPMT and a new favorite-aware loss function to fine-tune the Transformer-based model."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}