{
    "acronym": "34a4e6818d680875ff0bef9a76de0376118446d1",
    "title": "Sparse Sinkhorn Attention",
    "seed_ids": [
        "sparsetransformer",
        "f51497f463566581874c941353dd9d80069c5b77",
        "2cf3bd0cc1382f35384e259d99e4f9744eeaed28",
        "2a31319e73d4486716168b65cdf7559baeda18ce",
        "16c844fd4d97f3c6eb38b0d6527c87d184efedc3"
    ],
    "s2id": "34a4e6818d680875ff0bef9a76de0376118446d1",
    "abstract": "We propose Sparse Sinkhorn Attention, a new efficient and sparse method for learning to attend. Our method is based on differentiable sorting of internal representations. Concretely, we introduce a meta sorting network that learns to generate latent permutations over sequences. Given sorted sequences, we are then able to compute quasi-global attention with only local windows, improving the memory efficiency of the attention module. To this end, we propose new algorithmic innovations such as Causal Sinkhorn Balancing and SortCut, a dynamic sequence truncation method for tailoring Sinkhorn Attention for encoding and/or decoding purposes. Via extensive experiments on algorithmic seq2seq sorting, language modeling, pixel-wise image generation, document classification and natural language inference, we demonstrate that our memory efficient Sinkhorn Attention method is competitive with vanilla attention and consistently outperforms recently proposed efficient Transformer models such as Sparse Transformers.",
    "authors": [
        "Yi Tay",
        "Dara Bahri",
        "Liu Yang",
        "Donald Metzler",
        "Da-Cheng Juan"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a meta sorting network that learns to generate latent permutations over sequences and is able to compute quasi-global attention with only local windows, improving the memory efficiency of the attention module."
    },
    "citationCount": 285,
    "influentialCitationCount": 36,
    "code": null,
    "description": null,
    "url": null
}