{
    "acronym": "34a833ed550b82952417f5449e1ede2cc2ec279d",
    "title": "Driving and suppressing the human language network using large language models",
    "seed_ids": [
        "gpt",
        "66c286df54551baba7351a1ed44019367e5aa7ea",
        "eaee0b647d336c6fc8b844812675ec35cddf14a1",
        "8cef169a76fc8ff2971ff3b6832b5de885d37ad4",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "23e04389f8728a5736382d3662341a1a2a25e171",
        "6fb0b072c4fcdc0c78218bfd1b181fd562f07cd2",
        "5a2263092f49540fd0e049050a96882ff29b00c3",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "34a833ed550b82952417f5449e1ede2cc2ec279d",
    "abstract": "Transformer models such as GPT generate human-like language and are highly predictive of human brain responses to language. Here, using fMRI-measured brain responses to 1,000 diverse sentences, we first show that a GPT-based encoding model can predict the magnitude of brain response associated with each sentence. Then, we use the model to identify new sentences that are predicted to drive or suppress responses in the human language network. We show that these model-selected novel sentences indeed strongly drive and suppress activity of human language areas in new individuals. A systematic analysis of the model-selected sentences reveals that surprisal and well-formedness of linguistic input are key determinants of response strength in the language network. These results establish the ability of neural network models to not only mimic human language but also noninvasively control neural activity in higher-level cortical areas, like the language network.",
    "authors": [
        "Greta Tuckute",
        "Aalok Sathe",
        "Shashank Srikant",
        "Maya Taliaferro",
        "Mingye Wang",
        "Martin Schrimpf",
        "Kendrick Norris Kay",
        "Evelina Fedorenko"
    ],
    "venue": "bioRxiv",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Using fMRI-measured brain responses to 1,000 diverse sentences, this work shows that a GPT-based encoding model can predict the magnitude of brain response associated with each sentence and identifies new sentences that are predicted to drive or suppress responses in the human language network."
    },
    "citationCount": 20,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}