{
    "acronym": "34aae207d1ed64c32466f38054ed0a0cc1390158",
    "title": "How Effective are State Space Models for Machine Translation?",
    "seed_ids": [
        "transformer",
        "mamba",
        "repeatafterme",
        "3dd6bc488283f1e4cc967d98a6a6c3d7f1a6cf76",
        "d53fe76bd2795a19ddf52d012917782f6f6f2c1e",
        "189fde3f4dfa105bb51472a8945618f395919560",
        "77fde89a0f28cae77fd488ee3b641dee716e9c77",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "01e721df7fcf8b664deb2cdc97ff58d65553af6b",
        "68850153b0210615c86f9a72624f34e2913bcddf",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "8cef9900c04d7f661c08f4b5b1ed4337ace042a3"
    ],
    "s2id": "34aae207d1ed64c32466f38054ed0a0cc1390158",
    "abstract": "Transformers are the current architecture of choice for NLP, but their attention layers do not scale well to long contexts. Recent works propose to replace attention with linear recurrent layers -- this is the case for state space models, which enjoy efficient training and inference. However, it remains unclear whether these models are competitive with transformers in machine translation (MT). In this paper, we provide a rigorous and comprehensive experimental comparison between transformers and linear recurrent models for MT. Concretely, we experiment with RetNet, Mamba, and hybrid versions of Mamba which incorporate attention mechanisms. Our findings demonstrate that Mamba is highly competitive with transformers on sentence and paragraph-level datasets, where in the latter both models benefit from shifting the training distribution towards longer sequences. Further analysis show that integrating attention into Mamba improves translation quality, robustness to sequence length extrapolation, and the ability to recall named entities.",
    "authors": [
        "Hugo Pitorro",
        "Pavlo Vasylenko",
        "Marcos Treviso",
        "Andr'e F. T. Martins"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that Mamba is highly competitive with transformers on sentence and paragraph-level datasets, where in the latter both models benefit from shifting the training distribution towards longer sequences."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}