{
    "acronym": "355e7b4ec396fef5c0ae1e12b0fd2d8130b21dc2",
    "title": "Let us Build Bridges: Understanding and Extending Diffusion Generative Models",
    "seed_ids": [
        "d3pms",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "355e7b4ec396fef5c0ae1e12b0fd2d8130b21dc2",
    "abstract": "Diffusion-based generative models have achieved promising results recently, but raise an array of open questions in terms of conceptual understanding, theoretical analysis, algorithm improvement and extensions to discrete, structured, non-Euclidean domains. This work tries to re-exam the overall framework, in order to gain better theoretical understandings and develop algorithmic extensions for data from arbitrary domains. By viewing diffusion models as latent variable models with unobserved diffusion trajectories and applying maximum likelihood estimation (MLE) with latent trajectories imputed from an auxiliary distribution, we show that both the model construction and the imputation of latent trajectories amount to constructing diffusion bridge processes that achieve deterministic values and constraints at end point, for which we provide a systematic study and a suit of tools. Leveraging our framework, we present 1) a first theoretical error analysis for learning diffusion generation models, and 2) a simple and unified approach to learning on data from different discrete and constrained domains. Experiments show that our methods perform superbly on generating images, semantic segments and 3D point clouds.",
    "authors": [
        "Xingchao Liu",
        "Lemeng Wu",
        "Mao Ye",
        "Qiang Liu"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work tries to re-exam the overall framework in order to gain better theoretical understandings and develop algorithmic extensions for data from arbitrary domains, and presents a first theoretical error analysis for learning diffusion generation models."
    },
    "citationCount": 56,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}