{
    "acronym": "35712d135083d4d22b2d56f482c5d1d32a14eb41",
    "title": "A Survey of Few-Shot Learning for Biomedical Time Series",
    "seed_ids": [
        "bert",
        "16f01c1b3ddd0b2abd5ddfe4fdb3f74767607277",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "35712d135083d4d22b2d56f482c5d1d32a14eb41",
    "abstract": "Advancements in wearable sensor technologies and the digitization of medical records have contributed to the unprecedented ubiquity of biomedical time series data. Data-driven models have tremendous potential to assist clinical diagnosis and improve patient care by improving long-term monitoring capabilities, facilitating early disease detection and intervention, as well as promoting personalized healthcare delivery. However, accessing extensively labeled datasets to train data-hungry deep learning models encounters many barriers, such as long-tail distribution of rare diseases, cost of annotation, privacy and security concerns, data-sharing regulations, and ethical considerations. An emerging approach to overcome the scarcity of labeled data is to augment AI methods with human-like capabilities to leverage past experiences to learn new tasks with limited examples, called few-shot learning. This survey provides a comprehensive review and comparison of few-shot learning methods for biomedical time series applications. The clinical benefits and limitations of such methods are discussed in relation to traditional data-driven approaches. This paper aims to provide insights into the current landscape of few-shot learning for biomedical time series and its implications for future research and applications.",
    "authors": [
        "Chenqi Li",
        "Timothy Denison",
        "Tingting Zhu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey provides a comprehensive review and comparison of few-shot learning methods for biomedical time series applications and the clinical benefits and limitations of such methods are discussed in relation to traditional data-driven approaches."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}