{
    "acronym": "357569763e23ebeab6ca1da8f33cde493e05dbc0",
    "title": "Training language models to summarize narratives improves brain alignment",
    "seed_ids": [
        "bigbird",
        "8cef169a76fc8ff2971ff3b6832b5de885d37ad4",
        "23e04389f8728a5736382d3662341a1a2a25e171",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "357569763e23ebeab6ca1da8f33cde493e05dbc0",
    "abstract": "Building systems that achieve a deeper understanding of language is one of the central goals of natural language processing (NLP). Towards this goal, recent works have begun to train language models on narrative datasets which require extracting the most critical information by integrating across long contexts. However, it is still an open question whether these models are learning a deeper understanding of the text, or if the models are simply learning a heuristic to complete the task. This work investigates this further by turning to the one language processing system that truly understands complex language: the human brain. We show that training language models for deeper narrative understanding results in richer representations that have improved alignment to human brain activity. We further find that the improvements in brain alignment are larger for character names than for other discourse features, which indicates that these models are learning important narrative elements. Taken together, these results suggest that this type of training can indeed lead to deeper language understanding. These findings have consequences both for cognitive neuroscience by revealing some of the significant factors behind brain-NLP alignment, and for NLP by highlighting that understanding of long-range context can be improved beyond language modeling.",
    "authors": [
        "Khai Loong Aw",
        "Mariya Toneva"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that training language models for deeper narrative understanding results in richer representations that have improved alignment to human brain activity, and the improvements in brain alignment are larger for character names than for other discourse features, which indicates that these models are learning important narrative elements."
    },
    "citationCount": 13,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}