{
    "acronym": "35a9749df07a2ab97c51af4d260b095b00da7676",
    "title": "Informer: Beyond Efficient Transformer for Long Sequence Time-Series Forecasting",
    "seed_ids": [
        "sparsetransformer",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "2cf3bd0cc1382f35384e259d99e4f9744eeaed28",
        "8cef9900c04d7f661c08f4b5b1ed4337ace042a3"
    ],
    "s2id": "35a9749df07a2ab97c51af4d260b095b00da7676",
    "abstract": "Many real-world applications require the prediction of long sequence time-series, such as electricity consumption planning. Long sequence time-series forecasting (LSTF) demands a high prediction capacity of the model, which is the ability to capture precise long-range dependency coupling between output and input efficiently. Recent studies have shown the potential of Transformer to increase the prediction capacity. However, there are several severe issues with Transformer that prevent it from being directly applicable to LSTF, including quadratic time complexity, high memory usage, and inherent limitation of the encoder-decoder architecture. To address these issues, we design an efficient transformer-based model for LSTF, named Informer, with three distinctive characteristics: (i) a ProbSparse self-attention mechanism, which achieves O(L log L) in time complexity and memory usage, and has comparable performance on sequences' dependency alignment. (ii) the self-attention distilling highlights dominating attention by halving cascading layer input, and efficiently handles extreme long input sequences. (iii) the generative style decoder, while conceptually simple, predicts the long time-series sequences at one forward operation rather than a step-by-step way, which drastically improves the inference speed of long-sequence predictions. Extensive experiments on four large-scale datasets demonstrate that Informer significantly outperforms existing methods and provides a new solution to the LSTF problem.",
    "authors": [
        "Haoyi Zhou",
        "Shanghang Zhang",
        "J. Peng",
        "Shuai Zhang",
        "Jianxin Li",
        "Hui Xiong",
        "Wan Zhang"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An efficient transformer-based model for LSTF, named Informer, with three distinctive characteristics: a ProbSparse self-attention mechanism, which achieves O(L log L) in time complexity and memory usage, and has comparable performance on sequences' dependency alignment."
    },
    "citationCount": 2266,
    "influentialCitationCount": 379,
    "code": null,
    "description": null,
    "url": null
}