{
    "acronym": "35ab93f41115e860bee5e202b71061addfd0fd5d",
    "title": "Learning to (Learn at Test Time): RNNs with Expressive Hidden States",
    "seed_ids": [
        "mamba",
        "157ed5647da39a7f5d33a84a90414b2a9e97e301",
        "62b18cc55dcc7ffe52c28e1086aee893b7bc4334",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "37ba9c33025fb31f25436010e12c65a0bafc0e1f",
        "e3fc46d5f4aae2c7a8a86b6bd21ca8db5d40fcbd",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "86589b6286ef3c55b8b4fccfb41a3b30b7afdf61",
        "1a703f08da01cf737cce3fb9064259b3f4b44e9c",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "cd63025532a62fa245a02ec05e32ac4d23089631"
    ],
    "s2id": "35ab93f41115e860bee5e202b71061addfd0fd5d",
    "abstract": "Self-attention performs well in long context but has quadratic complexity. Existing RNN layers have linear complexity, but their performance in long context is limited by the expressive power of their hidden state. We propose a new class of sequence modeling layers with linear complexity and an expressive hidden state. The key idea is to make the hidden state a machine learning model itself, and the update rule a step of self-supervised learning. Since the hidden state is updated by training even on test sequences, our layers are called Test-Time Training (TTT) layers. We consider two instantiations: TTT-Linear and TTT-MLP, whose hidden state is a linear model and a two-layer MLP respectively. We evaluate our instantiations at the scale of 125M to 1.3B parameters, comparing with a strong Transformer and Mamba, a modern RNN. Both TTT-Linear and TTT-MLP match or exceed the baselines. Similar to Transformer, they can keep reducing perplexity by conditioning on more tokens, while Mamba cannot after 16k context. With preliminary systems optimization, TTT-Linear is already faster than Transformer at 8k context and matches Mamba in wall-clock time. TTT-MLP still faces challenges in memory I/O, but shows larger potential in long context, pointing to a promising direction for future research.",
    "authors": [
        "Yu Sun",
        "Xinhao Li",
        "Karan Dalal",
        "Jiarui Xu",
        "Arjun Vikram",
        "Genghan Zhang",
        "Yann Dubois",
        "Xinlei Chen",
        "Xiaolong Wang",
        "Sanmi Koyejo",
        "Tatsunori Hashimoto",
        "Carlos Guestrin"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "With preliminary systems optimization, TTT-Linear is already faster than Transformer at 8k context and matches Mamba in wall-clock time, and TTT-MLP still faces challenges in memory I/O, but shows larger potential in long context, pointing to a promising direction for future research."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}