{
    "acronym": "366441034ec03b2fd72e29c246c49389a50b8ad8",
    "title": "Online Adaptation of Language Models with a Memory of Amortized Contexts",
    "seed_ids": [
        "transformer",
        "7b2470f0f53fcd79b82ed6a0e6062f39b07c27d6",
        "80980cd10d19f021c14a6b7eee871b6a5d328024",
        "c53e3020e4b8f9e1cd7b6ed35221480a2647ea26"
    ],
    "s2id": "366441034ec03b2fd72e29c246c49389a50b8ad8",
    "abstract": "Due to the rapid generation and dissemination of information, large language models (LLMs) quickly run out of date despite enormous development costs. Due to this crucial need to keep models updated, online learning has emerged as a critical necessity when utilizing LLMs for real-world applications. However, given the ever-expanding corpus of unseen documents and the large parameter space of modern LLMs, efficient adaptation is essential. To address these challenges, we propose Memory of Amortized Contexts (MAC), an efficient and effective online adaptation framework for LLMs with strong knowledge retention. We propose an amortized feature extraction and memory-augmentation approach to compress and extract information from new documents into compact modulations stored in a memory bank. When answering questions, our model attends to and extracts relevant knowledge from this memory bank. To learn informative modulations in an efficient manner, we utilize amortization-based meta-learning, which substitutes the optimization process with a single forward pass of the encoder. Subsequently, we learn to choose from and aggregate selected documents into a single modulation by conditioning on the question, allowing us to adapt a frozen language model during test time without requiring further gradient updates. Our experiment demonstrates the superiority of MAC in multiple aspects, including online adaptation performance, time, and memory efficiency. Code is available at: https://github.com/jihoontack/MAC.",
    "authors": [
        "Jihoon Tack",
        "Jaehyung Kim",
        "Eric Mitchell",
        "Jinwoo Shin",
        "Yee Whye Teh",
        "Jonathan Richard Schwarz"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Memory of Amortized Contexts (MAC) is proposed, an efficient and effective online adaptation framework for LLMs with strong knowledge retention that combines amortized feature extraction and memory-augmentation approach to compress and extract information from new documents into compact modulations stored in a memory bank."
    },
    "citationCount": 5,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}