{
    "acronym": "369c9378ae72c4b72215c34766b8f5a2215212be",
    "title": "-generAItor: Tree-in-the-loop Text Generation for Language Model Explainability and Adaptation",
    "seed_ids": [
        "gpt2",
        "bert",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "369c9378ae72c4b72215c34766b8f5a2215212be",
    "abstract": "Large language models (LLMs) are widely deployed in various downstream tasks, e.g., auto-completion, aided writing, or chat-based text generation. However, the considered output candidates of the underlying search algorithm are under-explored and under-explained. We tackle this shortcoming by proposing a tree-in-the-loop approach, where a visual representation of the beam search tree is the central component for analyzing, explaining, and adapting the generated outputs. To support these tasks, we present generAItor, a visual analytics technique, augmenting the central beam search tree with various task-specific widgets, providing targeted visualizations and interaction possibilities. Our approach allows interactions on multiple levels and offers an iterative pipeline that encompasses generating, exploring, and comparing output candidates, as well as fine-tuning the model based on adapted data. Our case study shows that our tool generates new insights in gender bias analysis beyond state-of-the-art template-based methods. Additionally, we demonstrate the applicability of our approach in a qualitative user study. Finally, we quantitatively evaluate the adaptability of the model to few samples, as occurring in text-generation use cases.",
    "authors": [
        "Thilo Spinner",
        "Rebecca Kehlbeck",
        "R. Sevastjanova",
        "Tobias Stähle",
        "Daniel A. Keim",
        "Oliver Deussen",
        "Mennatallah El-Assady"
    ],
    "venue": "ACM Trans. Interact. Intell. Syst.",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "GenerAItor, a visual analytics technique, augmenting the central beam search tree with various task-specific widgets, providing targeted visualizations and interaction possibilities, and quantitatively evaluates the adaptability of the model to few samples, as occurring in text-generation use cases."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}