{
    "acronym": "36b88e6cf9cd5fa4809602f365287cb2201f8350",
    "title": "EMO: Earth Mover Distance Optimization for Auto-Regressive Language Modeling",
    "seed_ids": [
        "gpt2",
        "d8d578d4ece329f17b025946587b1751721b9144",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d4550863c9b4102472a2326ab994aafdb13de7b9",
        "7a15950dc71079285a4eaf195de5aadd87c41b40",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "36b88e6cf9cd5fa4809602f365287cb2201f8350",
    "abstract": "Neural language models are probabilistic models of human text. They are predominantly trained using maximum likelihood estimation (MLE), which is equivalent to minimizing the forward cross-entropy between the empirical data distribution and the model distribution. However, various degeneration phenomena are still widely observed when decoding from the distributions learned by such models. We establish that the forward cross-entropy is suboptimal as a distance metric for aligning human and model distribution due to its (1) recall-prioritization (2) negative diversity ignorance and (3) train-test mismatch. In this paper, we propose Earth Mover Distance Optimization (EMO) for auto-regressive language modeling. EMO capitalizes on the inherent properties of earth mover distance to address the aforementioned challenges. Due to the high complexity of direct computation, we further introduce a feasible upper bound for EMO to ease end-to-end training. Upon extensive evaluation of language models trained using EMO and MLE. We find that EMO demonstrates a consistently better language modeling performance than MLE across domains. Moreover, EMO demonstrates noteworthy enhancements in downstream performance with minimal fine-tuning on merely 25,000 sentences. This highlights the tremendous potential of EMO as a lightweight calibration method for enhancing large-scale pre-trained language models.",
    "authors": [
        "Siyu Ren",
        "Zhiyong Wu",
        "Kenny Q. Zhu"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is established that the forward cross-entropy is suboptimal as a distance metric for aligning human and model distribution due to its recall-prioritization, negative diversity ignorance and train-test mismatch, and EMO capitalizes on the inherent properties of earth mover distance to address the aforementioned challenges."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}