{
    "acronym": "37410333c789da14d0635f6563b063c9b9427d23",
    "title": "SMILE: Multimodal Dataset for Understanding Laughter in Video with Language Models",
    "seed_ids": [
        "gpt3",
        "ada81a4de88a6ce474df2e2446ad11fea480616e",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "33172567ab1dff9ca32c8d995d88bbff466f3236"
    ],
    "s2id": "37410333c789da14d0635f6563b063c9b9427d23",
    "abstract": "Despite the recent advances of the artificial intelligence, building social intelligence remains a challenge. Among social signals, laughter is one of the distinctive expressions that occurs during social interactions between humans. In this work, we tackle a new challenge for machines to understand the rationale behind laughter in video, Video Laugh Reasoning. We introduce this new task to explain why people laugh in a particular video and a dataset for this task. Our proposed dataset, SMILE, comprises video clips and language descriptions of why people laugh. We propose a baseline by leveraging the reasoning capacity of large language models (LLMs) with textual video representation. Experiments show that our baseline can generate plausible explanations for laughter. We further investigate the scalability of our baseline by probing other video understanding tasks and in-the-wild videos. We release our dataset, code, and model checkpoints on https://github.com/postech-ami/SMILE-Dataset.",
    "authors": [
        "Lee Hyun",
        "Kim Sung-Bin",
        "Seungju Han",
        "Youngjae Yu",
        "Tae-Hyun Oh"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a new challenge for machines to understand the rationale behind laughter in video, Video Laugh Reasoning, and proposes a baseline by leveraging the reasoning capacity of large language models (LLMs) with textual video representation."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}