{
    "acronym": "383393bc2a33d9bb0642c2ac21b55cfc542c6aa3",
    "title": "Bespoke Solvers for Generative Flow Models",
    "seed_ids": [
        "classfreediffu",
        "c69361b20ad3d88ad4c5e9e1a3a66d0932f2bc43",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "94bcd712aed610b8eaeccc57136d65ec988356f2"
    ],
    "s2id": "383393bc2a33d9bb0642c2ac21b55cfc542c6aa3",
    "abstract": "Diffusion or flow-based models are powerful generative paradigms that are notoriously hard to sample as samples are defined as solutions to high-dimensional Ordinary or Stochastic Differential Equations (ODEs/SDEs) which require a large Number of Function Evaluations (NFE) to approximate well. Existing methods to alleviate the costly sampling process include model distillation and designing dedicated ODE solvers. However, distillation is costly to train and sometimes can deteriorate quality, while dedicated solvers still require relatively large NFE to produce high quality samples. In this paper we introduce\"Bespoke solvers\", a novel framework for constructing custom ODE solvers tailored to the ODE of a given pre-trained flow model. Our approach optimizes an order consistent and parameter-efficient solver (e.g., with 80 learnable parameters), is trained for roughly 1% of the GPU time required for training the pre-trained model, and significantly improves approximation and generation quality compared to dedicated solvers. For example, a Bespoke solver for a CIFAR10 model produces samples with Fr\\'echet Inception Distance (FID) of 2.73 with 10 NFE, and gets to 1% of the Ground Truth (GT) FID (2.59) for this model with only 20 NFE. On the more challenging ImageNet-64$\\times$64, Bespoke samples at 2.2 FID with 10 NFE, and gets within 2% of GT FID (1.71) with 20 NFE.",
    "authors": [
        "Neta Shaul",
        "J. Pérez",
        "Ricky T. Q. Chen",
        "Ali K. Thabet",
        "Albert Pumarola",
        "Y. Lipman"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Bespoke solvers is introduced, a novel framework for constructing custom ODE solvers tailored to the ODE of a given pre-trained flow model that optimizes an order consistent and parameter-efficient solver, is trained for roughly 1% of the GPU time required for training the pre- trained model, and significantly improves approximation and generation quality compared to dedicated solvers."
    },
    "citationCount": 12,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}