{
    "acronym": "386c1852329d981eca785f986d93cbf993dbaae4",
    "title": "SynthesizRR: Generating Diverse Datasets with Retrieval Augmentation",
    "seed_ids": [
        "bert",
        "2166f1dc62759e9ed20955393b9c41683968d44b",
        "465471bb5bf1a945549d6291c2d23367966b4957",
        "394bd431e522b86581086bcb5cd9be161cf1cdf4",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "23c265ba884b92ecbd9d18641078d964697e4590",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "386c1852329d981eca785f986d93cbf993dbaae4",
    "abstract": "It is often desirable to distill the capabilities of large language models (LLMs) into smaller student models due to compute and memory constraints. One way to do this for classification tasks is via dataset synthesis, which can be accomplished by generating examples of each label from the LLM. Prior approaches to synthesis use few-shot prompting, which relies on the LLM's parametric knowledge to generate usable examples. However, this leads to issues of repetition, bias towards popular entities, and stylistic differences from human text. In this work, we propose Synthesize by Retrieval and Refinement (SynthesizRR), which uses retrieval augmentation to introduce variety into the dataset synthesis process: as retrieved passages vary, the LLM is seeded with different content to generate its examples. We empirically study the synthesis of six datasets, covering topic classification, sentiment analysis, tone detection, and humor, requiring complex synthesis strategies. We find that SynthesizRR greatly improves lexical and semantic diversity, similarity to human-written text, and distillation performance, when compared to 32-shot prompting and four prior approaches. We release our extensive codebase at https://github.com/amazon-science/synthesizrr",
    "authors": [
        "Abhishek Divekar",
        "Greg Durrett"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes Synthesize by Retrieval and Refinement (SynthesizRR), which uses retrieval augmentation to introduce variety into the dataset synthesis process: as retrieved passages vary, the LLM is seeded with different content to generate its examples."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}