{
    "acronym": "38be82da178efaa903ebf5b57520c64195c7354e",
    "title": "EdgeQAT: Entropy and Distribution Guided Quantization-Aware Training for the Acceleration of Lightweight LLMs on the Edge",
    "seed_ids": [
        "gpt2",
        "47beae741f6a4470dbd286d4f3f05ba2031c52d2",
        "1dede9d21db0be1c58208e1f970e57aac4fc45f8",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "5a2263092f49540fd0e049050a96882ff29b00c3",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "38be82da178efaa903ebf5b57520c64195c7354e",
    "abstract": "Despite the remarkable strides of Large Language Models (LLMs) in various fields, the wide applications of LLMs on edge devices are limited due to their massive parameters and computations. To address this, quantization is commonly adopted to generate lightweight LLMs with efficient computations and fast inference. However, Post-Training Quantization (PTQ) methods dramatically degrade in quality when quantizing weights, activations, and KV cache together to below 8 bits. Besides, many Quantization-Aware Training (QAT) works quantize model weights, leaving the activations untouched, which do not fully exploit the potential of quantization for inference acceleration on the edge. In this paper, we propose EdgeQAT, the Entropy and Distribution Guided QAT for the optimization of lightweight LLMs to achieve inference acceleration on Edge devices. We first identify that the performance drop of quantization primarily stems from the information distortion in quantized attention maps, demonstrated by the different distributions in quantized query and key of the self-attention mechanism. Then, the entropy and distribution guided QAT is proposed to mitigate the information distortion. Moreover, we design a token importance-aware adaptive method to dynamically quantize the tokens with different bit widths for further optimization and acceleration. Our extensive experiments verify the substantial improvements with our framework across various datasets. Furthermore, we achieve an on-device speedup of up to 2.37x compared with its FP16 counterparts across multiple edge devices, signaling a groundbreaking advancement.",
    "authors": [
        "Xuan Shen",
        "Zhenglun Kong",
        "Changdi Yang",
        "Zhaoyang Han",
        "Lei Lu",
        "Peiyan Dong",
        "Cheng Lyu",
        "Chih-hsiang Li",
        "Xuehang Guo",
        "Zhihao Shu",
        "Wei Niu",
        "Miriam Leeser",
        "Pu Zhao",
        "Yanzhi Wang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes EdgeQAT, the Entropy and Distribution Guided QAT for the optimization of lightweight LLMs to achieve inference acceleration on Edge devices and designs a token importance-aware adaptive method to dynamically quantize the tokens with different bit widths for further optimization and acceleration."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}