{
    "acronym": "38c0c6a5d0542561c528e9dd574738aafa94c6e6",
    "title": "Sheet Music Transformer ++: End-to-End Full-Page Optical Music Recognition for Pianoform Sheet Music",
    "seed_ids": [
        "transformer",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "38c0c6a5d0542561c528e9dd574738aafa94c6e6",
    "abstract": "Optical Music Recognition is a field that has progressed significantly, bringing accurate systems that transcribe effectively music scores into digital formats. Despite this, there are still several limitations that hinder OMR from achieving its full potential. Specifically, state of the art OMR still depends on multi-stage pipelines for performing full-page transcription, as well as it has only been demonstrated in monophonic cases, leaving behind very relevant engravings. In this work, we present the Sheet Music Transformer++, an end-to-end model that is able to transcribe full-page polyphonic music scores without the need of a previous Layout Analysis step. This is done thanks to an extensive curriculum learning-based pretraining with synthetic data generation. We conduct several experiments on a full-page extension of a public polyphonic transcription dataset. The experimental outcomes confirm that the model is competent at transcribing full-page pianoform scores, marking a noteworthy milestone in end-to-end OMR transcription.",
    "authors": [
        "Antonio R'ios-Vila",
        "Jorge Calvo-Zaragoza",
        "David Rizo",
        "Thierry Paquet"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Sheet Music Transformer++ is presented, an end-to-end model that is able to transcribe full-page polyphonic music scores without the need of a previous Layout Analysis step and is competent at transcribing full-page pianoform scores, marking a noteworthy milestone in end-to-end OMR transcription."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}