{
    "acronym": "38c48a1cd296d16dc9c56717495d6e44cc354444",
    "title": "Vision Mamba: Efficient Visual Representation Learning with Bidirectional State Space Model",
    "seed_ids": [
        "mamba",
        "434d751d355d7a7c20efa570e785c76286245e77",
        "240103933ffe3dac2179cc160a2bd91299357a53",
        "debbb47abc9fb757857f7c06aa86ca558d37c2d7",
        "bb6644a9f5920abfc1fa008f366a9ff48468e063",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "240300b1da360f22bf0b82c6817eacebba6deed4",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "d1869155960e4b1b882b39171dbecd25a7eda3cd",
        "eaef083b9d661f42cc0d89d9d8156218f33a91d9",
        "ca444821352a4bd91884413d8070446e2960715a",
        "9226ae23b95b3f6891461e086d910ffeb7ac448a",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "38c48a1cd296d16dc9c56717495d6e44cc354444",
    "abstract": "Recently the state space models (SSMs) with efficient hardware-aware designs, i.e., the Mamba deep learning model, have shown great potential for long sequence modeling. Meanwhile building efficient and generic vision backbones purely upon SSMs is an appealing direction. However, representing visual data is challenging for SSMs due to the position-sensitivity of visual data and the requirement of global context for visual understanding. In this paper, we show that the reliance on self-attention for visual representation learning is not necessary and propose a new generic vision backbone with bidirectional Mamba blocks (Vim), which marks the image sequences with position embeddings and compresses the visual representation with bidirectional state space models. On ImageNet classification, COCO object detection, and ADE20k semantic segmentation tasks, Vim achieves higher performance compared to well-established vision transformers like DeiT, while also demonstrating significantly improved computation&memory efficiency. For example, Vim is 2.8$\\times$ faster than DeiT and saves 86.8% GPU memory when performing batch inference to extract features on images with a resolution of 1248$\\times$1248. The results demonstrate that Vim is capable of overcoming the computation&memory constraints on performing Transformer-style understanding for high-resolution images and it has great potential to be the next-generation backbone for vision foundation models. Code is available at https://github.com/hustvl/Vim.",
    "authors": [
        "Lianghui Zhu",
        "Bencheng Liao",
        "Qian Zhang",
        "Xinlong Wang",
        "Wenyu Liu",
        "Xinggang Wang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a new generic vision backbone with bidirectional Mamba blocks (Vim), which marks the image sequences with position embeddings and compresses the visual representation with bidirectional state space models and has great potential to be the next-generation backbone for vision foundation models."
    },
    "citationCount": 226,
    "influentialCitationCount": 35,
    "code": null,
    "description": null,
    "url": null
}