{
    "acronym": "392054fedec600542b2828f698a359f1dc5ddbc1",
    "title": "Unsupervised literature mining approaches for extracting relationships pertaining to habitats and reproductive conditions of plant species",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "392054fedec600542b2828f698a359f1dc5ddbc1",
    "abstract": "Introduction Fine-grained, descriptive information on habitats and reproductive conditions of plant species are crucial in forest restoration and rehabilitation efforts. Precise timing of fruit collection and knowledge of species' habitat preferences and reproductive status are necessary especially for tropical plant species that have short-lived recalcitrant seeds, and those that exhibit complex reproductive patterns, e.g., species with supra-annual mass flowering events that may occur in irregular intervals. Understanding plant regeneration in the way of planning for effective reforestation can be aided by providing access to structured information, e.g., in knowledge bases, that spans years if not decades as well as covering a wide range of geographic locations. The content of such a resource can be enriched with literature-derived information on species' time-sensitive reproductive conditions and location-specific habitats. Methods We sought to develop unsupervised approaches to extract relationships pertaining to habitats and their locations, and reproductive conditions of plant species and corresponding temporal information. Firstly, we handcrafted rules for a traditional rule-based pattern matching approach. We then developed a relation extraction approach building upon transformer models, i.e., the Text-to-Text Transfer Transformer (T5), casting the relation extraction problem as a question answering and natural language inference task. We then propose a novel unsupervised hybrid approach that combines our rule-based and transformer-based approaches. Results Evaluation of our hybrid approach on an annotated corpus of biodiversity-focused documents demonstrated an improvement of up to 15 percentage points in recall and best performance over solely rule-based and transformer-based methods with F1-scores ranging from 89.61 to 96.75% for reproductive condition - temporal expression relations, and ranging from 85.39% to 89.90% for habitat - geographic location relations. Our work shows that even without training models on any domain-specific labeled dataset, we are able to extract relationships between biodiversity concepts from literature with satisfactory performance.",
    "authors": [
        "Roselyn Gabud",
        "Portia Lapitan",
        "Vladimir Mariano",
        "Eduardo Mendoza",
        "Nelson Pampolina",
        "Maria Art Antonette Clariño",
        "R. Batista-Navarro"
    ],
    "venue": "Frontiers Artif. Intell.",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work shows that even without training models on any domain-specific labeled dataset, this work shows that even without training models on any domain-specific labeled dataset, it is able to extract relationships between biodiversity concepts from literature with satisfactory performance."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}