{
    "acronym": "394bd431e522b86581086bcb5cd9be161cf1cdf4",
    "title": "Language Models are Realistic Tabular Data Generators",
    "seed_ids": [
        "gpt2",
        "b92628d13e8d090d042232fe6ae0b8998634b893",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "394bd431e522b86581086bcb5cd9be161cf1cdf4",
    "abstract": "Tabular data is among the oldest and most ubiquitous forms of data. However, the generation of synthetic samples with the original data's characteristics remains a significant challenge for tabular data. While many generative models from the computer vision domain, such as variational autoencoders or generative adversarial networks, have been adapted for tabular data generation, less research has been directed towards recent transformer-based large language models (LLMs), which are also generative in nature. To this end, we propose GReaT (Generation of Realistic Tabular data), which exploits an auto-regressive generative LLM to sample synthetic and yet highly realistic tabular data. Furthermore, GReaT can model tabular data distributions by conditioning on any subset of features; the remaining features are sampled without additional overhead. We demonstrate the effectiveness of the proposed approach in a series of experiments that quantify the validity and quality of the produced data samples from multiple angles. We find that GReaT maintains state-of-the-art performance across numerous real-world and synthetic data sets with heterogeneous feature types coming in various sizes.",
    "authors": [
        "V. Borisov",
        "Kathrin Seßler",
        "Tobias Leemann",
        "Martin Pawelczyk",
        "Gjergji Kasneci"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes GReaT (Generation of Realistic Tabular data), which exploits an auto-regressive generative LLM to sample synthetic and yet highly realistic tabular data and maintains state-of-the-art performance across numerous real-world and synthetic data sets."
    },
    "citationCount": 112,
    "influentialCitationCount": 16,
    "code": null,
    "description": null,
    "url": null
}