{
    "acronym": "395aae6e7a79e5760457ca38e868acc970016230",
    "title": "MATE: Multi-view Attention for Table Transformer Efficiency",
    "seed_ids": [
        "reformer",
        "transformerxl",
        "etc",
        "93d3e45395117e21214d404c8753b578c29266d1",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "40ca4fcfffa7ca9aa9b7ff06ecf3cd0436712d78",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "d27669c82faf78ea08cceaa0a171b540cccc304d"
    ],
    "s2id": "395aae6e7a79e5760457ca38e868acc970016230",
    "abstract": "This work presents a sparse-attention Transformer architecture for modeling documents that contain large tables. Tables are ubiquitous on the web, and are rich in information. However, more than 20% of relational tables on the web have 20 or more rows (Cafarella et al., 2008), and these large tables present a challenge for current Transformer models, which are typically limited to 512 tokens. Here we propose MATE, a novel Transformer architecture designed to model the structure of web tables. MATE uses sparse attention in a way that allows heads to efficiently attend to either rows or columns in a table. This architecture scales linearly with respect to speed and memory, and can handle documents containing more than 8000 tokens with current accelerators. MATE also has a more appropriate inductive bias for tabular data, and sets a new state-of-the-art for three table reasoning datasets. For HybridQA (Chen et al., 2020), a dataset that involves large documents containing tables, we improve the best prior result by 19 points.",
    "authors": [
        "Julian Martin Eisenschlos",
        "Maharshi Gor",
        "Thomas Müller",
        "William W. Cohen"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "MATE is proposed, a novel Transformer architecture designed to model the structure of web tables that uses sparse attention in a way that allows heads to efficiently attend to either rows or columns in a table."
    },
    "citationCount": 76,
    "influentialCitationCount": 13,
    "code": null,
    "description": null,
    "url": null
}