{
    "acronym": "39fe0048180b0a4e5b2bc54dac4af152a33cddb3",
    "title": "Position: Foundation Agents as the Paradigm Shift for Decision Making",
    "seed_ids": [
        "gpt3",
        "44d16a076c00ecada3d425203377e4ec951c4ed0",
        "efabf7727dc3212676f03f1384809ce019db109d",
        "bfe6fd05f09647b001c7eb6e333a95c881c88344",
        "860bc4f071f35d6d8529a52c2c1858d030779a6a",
        "32c9b3859086d15184989454eb878638659e64c6",
        "ada81a4de88a6ce474df2e2446ad11fea480616e",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "39fe0048180b0a4e5b2bc54dac4af152a33cddb3",
    "abstract": "Decision making demands intricate interplay between perception, memory, and reasoning to discern optimal policies. Conventional approaches to decision making face challenges related to low sample efficiency and poor generalization. In contrast, foundation models in language and vision have showcased rapid adaptation to diverse new tasks. Therefore, we advocate for the construction of foundation agents as a transformative shift in the learning paradigm of agents. This proposal is underpinned by the formulation of foundation agents with their fundamental characteristics and challenges motivated by the success of large language models (LLMs). Moreover, we specify the roadmap of foundation agents from large interactive data collection or generation, to self-supervised pretraining and adaptation, and knowledge and value alignment with LLMs. Lastly, we pinpoint critical research questions derived from the formulation and delineate trends for foundation agents supported by real-world use cases, addressing both technical and theoretical aspects to propel the field towards a more comprehensive and impactful future.",
    "authors": [
        "Xiaoqian Liu",
        "Xingzhou Lou",
        "Jianbin Jiao",
        "Junge Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This proposal is underpinned by the formulation of foundation agents with their fundamental characteristics and challenges motivated by the success of large language models (LLMs), specifying the roadmap of foundation agents from large interactive data collection or generation, to self-supervised pretraining and adaptation, and knowledge and value alignment with LLMs."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}