{
    "acronym": "3a22aad6c18a9559be3bbb197494b434b872a05a",
    "title": "Diffusion-NAT: Self-Prompting Discrete Diffusion for Non-Autoregressive Text Generation",
    "seed_ids": [
        "d3pms",
        "diffusionlm",
        "diffuseq",
        "32457b4527dbcce35da25b5fc89b86bd926cc0ea",
        "54b6e5dcef733c151adef0ac06430f63cb301a36",
        "f2f85068c9e22a4d8fe6b58e2d92e2d30bc10578",
        "5fa10872ef8037853ff7c8baf5f77fb55a918eca",
        "1f898d66acabff511a3871b82799aa73c0055402",
        "a1186d7d9a9ef258c76afef1177e4f348061a537",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "25db56fc85fe15625c3375064a35e908ba6dfd2a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "e512964293671abbdc409f313d127cbe85ffe5cd",
        "24425954960ce968e5f14360fbdd0605abcadfcf",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3a22aad6c18a9559be3bbb197494b434b872a05a",
    "abstract": "Recently, continuous diffusion models (CDM) have been introduced into non-autoregressive (NAR) text-to-text generation. However, the discrete nature of text increases the difficulty of CDM to generate coherent and fluent texts, and also causes the incompatibility problem between CDM and advanced NLP techniques, especially the popular pre-trained language models (PLMs).To solve it, we propose Diffusion-NAT, which introduces discrete diffusion models (DDM) into NAR text-to-text generation and integrates BART to improve the performance.By revising the decoding process of BART and the typical settings of DDM, we unify the inference process of BART and the denoising process of DDM into the same NAR masked tokens recovering task.In this way, DDM can rely on BART to perform denoising, which can benefit from both the rich pre-learned knowledge of BART and the iterative refining paradigm of DDM.Besides, we also propose the iterative self-prompting strategy to further improve the generation quality.Experimental results on 7 datasets show that our approach can outperform competitive NAR methods, and even surpass autoregressive methods.Our code and data are released at https://github.com/RUCAIBox/DiffusionNAT.",
    "authors": [
        "Kun Zhou",
        "Yifan Li",
        "Wayne Xin Zhao",
        "Ji-rong Wen"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Diffusion-NAT is proposed, which introduces discrete diffusion models (DDM) into NAR text-to-text generation and integrates BART to improve the performance and proposes the iterative self-prompting strategy to further improve the generation quality."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}