{
    "acronym": "3a356a3a48b952837c79c229531ad93a72bc62df",
    "title": "SumREN: Summarizing Reported Speech about Events in News",
    "seed_ids": [
        "memcompress",
        "8668e48b0032664af00e58e0c7774ddde17ffd7e",
        "13850aabbe8b70e99560a42504773a76ab5a4f47",
        "ef57ad148ec2eeef5eb3467f3e37e30042b2c7bd",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "3a356a3a48b952837c79c229531ad93a72bc62df",
    "abstract": "A primary objective of news articles is to establish the factual record for an event, frequently achieved by conveying both the details of the specified event (i.e., the 5 Ws; Who, What, Where, When and Why regarding the event) and how people reacted to it (i.e., reported statements). However, existing work on news summarization almost exclusively focuses on the event details. In this work, we propose the novel task of summarizing the reactions of different speakers, as expressed by their reported statements, to a given event. To this end, we create a new multi-document summarization benchmark, SumREN, comprising 745 summaries of reported statements from various public figures obtained from 633 news articles discussing 132 events. We propose an automatic silver-training data generation approach for our task, which helps smaller models like BART achieve GPT-3 level performance on this task. Finally, we introduce a pipeline-based framework for summarizing reported speech, which we empirically show to generate summaries that are more abstractive and factual than baseline query-focused summarization approaches.",
    "authors": [
        "R. Reddy",
        "Heba Elfardy",
        "Hou Pong Chan",
        "Kevin Small",
        "Heng Ji"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes the novel task of summarizing the reactions of different speakers, as expressed by their reported statements, to a given event, and creates a new multi-document summarization benchmark, SumREN, comprising 745 summaries of reported statements from various public figures obtained from 633 news articles discussing 132 events."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}