{
    "acronym": "3a55d1dd0f8a84c5c7f22bbdfc788daf1c277aab",
    "title": "Domain Based Medical Image Testing Using Attention Model",
    "seed_ids": [
        "transformer",
        "d9d3df9aa6ee2cfea2ea02831b0de5d9204648cd"
    ],
    "s2id": "3a55d1dd0f8a84c5c7f22bbdfc788daf1c277aab",
    "abstract": "Medical image testing is a crucial role in clinical system due to the label based region of interest is used for diagnosis and therapy. As per the domain shift, the segmentation performance is suffered for different unlabeled image modality. While unsupervised domain adaptation (UDA) model is dealing with these issues, current techniques may need some speed tweaks. Transformer’s’ adaptability is also under observation, even though new Transformer-based approaches to medical image segmentation have quite considered for performance. Thus, we considered domain based Transformer model to construct a cross-modal segmentation approach. This method perform at gaining knowledge long-range dependencies and enrapturing attention-related record. We considered Meta Attention (MA) approach to gain knowledge the level-by-level consistencies with positioning scheme. This model transfer more data between two modalities to execute an attention-based arrangement system. We have extensively tested cross-modality segmentation on three datasets: heart, abdominal organs, and brain tumors. The experimental results demonstrate that, when compared to the cutting-edge UDA approaches, our approach is considerably enhanced the performance. The average value of our model on Dice Similarity Coefficient (DSC) is 80% whereas DAFormer is 77.1%.",
    "authors": [
        "H. K. Bhuyan",
        "Anusha Kamireddy"
    ],
    "venue": "2024 Second International Conference on Data Science and Information System (ICDSIS)",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work considered domain based Transformer model to construct a cross-modal segmentation approach and considered Meta Attention (MA) approach to gain knowledge the level-by-level consistencies with positioning scheme for attention-based arrangement system."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}