{
    "acronym": "3aa2c10dd6c72267ea8a622c8f30b3c9240d5fab",
    "title": "Frozen Pretrained Transformers as Universal Computation Engines",
    "seed_ids": [
        "gpt",
        "gpt2",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3aa2c10dd6c72267ea8a622c8f30b3c9240d5fab",
    "abstract": "We investigate the capability of a transformer pretrained on natural language to generalize to other modalities with minimal finetuning -- in particular, without finetuning of the self-attention and feedforward layers of the residual blocks. We consider such a model, which we call a Frozen Pretrained Transformer (FPT), and study finetuning it on a variety of sequence classification tasks spanning numerical computation, vision, and protein fold prediction. In contrast to prior works which investigate finetuning on the same modality as the pretraining dataset, we show that pretraining on natural language can improve performance and compute efficiency on non-language downstream tasks. Additionally, we perform an analysis of the architecture, comparing the performance of a random initialized transformer to a random LSTM. Combining the two insights, we find language-pretrained transformers can obtain strong performance on a variety of non-language tasks.",
    "authors": [
        "Kevin Lu",
        "Aditya Grover",
        "P. Abbeel",
        "Igor Mordatch"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work investigates the capability of a transformer pretrained on natural language to generalize to other modalities with minimal finetuning, and finds language-pretrained transformers can obtain strong performance on a variety of non-language tasks."
    },
    "citationCount": 47,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}