{
    "acronym": "3adca9d49eab1a4db6538a995af3636d10e120c3",
    "title": "BladeDISC: Optimizing Dynamic Shape Machine Learning Workloads via Compiler Approach",
    "seed_ids": [
        "bert",
        "c9706e8421d086348845b97f53c96f34254dfd79",
        "87c5b281fa43e6f27191b20a8dd694eda1126336"
    ],
    "s2id": "3adca9d49eab1a4db6538a995af3636d10e120c3",
    "abstract": "Compiler optimization plays an increasingly important role to boost the performance of machine learning models for data processing and management. With increasingly complex data, the dynamic tensor shape phenomenon emerges for ML models. However, existing ML compilers either can only handle static shape models or expose a series of performance problems for both operator fusion optimization and code generation in dynamic shape scenes. This paper tackles the main challenges of dynamic shape optimization: the fusion optimization without shape value, and code generation supporting arbitrary shapes. To tackle the fundamental challenge of the absence of shape values, it systematically abstracts and excavates the shape information and designs a cross-level symbolic shape representation. With the insight that what fusion optimization relies upon is tensor shape relationships between adjacent operators rather than exact shape values, it proposes the dynamic shape fusion approach based on shape information propagation. To generate code that adapts to arbitrary shapes efficiently, it proposes a compile-time and runtime combined code generation approach. Finally, it presents a complete optimization pipeline for dynamic shape models and implements an industrial-grade ML compiler, named BladeDISC. The extensive evaluation demonstrates that BladeDISC outperforms PyTorch, TorchScript, TVM, ONNX Runtime, XLA, Torch Inductor (dynamic shape), and TensorRT by up to 6.95×, 6.25×, 4.08×, 2.04×, 2.06×, 7.92×, and 4.16× (3.54×, 3.12×, 1.95×, 1.47×, 1.24×, 2.93×, and 1.46× on average) in terms of end-to-end inference speedup on the A10 and T4 GPU, respectively. BladeDISC's source code is publicly available at https://github.com/alibaba/BladeDISC.",
    "authors": [
        "Zhen Zheng",
        "Zaifeng Pan",
        "Dalin Wang",
        "Kai Zhu",
        "Wenyi Zhao",
        "Tianyou Guo",
        "Xiafei Qiu",
        "Minmin Sun",
        "Junjie Bai",
        "Feng Zhang",
        "Xiaoyong Du",
        "Jidong Zhai",
        "Wei Lin"
    ],
    "venue": "Proc. ACM Manag. Data",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper tackles the main challenges of dynamic shape optimization: the fusion optimization without shape value, and code generation supporting arbitrary shapes and presents a complete optimization pipeline for dynamic shape models and implements an industrial-grade ML compiler, named BladeDISC."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}