{
    "acronym": "3ae4720a05249a77b2c827d1787b79790023e07f",
    "title": "CFG++: Manifold-constrained Classifier Free Guidance for Diffusion Models",
    "seed_ids": [
        "classfreediffu",
        "8745157f991013b23fbb79d300ba560f9005c8d4",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "3ae4720a05249a77b2c827d1787b79790023e07f",
    "abstract": "Classifier-free guidance (CFG) is a fundamental tool in modern diffusion models for text-guided generation. Although effective, CFG has notable drawbacks. For instance, DDIM with CFG lacks invertibility, complicating image editing; furthermore, high guidance scales, essential for high-quality outputs, frequently result in issues like mode collapse. Contrary to the widespread belief that these are inherent limitations of diffusion models, this paper reveals that the problems actually stem from the off-manifold phenomenon associated with CFG, rather than the diffusion models themselves. More specifically, inspired by the recent advancements of diffusion model-based inverse problem solvers (DIS), we reformulate text-guidance as an inverse problem with a text-conditioned score matching loss, and develop CFG++, a novel approach that tackles the off-manifold challenges inherent in traditional CFG. CFG++ features a surprisingly simple fix to CFG, yet it offers significant improvements, including better sample quality for text-to-image generation, invertibility, smaller guidance scales, reduced mode collapse, etc. Furthermore, CFG++ enables seamless interpolation between unconditional and conditional sampling at lower guidance scales, consistently outperforming traditional CFG at all scales. Experimental results confirm that our method significantly enhances performance in text-to-image generation, DDIM inversion, editing, and solving inverse problems, suggesting a wide-ranging impact and potential applications in various fields that utilize text guidance. Project Page: https://cfgpp-diffusion.github.io/.",
    "authors": [
        "Hyungjin Chung",
        "Jeongsol Kim",
        "Geon Yeong Park",
        "Hyelin Nam",
        "Jong Chul Ye"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Inspired by the recent advancements of diffusion model-based inverse problem solvers (DIS), text-guidance is reformulate as an inverse problem with a text-conditioned score matching loss, and CFG++ is developed, a novel approach that tackles the off-manifold challenges inherent in traditional CFG."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}