{
    "acronym": "3b1f020fa897d5788e7dd2e1a1fd86e3770a83bf",
    "title": "Injecting User Identity Into Pretrained Language Models for Document-Level Sentiment Classification",
    "seed_ids": [
        "gpt",
        "adc61e21eafecfbf6ebecc570f9f913659a2bfb2",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "a022bda79947d1f656a1164003c1b3ae9a843df9",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3b1f020fa897d5788e7dd2e1a1fd86e3770a83bf",
    "abstract": "This paper mainly studies the combination of pre-trained language models and user identity information for document-level sentiment classification. In recent years, pre-trained language models (PLMs) such as BERT have achieved state-of-the-art results on many NLP applications, including document-level sentiment classification. On the other hand, a collection of works introduce additional information such as user identity for better text modeling. However, most of them inject user identity into traditional models, while few studies have been conducted to study the combination of pre-trained language models and user identity for even better performance. To address this issue, in this paper, we propose to unite user identity and PLMs and formulate User-enhanced Pre-trained Language Models (U-PLMs). Specifically, we demonstrate two simple yet effective attempts, i.e. embedding-based and attention-based personalization, which inject user identity into different parts of a pre-trained language model and provide personalization from different perspectives. Experiments in three datasets with two backbone PLMs show that our proposed methods outperform the best state-of-the-art baseline method with an absolute improvement of up to 3%, 2.8%, and 2.2% on accuracy. In addition, our methods encode user identity with plugin modules, which are fully compatible with most auto-encoding pre-trained language models.",
    "authors": [
        "Xinlei Cao",
        "Jinyang Yu",
        "Zhuang Yan"
    ],
    "venue": "IEEE Access",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes to unite user identity and PLMs and formulate User-enhanced Pre-trained Language Models (U-PLMs), and demonstrates two simple yet effective attempts, i.e. embedding-based and attention-based personalization, which inject user identity into different parts of a pre-trained language model and provide personalization from different perspectives."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}