{
    "acronym": "3b2a675bb617ae1a920e8e29d535cdf27826e999",
    "title": "Video Diffusion Models",
    "seed_ids": [
        "classfreediffu",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "2d9ae4c167510ed78803735fc57ea67c3cc55a35",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06",
        "e763fdc9ae56826ff799163ea035b29bffd8ea6f"
    ],
    "s2id": "3b2a675bb617ae1a920e8e29d535cdf27826e999",
    "abstract": "Generating temporally coherent high fidelity video is an important milestone in generative modeling research. We make progress towards this milestone by proposing a diffusion model for video generation that shows very promising initial results. Our model is a natural extension of the standard image diffusion architecture, and it enables jointly training from image and video data, which we find to reduce the variance of minibatch gradients and speed up optimization. To generate long and higher resolution videos we introduce a new conditional sampling technique for spatial and temporal video extension that performs better than previously proposed methods. We present the first results on a large text-conditioned video generation task, as well as state-of-the-art results on established benchmarks for video prediction and unconditional video generation. Supplementary material is available at https://video-diffusion.github.io/",
    "authors": [
        "Jonathan Ho",
        "Tim Salimans",
        "Alexey Gritsenko",
        "William Chan",
        "Mohammad Norouzi",
        "David J. Fleet"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a diffusion model for video generation that shows very promising initial results, and introduces a new conditional sampling technique for spatial and temporal video extension that performs better than previously proposed methods."
    },
    "citationCount": 869,
    "influentialCitationCount": 91,
    "code": null,
    "description": null,
    "url": null
}