{
    "acronym": "3b42b813971bc3aa596569538282a2f386b28bea",
    "title": "Word sense disambiguation of acronyms in clinical narratives",
    "seed_ids": [
        "bert",
        "a566da8ac72ad60f3c9380ac9e038a91314ef77a",
        "76912f2d895788189c301286d486b31e5b99a33d"
    ],
    "s2id": "3b42b813971bc3aa596569538282a2f386b28bea",
    "abstract": "Clinical narratives commonly use acronyms without explicitly defining their long forms. This makes it difficult to automatically interpret their sense as acronyms tend to be highly ambiguous. Supervised learning approaches to their disambiguation in the clinical domain are hindered by issues associated with patient privacy and manual annotation, which limit the size and diversity of training data. In this study, we demonstrate how scientific abstracts can be utilised to overcome these issues by creating a large automatically annotated dataset of artificially simulated global acronyms. A neural network trained on such a dataset achieved the F1-score of 95% on disambiguation of acronym mentions in scientific abstracts. This network was integrated with multi-word term recognition to extract a sense inventory of acronyms from a corpus of clinical narratives on the fly. Acronym sense extraction achieved the F1-score of 74% on a corpus of radiology reports. In clinical practice, the suggested approach can be used to facilitate development of institution-specific inventories.",
    "authors": [
        "Daphné Chopard",
        "P. Corcoran",
        "Irena Spasić"
    ],
    "venue": "Frontiers Digit. Health",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A neural network was integrated with multi-word term recognition to extract a sense inventory of acronyms from a corpus of clinical narratives on the fly, and achieved the F1-score of 95% on disambiguation of acronym mentions in scientific abstracts."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}