{
    "acronym": "3b5545f0e35a117ca2820807f847043b82835f4f",
    "title": "FilterGNN: Image Feature Matching with Cascaded Outlier Filters and Linear Attention",
    "seed_ids": [
        "lineartransformer",
        "221e3f9f9c6e68eb68dd7084ef8e1e692869da85",
        "9ede78aa6a5471b2bbf07987ed62232df7446f4e",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "2cf3bd0cc1382f35384e259d99e4f9744eeaed28",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "3b5545f0e35a117ca2820807f847043b82835f4f",
    "abstract": "Cross-view matching of image local features is a fundamental task for visual localization and 3D reconstruction. In this paper, we propose FilterGNN, a Transformer-based graph neural network (GNN), aiming to improve matching efﬁciency and accuracy for visual descriptors. Based on high matching sparseness and coarse-to-ﬁne co-visible area detection, Fil-terGNN utilizes cascaded optimal graph matching ﬁlter modules to dynamically reject outlier matches. More-over, we have successfully adapted linear attention for FilterGNN with post instance normalization support, which signiﬁcantly reduces the complexity of complete graph learning from O ( N 2 ) to O ( N ) . Experiments show that FilterGNN only takes 6% time cost and 33 . 3% memory cost against SuperGlue under large-scale input size, and achieves competitive performance for various tasks, such as pose estimation, visual localization and sparse 3D reconstruction.",
    "authors": [
        "Junxiong Cai",
        "Tai-Jiang Mu",
        "Yunyu Lai"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes FilterGNN, a Transformer-based graph neural network (GNN), aiming to improve matchingency and accuracy for visual descriptors, based on high matching sparseness and coarse-to-ﬁne co-visible area detection."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}