{
    "acronym": "3bcea238b0c323d8f891829714bbe6e8a3de894c",
    "title": "Toward Unifying Text Segmentation and Long Document Summarization",
    "seed_ids": [
        "longformer",
        "0a41cb292242a82b2b09b3bf23b48349b981a640",
        "999deaecf0adb9defa3b233be32c6a1c3f7090a3",
        "9dc624d7258d1a56117ca720aea953ce46b66b21",
        "46e7383e6fb8da77479d0a828c7a24d924302169",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0"
    ],
    "s2id": "3bcea238b0c323d8f891829714bbe6e8a3de894c",
    "abstract": "Text segmentation is important for signaling a document’s structure. Without segmenting a long document into topically coherent sections, it is difficult for readers to comprehend the text, let alone find important information. The problem is only exacerbated by a lack of segmentation in transcripts of audio/video recordings. In this paper, we explore the role that section segmentation plays in extractive summarization of written and spoken documents. Our approach learns robust sentence representations by performing summarization and segmentation simultaneously, which is further enhanced by an optimization-based regularizer to promote selection of diverse summary sentences. We conduct experiments on multiple datasets ranging from scientific articles to spoken transcripts to evaluate the model’s performance. Our findings suggest that the model can not only achieve state-of-the-art performance on publicly available benchmarks, but demonstrate better cross-genre transferability when equipped with text segmentation. We perform a series of analyses to quantify the impact of section segmentation on summarizing written and spoken documents of substantial length and complexity.",
    "authors": [
        "Sangwoo Cho",
        "Kaiqiang Song",
        "Xiaoyang Wang",
        "Fei Liu",
        "Dong Yu"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The findings suggest that the model can not only achieve state-of-the-art performance on publicly available benchmarks, but demonstrate better cross-genre transferability when equipped with text segmentation."
    },
    "citationCount": 18,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}