{
    "acronym": "3bd072b495c54dde9848f420b6071b0bedc05427",
    "title": "Beyond Turing: A Comparative Analysis of Approaches for Detecting Machine-Generated Text",
    "seed_ids": [
        "gpt2",
        "4ad189079046bf9df0f8ece7545e42dc00e13b9f",
        "f8c6cb00ab9775f90ded5025b49cc260cede9350",
        "2eeff1edde4fc66284e7bedeb8eb8878ed4560f4",
        "11beca761c3079f7612204ed1b241ee8832107c9",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3bd072b495c54dde9848f420b6071b0bedc05427",
    "abstract": "Significant progress has been made on text generation by pre-trained language models (PLMs), yet distinguishing between human and machine-generated text poses an escalating challenge. This paper offers an in-depth evaluation of three distinct methods used to address this task: traditional shallow learning, Language Model (LM) fine-tuning, and Multilingual Model fine-tuning. These approaches are rigorously tested on a wide range of machine-generated texts, providing a benchmark of their competence in distinguishing between human-authored and machine-authored linguistic constructs. The results reveal considerable differences in performance across methods, thus emphasizing the continued need for advancement in this crucial area of NLP. This study offers valuable insights and paves the way for future research aimed at creating robust and highly discriminative models.",
    "authors": [
        "Muhammad Farid Adilazuarda",
        "N. Arkoulis",
        "Oleksii Chumakov"
    ],
    "venue": "TRUSTNLP",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An in-depth evaluation of three distinct methods used to address text generation by pre-trained language models, traditional shallow learning, Language Model (LM) fine-tuning, and Multilingual Model fine- Tuning reveals considerable differences in performance across methods."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}