{
    "acronym": "3c6ec875050ad4d2319725697d74154f66ced597",
    "title": "Hierarchical Perceiver",
    "seed_ids": [
        "perceiverio",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "231e768f0cd280faa0f725bb353262cb4fed08d1",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "3c6ec875050ad4d2319725697d74154f66ced597",
    "abstract": "General perception systems such as Perceivers can process arbitrary modalities in any combination and are able to handle up to a few hundred thousand inputs. They achieve this generality by using exclusively global attention operations. This however hinders them from scaling up to the inputs sizes required to process raw high-resolution images or video. In this paper, we show that some degree of locality can be introduced back into these models, greatly improving their efficiency while preserving their generality. To scale them further, we introduce a self-supervised approach that enables learning dense low-dimensional positional embeddings for very large signals. We call the resulting model a Hierarchical Perceiver (HiP). In sum our contributions are: 1) scaling Perceiver-type models to raw high-resolution images and audio+video, 2) showing the feasibility of learning 1M+ positional embeddings from scratch using masked auto-encoding, 3) demonstrating competitive performance on raw data from ImageNet, AudioSet, PASCAL VOC, ModelNet40 and Kinetics datasets with the same exact, unchanged model and without specialized preprocessing or any tokenization.",
    "authors": [
        "João Carreira",
        "Skanda Koppula",
        "Daniel Zoran",
        "Adrià Recasens",
        "Catalin Ionescu",
        "Olivier J. Hénaff",
        "Evan Shelhamer",
        "Relja Arandjelović",
        "M. Botvinick",
        "O. Vinyals",
        "K. Simonyan",
        "Andrew Zisserman",
        "Andrew Jaegle"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces a self-supervised approach that enables learning dense low-dimensional positional embeddings for very large signals and calls the resulting model a Hierarchical Perceiver (HiP)."
    },
    "citationCount": 12,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}