{
    "acronym": "3c80287c19df991e536f2e5e8911395d5ed86f4f",
    "title": "PatchHAR: A MLP-Like Architecture for Efficient Activity Recognition Using Wearables",
    "seed_ids": [
        "gmlp"
    ],
    "s2id": "3c80287c19df991e536f2e5e8911395d5ed86f4f",
    "abstract": "To date, convolutional neural networks have played a dominant role in sensor-based human activity recognition (HAR) scenarios. In 2021, researchers from four institutions almost simultaneously released their newest work to arXiv.org, where each of them independently presented new network architectures mainly consisting of linear layers. This arouses a heated debate whether the current research hotspot in deep learning architectures is returning to MLPs. Inspired by the recent success achieved by MLPs, in this paper, we first propose a lightweight network architecture called all-MLP for HAR, which is entirely built on MLP layers with a gating unit. By dividing multi-channel sensor time series into nonoverlapping patches, all linear layers directly process sensor patches to automatically extract local features, which is able to effectively reduce computational cost. Compared with convolutional architectures, it takes fewer FLOPs and parameters but achieves comparable classification score on WISDM, OPPORTUNITY, PAMAP2 and USC-HAD HAR benchmarks. The additional benefit is that all involved computations are matrix multiplication, which can be readily optimized with popular deep learning libraries. This advantage can promote practical HAR deployment in wearable devices. Finally, we evaluate the actual operation of all-MLP model on a Raspberry Pi platform for real-world human activity recognition simulation. We conclude that the new architecture is not a simple reuse of traditional MLPs in HAR scenario, but is a significant advance over them.",
    "authors": [
        "Shuoyuan Wang",
        "Lei Zhang",
        "Xing Wang",
        "Wenbo Huang",
        "Hao Wu",
        "Aiguo Song"
    ],
    "venue": "IEEE Transactions on Biometrics Behavior and Identity Science",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a lightweight network architecture called all-MLP for HAR, which is entirely built on MLP layers with a gating unit and concludes that the new architecture is not a simple reuse of traditional MLPs in HAR scenario, but is a significant advance over them."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}