{
    "acronym": "3cb249077fa9fdd7e18db396f5e053febaa83889",
    "title": "SemEval-2024 Task 9: BRAINTEASER: A Novel Task Defying Common Sense",
    "seed_ids": [
        "bert",
        "e747987df0200cb5f4d7367500d360b91a9b5b63",
        "bfe533b42b305dc514ad688a50ffd36c5b847fe9",
        "b9187c03f562d3686193c767ddc7cbe2c1ff3c89",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47"
    ],
    "s2id": "3cb249077fa9fdd7e18db396f5e053febaa83889",
    "abstract": "While vertical thinking relies on logical and commonsense reasoning, lateral thinking requires systems to defy commonsense associations and overwrite them through unconventional thinking. Lateral thinking has been shown to be challenging for current models but has received little attention. A recent benchmark, BRAINTEASER, aims to evaluate current models’ lateral thinking ability in a zero-shot setting. In this paper, we split the original benchmark to also support fine-tuning setting and present SemEval Task 9, BRAINTEASER(S), the first task at this competition designed to test the system’s reasoning and lateral thinking ability. As a popular task, BRAINTEASER(S)’s two subtasks receive 483 team submissions from 182 participants during the competition. This paper provides a fine-grained system analysis of the competition results, together with a reflection on what this means for the ability of the systems to reason laterally.We hope that the BRAINTEASER(S) subtasks and findings in this paper can stimulate future work on lateral thinking and robust reasoning by computational models",
    "authors": [
        "Yifan Jiang",
        "Filip Ilievski",
        "Kaixin Ma"
    ],
    "venue": "International Workshop on Semantic Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A fine-grained system analysis of the BRAINTEASER(S) competition results is provided, together with a reflection on what this means for the ability of the systems to reason laterally."
    },
    "citationCount": 28,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}