{
    "acronym": "3cc0f0b40589f4e0f971280cad48919048d22a41",
    "title": "GSVA: Generalized Segmentation via Multimodal Large Language Models",
    "seed_ids": [
        "gpt3",
        "dc6a7257c19be0b48d200bcb66c493c4ac07a632",
        "42a30dc5470f54ec249f25d3c31e05d7c376c8e3",
        "55cd2d0a8f26c4dc458303f937af2b6fb8f8b693",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "837ac4ed6825502f0460caec45e12e734c85b113"
    ],
    "s2id": "3cc0f0b40589f4e0f971280cad48919048d22a41",
    "abstract": "Generalized Referring Expression Segmentation (GRES) extends the scope of classic RES to refer to multiple objects in one expression or identify the empty targets absent in the image. GRES poses challenges in modeling the complex spatial relationships of the instances in the image and identifying non-existing referents. Multimodal Large Language Models (MLLMs) have recently shown tremendous progress in these complicated vision-language tasks. Connecting Large Language Models (LLMs) and vision models, MLLMs are proficient in understanding contexts with visual inputs. Among them, LISA, as a representative, adopts a special [SEG] token to prompt a segmentation mask decoder, e.g., SAM, to enable MLLMs in the RES task. However, existing solutions to GRES remain unsatisfactory since current segmentation MLLMs cannot correctly handle the cases where users might reference multiple subjects in a singular prompt or provide descriptions incongruent with any image target. In this paper, we propose Generalized Segmentation Vision Assistant (GSVA) to address this gap. Specifically, GSVA reuses the [SEG] token to prompt the segmentation model towards supporting multiple mask references simultaneously and innovatively learns to generate a [REJ] token to reject the null targets explicitly. Experiments validate GSVA's efficacy in resolving the GRES issue, marking a notable enhancement and setting a new record on the GRES benchmark gRefCOCO dataset. GSVA also proves effective across various classic referring segmentation and comprehension tasks.",
    "authors": [
        "Zhuofan Xia",
        "Dongchen Han",
        "Yizeng Han",
        "Xuran Pan",
        "Shiji Song",
        "Gao Huang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Generalized Segmentation Vision Assistant is proposed, which reuses the [SEG] token to prompt the segmentation model towards supporting multiple mask references simultaneously and innovatively learns to generate a [REJ] token to reject the null targets explicitly."
    },
    "citationCount": 9,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}