{
    "acronym": "3d07f41628a25e2e9b895b8a3659ca3ebfd1a73f",
    "title": "Document Understanding Dataset and Evaluation (DUDE)",
    "seed_ids": [
        "bigbird",
        "1436ee75f8dded44de157cf778a96bdaf6b20a76",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "2bff508779af191e7950b16cea8c4a9d0fc341e5"
    ],
    "s2id": "3d07f41628a25e2e9b895b8a3659ca3ebfd1a73f",
    "abstract": "We call on the Document AI (DocAI) community to reevaluate current methodologies and embrace the challenge of creating more practically-oriented benchmarks. Document Understanding Dataset and Evaluation (DUDE) seeks to remediate the halted research progress in understanding visually-rich documents (VRDs). We present a new dataset1 with novelties related to types of questions, answers, and document layouts based on multi-industry, multi-domain, and multi-page VRDs of various origins, and dates. Moreover, we are pushing the boundaries of current methods by creating multi-task and multi-domain evaluation setups that more accurately simulate real-world situations where powerful generalization and adaptation under low-resource settings are desired. DUDE aims to set a new standard as a more practical, long-standing benchmark for the community, and we hope that it will lead to future extensions and contributions that address real-world challenges. Finally, our work illustrates the importance of finding more efficient ways to model language, images, and layout in DocAI.",
    "authors": [
        "Jordy Van Landeghem",
        "Rubèn Pérez Tito",
        "Łukasz Borchmann",
        "Michal Pietruszka",
        "Pawel J'oziak",
        "Rafal Powalski",
        "Dawid Jurkiewicz",
        "Mickaël Coustaty",
        "Bertrand Ackaert",
        "Ernest Valveny",
        "Matthew B. Blaschko",
        "Sien Moens",
        "Tomasz Stanislawek"
    ],
    "venue": "IEEE International Conference on Computer Vision",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new dataset is presented with novelties related to types of questions, answers, and document layouts based on multi-industry, multi-domain, and multi-page VRDs of various origins, and dates, which illustrates the importance of finding more efficient ways to model language, images, and layout in DocAI."
    },
    "citationCount": 18,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}