{
    "acronym": "3d473cbb7a377cf960abff31748a1a39bb6c7d7c",
    "title": "Skeleton-of-Thought: Large Language Models Can Do Parallel Decoding",
    "seed_ids": [
        "flashattn",
        "aade40af0d85b0b4fe15c97f6222d5c2e4d6d9b3",
        "22b58dce1a13382418b8372bbd50ed3b2533f899",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "1900de2b966ca55ee5ca24ec94d5debe66e80c5b",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87"
    ],
    "s2id": "3d473cbb7a377cf960abff31748a1a39bb6c7d7c",
    "abstract": "This work aims at decreasing the end-to-end generation latency of large language models (LLMs). One of the major causes of the high generation latency is the sequential decoding approach adopted by almost all state-of-the-art LLMs. In this work, motivated by the thinking and writing process of humans, we propose “Skeleton-of-Thought” (SoT), which guides LLMs to first generate the skeleton of the answer, and then conducts parallel API calls or batched decoding to complete the contents of each skeleton point in parallel . Not only does SoT provide considerable speed-up (up to 2.39 × across 11 different LLMs), but it can also potentially improve the answer quality on several question categories in terms of diversity and relevance. SoT is an initial attempt at data-centric optimization for efficiency, and reveal the potential of pushing LLMs to think more like a human for answer quality.",
    "authors": [
        "Xuefei Ning",
        "Zinan Lin",
        "Zixuan Zhou",
        "Huazhong Yang",
        "Yu Wang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Skeleton-of-Thought (SoT), which guides LLMs to first generate the skeleton of the answer, and then conducts parallel API calls or batched decoding to complete the contents of each skeleton point in parallel, is proposed."
    },
    "citationCount": 51,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}