{
    "acronym": "3d4923d3ccf09334023e2bad293cd84f91105ffe",
    "title": "Quadapter: Adapter for GPT-2 Quantization",
    "seed_ids": [
        "gpt2",
        "e4f82c0a13cae6739239ae0c25a554b6daff35af",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3d4923d3ccf09334023e2bad293cd84f91105ffe",
    "abstract": "Transformer language models such as GPT-2 are difficult to quantize because of outliers in activations leading to a large quantization error. To adapt to the error, one must use quantization-aware training, which entails a fine-tuning process based on the dataset and the training pipeline identical to those for the original model. Pretrained language models, however, often do not grant access to their datasets and training pipelines, forcing us to rely on arbitrary ones for fine-tuning. In that case, it is observed that quantization-aware training overfits the model to the fine-tuning data. For quantization without overfitting, we introduce a quantization adapter (Quadapter), a small set of parameters that are learned to make activations quantization-friendly by scaling them channel-wise. It keeps the model parameters unchanged. By applying our method to the challenging task of quantizing GPT-2, we demonstrate that it effectively prevents the overfitting and improves the quantization performance.",
    "authors": [
        "Minseop Park",
        "J. You",
        "Markus Nagel",
        "Simyung Chang"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A quantization adapter (Quadapter) is introduced, a small set of parameters that are learned to make activations quantization-friendly by scaling them channel-wise that effectively prevents the overfitting and improves the quantization performance."
    },
    "citationCount": 8,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}