{
    "acronym": "3dc535e120e4f41ece11f0c40e7d0b1c97ad53ba",
    "title": "SecFormer: Towards Fast and Accurate Privacy-Preserving Inference for Large Language Models",
    "seed_ids": [
        "bert",
        "3310490e2a88b1ce2ad062ae4dfd597918c0dde4",
        "7c7f7f191aa7ceb083e7f7295f89ce400192220f",
        "5d74e5fe624aa81c94a6ecf74436fce214ebd0b2",
        "6cfd71d6f3cbe63a0af95b0622a6dd7387ab6acf",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3dc535e120e4f41ece11f0c40e7d0b1c97ad53ba",
    "abstract": "With the growing use of large language models hosted on cloud platforms to offer inference services, privacy concerns are escalating, especially concerning sensitive data like investment plans and bank account details. Secure Multi-Party Computing (SMPC) emerges as a promising solution to protect the privacy of inference data and model parameters. However, the application of SMPC in Privacy-Preserving Inference (PPI) for large language models, particularly those based on the Transformer architecture, often leads to considerable slowdowns or declines in performance. This is largely due to the multitude of nonlinear operations in the Transformer architecture, which are not well-suited to SMPC and difficult to circumvent or optimize effectively. To address this concern, we introduce an advanced optimization framework called SecFormer, to achieve fast and accurate PPI for Transformer models. By implementing model design optimization, we successfully eliminate the high-cost exponential and maximum operations in PPI without sacrificing model performance. Additionally, we have developed a suite of efficient SMPC protocols that utilize segmented polynomials, Fourier series and Goldschmidt's method to handle other complex nonlinear functions within PPI, such as GeLU, LayerNorm, and Softmax. Our extensive experiments reveal that SecFormer outperforms MPCFormer in performance, showing improvements of $5.6\\%$ and $24.2\\%$ for BERT$_{\\text{BASE}}$ and BERT$_{\\text{LARGE}}$, respectively. In terms of efficiency, SecFormer is 3.56 and 3.58 times faster than Puma for BERT$_{\\text{BASE}}$ and BERT$_{\\text{LARGE}}$, demonstrating its effectiveness and speed.",
    "authors": [
        "Jinglong Luo",
        "Yehong Zhang",
        "Zhuo Zhang",
        "Jiaqi Zhang",
        "Xin Mu",
        "Hui Wang",
        "Yue Yu",
        "Zenglin Xu"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces an advanced optimization framework called SecFormer, to achieve fast and accurate PPI for Transformer models, and successfully eliminates the high-cost exponential and maximum operations in PPI without sacrificing model performance."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}