{
    "acronym": "3dd61cd58e4f9374be1d9867096dbd09046e1439",
    "title": "IsoScore: Measuring the Uniformity of Embedding Space Utilization",
    "seed_ids": [
        "gpt",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3dd61cd58e4f9374be1d9867096dbd09046e1439",
    "abstract": "The recent success of distributed word representations has led to an increased interest in analyzing the properties of their spatial distribution. Several studies have suggested that contextualized word embedding models do not isotropically project tokens into vector space. However, current methods designed to measure isotropy, such as average random cosine similarity and the partition score, have not been thoroughly analyzed and are not appropriate for measuring isotropy. We propose IsoScore: a novel tool that quantifies the degree to which a point cloud uniformly utilizes the ambient vector space. Using rigorously designed tests, we demonstrate that IsoScore is the only tool available in the literature that accurately measures how uniformly distributed variance is across dimensions in vector space. Additionally, we use IsoScore to challenge a number of recent conclusions in the NLP literature that have been derived using brittle metrics of isotropy. We caution future studies from using existing tools to measure isotropy in contextualized embedding space as resulting conclusions will be misleading or altogether inaccurate.",
    "authors": [
        "W. Rudman",
        "Nate Gillman",
        "T. Rayne",
        "Carsten Eickhoff"
    ],
    "venue": "Findings",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "IsoScore is proposed: a novel tool that quantifies the degree to which a point cloud uniformly utilizes the ambient vector space and is used to challenge a number of recent conclusions in the NLP literature that have been derived using brittle metrics of isotropy."
    },
    "citationCount": 21,
    "influentialCitationCount": 8,
    "code": null,
    "description": null,
    "url": null
}