{
    "acronym": "3e06a3340327dc69d00e6b35cab1ed12eb079d86",
    "title": "A Transformer-Based Model for Zero-Shot Health Trajectory Prediction",
    "seed_ids": [
        "gpt3",
        "94ce1d5924e05e8d75e43ce70044293ddcef850a",
        "d02bbcc305e7810951fb13524240b48718a506fd"
    ],
    "s2id": "3e06a3340327dc69d00e6b35cab1ed12eb079d86",
    "abstract": "Integrating modern machine learning and clinical decision-making has great promise for mitigating healthcares increasing cost and complexity. We introduce the Enhanced Transformer for Health Outcome Simulation (ETHOS), a novel application of the transformer deep-learning architecture for analyzing high-dimensional, heterogeneous, and episodic health data. ETHOS is trained using Patient Health Timelines (PHTs)-detailed, tokenized records of health events-to predict future health trajectories, leveraging a zero-shot learning approach. ETHOS represents a significant advancement in foundation model development for healthcare analytics, eliminating the need for labeled data and model fine-tuning. Its ability to simulate various treatment pathways and consider patient-specific factors positions ETHOS as a tool for care optimization and addressing biases in healthcare delivery. Future developments will expand ETHOS capabilities to incorporate a wider range of data types and data sources. Our work demonstrates a pathway toward accelerated AI development and deployment in healthcare.",
    "authors": [
        "P. Renc",
        "Y. Jia",
        "A. E. Samir",
        "J. Was",
        "Q. Li",
        "D. W. Bates",
        "A. Sitek"
    ],
    "venue": "medRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Enhanced Transformer for Health Outcome Simulation (ETHOS), a novel application of the transformer deep-learning architecture for analyzing high-dimensional, heterogeneous, and episodic health data, demonstrates a pathway toward accelerated AI development and deployment in healthcare."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}