{
    "acronym": "3e231405a4ab25a3c7510c69a69d91e99d7cce76",
    "title": "CLERC: A Dataset for Legal Case Retrieval and Retrieval-Augmented Analysis Generation",
    "seed_ids": [
        "bert",
        "77e07e5542b450a2ee3193993c552700ad9ba82d",
        "50985d2fa9f31221b080e725dcf63278e9b62b73",
        "883187d0bacf57238ac95e2749bcc601baf2c212",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "8db711adf1beb3e0c2ec492f3936841d827404e9",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "15cc6dac02a458f587712880e8b9c15bb97bbbeb"
    ],
    "s2id": "3e231405a4ab25a3c7510c69a69d91e99d7cce76",
    "abstract": "Legal professionals need to write analyses that rely on citations to relevant precedents, i.e., previous case decisions. Intelligent systems assisting legal professionals in writing such documents provide great benefits but are challenging to design. Such systems need to help locate, summarize, and reason over salient precedents in order to be useful. To enable systems for such tasks, we work with legal professionals to transform a large open-source legal corpus into a dataset supporting two important backbone tasks: information retrieval (IR) and retrieval-augmented generation (RAG). This dataset CLERC (Case Law Evaluation Retrieval Corpus), is constructed for training and evaluating models on their ability to (1) find corresponding citations for a given piece of legal analysis and to (2) compile the text of these citations (as well as previous context) into a cogent analysis that supports a reasoning goal. We benchmark state-of-the-art models on CLERC, showing that current approaches still struggle: GPT-4o generates analyses with the highest ROUGE F-scores but hallucinates the most, while zero-shot IR models only achieve 48.3% recall@1000.",
    "authors": [
        "Abe Bohan Hou",
        "Orion Weller",
        "Guanghui Qin",
        "Eugene Yang",
        "Dawn Lawrie",
        "Nils Holzenberger",
        "Andrew Blair-Stanek",
        "Benjamin Van Durme"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work works with legal professionals to transform a large open-source legal corpus into a dataset supporting two important backbone tasks: information retrieval (IR) and retrieval-augmented generation (RAG)."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}