{
    "acronym": "3e4ed3b3790980efbb537d381c7bc020eefed53f",
    "title": "MambaMixer: Efficient Selective State Space Models with Dual Token and Channel Selection",
    "seed_ids": [
        "transformer",
        "hippo",
        "mamba",
        "gla",
        "ba4c5a116d07b37dea1046b6d16a60cb2d01cd47",
        "9898fa5e103efc283fa013ac4e5acddff8de04e8",
        "da9178eae82d1ca5492aaecd0151ba49481cb8b1",
        "5867382590f9f0ff8caf15804d20bde10845b2d2",
        "0a32e6ff6eaac83ff325bae4557a8362222979aa",
        "26e6cd121c5fdb147df83cb848e4813c926737c8",
        "241110426ec211c3e6c8faa2af6a92aa5cd6d477",
        "2dda6da7375bf5e8bcf60f87b17ba10757f3bc57",
        "b24e899ec0f77eef2fc87a9b8e50516367aa1f97",
        "62b18cc55dcc7ffe52c28e1086aee893b7bc4334",
        "434d751d355d7a7c20efa570e785c76286245e77",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "6b655b74da908e2e0d7c37996d36d5ff4a28f030",
        "a7d68b1702af08ce4dbbf2cd0b083e744ae5c6be",
        "95d6d5ecb6ec57cf913e955107070496450cfd4c",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "a128b1c47e6842605fb95bceae930d2135fc38fc",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "ca444821352a4bd91884413d8070446e2960715a",
        "dd1139cfc609c2f3263d02e97176d5275caebc0a",
        "defecf3dc299214f4cb76a093c6eed2297eaa46f",
        "8326dba15f6b8ee6e43c23eea3265a05e59e8135",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "0d9b8ccb1135b8e380dd8015b080158c6aae3ae5",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "5f895e84c1fea75de07b4f90da518273c2e57291",
        "485c08025157973bb52a935c6aa3bee74f990c01",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "4b56eef2862f7f553686f1dd190c56017122a6a0",
        "30dcc0e191a376fea0e7a46f94c53872c029efc9",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "3e4ed3b3790980efbb537d381c7bc020eefed53f",
    "abstract": "Recent advances in deep learning have mainly relied on Transformers due to their data dependency and ability to learn at scale. The attention module in these architectures, however, exhibits quadratic time and space in input size, limiting their scalability for long-sequence modeling. Despite recent attempts to design efficient and effective architecture backbone for multi-dimensional data, such as images and multivariate time series, existing models are either data independent, or fail to allow inter- and intra-dimension communication. Recently, State Space Models (SSMs), and more specifically Selective State Space Models, with efficient hardware-aware implementation, have shown promising potential for long sequence modeling. Motivated by the success of SSMs, we present MambaMixer, a new architecture with data-dependent weights that uses a dual selection mechanism across tokens and channels, called Selective Token and Channel Mixer. MambaMixer connects selective mixers using a weighted averaging mechanism, allowing layers to have direct access to early features. As a proof of concept, we design Vision MambaMixer (ViM2) and Time Series MambaMixer (TSM2) architectures based on the MambaMixer block and explore their performance in various vision and time series forecasting tasks. Our results underline the importance of selective mixing across both tokens and channels. In ImageNet classification, object detection, and semantic segmentation tasks, ViM2 achieves competitive performance with well-established vision models and outperforms SSM-based vision models. In time series forecasting, TSM2 achieves outstanding performance compared to state-of-the-art methods while demonstrating significantly improved computational cost. These results show that while Transformers, cross-channel attention, and MLPs are sufficient for good performance in time series forecasting, neither is necessary.",
    "authors": [
        "Ali Behrouz",
        "Michele Santacatterina",
        "Ramin Zabih"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results show that while Transformers, cross-channel attention, and MLPs are sufficient for good performance in time series forecasting, neither is necessary."
    },
    "citationCount": 12,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}