{
    "acronym": "3e5b7f0b64c60ca0bb5ef547e8e3dcc2a568ab75",
    "title": "MTSMAE: Masked Autoencoders for Multivariate Time-Series Forecasting",
    "seed_ids": [
        "reformer",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3e5b7f0b64c60ca0bb5ef547e8e3dcc2a568ab75",
    "abstract": "Large-scale self-supervised pre-training Transformer architecture have significantly boosted the performance for various tasks in natural language processing (NLP) and computer vision (CV). However, there is a lack of researches on processing multivariate time-series by pre-trained Transformer, and especially, current study on masking time-series for self-supervised learning is still a gap. Different from language and image processing, the information density of time-series increases the difficulty of research. The challenge goes further with the invalidity of the previous patch embedding and mask methods. In this paper, according to the data characteristics of multivariate time-series, a patch embedding method is proposed, and we present an self-supervised pre-training approach based on Masked Autoencoders (MAE), called MTSMAE, which can improve the performance significantly over supervised learning without pre-training. Evaluating our method on several common multivariate time-series datasets from different fields and with different characteristics, experiment results demonstrate that the performance of our method is significantly better than the best method currently available.",
    "authors": [
        "Peiwang Tang",
        "Xianchao Zhang"
    ],
    "venue": "IEEE International Conference on Tools with Artificial Intelligence",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An self-supervised pre-training approach based on Masked Autoencoders (MAE), called MTSMAE, which can improve the performance significantly over supervised learning without pre- training, and is significantly better than the best method currently available."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}