{
    "acronym": "3e9e8d356d2b0c5d261f39648a66510430367dd2",
    "title": "Floorplanning with Edge-aware Graph Attention Network and Hindsight Experience Replay",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "3e9e8d356d2b0c5d261f39648a66510430367dd2",
    "abstract": "In this article, we focus on chip floorplanning, which aims to determine the location and orientation of circuit macros simultaneously, so the chip area and wirelength are minimized. As the highest level of abstraction in hierarchical physical design, floorplanning bridges the gap between the system-level design and the physical synthesis, whose quality directly influences downstream placement and routing. To tackle chip floorplanning, we propose an end-to-end reinforcement learning (RL) methodology with a hindsight experience replay technique. An edge-aware graph attention network (EAGAT) is developed to effectively encode the macro and connection features of the netlist graph. Moreover, we build a hierarchical decoder architecture mainly consisting of transformer and attention pointer mechanism to output floorplan actions. Since the RL agent automatically extracts knowledge about the solution space, the previously learned policy can be quickly transferred to optimize new unseen netlists. Experimental results demonstrate that, compared with state-of-the-art floorplanners, the proposed end-to-end methodology significantly optimizes area and wirelength on public GSRC and MCNC benchmarks.",
    "authors": [
        "Bo Yang",
        "Qi Xu",
        "Hao Geng",
        "Song Chen",
        "Bei Yu",
        "Yi Kang"
    ],
    "venue": "ACM Trans. Design Autom. Electr. Syst.",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This article focuses on chip floorplanning, which aims to determine the location and orientation of circuit macros simultaneously, so the chip area and wirelength are minimized, and proposes an end-to-end reinforcement learning (RL) methodology with a hindsight experience replay technique."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}