{
    "acronym": "3eb57555cbe63845b518d690da3ef85054598078",
    "title": "T RAINING S PIKING N EURAL N ETWORKS U SING L ESSONS FROM D EEP L EARNING",
    "seed_ids": [
        "spikegpt",
        "9f52317ea9c5a6804b978987ff2a6557f98b5b2c"
    ],
    "s2id": "3eb57555cbe63845b518d690da3ef85054598078",
    "abstract": "The brain is the perfect place to look for inspiration to develop more efﬁcient neural networks. The inner workings of our synapses and neurons provide a glimpse at what the future of deep learning might look like. This paper serves as a tutorial and perspective showing how to apply the lessons learnt from several decades of research in deep learning, gradient descent, backpropagation and neuroscience to biologically plausible spiking neural neural networks. We also explore the delicate interplay between encoding data as spikes and the learning process; the challenges and solutions of applying gradient-based learning to spiking neural networks; the subtle link between temporal backpropagation and spike timing dependent plasticity, and how deep learning might move towards biologically plausible online learning. Some ideas are well accepted and commonly used amongst the neuromorphic engineering community, while others are presented or justiﬁed for the ﬁrst time here. A series of companion interactive tutorials complementary to this paper using our Python package, snnTorch , are also made available. 1",
    "authors": [
        "J. Eshraghian",
        "Max Ward",
        "E. Neftci",
        "Xinxin Wang",
        "Gregor Lenz",
        "G. Dwivedi",
        "Bennamoun",
        "D. Jeong",
        "Wei D. Lu"
    ],
    "venue": "",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The delicate interplay between encoding data as spikes and the learning process; the challenges and solutions of applying gradient-based learning to spiking neural networks; the subtle link between temporal backpropagation and spike timing dependent plasticity; and how deep learning might move towards biologically plausible online learning are explored."
    },
    "citationCount": 29,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}