{
    "acronym": "3f24be61416886d13d3468ba7b946bf5a722e9c5",
    "title": "Hierarchical Multiple Granularity Attention Network for Long Document Classification",
    "seed_ids": [
        "gpt",
        "84daddd294fa3cc12596b5785f81c2a153d2fb1d",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "3f24be61416886d13d3468ba7b946bf5a722e9c5",
    "abstract": "Long document classification has aroused tremendous attention in the field of Nature Language Processing, due to the exponential increasing of publications. Although the common text classification methods can be extended for long document classification, they are confined to the length of text and do not have enough expressiveness to model the structure of the long document. To solve these problems, we proposed a hierarchical multiple granularity attention network for long document classification, in which the word and section level features are extracted and fused to represent the complex structure of the long document. Furthermore, a feature-based section pooling module is adopted to eliminate redundant text information and accelerate the computing. A series of experiments are conducted to evaluate the proposed method. The experimental results verify that our method is effective, efficient and competitive compared with the related state-of-the-art methods.",
    "authors": [
        "Yongli Hu",
        "Wenpeng Ding",
        "Tengfei Liu",
        "Junbin Gao",
        "Yanfeng Sun",
        "Baocai Yin"
    ],
    "venue": "IEEE International Joint Conference on Neural Network",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A hierarchical multiple granularity attention network is proposed for long document classification, in which the word and section level features are extracted and fused to represent the complex structure of the long document."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}