{
    "acronym": "3f3c01adbdd433d515c19ac8cf6c61c905f0061a",
    "title": "History Compression via Language Models in Reinforcement Learning",
    "seed_ids": [
        "hopfield",
        "264fb3355fe11c9063bc9e466d438f720d15ef52",
        "eb95b02edfaeb28f528b5ee8b705388bb9a933be",
        "64a29bee2e1ad29547d590a3cc26274f4c537145",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "562bf6d0aac2c6362086ef4c80503de8ea56b340",
        "f51497f463566581874c941353dd9d80069c5b77",
        "59a916cdc943f0282908e6f3fa0360f4c5fb78d0",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3f3c01adbdd433d515c19ac8cf6c61c905f0061a",
    "abstract": "In a partially observable Markov decision process (POMDP), an agent typically uses a representation of the past to approximate the underlying MDP. We propose to utilize a frozen Pretrained Language Transformer (PLT) for history representation and compression to improve sample efficiency. To avoid training of the Transformer, we introduce FrozenHopfield, which automatically associates observations with pretrained token embeddings. To form these associations, a modern Hopfield network stores these token embeddings, which are retrieved by queries that are obtained by a random but fixed projection of observations. Our new method, HELM, enables actor-critic network architectures that contain a pretrained language Transformer for history representation as a memory module. Since a representation of the past need not be learned, HELM is much more sample efficient than competitors. On Minigrid and Procgen environments HELM achieves new state-of-the-art results. Our code is available at https://github.com/ml-jku/helm.",
    "authors": [
        "Fabian Paischer",
        "Thomas Adler",
        "Vihang Patil",
        "Angela Bitto-Nemling",
        "Markus Holzleitner",
        "S. Lehner",
        "Hamid Eghbalzadeh",
        "Sepp Hochreiter"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes to utilize a frozen Pretrained Language Transformer (PLT) for history representation and compression to improve sample efficiency, and introduces FrozenHopfield, which automatically associates observations with pretrained token embeddings."
    },
    "citationCount": 31,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}