{
    "acronym": "3fe9d1d5bce66d029afea87021c504ac9f609a8c",
    "title": "Controlled Text Generation with Hidden Representation Transformations",
    "seed_ids": [
        "gpt2",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "b6c4a96e09b9f11e7c70e7f1fbe3f3971b92762d",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "7a15950dc71079285a4eaf195de5aadd87c41b40",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3fe9d1d5bce66d029afea87021c504ac9f609a8c",
    "abstract": "We propose CHRT (Control Hidden Representation Transformation) - a controlled language generation framework that steers large language models to generate text pertaining to certain attributes (such as toxicity). CHRT gains attribute control by modifying the hidden representation of the base model through learned transformations. We employ a contrastive-learning framework to learn these transformations that can be combined to gain multi-attribute control. The effectiveness of CHRT is experimentally shown by comparing it with seven baselines over three attributes. CHRT outperforms all the baselines in the task of detoxification, positive sentiment steering, and text simplification while minimizing the loss in linguistic qualities. Further, our approach has the lowest inference latency of only 0.01 seconds more than the base model, making it the most suitable for high-performance production environments. We open-source our code and release two novel datasets to further propel controlled language generation research.",
    "authors": [
        "Vaibhav Kumar",
        "H. Koorehdavoudi",
        "Masud Moshtaghi",
        "Amita Misra",
        "Ankit Chadha",
        "Emilio Ferrara"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "CHRT (Control Hidden Representation Transformation) is a controlled language generation framework that steers large language models to generate text pertaining to certain attributes (such as toxicity) that has the lowest inference latency and is the most suitable for high-performance production environments."
    },
    "citationCount": 2,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}