{
    "acronym": "3fedd3a8e723010c1992ba2e6246fd18e87f9cd2",
    "title": "I Can’t Believe That Happened! : Exploring Expressivity in Collaborative Storytelling with the Tabletop Robot Haru",
    "seed_ids": [
        "gpt2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "3fedd3a8e723010c1992ba2e6246fd18e87f9cd2",
    "abstract": "Collaborative storytelling has long been a goal of social robotics, however, much of this research is limited in interactivity or assumes that story content is curated. In this paper, we present a working fully-automatic collaborative storytelling robot, which can collaborate with a person to create a unique, improvised story by using a large-scale neural language model to dynamically generate continuations to a story. Because effective storytelling requires engaging the emotions of participants, we explore several modalities of procedurally-generated expressivity: 1. an expressive text-to-speech voice with several delivery styles, 2. physical and verbal reactions performed by the robot, and 3. an external display used to show instructions and graphics during storytelling.To understand the issues associated with improvised collaborative storytelling with a social robot, we conduct an online survey and elicitation study with a group of online observers of collaborative storytelling gameplay, comparing several expressivity strategies in terms of storytelling-related characteristics, expressivity characteristics, and personality traits as measured by RoSAS. This evaluation showed that expressivity strategies using both emotive voice and performed reactions were perceived to be more competent storytellers and more strongly associated with positive personality traits.",
    "authors": [
        "Eric Nichols",
        "Deborah Szapiro",
        "Yurii Vasylkiv",
        "Randy Gomez"
    ],
    "venue": "IEEE International Symposium on Robot and Human Interactive Communication",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A working fully-automatic collaborative storytelling robot is presented, which can collaborate with a person to create a unique, improvised story by using a large-scale neural language model to dynamically generate continuations to a story."
    },
    "citationCount": 3,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}