{
    "acronym": "4003b1bb28b3f8463accb3b5d57538708099f0ca",
    "title": "Beyond Extraction: Contextualising Tabular Data for Efficient Summarisation by Language Models",
    "seed_ids": [
        "gpt3",
        "7d083d654f66f763302d8a5f0678beb753f6507b"
    ],
    "s2id": "4003b1bb28b3f8463accb3b5d57538708099f0ca",
    "abstract": "The conventional use of the Retrieval-Augmented Generation (RAG) architecture has proven effective for retrieving information from diverse documents. However, challenges arise in handling complex table queries, especially within PDF documents containing intricate tabular structures.This research introduces an innovative approach to enhance the accuracy of complex table queries in RAG-based systems. Our methodology involves storing PDFs in the retrieval database and extracting tabular content separately. The extracted tables undergo a process of context enrichment, concatenating headers with corresponding values. To ensure a comprehensive understanding of the enriched data, we employ a fine-tuned version of the Llama-2-chat language model for summarisation within the RAG architecture. Furthermore, we augment the tabular data with contextual sense using the ChatGPT 3.5 API through a one-shot prompt. This enriched data is then fed into the retrieval database alongside other PDFs. Our approach aims to significantly improve the precision of complex table queries, offering a promising solution to a longstanding challenge in information retrieval.",
    "authors": [
        "Uday Allu",
        "Biddwan Ahmed",
        "Vishesh Tripathi"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This research introduces an innovative approach to enhance the accuracy of complex table queries in RAG-based systems, using a fine-tuned version of the Llama-2-chat language model for summarisation within the RAG architecture."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}