{
    "acronym": "415067494e2b2d59fb3e1e627c0b3ba4287d2b84",
    "title": "Passage-aware Search Result Diversification",
    "seed_ids": [
        "bert",
        "63857190aaf5aab1d94b54bb257b7b03b8cb5a50",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "415067494e2b2d59fb3e1e627c0b3ba4287d2b84",
    "abstract": "Research on search result diversification strives to enhance the variety of subtopics within the list of search results. Existing studies usually treat a document as a whole and represent it with one fixed-length vector. However, considering that a long document could cover different aspects of a query, using a single vector to represent the document is usually insufficient. To tackle this problem, we propose to exploit multiple passages to better represent documents in search result diversification. Different passages of each document may reflect different subtopics of the query and comparison among the passages can improve result diversity. Specifically, we segment the entire document into multiple passages and train a classifier to filter out the irrelevant ones. Then the document diversity is measured based on several passages that can offer the information needs of the query. Thereafter, we devise a passage-aware search result diversification framework that takes into account the topic information contained in the selected document sequence and candidate documents. The candidate documents’ novelty is evaluated based on their passages while considering the dynamically selected document sequence. We conducted experiments on a commonly utilized dataset, and the results indicate that our proposed method performs better than the most leading methods.",
    "authors": [
        "Zhan Su",
        "Zhicheng Dou",
        "Yutao Zhu",
        "Ji-Rong Wen"
    ],
    "venue": "ACM Trans. Inf. Syst.",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work segments the entire document into multiple passages and trains a classifier to filter out the irrelevant ones, and devise a passage-aware search result diversification framework that takes into account the topic information contained in the selected document sequence and candidate documents."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}