{
    "acronym": "41b50c0e8ab6e551ea6ba70a2fb33c27b3b2175c",
    "title": "Fine Tuning Named Entity Extraction Models for the Fantasy Domain",
    "seed_ids": [
        "bert",
        "9f1c5777a193b2c3bb2b25e248a156348e5ba56d"
    ],
    "s2id": "41b50c0e8ab6e551ea6ba70a2fb33c27b3b2175c",
    "abstract": "Named Entity Recognition (NER) is a sequence classification Natural Language Processing task where entities are identified in the text and classified into predefined categories. It acts as a foundation for most information extraction systems. Dungeons and Dragons (D&D) is an open-ended tabletop fantasy game with its own diverse lore. DnD entities are domain-specific and are thus unrecognizable by even the state-of-the-art off-the-shelf NER systems as the NER systems are trained on general data for pre-defined categories such as: person (PERS), location (LOC), organization (ORG), and miscellaneous (MISC). For meaningful extraction of information from fantasy text, the entities need to be classified into domain-specific entity categories as well as the models be fine-tuned on a domain-relevant corpus. This work uses available lore of monsters in the D&Ddomain to fine-tune Trankit, which is a prolific NER framework that uses a pre-trained model for NER. Upon this training, the system acquires the ability to extract monster names from relevant domain documents under a novel NER tag. This work compares the accuracy of the monster name identification against; the zero-shot Trankit model and two FLAIR models. The fine-tuned Trankit model achieves an 87.86% F1 score surpassing all the other considered models.",
    "authors": [
        "Aravinth Sivaganeshan",
        "Nisansa de Silva"
    ],
    "venue": "Moratuwa Engineering Research Conference",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work compares the accuracy of the monster name identification against; the zero-shot Trankit model and two FLAIR models to achieve an 87.86% F1 score surpassing all the other considered models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}