{
    "acronym": "41d5b00f73426402c9151c8e32561275cd4390f2",
    "title": "CAST: Clustering Self-Attention using Surrogate Tokens for Efficient Transformers",
    "seed_ids": [
        "bigbird",
        "reformer",
        "2fc384087f55111a196c96d88029aab324aa543e",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "cb5df449643767c1474d0aa6f189223f74a10c3d",
        "4f82bd927f6d79fd2e3ddf9d34bec0dc46b8e18c",
        "ec34748a74c84f67edde7cc763922fa6d4486022",
        "232734a65f0d903cdd77b9dfdddb1eded79eff18",
        "af679d69fcc1d0fcf0f039aba937853bcb50a8de",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "c0f709acf38eb27702b0fbce1215db0ebaa2de2b",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "75352cc69a29bd5fc411e0e79737cb96b6309161",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "41d5b00f73426402c9151c8e32561275cd4390f2",
    "abstract": "The Transformer architecture has shown to be a powerful tool for a wide range of tasks. It is based on the self-attention mechanism, which is an inherently computationally expensive operation with quadratic computational complexity: memory usage and compute time increase quadratically with the length of the input sequences, thus limiting the application of Transformers. In this work, we propose a novel Clustering self-Attention mechanism using Surrogate Tokens (CAST), to optimize the attention computation and achieve efficient transformers. CAST utilizes learnable surrogate tokens to construct a cluster affinity matrix, used to cluster the input sequence and generate novel cluster summaries. The self-attention from within each cluster is then combined with the cluster summaries of other clusters, enabling information flow across the entire input sequence. CAST improves efficiency by reducing the complexity from $O(N^2)$ to $O(\\alpha N)$ where N is the sequence length, and {\\alpha} is constant according to the number of clusters and samples per cluster. We show that CAST performs better than or comparable to the baseline Transformers on long-range sequence modeling tasks, while also achieving higher results on time and memory efficiency than other efficient transformers.",
    "authors": [
        "Adjorn van Engelenhoven",
        "Nicola Strisciuglio",
        "Estefan'ia Talavera"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "CAST performs better than or comparable to the baseline Transformers on long-range sequence modeling tasks, while also achieving higher results on time and memory efficiency than other efficient transformers."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}