{
    "acronym": "41d6ddb48affcb544e8f7700ce321c68e36cc34b",
    "title": "An Accurate and Interpretable Framework for Trustworthy Process Monitoring",
    "seed_ids": [
        "transformer",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "30dcc0e191a376fea0e7a46f94c53872c029efc9"
    ],
    "s2id": "41d6ddb48affcb544e8f7700ce321c68e36cc34b",
    "abstract": "Trustworthy process monitoring seeks to build an accurate and interpretable monitoring framework, which is critical for ensuring the safety of energy conversion plant (ECP) that operates under extreme working conditions, such as high pressure and temperature. Contemporary self-attentive models, however, fall short in this domain for two main reasons. First, they rely on stepwise correlations that fail to involve physically meaningful semantics in ECP logs, resulting in suboptimal accuracy and interpretability. Second, attention matrices are frequently cluttered with spurious correlations that obscure physically meaningful ones, further impeding effective interpretation. To overcome these issues, we propose AttentionMixer, a framework aimed at improving both accuracy and interpretability of the existing methods, and establish a trustworthy ECP monitoring framework. Specifically, to tackle the first issue, we employ a spatial adaptive message passing block to capture variatewise correlations. This block is coupled with a temporal adaptive message passing block through a mixing operator, yielding a multifaceted representation of ECP logs accounting for both the stepwise and variatewise correlations. Concurrently, to tackle the second issue, we employ a sparse message passing regularizer to filter out spurious correlations. We validate the efficacy of AttentionMixer using two real-world datasets from the radiation monitoring network for Chinese nuclear power plants.",
    "authors": [
        "Hao Wang",
        "Zhiyu Wang",
        "Yunlong Niu",
        "Zhaoran Liu",
        "Haozhe Li",
        "Yilin Liao",
        "Yuxin Huang",
        "Xinggao Liu"
    ],
    "venue": "IEEE Transactions on Artificial Intelligence",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "AttentionMixer, a framework aimed at improving both accuracy and interpretability of the existing methods, and establish a trustworthy ECP monitoring framework, is proposed and validated using two real-world datasets from the radiation monitoring network for Chinese nuclear power plants."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}