{
    "acronym": "41dfe67f0d26a29b8e54cf3b66219e3021414d30",
    "title": "A Multi-Step-Ahead Photovoltaic Power Forecasting Approach Using One-Dimensional Convolutional Neural Networks and Transformer",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "41dfe67f0d26a29b8e54cf3b66219e3021414d30",
    "abstract": "Due to environmental concerns about the use of fossil fuels, renewable energy, especially solar energy, is increasingly sought after for its ease of installation, cost-effectiveness, and versatile capacity. However, the variability in environmental factors poses a significant challenge to photovoltaic (PV) power generation forecasting, which is crucial for maintaining power system stability and economic efficiency. In this paper, a novel muti-step-ahead PV power generation forecasting model by integrating single-step and multi-step forecasts from various time resolutions was developed. One-dimensional convolutional neural network (CNN) layers were used for single-step forecasting to capture specific temporal patterns, with the transformer model improving multi-step forecasting by leveraging the combined outputs of the CNN. This combination can provide accurate and immediate forecasts as well as the ability to identify longer-term generation trends. Using the DKASC-ASA-1A and 1B datasets for empirical validation, several preprocessing methods were applied and a series of experiments were conducted to compare the performance of the model with other widely used deep learning models. The framework proved to be capable of accurately predicting multi-step-ahead PV power generation at multiple time resolutions.",
    "authors": [
        "Jihoon Moon"
    ],
    "venue": "Electronics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel muti-step-ahead PV power generation forecasting model by integrating single-step and multi-step forecasts from various time resolutions was developed, capable of accurately predicting multi-step-ahead PV power generation at multiple time resolutions."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}