{
    "acronym": "42875fad3b94e7c2ea8c7fd80d3190b9c4dbc2a8",
    "title": "A Meta Analysis of Attention Models on Legal Judgment Prediction System",
    "seed_ids": [
        "neurallegal",
        "a022bda79947d1f656a1164003c1b3ae9a843df9"
    ],
    "s2id": "42875fad3b94e7c2ea8c7fd80d3190b9c4dbc2a8",
    "abstract": "Artificial Intelligence in legal research is transforming the legal area in manifold ways. Pendency of court cases is a long-lasting problem in the judiciary due to various reasons such as lack of judges, lack of technology in legal services and the legal loopholes. The judicial system has to be more competent and more reliable in providing justice on time. One of the major causes of pending cases is the lack of legal intelligence to assist the litigants. The study in this paper reviews the challenges faced by judgment prediction system due to lengthy case facts using deep learning model. The Legal Judgment prediction system can help lawyers, judges and civilians to predict the win or loss rate, punishment term and applicable law articles for new cases. Besides, the paper reviews current encoding and decoding architecture with attention mechanism of transformer model that can be used for Legal Judgment Prediction system. Natural Language Processing using deep learning is an exploring field and there is a need for research to evaluate the current state of the art at the intersection of good text processing and feature representation with a deep learning model. This paper aims to develop a systematic review of existing methods used in the legal judgment prediction system and about the Hierarchical Attention Neural network model in detail. This can also be used in other applications such as legal document classification, sentimental analysis, news classification, text translation, medical reports and so on. Keywords—Legal judgment prediction; hierarchical attention neural network; text processing; transformer",
    "authors": [
        "G. Sukanya",
        "J. Priyadarshini"
    ],
    "venue": "",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The study in this paper reviews the challenges faced by judgment prediction system due to lengthy case facts using deep learning model and develops a systematic review of existing methods used and about the Hierarchical Attention Neural network model in detail."
    },
    "citationCount": 15,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}