{
    "acronym": "42c08dc83138732377eb2e427cc793ccc1edfc42",
    "title": "A Complete Survey on LLM-based AI Chatbots",
    "seed_ids": [
        "gpt3",
        "7b6a8c6d44e0f77bf930484e438d77b7465a69fb",
        "94ce1d5924e05e8d75e43ce70044293ddcef850a",
        "8cf819f6ee33909484ece40d79944c9c37f01a89",
        "4de290467d903b9977e31b3d4084006789bd6ebd",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "2c5460afa19ad6fc2568b7e210115acacc14a40c",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "42c08dc83138732377eb2e427cc793ccc1edfc42",
    "abstract": "The past few decades have witnessed an upsurge in data, forming the foundation for data-hungry, learning-based AI technology. Conversational agents, often referred to as AI chatbots, rely heavily on such data to train large language models (LLMs) and generate new content (knowledge) in response to user prompts. With the advent of OpenAI's ChatGPT, LLM-based chatbots have set new standards in the AI community. This paper presents a complete survey of the evolution and deployment of LLM-based chatbots in various sectors. We first summarize the development of foundational chatbots, followed by the evolution of LLMs, and then provide an overview of LLM-based chatbots currently in use and those in the development phase. Recognizing AI chatbots as tools for generating new knowledge, we explore their diverse applications across various industries. We then discuss the open challenges, considering how the data used to train the LLMs and the misuse of the generated knowledge can cause several issues. Finally, we explore the future outlook to augment their efficiency and reliability in numerous applications. By addressing key milestones and the present-day context of LLM-based chatbots, our survey invites readers to delve deeper into this realm, reflecting on how their next generation will reshape conversational AI.",
    "authors": [
        "Sumit Kumar Dam",
        "Choong-Seon Hong",
        "Yu Qiao",
        "Chaoning Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A complete survey of the evolution and deployment of LLM-based chatbots in various sectors, addressing key milestones and the present-day context of LLM-based chatbots, and inviting readers to delve deeper into this realm."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}