{
    "acronym": "4300adeecf60f0ed1c0ccb9c4b62c0904227bca4",
    "title": "Linear Transformers with Learnable Kernel Functions are Better In-Context Models",
    "seed_ids": [
        "mamba",
        "based",
        "189fde3f4dfa105bb51472a8945618f395919560",
        "77fde89a0f28cae77fd488ee3b641dee716e9c77",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "01e721df7fcf8b664deb2cdc97ff58d65553af6b",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "54155c2977a977bf129849455dcae3a2b79b3f41",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "a30ac45ac5b7bd2148d3fb80ee7f3c29724e3170",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "1a703f08da01cf737cce3fb9064259b3f4b44e9c",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4300adeecf60f0ed1c0ccb9c4b62c0904227bca4",
    "abstract": "Advancing the frontier of subquadratic architectures for Language Models (LMs) is crucial in the rapidly evolving field of natural language processing. Current innovations, including State Space Models, were initially celebrated for surpassing Transformer performance on language modeling tasks. However, these models have revealed deficiencies in essential In-Context Learning capabilities - a domain where the Transformer traditionally shines. The Based model emerged as a hybrid solution, blending a Linear Transformer with a kernel inspired by the Taylor expansion of exponential functions, augmented by convolutional networks. Mirroring the Transformer's in-context adeptness, it became a strong contender in the field. In our work, we present a singular, elegant alteration to the Based kernel that amplifies its In-Context Learning abilities evaluated with the Multi-Query Associative Recall task and overall language modeling process, as demonstrated on the Pile dataset.",
    "authors": [
        "Yaroslav Aksenov",
        "Nikita Balagansky",
        "Sofia Maria Lo Cicero Vaina",
        "Boris Shaposhnikov",
        "Alexey Gorbatovski",
        "Daniil Gavrilov"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A singular, elegant alteration to the Based kernel is presented that amplifies its In-Context Learning abilities evaluated with the Multi-Query Associative Recall task and overall language modeling process, as demonstrated on the Pile dataset."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}