{
    "acronym": "4319a5faceb0f94fc791e49dc0b94dd4d142f90e",
    "title": "Dirichlet Diffusion Score Model for Biological Sequence Generation",
    "seed_ids": [
        "d3pms",
        "analogbits",
        "23b7cde603b5ec8d5d13d46e1c453dc52d7c3f6c",
        "33433e9103b00aa0c42597cbfe13a429fbf5abdf",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "e9b9a47cd81c66603c827f0f2bc4fba0d9ae77c4",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "599bc7cfe98c2b57ddbe111412203a636da57be0"
    ],
    "s2id": "4319a5faceb0f94fc791e49dc0b94dd4d142f90e",
    "abstract": "Designing biological sequences is an important challenge that requires satisfying complex constraints and thus is a natural problem to address with deep generative modeling. Diffusion generative models have achieved considerable success in many applications. Score-based generative stochastic differential equations (SDE) model is a continuous-time diffusion model framework that enjoys many benefits, but the originally proposed SDEs are not naturally designed for modeling discrete data. To develop generative SDE models for discrete data such as biological sequences, here we introduce a diffusion process defined in the probability simplex space with stationary distribution being the Dirichlet distribution. This makes diffusion in continuous space natural for modeling discrete data. We refer to this approach as Dirchlet diffusion score model. We demonstrate that this technique can generate samples that satisfy hard constraints using a Sudoku generation task. This generative model can also solve Sudoku, including hard puzzles, without additional training. Finally, we applied this approach to develop the first human promoter DNA sequence design model and showed that designed sequences share similar properties with natural promoter sequences.",
    "authors": [
        "P. Avdeyev",
        "Chenlai Shi",
        "Y.M. Tan",
        "Kseniia Dudnyk",
        "Jian Zhou"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a diffusion process defined in the probability simplex space with stationary distribution being the Dirichlet distribution, which makes diffusion in continuous space natural for modeling discrete data and demonstrates that this approach can generate samples that satisfy hard constraints using a Sudoku generation task."
    },
    "citationCount": 24,
    "influentialCitationCount": 7,
    "code": null,
    "description": null,
    "url": null
}