{
    "acronym": "434f4ecbfdea4496bbcd763427fc605bf11abddc",
    "title": "Token Dropping for Efficient BERT Pretraining",
    "seed_ids": [
        "funneltransformer",
        "319b84be7a843250bc81d7086f79a4126d550277",
        "837ac4ed6825502f0460caec45e12e734c85b113",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "f6245b3e6270e4dc2e279c4b728030523dffcff4",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "5a3749929bf5fb8b1f98a7b2a43c3b957bcf6c88",
        "16c844fd4d97f3c6eb38b0d6527c87d184efedc3"
    ],
    "s2id": "434f4ecbfdea4496bbcd763427fc605bf11abddc",
    "abstract": "Transformer-based models generally allocate the same amount of computation for each token in a given sequence. We develop a simple but effective “token dropping” method to accelerate the pretraining of transformer models, such as BERT, without degrading its performance on downstream tasks. In particular, we drop unimportant tokens starting from an intermediate layer in the model to make the model focus on important tokens more efficiently if with limited computational resource. The dropped tokens are later picked up by the last layer of the model so that the model still produces full-length sequences. We leverage the already built-in masked language modeling (MLM) loss to identify unimportant tokens with practically no computational overhead. In our experiments, this simple approach reduces the pretraining cost of BERT by 25% while achieving similar overall fine-tuning performance on standard downstream tasks.",
    "authors": [
        "Le Hou",
        "Richard Yuanzhe Pang",
        "Tianyi Zhou",
        "Yuexin Wu",
        "Xinying Song",
        "Xiaodan Song",
        "Denny Zhou"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A simple but effective “token dropping” method is developed to accelerate the pretraining of transformer models, such as BERT, without degrading its performance on downstream tasks."
    },
    "citationCount": 35,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}