{
    "acronym": "43d5850f67f94850809e3b5e5ae8d5e28a9d2ed8",
    "title": "Spatio-Temporal Convolution-Attention Video Network",
    "seed_ids": [
        "mega",
        "fc4cbc7a75f5a3bbca59db5513231555f078fe78",
        "70e91e16eb321067d9402710e14a40cf28311f73",
        "9226ae23b95b3f6891461e086d910ffeb7ac448a",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "78a0fb70b79116eb8d42c5951ced4f9efba513f0"
    ],
    "s2id": "43d5850f67f94850809e3b5e5ae8d5e28a9d2ed8",
    "abstract": "In this paper, we present a hierarchical neural network based on convolutional and attention modeling for short and long-range video reasoning, called Spatio-Temporal Convolution-Attention Video Network (STCA). The proposed method is capable of learning appearance and temporal cues in two stages with different temporal depths to maximize engagement of the short-range and long-range video sequences. It has the benefits of convolutional and attention networks in exploiting spatial and temporal cues for a new spatio-temporal sequence modeling. Our method is a novel mixer architecture to obtain robust properties of convolution (such as translational equivariance) while having the generalization and sequential modeling ability of transformers to deal with dynamic variations in videos. The proposed video deep neural network aims to exploit spatio-temporal information in two stages: 1.) Short Clip Stage (SCS) and 2.) Long Video Stage (LVS). SCS handles spatio-temporal cues dealing with short-range video clips and operates on video frames with 3D convolutions and multi-headed self-attention modeling. Since SCS operates on video frames, this reduces the quadratic complexity of the self-attention operation. In LVS, we mitigate the issue of modeling long-range temporal self-attention. LVS models long-range temporal reasoning using representation (i.e., tokens) obtained from SCS. LVS consists of variants of long-range temporal modeling mechanisms for learning compact and robust global temporal representations of the entire video. We conduct experiments on six challenging video recognition datasets: HVU, Kinetics (400, 600, 700), Something-Something V2, and Long Video Understanding dataset. Through extensive evaluations and ablation studies, we show outstanding performances in comparison to state-of-the-art methods on the mentioned datasets.",
    "authors": [
        "Ali Diba",
        "Vivek Sharma",
        "M. M. Arzani",
        "L. V. Gool"
    ],
    "venue": "2023 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel mixer architecture to obtain robust properties of convolution (such as translational equivariance) while having the generalization and sequential modeling ability of transformers to deal with dynamic variations in videos."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}