{
    "acronym": "4406d933f8aab86d43e6efe1bfdc98a382020634",
    "title": "Open Challenges and Opportunities in Federated Foundation Models Towards Biomedical Healthcare",
    "seed_ids": [
        "gpt3",
        "bert",
        "5fc1a3a49e8f1d106118b69d1d6be3b6caa23da0",
        "242dbbef9e7f624525c57645f193e0b13a90ad44",
        "3aa2c10dd6c72267ea8a622c8f30b3c9240d5fab",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "dc35daba3fb34b2e6a5b12530badb7b799262bbf",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4406d933f8aab86d43e6efe1bfdc98a382020634",
    "abstract": "This survey explores the transformative impact of foundation models (FMs) in artificial intelligence, focusing on their integration with federated learning (FL) for advancing biomedical research. Foundation models such as ChatGPT, LLaMa, and CLIP, which are trained on vast datasets through methods including unsupervised pretraining, self-supervised learning, instructed fine-tuning, and reinforcement learning from human feedback, represent significant advancements in machine learning. These models, with their ability to generate coherent text and realistic images, are crucial for biomedical applications that require processing diverse data forms such as clinical reports, diagnostic images, and multimodal patient interactions. The incorporation of FL with these sophisticated models presents a promising strategy to harness their analytical power while safeguarding the privacy of sensitive medical data. This approach not only enhances the capabilities of FMs in medical diagnostics and personalized treatment but also addresses critical concerns about data privacy and security in healthcare. This survey reviews the current applications of FMs in federated settings, underscores the challenges, and identifies future research directions including scaling FMs, managing data diversity, and enhancing communication efficiency within FL frameworks. The objective is to encourage further research into the combined potential of FMs and FL, laying the groundwork for groundbreaking healthcare innovations.",
    "authors": [
        "Xingyu Li",
        "Lu Peng",
        "Yuping Wang",
        "Weihua Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey explores the transformative impact of foundation models in artificial intelligence, focusing on their integration with federated learning (FL) for advancing biomedical research, and identifies future research directions including scaling FMs, managing data diversity, and enhancing communication efficiency within FL frameworks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}