{
    "acronym": "44f0eb7be111747f54a8669f74be0bb0dad96cff",
    "title": "An Empirical Comparison of Pre-Trained Models of Source Code",
    "seed_ids": [
        "gpt2",
        "e9fc39f56abbc6b8aed1e05496d985e70345a95a",
        "4b27f18bff43d605805c92696a979714ced0b805",
        "0646bb09db4d1ba24150e69b71edcd4aff691b3c",
        "49cf6a22a5dac5bc98b653534af65ffa0bc0e76d",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "44f0eb7be111747f54a8669f74be0bb0dad96cff",
    "abstract": "While a large number of pre-trained models of source code have been successfully developed and applied to a variety of software engineering (SE) tasks in recent years, our understanding of these pre-trained models is arguably fairly limited. With the goal of advancing our understanding of these models, we perform the first systematic empirical comparison of 19 recently-developed pre-trained models of source code on 13 SE tasks. To gain additional insights into these models, we adopt a recently -developed 4-dimensional categorization of pre-trained models, and subsequently investigate whether there are correlations between different categories of pre-trained models and their performances on different SE tasks.",
    "authors": [
        "Changan Niu",
        "Chuanyi Li",
        "Vincent Ng",
        "Dongxiao Chen",
        "Jidong Ge",
        "B. Luo"
    ],
    "venue": "International Conference on Software Engineering",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The first systematic empirical comparison of 19 recently-developed pre- trained models of source code on 13 SE tasks is performed, and a recently -developed 4-dimensional categorization of pre-trained models is adopted to gain additional insights into these models."
    },
    "citationCount": 48,
    "influentialCitationCount": 6,
    "code": null,
    "description": null,
    "url": null
}