{
    "acronym": "44f72ab7d058725c355dc09eab104113d769adb9",
    "title": "Pyramid Diffusion for Fine 3D Large Scene Generation",
    "seed_ids": [
        "d3pms",
        "764740864dc4be6636ba96e3e9e590968cac604f",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "e342165a614588878ad0f4bc9bacf3905df34d08",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "71cc838d8a50a0d62cc9c679536f1f25b2ea6b7f"
    ],
    "s2id": "44f72ab7d058725c355dc09eab104113d769adb9",
    "abstract": "Diffusion models have shown remarkable results in generating 2D images and small-scale 3D objects. However, their application to the synthesis of large-scale 3D scenes has been rarely explored. This is mainly due to the inherent complexity and bulky size of 3D scenery data, particularly outdoor scenes, and the limited availability of comprehensive real-world datasets, which makes training a stable scene diffusion model challenging. In this work, we explore how to effectively generate large-scale 3D scenes using the coarse-to-fine paradigm. We introduce a framework, the Pyramid Discrete Diffusion model (PDD), which employs scale-varied diffusion models to progressively generate high-quality outdoor scenes. Experimental results of PDD demonstrate our successful exploration in generating 3D scenes both unconditionally and conditionally. We further showcase the data compatibility of the PDD model, due to its multi-scale architecture: a PDD model trained on one dataset can be easily fine-tuned with another dataset. Code is available at https://github.com/yuhengliu02/pyramid-discrete-diffusion.",
    "authors": [
        "Yuheng Liu",
        "Xinke Li",
        "Xueting Li",
        "Lu Qi",
        "Chongshou Li",
        "Ming-Hsuan Yang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a framework, the Pyramid Discrete Diffusion model (PDD), which employs scale-varied diffusion models to progressively generate high-quality outdoor scenes and showcases the data compatibility of the PDD model, due to its multi-scale architecture: a PDD model trained on one dataset can be easily fine-tuned with another dataset."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}