{
    "acronym": "451210e692c1377fe14a772aa1efa8aa8bfff7e0",
    "title": "Memory-Augmenting Decoder-Only Language Models through Encoders (Student Abstract)",
    "seed_ids": [
        "transformer",
        "da1d6445b6b64ce9eb4587ba8abbdc490f648ec1",
        "6ff68b34a5f78bdd14437fe5a79aebbc42c26467"
    ],
    "s2id": "451210e692c1377fe14a772aa1efa8aa8bfff7e0",
    "abstract": "The Transformer architecture has seen a lot of attention in recent years also thanks to its ability to scale well and allow massive parallelism during training. This has made possible the development of Language Models (LMs) of increasing size and the discovery of latent abilities that completely outclass traditional methods e.g. rule-based systems. However, they also introduced new issues, like their inability to retain the history of previous interactions due to their stateless nature or the difficulty in controlling their generation. Different attempts have been made to address these issues, e.g. a `brute force' approach to solving the memory issue is to include the full conversation history in the context window, a solution that is limited by the quadratic scalability of Transformers. In this work, we explore computationally practical solutions to the memory problem. We propose to augment the decoder-only architecture of (most) Large LMs with a (relatively small) memory encoder. Its output is prepended to the decoder's input in a similar fashion to recent works in Adapters and the original Transformer architecture. Initial experiments show promising results, however future work is needed to compare with State-of-the-Art methods.",
    "authors": [
        "Alessio Galatolo",
        "Katie Winkle"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes to augment the decoder-only architecture of (most) Large LMs with a (relatively small) memory encoder, prepended to the decoder's input in a similar fashion to recent works in Adapters and the original Transformer architecture."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}