{
    "acronym": "453277762bc0e794667c97880110a0c4feabc374",
    "title": "In-Context Exemplars as Clues to Retrieving from Large Associative Memory",
    "seed_ids": [
        "hopfield",
        "abb79cc72fab35bfeb50585a121375b9bebafbb0",
        "48abfc41a0abf023d2037ebb2f274835e0d322d0",
        "525d93a382f6e7873b5d8a2e0713eb3dff7fb250",
        "cd471b5ef162906ef3d9a84398b3f98e9ee4bf56",
        "d0086b86103a620a86bc918746df0aa642e2a8a3"
    ],
    "s2id": "453277762bc0e794667c97880110a0c4feabc374",
    "abstract": "Recently, large language models (LLMs) have made remarkable progress in natural language processing. The most representative ability of LLMs is in-context learning (ICL), which enables LLMs to learn patterns from in-context exemplars without training. The performance of ICL greatly depends on the exemplars used. However, how to choose exemplars remains unclear due to the lack of understanding of how in-context learning works. In this paper, we present a novel perspective on ICL by conceptualizing it as contextual retrieval from a model of associative memory. We establish a theoretical framework of ICL based on Hopfield Networks. Based on our framework, we look into how in-context exemplars influence the performance of ICL and propose more efficient active exemplar selection. Our study sheds new light on the mechanism of ICL by connecting it to memory retrieval, with potential implications for advancing the understanding of LLMs.",
    "authors": [
        "Jiachen Zhao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel perspective on ICL is presented by conceptualizing it as contextual retrieval from a model of associative memory, which establishes a theoretical framework of ICL based on Hopfield Networks and proposes more efficient active exemplar selection."
    },
    "citationCount": 4,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}