{
    "acronym": "453fc588d97958c6fefad96e79edd896873b3e09",
    "title": "Chess as a Testbed for Language Model State Tracking",
    "seed_ids": [
        "performer",
        "reformer",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "453fc588d97958c6fefad96e79edd896873b3e09",
    "abstract": "Transformer language models have made tremendous strides in natural language understanding tasks. However, the complexity of natural language makes it challenging to ascertain how accurately these models are tracking the world state underlying the text. Motivated by this issue, we consider the task of language modeling for the game of chess. Unlike natural language, chess notations describe a simple, constrained, and deterministic domain. Moreover, we observe that the appropriate choice of chess notation allows for directly probing the world state, without requiring any additional probing-related machinery. We find that: (a) With enough training data, transformer language models can learn to track pieces and predict legal moves with high accuracy when trained solely on move sequences. (b) For small training sets providing access to board state information during training can yield significant improvements. (c) The success of transformer language models is dependent on access to the entire game history i.e. “full attention”. Approximating this full attention results in a significant performance drop. We propose this testbed as a benchmark for future work on the development and analysis of transformer language models.",
    "authors": [
        "Shubham Toshniwal",
        "Sam Wiseman",
        "Karen Livescu",
        "Kevin Gimpel"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is found that with enough training data, transformer language models can learn to track pieces and predict legal moves with high accuracy when trained solely on move sequences and for small training sets providing access to board state information during training can yield significant improvements."
    },
    "citationCount": 24,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}