{
    "acronym": "45e50baac4d341f0cf1a40af096bfa9c3f555235",
    "title": "Understanding the Effect of Model Compression on Social Bias in Large Language Models",
    "seed_ids": [
        "bert",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "45e50baac4d341f0cf1a40af096bfa9c3f555235",
    "abstract": "Large Language Models (LLMs) trained with self-supervision on vast corpora of web text fit to the social biases of that text. Without intervention, these social biases persist in the model's predictions in downstream tasks, leading to representational harm. Many strategies have been proposed to mitigate the effects of inappropriate social biases learned during pretraining. Simultaneously, methods for model compression have become increasingly popular to reduce the computational burden of LLMs. Despite the popularity and need for both approaches, little work has been done to explore the interplay between these two. We perform a carefully controlled study of the impact of model compression via quantization and knowledge distillation on measures of social bias in LLMs. Longer pretraining and larger models led to higher social bias, and quantization showed a regularizer effect with its best trade-off around 20% of the original pretraining time.",
    "authors": [
        "Gustavo Gonçalves",
        "Emma Strubell"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A carefully controlled study of the impact of model compression via quantization and knowledge distillation on measures of social bias in LLMs finds that longer pretraining and larger models led to higher social bias, and quantization showed a regularizer effect with its best trade-off around 20% of the original pretraining time."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}