{
    "acronym": "45f05f24c05695ed5efab3c026d65c4f3ab9799a",
    "title": "COFS: COntrollable Furniture layout Synthesis",
    "seed_ids": [
        "gpt2",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "45f05f24c05695ed5efab3c026d65c4f3ab9799a",
    "abstract": "Realistic, scalable, and controllable generation of furniture layouts is essential for many applications in virtual reality, augmented reality, game development and synthetic data generation. The most successful current methods tackle this problem as a sequence generation problem which imposes a specific ordering on the elements of the layout, making it hard to exert fine-grained control over the attributes of a generated scene. Existing methods provide control through object-level conditioning, or scene completion, where generation can be conditioned on an arbitrary subset of furniture objects. However, attribute-level conditioning, where generation can be conditioned on an arbitrary subset of object attributes, is not supported. We propose COFS, a method to generate furniture layouts that enables fine-grained control through attribute-level conditioning. For example, COFS allows specifying only the scale and type of objects that should be placed in the scene and the generator chooses their positions and orientations; or the position that should be occupied by objects can be specified and the generator chooses their type, scale, orientation, etc. Our results show both qualitatively and quantitatively that we significantly outperform existing methods on attribute-level conditioning.",
    "authors": [
        "W. Para",
        "Paul Guerrero",
        "N. Mitra",
        "Peter Wonka"
    ],
    "venue": "International Conference on Computer Graphics and Interactive Techniques",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "COFS, a method to generate furniture layouts that enables fine-grained control through attribute-level conditioning, is proposed and shows both qualitatively and quantitatively that it significantly outperform existing methods on attribute- level conditioning."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}