{
    "acronym": "460c4b8976bd7686908aa8918b04259cc97563b1",
    "title": "Brain Dialogue Interface (BDI): A User-Friendly fMRI Model for Interactive Brain Decoding",
    "seed_ids": [
        "transformer",
        "8cf819f6ee33909484ece40d79944c9c37f01a89",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "460c4b8976bd7686908aa8918b04259cc97563b1",
    "abstract": "Brain decoding techniques are essential for understanding the neurocognitive system. Although numerous methods have been introduced in this field, accurately aligning complex external stimuli with brain activities remains a formidable challenge. To alleviate alignment difficulties, many studies have simplified their models by employing single-task paradigms and establishing direct links between brain/world through classification strategies. Despite improvements in decoding accuracy, this strategy frequently encounters issues with generality when adapting these models to various task paradigms. To address this issue, this study introduces a user-friendly decoding model that enables dynamic communication with the brain, as opposed to the static decoding approaches utilized by traditional studies. The model functions as a brain simulator, allowing for interactive engagement with the brain and enabling the decoding of a subject's experiences through dialogue-like queries. Uniquely, our model is trained in a completely unsupervised and task-free manner. Our experiments demonstrate the feasibility and versatility of our proposed method. Notably, our model demonstrates exceptional capabilities in signal compression, successfully representing the entire brain signal of approximately 185,751 voxels with just 32 signals. Furthermore, we show how our model can integrate seamlessly with multimodal models, thus enhancing the potential for controlling brain decoding through textual or image inputs.",
    "authors": [
        "Heng Huang",
        "Lin Zhao",
        "Zihao Wu",
        "Xiao-Xing Yu",
        "Jing Zhang",
        "Xintao Hu",
        "Dajiang Zhu",
        "Tianming Liu"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study introduces a user-friendly decoding model that enables dynamic communication with the brain, as opposed to the static decoding approaches utilized by traditional studies, and shows how it can integrate seamlessly with multimodal models, thus enhancing the potential for controlling brain decoding through textual or image inputs."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}