{
    "acronym": "465b80aea2b99ffe0710325f5c256e8d2ac642a5",
    "title": "EDGE: Editable Dance Generation From Music",
    "seed_ids": [
        "classfreediffu",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "15736f7c205d961c00378a938daffaacb5a0718d",
        "81521a80f7aa939281863c15b42e446ff5a0e65a",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "58350665d7880fa1c85f6889b3a44cc96fa67d56"
    ],
    "s2id": "465b80aea2b99ffe0710325f5c256e8d2ac642a5",
    "abstract": "Dance is an important human art form, but creating new dances can be difficult and time-consuming. In this work, we introduce Editable Dance GEneration (EDGE), a state-of-the-art method for editable dance generation that is capable of creating realistic, physically-plausible dances while remaining faithful to the input music. EDGE uses a transformer-based diffusion model paired with Jukebox, a strong music feature extractor, and confers powerful editing capabilities well-suited to dance, including joint-wise conditioning, and in-betweening. We introduce a new metric for physical plausibility, and evaluate dance quality generated by our method extensively through (1) multiple quantitative metrics on physical plausibility, beat alignment, and diversity benchmarks, and more importantly, (2) a large-scale user study, demonstrating a significant improvement over previous state-of-the-art methods. Qualitative samples from our model can be found at our website.",
    "authors": [
        "Jo-Han Tseng",
        "Rodrigo Castellon",
        "C. Liu"
    ],
    "venue": "Computer Vision and Pattern Recognition",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces Editable Dance GEneration (EDGE), a state-of-the-art method for editable dance generation that is capable of creating realistic, physically-plausible dances while remaining faithful to the input music."
    },
    "citationCount": 129,
    "influentialCitationCount": 18,
    "code": null,
    "description": null,
    "url": null
}