{
    "acronym": "46c585ee9abf76779ea4b863d2da4358efd0d1d3",
    "title": "Adaptive Semiparametric Language Models",
    "seed_ids": [
        "transformerxl",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "cd63025532a62fa245a02ec05e32ac4d23089631",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "46c585ee9abf76779ea4b863d2da4358efd0d1d3",
    "abstract": "Abstract We present a language model that combines a large parametric neural network (i.e., a transformer) with a non-parametric episodic memory component in an integrated architecture. Our model uses extended short-term context by caching local hidden states—similar to transformer-XL—and global long-term memory by retrieving a set of nearest neighbor tokens at each timestep. We design a gating function to adaptively combine multiple information sources to make a prediction. This mechanism allows the model to use either local context, short-term memory, or long-term memory (or any combination of them) on an ad hoc basis depending on the context. Experiments on word-based and character-based language modeling datasets demonstrate the efficacy of our proposed method compared to strong baselines.",
    "authors": [
        "Dani Yogatama",
        "Cyprien de Masson d'Autume",
        "Lingpeng Kong"
    ],
    "venue": "Transactions of the Association for Computational Linguistics",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A language model that combines a large parametric neural network with a non-parametric episodic memory component in an integrated architecture is presented and a gating function to adaptively combine multiple information sources to make a prediction is designed."
    },
    "citationCount": 94,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}