{
    "acronym": "46f489808b42403c456aeb4f07c6ce3e772d382e",
    "title": "Sequence-to-sequence translation from mass spectra to peptides with a transformer model",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "46f489808b42403c456aeb4f07c6ce3e772d382e",
    "abstract": "A fundamental challenge for any mass spectrometry-based proteomics experiment is the identification of the peptide that generated each acquired tandem mass spectrum. Although approaches that leverage known peptide sequence databases are widely used and effective for well-characterized model organisms, such methods cannot detect unexpected peptides and can be impractical or impossible to apply in some settings. Thus, the ability to assign peptide sequences to the acquired tandem mass spectra without prior information—de novo peptide sequencing—is valuable for gaining biological insights for tasks including antibody sequencing, immunopeptidomics, and metaproteomics. Although many methods have been developed to address this de novo sequencing problem, it remains an outstanding challenge, in part due to the difficulty of modeling the irregular data structure of tandem mass spectra. Here, we describe Casanovo, a machine learning model that uses a transformer neural network architecture to translate the sequence of peaks in a tandem mass spectrum into the sequence of amino acids that comprise the generating peptide. We train a Casanovo model from 30 million labeled spectra and demonstrate that the model outperforms several state-of-the-art methods on a cross-species benchmark dataset. We also develop a version of Casanovo that is fine-tuned for non-enzymatic peptides. Finally, we demonstrate that Casanovo’s superior performance improves the analysis of immunopeptidomics and metaproteomics experiments and allows us to delve deeper into the dark proteome.",
    "authors": [
        "Melih Yilmaz",
        "William E. Fondrie",
        "Wout Bittremieux",
        "Rowan Nelson",
        "Varun Ananth",
        "Sewoong Oh",
        "William Stafford Noble"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Cananovo is described, a machine learning model that uses a transformer neural network architecture to translate the sequence of peaks in a tandem mass spectrum into the sequence of amino acids that comprise the generating peptide."
    },
    "citationCount": 10,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}