{
    "acronym": "479890489d9cd8c4c2dce9a3a51b3ec74f99edf5",
    "title": "Aspect-Based Sentiment Analysis Techniques: A Comparative Study",
    "seed_ids": [
        "bert",
        "270f3bea8ca801870a6cc56b4d36f7f2019c9ed0",
        "c6c734e16f66fbfcefac7625cc64599e83292c1e",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "479890489d9cd8c4c2dce9a3a51b3ec74f99edf5",
    "abstract": "Since the dawn of the digitalisation era, customer feedback and online reviews are unequivocally major sources of insights for businesses. Consequently, conducting comparative analyses of such sources has become the de facto modus operandi of any business that wishes to give itself a competitive edge over its peers and improve customer loyalty. Sentiment analysis is one such method instrumental in gauging public interest, exposing market trends, and analysing competitors. While traditional sentiment analysis focuses on overall sentiment, as the needs advance with time, it has become important to explore public opinions and sentiments on various specific subjects, products and services mentioned in the reviews on a finer-granular level. To this end, Aspect-based Sentiment Analysis (ABSA), supported by advances in Artificial Intelligence (AI) techniques which have contributed to a paradigm shift from simple word-level analysis to tone and context-aware analyses, focuses on identifying specific aspects within the text and determining the sentiment associated with each aspect. In this study, we compare several deep-NN methods for ABSA on two benchmark datasets (Restaurant14 and Laptop-14) and found that FAST LSA obtains the best overall results of 87.6% and 82.6% accuracy but does not pass LSA+DeBERTa which reports 90.33% and 86.21% accuracy respectively.",
    "authors": [
        "Dineth Jayakody",
        "Koshila Isuranda",
        "A. V. A. Malkith",
        "Nisansa de Silva",
        "Sachintha Rajith Ponnamperuma",
        "G. Sandamali",
        "K. L. Sudheera"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study compares several deep-NN methods for ABSA on two benchmark datasets and found that FAST LSA obtains the best overall results but does not pass LSA+DeBERTa which reports 90.33% and 86.21% accuracy respectively."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}