{
    "acronym": "479eaafcee15a44b632b3cab41491b517e1531fe",
    "title": "A Comprehensive Survey on Deep Music Generation: Multi-level Representations, Algorithms, Evaluations, and Future Directions",
    "seed_ids": [
        "transformerxl",
        "4c64c35198453662882afd63d618a832c7d8c1b2",
        "ad4c63d617d89ac82ad3fd1dfa68a9f2afa84443",
        "ce510c6cfeac703706460680e977c54554840830",
        "7a79099447bef9a3ea13b1dc409d04b3dff57320",
        "24a70db0bbb5f486126477e32a6a44ab917a4b11",
        "fb507ada871d1e8c29e376dbf7b7879689aa89f9"
    ],
    "s2id": "479eaafcee15a44b632b3cab41491b517e1531fe",
    "abstract": "The utilization of deep learning techniques in generating various contents (such as image, text, etc.) has become a trend. Especially music, the topic of this paper, has attracted widespread attention of countless researchers.The whole process of producing music can be divided into three stages, corresponding to the three levels of music generation: score generation produces scores, performance generation adds performance characteristics to the scores, and audio generation converts scores with performance characteristics into audio by assigning timbre or generates music in audio format directly. Previous surveys have explored the network models employed in the field of automatic music generation. However, the development history, the model evolution, as well as the pros and cons of same music generation task have not been clearly illustrated. This paper attempts to provide an overview of various composition tasks under different music generation levels, covering most of the currently popular music generation tasks using deep learning. In addition, we summarize the datasets suitable for diverse tasks, discuss the music representations, the evaluation methods as well as the challenges under different levels, and finally point out several future directions.",
    "authors": [
        "Shulei Ji",
        "Jing Luo",
        "Xinyu Yang"
    ],
    "venue": "arXiv.org",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper attempts to provide an overview of various composition tasks under different music generation levels, covering most of the currently popular music generation tasks using deep learning."
    },
    "citationCount": 97,
    "influentialCitationCount": 7,
    "code": null,
    "description": null,
    "url": null
}