{
    "acronym": "47a1263ba21a72790334544f2a11b7c0ee4b5e76",
    "title": "Multimodality Representation Learning: A Survey on Evolution, Pretraining and Its Applications",
    "seed_ids": [
        "gpt",
        "981995fd64611f475179b280f4e9c241051ac185",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "47a1263ba21a72790334544f2a11b7c0ee4b5e76",
    "abstract": "Multimodality Representation Learning, as a technique of learning to embed information from different modalities and their correlations, has achieved remarkable success on a variety of applications, such as Visual Question Answering (VQA), Natural Language for Visual Reasoning (NLVR), and Vision Language Retrieval (VLR). Among these applications, cross-modal interaction and complementary information from different modalities are crucial for advanced models to perform any multimodal task, e.g., understand, recognize, retrieve, or generate optimally. Researchers have proposed diverse methods to address these tasks. The different variants of transformer-based architectures performed extraordinarily on multiple modalities. This survey presents the comprehensive literature on the evolution and enhancement of deep learning multimodal architectures to deal with textual, visual and audio features for diverse cross-modal and modern multimodal tasks. This study summarizes the (i) recent task-specific deep learning methodologies, (ii) the pretraining types and multimodal pretraining objectives, (iii) from state-of-the-art pretrained multimodal approaches to unifying architectures, and (iv) multimodal task categories and possible future improvements that can be devised for better multimodal learning. Moreover, we prepare a dataset section for new researchers that covers most of the benchmarks for pretraining and finetuning. Finally, major challenges, gaps, and potential research topics are explored. A constantly-updated paperlist related to our survey is maintained at https://github.com/marslanm/multimodality-representation-learning.",
    "authors": [
        "Muhammad Arslan Manzoor",
        "S. Albarri",
        "Ziting Xian",
        "Zaiqiao Meng",
        "Preslav Nakov",
        "Shangsong Liang"
    ],
    "venue": "ACM Trans. Multim. Comput. Commun. Appl.",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey presents the comprehensive literature on the evolution and enhancement of deep learning multimodal architectures to deal with textual, visual and audio features for diverse cross-modal and modern multimodals tasks and prepares a dataset section for new researchers that covers most of the benchmarks for pretraining and finetuning."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}