{
    "acronym": "47ad867a1adb71475a36861cb6a107cc5a341483",
    "title": "Fast Adaptation via Prompted Data: An Efficient Cross-Domain Fine-tuning Method for Large Language Models",
    "seed_ids": [
        "gpt",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "bf722dc893ddaad5045fca5646212ec3badf3c5a",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "b47381e04739ea3f392ba6c8faaf64105493c196"
    ],
    "s2id": "47ad867a1adb71475a36861cb6a107cc5a341483",
    "abstract": "Large language models (LLMs) have achieved great success in a variety of natural language understanding tasks. However, domain discrepancies between the downstream task and the pre-training corpora may have hurdled LLMs to excel further in the vertical applications. Contrary to prior computational-heavy methods, we propose a lightweight solution to further bridge the gap in applying LLMs to diverse downstream tasks — a Fast Adaptation method for LLMs via Prompted Data, in short FAvPD. Notably, with FAvPD, we establish an additional adaptive tuning procedure, wherein we integrate downstream text corpora, gold labels as well as external knowledge sources and then envelop them into a form of highly controllable prompt. As a simple, easy-to-use, and versatile solution, FAvPD lies in the intersection of regimes like knowledge-augmented LLMs, fine-tuning, and adaptation techniques. With extensive experiments, we prove that FAvPD excels in both performance efficacy and training efficiency over related prior works. FAvPD is publicly available at https://github.com/Hyatio/FAvPD.",
    "authors": [
        "Yiming Zhang",
        "Hantao Yang",
        "Haobo Wang",
        "Jake Zhao"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a lightweight solution to further bridge the gap in applying LLMs to diverse downstream tasks — a Fast Adaptation method for LLMs via Prompted Data, in short FAvPD, which excels in both performance efficacy and training efficiency over related prior works."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}