{
    "acronym": "47e4d7aa183f323d7e16a50185056d1c45d304cb",
    "title": "Detail-Enhanced Intra- and Inter-modal Interaction for Audio-Visual Emotion Recognition",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "47e4d7aa183f323d7e16a50185056d1c45d304cb",
    "abstract": "Capturing complex temporal relationships between video and audio modalities is vital for Audio-Visual Emotion Recognition (AVER). However, existing methods lack attention to local details, such as facial state changes between video frames, which can reduce the discriminability of features and thus lower recognition accuracy. In this paper, we propose a Detail-Enhanced Intra- and Inter-modal Interaction network(DE-III) for AVER, incorporating several novel aspects. We introduce optical flow information to enrich video representations with texture details that better capture facial state changes. A fusion module integrates the optical flow estimation with the corresponding video frames to enhance the representation of facial texture variations. We also design attentive intra- and inter-modal feature enhancement modules to further improve the richness and discriminability of video and audio representations. A detailed quantitative evaluation shows that our proposed model outperforms all existing methods on three benchmark datasets for both concrete and continuous emotion recognition. To encourage further research and ensure replicability, we will release our full code upon acceptance.",
    "authors": [
        "Tong Shi",
        "Xuri Ge",
        "Joemon M. Jose",
        "Nicolas Pugeault",
        "Paul Henderson"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Detail-Enhanced Intra- and Inter-modal Interaction network (DE-III) for AVER, incorporating several novel aspects, including optical flow information to enrich video representations with texture details that better capture facial state changes."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}