{
    "acronym": "480e667c50eb71ba78bfde47e4686ca7b21148bd",
    "title": "MICO: A Multi-alternative Contrastive Learning Framework for Commonsense Knowledge Representation",
    "seed_ids": [
        "gpt2",
        "9fa9d5dd481400b2f3904b33d542d70a6affccb9",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "710d183174844da5b7f392667f3cc25d2b098dde",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "480e667c50eb71ba78bfde47e4686ca7b21148bd",
    "abstract": "Commonsense reasoning tasks such as commonsense knowledge graph completion and commonsense question answering require powerful representation learning. In this paper, we propose to learn commonsense knowledge representation by MICO, a Multi-alternative contrastve learning framework on COmmonsense knowledge graphs (MICO). MICO generates the commonsense knowledge representation by contextual interaction between entity nodes and relations with multi-alternative contrastive learning. In MICO, the head and tail entities in an $(h,r,t)$ knowledge triple are converted to two relation-aware sequence pairs (a premise and an alternative) in the form of natural language. Semantic representations generated by MICO can benefit the following two tasks by simply comparing the distance score between the representations: 1) zero-shot commonsense question answering task; 2) inductive commonsense knowledge graph completion task. Extensive experiments show the effectiveness of our method.",
    "authors": [
        "Ying Su",
        "Zihao Wang",
        "Tianqing Fang",
        "Hongming Zhang",
        "Yangqiu Song",
        "T. Zhang"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Semantic representations generated by MICO can benefit the following two tasks by simply comparing the distance score between the representations: 1) zero-shot commonsense question answering task; 2) inductive commonsense knowledge graph completion task."
    },
    "citationCount": 12,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}