{
    "acronym": "483336e50c566c5505012d8777b97800a6386113",
    "title": "Text Editing by Command",
    "seed_ids": [
        "memcompress",
        "e7c698bdace380f7183dedbe657686f1885f615c",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "483336e50c566c5505012d8777b97800a6386113",
    "abstract": "A prevailing paradigm in neural text generation is one-shot generation, where text is produced in a single step. The one-shot setting is inadequate, however, when the constraints the user wishes to impose on the generated text are dynamic, especially when authoring longer documents. We address this limitation with an interactive text generation setting in which the user interacts with the system by issuing commands to edit existing text. To this end, we propose a novel text editing task, and introduce WikiDocEdits, a dataset of single-sentence edits crawled from Wikipedia. We show that our Interactive Editor, a transformer-based model trained on this dataset, outperforms baselines and obtains positive results in both automatic and human evaluations. We present empirical and qualitative analyses of this model’s performance.",
    "authors": [
        "Felix Faltings",
        "Michel Galley",
        "Gerold Hintz",
        "Chris Brockett",
        "Chris Quirk",
        "Jianfeng Gao",
        "Bill Dolan"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel text editing task, and introduces WikiDocEdits, a dataset of single-sentence edits crawled from Wikipedia, and shows that the Interactive Editor, a transformer-based model trained on this dataset, outperforms baselines and obtains positive results in both automatic and human evaluations."
    },
    "citationCount": 33,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}