{
    "acronym": "484b4e96428a7d3ab46330a15b14278ca7bd68ca",
    "title": "GENIUS: Sketch-based Language Model Pre-training via Extreme and Selective Masking for Text Generation and Augmentation",
    "seed_ids": [
        "gpt2",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "7eba731a7fd8de712b7b79b5af41a6e2d4dbd191",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "7a15950dc71079285a4eaf195de5aadd87c41b40",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "484b4e96428a7d3ab46330a15b14278ca7bd68ca",
    "abstract": "We introduce GENIUS: a conditional text generation model using sketches as input, which can fill in the missing contexts for a given sketch (key information consisting of textual spans, phrases, or words, concatenated by mask tokens). GENIUS is pre-trained on a large-scale textual corpus with a novel reconstruction from sketch objective using an extreme and selective masking strategy, enabling it to generate diverse and high-quality texts given sketches. Comparison with other competitive conditional language models (CLMs) reveals the superiority of GENIUS's text generation quality. We further show that GENIUS can be used as a strong and ready-to-use data augmentation tool for various natural language processing (NLP) tasks. Most existing textual data augmentation methods are either too conservative, by making small changes to the original text, or too aggressive, by creating entirely new samples. With GENIUS, we propose GeniusAug, which first extracts the target-aware sketches from the original training set and then generates new samples based on the sketches. Empirical experiments on 6 text classification datasets show that GeniusAug significantly improves the models' performance in both in-distribution (ID) and out-of-distribution (OOD) settings. We also demonstrate the effectiveness of GeniusAug on named entity recognition (NER) and machine reading comprehension (MRC) tasks. (Code and models are publicly available at https://github.com/microsoft/SCGLab and https://github.com/beyondguo/genius)",
    "authors": [
        "Biyang Guo",
        "Yeyun Gong",
        "Yelong Shen",
        "Songqiao Han",
        "Hailiang Huang",
        "Nan Duan",
        "Weizhu Chen"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "GeniusAug is proposed, which first extracts the target-aware sketches from the original training set and then generates new samples based on the sketches, and is demonstrated to be a strong and ready-to-use data augmentation tool for various natural language processing (NLP) tasks."
    },
    "citationCount": 14,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}