{
    "acronym": "48d11fb087d9d06ab4a1118305b9930a1f9ed3a9",
    "title": "R^2AG: Incorporating Retrieval Information into Retrieval Augmented Generation",
    "seed_ids": [
        "transformer",
        "7baef7beeeda52a330f3d1300b3900635b8e6419",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "ec307b17f193b14292206b65a1bcc95bfd8f02ed"
    ],
    "s2id": "48d11fb087d9d06ab4a1118305b9930a1f9ed3a9",
    "abstract": "Retrieval augmented generation (RAG) has been applied in many scenarios to augment large language models (LLMs) with external documents provided by retrievers. However, a semantic gap exists between LLMs and retrievers due to differences in their training objectives and architectures. This misalignment forces LLMs to passively accept the documents provided by the retrievers, leading to incomprehension in the generation process, where the LLMs are burdened with the task of distinguishing these documents using their inherent knowledge. This paper proposes R$^2$AG, a novel enhanced RAG framework to fill this gap by incorporating Retrieval information into Retrieval Augmented Generation. Specifically, R$^2$AG utilizes the nuanced features from the retrievers and employs a R$^2$-Former to capture retrieval information. Then, a retrieval-aware prompting strategy is designed to integrate retrieval information into LLMs' generation. Notably, R$^2$AG suits low-source scenarios where LLMs and retrievers are frozen. Extensive experiments across five datasets validate the effectiveness, robustness, and efficiency of R$^2$AG. Our analysis reveals that retrieval information serves as an anchor to aid LLMs in the generation process, thereby filling the semantic gap.",
    "authors": [
        "Fuda Ye",
        "Shuangyin Li",
        "Yongqi Zhang",
        "Lei Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "R$^2$AG is proposed, a novel enhanced RAG framework to fill the semantic gap between LLMs and retrievers and serves as an anchor to aid LLMs in the generation process, thereby filling the semantic gap."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}