{
    "acronym": "48d65c0a06bd3d752fee4c3b67698a329c5ebdf6",
    "title": "Controllable Decontextualization of Yes/No Question and Answers into Factual Statements",
    "seed_ids": [
        "gpt2",
        "4a6a65968a8eb8c09ffb57a7774ddabb596565b1",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "48d65c0a06bd3d752fee4c3b67698a329c5ebdf6",
    "abstract": "Yes/No or polar questions represent one of the main linguistic question categories. They consist of a main interrogative clause, for which the answer is binary (assertion or negation). Polar questions and answers (PQA) represent a valuable knowledge resource present in many community and other curated QA sources, such as forums or e-commerce applications. Using answers to polar questions alone in other contexts is not trivial. Answers are contextualized, and presume that the interrogative question clause and any shared knowledge between the asker and answerer are provided. We address the problem of controllable rewriting of answers to polar questions into decontextualized and succinct factual statements. We propose a Transformer sequence to sequence model that utilizes soft-constraints to ensure controllable rewriting, such that the output statement is semantically equivalent to its PQA input. Evaluation on three separate PQA datasets as measured through automated and human evaluation metrics show that our proposed approach achieves the best performance when compared to existing baselines.",
    "authors": [
        "Lingbo Mo",
        "B. Fetahu",
        "Oleg Rokhlenko",
        "S. Malmasi"
    ],
    "venue": "European Conference on Information Retrieval",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a Transformer sequence to sequence model that utilizes soft-constraints to ensure controllable rewriting, such that the output statement is semantically equivalent to its PQA input."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}