{
    "acronym": "491ca4b6d1d58003ba95bc6f3b33ea1ff7592d0e",
    "title": "Deep Learning-Based Dynamic Region of Interest Autofocus Method for Grayscale Image",
    "seed_ids": [
        "flowformer",
        "9b61adb6f0d1e8831ab2f5481a12e2125b13c50a"
    ],
    "s2id": "491ca4b6d1d58003ba95bc6f3b33ea1ff7592d0e",
    "abstract": "In the field of autofocus for optical systems, although passive focusing methods are widely used due to their cost-effectiveness, fixed focusing windows and evaluation functions in certain scenarios can still lead to focusing failures. Additionally, the lack of datasets limits the extensive research of deep learning methods. In this work, we propose a neural network autofocus method with the capability of dynamically selecting the region of interest (ROI). Our main work is as follows: first, we construct a dataset for automatic focusing of grayscale images; second, we transform the autofocus issue into an ordinal regression problem and propose two focusing strategies: full-stack search and single-frame prediction; and third, we construct a MobileViT network with a linear self-attention mechanism to achieve automatic focusing on dynamic regions of interest. The effectiveness of the proposed focusing method is verified through experiments, and the results show that the focusing MAE of the full-stack search can be as low as 0.094, with a focusing time of 27.8 ms, and the focusing MAE of the single-frame prediction can be as low as 0.142, with a focusing time of 27.5 ms.",
    "authors": [
        "Yao Wang",
        "Chuan Wu",
        "Yunlong Gao",
        "Huiying Liu"
    ],
    "venue": "Italian National Conference on Sensors",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A neural network autofocus method with the capability of dynamically selecting the region of interest (ROI) and a MobileViT network with a linear self-attention mechanism to achieve automatic focusing on dynamic regions of interest is proposed."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}