{
    "acronym": "497b1a8711d5f5f0a27254fd4a1bba16ad0d9625",
    "title": "SentiLR: Linguistic Knowledge Enhanced Language Representation for Sentiment Analysis",
    "seed_ids": [
        "gpt",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "68e686817f2c33cd09ba3805fa082348f18affd9",
        "07c53193b50aa0b108b14b9edfbef64ea1e9119b",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "1b553c34270543a36ca12784821a7817b36e66ad",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "497b1a8711d5f5f0a27254fd4a1bba16ad0d9625",
    "abstract": "Most of the existing pre-trained language representation models neglect to consider the linguistic knowledge of texts, whereas we argue that such knowledge can promote language understanding in various NLP tasks. To benefit the downstream tasks in sentiment analysis, we propose a novel language representation model called SentiLR, which introduces word-level linguistic knowledge including part-of-speech tag and prior sentiment polarity from SentiWordNet. During pre-training, we first acquire the prior sentiment polarity of each word by querying the SentiWordNet dictionary with its part-of-speech tag. Then, we devise a new pre-training task called label-aware masked language model consisting of two sub-tasks: 1) word knowledge recovering given the sentence-level label; 2) sentence-level label prediction with linguistic knowledge enhanced context. Experiments show that SentiLR achieves state-of-the-art performances on sentence-level / aspect-level sentiment analysis and sentiment-aware data augmentation.",
    "authors": [
        "Pei Ke",
        "Haozhe Ji",
        "Siyang Liu",
        "Xiaoyan Zhu",
        "Minlie Huang"
    ],
    "venue": "arXiv.org",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel language representation model called SentiLR is proposed, which introduces word-level linguistic knowledge including part-of-speech tag and prior sentiment polarity from SentiWordNet, and achieves state-of theart performances on sentence-level / aspect-level sentiment analysis and sentiment-aware data augmentation."
    },
    "citationCount": 7,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}