{
    "acronym": "499b5121a80c5d5b54cd0e94359da40f4bb7e245",
    "title": "An Extractive-Abstractive Approach for Multi-document Summarization of Scientific Articles for Literature Review",
    "seed_ids": [
        "bigbird",
        "d25121da56c9050137800c69520111b30201d1ed",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "499b5121a80c5d5b54cd0e94359da40f4bb7e245",
    "abstract": "Research in the biomedical domain is con- stantly challenged by its large amount of ever- evolving textual information. Biomedical re- searchers are usually required to conduct a lit- erature review before any medical interven- tion to assess the effectiveness of the con- cerned research. However, the process is time- consuming, and therefore, automation to some extent would help reduce the accompanying information overload. Multi-document sum- marization of scientific articles for literature reviews is one approximation of such automa- tion. Here in this paper, we describe our pipelined approach for the aforementioned task. We design a BERT-based extractive method followed by a BigBird PEGASUS-based ab- stractive pipeline for generating literature re- view summaries from the abstracts of biomedi- cal trial reports as part of the Multi-document Summarization for Literature Review (MSLR) shared task1 in the Scholarly Document Pro- cessing (SDP) workshop 20222. Our proposed model achieves the best performance on the MSLR-Cochrane leaderboard3 on majority of the evaluation metrics. Human scrutiny of our automatically generated summaries indicates that our approach is promising to yield readable multi-article summaries for conducting such lit- erature reviews.",
    "authors": [
        "Kartik Shinde",
        "Trinita Roy",
        "Tirthankar Ghosal"
    ],
    "venue": "SDP",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Human scrutiny of the automatically generated summaries indicates that the approach is promising to yield readable multi-article summaries for conducting such lit- erature reviews."
    },
    "citationCount": 3,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}