{
    "acronym": "499b172ae03e36dcad9f584983d18d70bfd2cdf2",
    "title": "LeSICiN: A Heterogeneous Graph-based Approach for Automatic Legal Statute Identification from Indian Legal Documents",
    "seed_ids": [
        "neurallegal"
    ],
    "s2id": "499b172ae03e36dcad9f584983d18d70bfd2cdf2",
    "abstract": "The task of Legal Statute Identification (LSI) aims to identify the legal statutes that are relevant to a given description of facts or evidence of a legal case. \n Existing methods only utilize the textual content of facts and legal articles to guide such a task. However, the citation network among case documents and legal statutes is a rich source of additional information, which is not considered by existing models. \n In this work, we take the first step towards utilising both the text and the legal citation network for the LSI task.\n We curate a large novel dataset for this task, including facts of cases from several major Indian Courts of Law, and statutes from the Indian Penal Code (IPC). \n Modeling the statutes and training documents as a heterogeneous graph, our proposed model LeSICiN can learn rich textual and graphical features, and can also tune itself to correlate these features. \n Thereafter, the model can be used to inductively predict links between test documents (new nodes whose graphical features are not available to the model) and statutes (existing nodes). \n Extensive experiments on the dataset show that our model comfortably outperforms several state-of-the-art baselines, by exploiting the graphical structure along with textual features.",
    "authors": [
        "Shounak Paul",
        "Pawan Goyal",
        "Saptarshi Ghosh"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work takes the first step towards utilising both the text and the legal citation network for the LSI task, by modeling the statutes and training documents as a heterogeneous graph and showing that the proposed model LeSICiN comfortably outperforms several state-of-the-art baselines."
    },
    "citationCount": 31,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}