{
    "acronym": "49c3f85573a3204c5e66317289e4cecfed50f38a",
    "title": "Assemble Foundation Models for Automatic Code Summarization",
    "seed_ids": [
        "gpt",
        "0646bb09db4d1ba24150e69b71edcd4aff691b3c",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "49c3f85573a3204c5e66317289e4cecfed50f38a",
    "abstract": "Automatic code summarization is beneficial to software development and maintenance since it reduces the burden of manual tasks. Currently, artificial intelligence is undergoing a paradigm shift. The foundation models pretrained on massive data and finetuned to downstream tasks surpass specially customized models. This trend inspired us to consider reusing foundation models instead of learning from scratch. Based on this, we propose a flexible and robust approach for automatic code summarization based on neural networks. We assemble available foundation models, such as CodeBERT and GPT-2, into a single model named AdaMo. Moreover, we utilize Gaussian noise as the simulation of contextual information to optimize the latent representation. Furthermore, we introduce two adaptive schemes from the perspective of knowledge transfer, namely continuous pretraining and intermediate finetuning, and design intermediate stage tasks for general sequence-to-sequence learning. Finally, we evaluate AdaMo against a benchmark dataset for code summarization, by comparing it with state-of-the-art models.",
    "authors": [
        "Jian Gu",
        "P. Salza",
        "H. Gall"
    ],
    "venue": "IEEE International Conference on Software Analysis, Evolution, and Reengineering",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work assembles available foundation models, such as CodeBERT and GPT-2, into a single model named AdaMo, and utilizes Gaussian noise as the simulation of contextual information to optimize the latent representation."
    },
    "citationCount": 25,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}