{
    "acronym": "49cbfa5848aaa74ce01d29ee5328f1a2b466ce27",
    "title": "David helps Goliath: Inference-Time Collaboration Between Small Specialized and Large General Diffusion LMs",
    "seed_ids": [
        "ssdlm",
        "67cdecbcfed07b9a29d9e2a92da684604383afd7",
        "f2f85068c9e22a4d8fe6b58e2d92e2d30bc10578",
        "3a22aad6c18a9559be3bbb197494b434b872a05a",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "020a50f6a7154850ac81e3cde69ad8198ded6751",
        "1f898d66acabff511a3871b82799aa73c0055402",
        "a1186d7d9a9ef258c76afef1177e4f348061a537",
        "a979742220a88b1d32e1fbe72c41e8ba3007053c",
        "2c6ac935c826002976722ca8d3319f691975687e",
        "0b9770a377b3f96cef9f268cee1791d39a0d4893",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "24425954960ce968e5f14360fbdd0605abcadfcf",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "49cbfa5848aaa74ce01d29ee5328f1a2b466ce27",
    "abstract": "Diffusion-based language models are emerging as a promising alternative to autoregressive LMs: they approach the competence of autoregressive LMs while offering nuanced controllability at inference time. While autoregressive LMs have benefited immensely from scaling and instruction-based learning, existing studies of diffusion LMs have been conducted on a smaller scale. Starting with a recently proposed diffusion model SSD-LM, in this work we first explore methods to scale it from 0.4B to 13B parameters, proposing techniques to improve its training and inference efficiency, and to finetune the model to follow instructions. Armed with a more powerful, general purpose diffusion LM, we introduce the primary contribution of this work – SSD-2 – an approach to easily ensemble at inference time a large general-purpose diffusion LM with smaller, but specialized and contextualized diffusion LMs. We show that SSD-2 facilitates novel ensembles with 100x smaller models that can be customized and deployed by individual users. We find that compared to autoregressive models, the collaboration between diffusion LMs is more effective, leading to higher-quality model responses due to their ability to dynamically incorporate bi-directional contexts.",
    "authors": [
        "Xiaochuang Han",
        "Sachin Kumar",
        "Yulia Tsvetkov",
        "Marjan Ghazvininejad"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Compared to autoregressive models, the collaboration between diffusion LMs is more effective, leading to higher-quality model responses due to their ability to dynamically incorporate bi-directional contexts, and it is shown that SSD-2 facilitates novel ensembles with 100x smaller models that can be customized and deployed by individual users."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}