{
    "acronym": "49f3d7edffeda63e4bc983f01b240ed32ae3c329",
    "title": "Do Pre-Trained Language Models Detect and Understand Semantic Underspecification? Ask the DUST!",
    "seed_ids": [
        "gpt2",
        "d989f59ef6a54a933b40ece2bedfbdc6bb9c178d",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "49f3d7edffeda63e4bc983f01b240ed32ae3c329",
    "abstract": "In everyday language use, speakers frequently utter and interpret sentences that are semantically underspecified, namely, whose content is insufficient to fully convey their message or interpret them univocally. For example, to interpret the underspecified sentence\"Don't spend too much\", which leaves implicit what (not) to spend, additional linguistic context or outside knowledge is needed. In this work, we propose a novel Dataset of semantically Underspecified Sentences grouped by Type (DUST) and use it to study whether pre-trained language models (LMs) correctly identify and interpret underspecified sentences. We find that newer LMs are reasonably able to identify underspecified sentences when explicitly prompted. However, interpreting them correctly is much harder for any LMs. Our experiments show that when interpreting underspecified sentences, LMs exhibit little uncertainty, contrary to what theoretical accounts of underspecification would predict. Overall, our study reveals limitations in current models' processing of sentence semantics and highlights the importance of using naturalistic data and communicative scenarios when evaluating LMs' language capabilities.",
    "authors": [
        "Frank Wildenburg",
        "Michael Hanna",
        "Sandro Pezzelle"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel Dataset of semantically Underspecified Sentences grouped by Type (DUST) is proposed and used to study whether pre-trained language models (LMs) correctly identify and interpret underspecified sentences and reveals limitations in current models' processing of sentence semantics."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}