{
    "acronym": "4a05b76187ee07c82edf2d4c2961586ebe854714",
    "title": "Progressive Inference: Explaining Decoder-Only Sequence Classification Models Using Intermediate Predictions",
    "seed_ids": [
        "gpt",
        "83edcfbb206ddad38a971d605da09390604248ea"
    ],
    "s2id": "4a05b76187ee07c82edf2d4c2961586ebe854714",
    "abstract": "This paper proposes Progressive Inference - a framework to compute input attributions to explain the predictions of decoder-only sequence classification models. Our work is based on the insight that the classification head of a decoder-only Transformer model can be used to make intermediate predictions by evaluating them at different points in the input sequence. Due to the causal attention mechanism, these intermediate predictions only depend on the tokens seen before the inference point, allowing us to obtain the model's prediction on a masked input sub-sequence, with negligible computational overheads. We develop two methods to provide sub-sequence level attributions using this insight. First, we propose Single Pass-Progressive Inference (SP-PI), which computes attributions by taking the difference between consecutive intermediate predictions. Second, we exploit a connection with Kernel SHAP to develop Multi Pass-Progressive Inference (MP-PI). MP-PI uses intermediate predictions from multiple masked versions of the input to compute higher quality attributions. Our studies on a diverse set of models trained on text classification tasks show that SP-PI and MP-PI provide significantly better attributions compared to prior work.",
    "authors": [
        "Sanjay Kariyappa",
        "Freddy L'ecu'e",
        "Saumitra Mishra",
        "Christopher Pond",
        "Daniele Magazzeni",
        "Manuela Veloso"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Single Pass-Progressive Inference (SP-PI), which computes attributions by taking the difference between consecutive intermediate predictions, and Multi Pass-Progressive Inference (MP-PI), which uses intermediate predictions from multiple masked versions of the input to compute higher quality attributions."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}