{
    "acronym": "4a0d00220659b0e569defb0d99f33a48b319bda8",
    "title": "A Survey on Text-guided 3D Visual Grounding: Elements, Recent Advances, and Future Directions",
    "seed_ids": [
        "transformer",
        "8cf819f6ee33909484ece40d79944c9c37f01a89",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4a0d00220659b0e569defb0d99f33a48b319bda8",
    "abstract": "Text-guided 3D visual grounding (T-3DVG), which aims to locate a specific object that semantically corresponds to a language query from a complicated 3D scene, has drawn increasing attention in the 3D research community over the past few years. Compared to 2D visual grounding, this task presents great potential and challenges due to its closer proximity to the real world and the complexity of data collection and 3D point cloud source processing. In this survey, we attempt to provide a comprehensive overview of the T-3DVG progress, including its fundamental elements, recent research advances, and future research directions. To the best of our knowledge, this is the first systematic survey on the T-3DVG task. Specifically, we first provide a general structure of the T-3DVG pipeline with detailed components in a tutorial style, presenting a complete background overview. Then, we summarize the existing T-3DVG approaches into different categories and analyze their strengths and weaknesses. We also present the benchmark datasets and evaluation metrics to assess their performances. Finally, we discuss the potential limitations of existing T-3DVG and share some insights on several promising research directions. The latest papers are continually collected at https://github.com/liudaizong/Awesome-3D-Visual-Grounding.",
    "authors": [
        "Daizong Liu",
        "Yang Liu",
        "Wencan Huang",
        "Wei Hu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey attempts to provide a comprehensive overview of the T-3DVG progress, including its fundamental elements, recent research advances, and future research directions, by providing a general structure of the T-3DVG pipeline with detailed components in a tutorial style."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}