{
    "acronym": "4a6a8183652d8f4274f6c219b2f36efb9246db0d",
    "title": "Photonic-Electronic Integrated Circuits for High-Performance Computing and AI Accelerator",
    "seed_ids": [
        "gpt3",
        "139ebdcaa3d5f60a3c5289bb61d5865141886d51"
    ],
    "s2id": "4a6a8183652d8f4274f6c219b2f36efb9246db0d",
    "abstract": "In recent decades, the demand for computational power has surged, particularly with the rapid expansion of artificial intelligence (AI). As we navigate the post-Moore's law era, the limitations of traditional electrical digital computing, including process bottlenecks and power consumption issues, are propelling the search for alternative computing paradigms. Among various emerging technologies, integrated photonics stands out as a promising solution for next-generation high-performance computing, thanks to the inherent advantages of light, such as low latency, high bandwidth, and unique multiplexing techniques. Furthermore, the progress in photonic integrated circuits (PICs), which are equipped with abundant photoelectronic components, positions photonic-electronic integrated circuits as a viable solution for high-performance computing and hardware AI accelerators. In this review, we survey recent advancements in both PIC-based digital and analog computing for AI, exploring the principal benefits and obstacles of implementation. Additionally, we propose a comprehensive analysis of photonic AI from the perspectives of hardware implementation, accelerator architecture, and software-hardware co-design. In the end, acknowledging the existing challenges, we underscore potential strategies for overcoming these issues and offer insights into the future drivers for optical computing.",
    "authors": [
        "Shupeng Ning",
        "Hanqing Zhu",
        "Chenghao Feng",
        "Jiaqi Gu",
        "Zhixing Jiang",
        "Zhoufeng Ying",
        "J. Midkiff",
        "Sourabh Jain",
        "M. Hlaing",
        "David Z. Pan",
        "Ray T. Chen"
    ],
    "venue": "Journal of Lightwave Technology",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This review surveys recent advancements in both PIC-based digital and analog computing for AI, exploring the principal benefits and obstacles of implementation and proposes a comprehensive analysis of photonic AI from the perspectives of hardware implementation, accelerator architecture, and software-hardware co-design."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}