{
    "acronym": "4a6c5f0e7f0c2b47b9024c4cc13a59a31597b2ff",
    "title": "Improving the Applicability of Knowledge-Enhanced Dialogue Generation Systems by Using Heterogeneous Knowledge from Multiple Sources",
    "seed_ids": [
        "gpt2",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4a6c5f0e7f0c2b47b9024c4cc13a59a31597b2ff",
    "abstract": "Traditional conversational systems can only access the given query during the response generation, leading to meaningless responses. To this end, researchers proposed to enhance dialogue generation by integrating external knowledge. Although such methods have achieved remarkable gains, the use of only single-source knowledge often makes existing knowledge-enhanced methods degenerate into traditional models in real scenarios because of the insufficient knowledge coverage of single-source knowledge. To improve the applicability of knowledge-enhanced methods, we propose two novel frameworks to use heterogeneous knowledge from multiple sources. We first propose an MHKD-Seq2Seq framework, which can use different heterogeneous knowledge by identifying abstract-level knowledge behaviors; meanwhile, a Diffuse-Aggregate scheme is used to process multiple knowledge simultaneously and produce a unified result. The next framework MHKD-ARPLM can leverage the advantages of pretrained language models with Knowledge Linearization techniques. In experiments, we collected dialogues from previously open-released datasets and built a multi-source knowledge-aligned dataset TriKE-Weibo, which involves three knowledge sources: commonsense, texts, and infobox tables. Extensive evaluations demonstrate the performance leadership of our approaches against competitive baseline models.",
    "authors": [
        "Sixing Wu",
        "Minghui Wang",
        "Ying Li",
        "D. Zhang",
        "Zhonghai Wu"
    ],
    "venue": "Web Search and Data Mining",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An MHKD-Seq2Seq framework, which can use different heterogeneous knowledge by identifying abstract-level knowledge behaviors, and a Diffuse-Aggregate scheme is used to process multiple knowledge simultaneously and produce a unified result."
    },
    "citationCount": 15,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}