{
    "acronym": "4a7550c486ba19ddcb23c2df38ceaaba8d69cacc",
    "title": "Bridging Local Details and Global Context in Text-Attributed Graphs",
    "seed_ids": [
        "bert",
        "6da4b231148bf26677233d1f778d08a5d26f4313",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "efe4902a39c8ef332058ae7d156a6bffcd3c1341"
    ],
    "s2id": "4a7550c486ba19ddcb23c2df38ceaaba8d69cacc",
    "abstract": "Representation learning on text-attributed graphs (TAGs) is vital for real-world applications, as they combine semantic textual and contextual structural information. Research in this field generally consist of two main perspectives: local-level encoding and global-level aggregating, respectively refer to textual node information unification (e.g., using Language Models) and structure-augmented modeling (e.g., using Graph Neural Networks). Most existing works focus on combining different information levels but overlook the interconnections, i.e., the contextual textual information among nodes, which provides semantic insights to bridge local and global levels. In this paper, we propose GraphBridge, a multi-granularity integration framework that bridges local and global perspectives by leveraging contextual textual information, enhancing fine-grained understanding of TAGs. Besides, to tackle scalability and efficiency challenges, we introduce a graphaware token reduction module. Extensive experiments across various models and datasets show that our method achieves state-of-theart performance, while our graph-aware token reduction module significantly enhances efficiency and solves scalability issues.",
    "authors": [
        "Yaoke Wang",
        "Yun Zhu",
        "Wenqiao Zhang",
        "Yueting Zhuang",
        "Yunfei Li",
        "Siliang Tang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "GraphBridge is proposed, a multi-granularity integration framework that bridges local and global perspectives by leveraging contextual textual information, enhancing fine-grained understanding of TAGs and introduces a graphaware token reduction module to tackle scalability and efficiency challenges."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}