{
    "acronym": "4ad189079046bf9df0f8ece7545e42dc00e13b9f",
    "title": "Towards a Robust Detection of Language Model-Generated Text: Is ChatGPT that easy to detect?",
    "seed_ids": [
        "gpt",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "fd1b829261ba04bb92e0ab60c4f6e7cea0d99fbf",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4ad189079046bf9df0f8ece7545e42dc00e13b9f",
    "abstract": "Recent advances in natural language processing (NLP) have led to the development of large language models (LLMs) such as ChatGPT. This paper proposes a methodology for developing and evaluating ChatGPT detectors for French text, with a focus on investigating their robustness on out-of-domain data and against common attack schemes. The proposed method involves translating an English dataset into French and training a classifier on the translated data. Results show that the detectors can effectively detect ChatGPT-generated text, with a degree of robustness against basic attack techniques in in-domain settings. However, vulnerabilities are evident in out-of-domain contexts, highlighting the challenge of detecting adversarial text. The study emphasizes caution when applying in-domain testing results to a wider variety of content. We provide our translated datasets and models as open-source resources.",
    "authors": [
        "Wissam Antoun",
        "Virginie Mouilleron",
        "Benoît Sagot",
        "Djamé Seddah"
    ],
    "venue": "JEPTALNRECITAL",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Results show that the detectors can effectively detect ChatGPT-generated text, with a degree of robustness against basic attack techniques in in-domain settings, and emphasizes caution when applying in- domain testing results to a wider variety of content."
    },
    "citationCount": 16,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}