{
    "acronym": "4af36ed1d53d13ae17b441562ef1158a5e295a22",
    "title": "Point Neighborhood Embeddings",
    "seed_ids": [
        "metaformer"
    ],
    "s2id": "4af36ed1d53d13ae17b441562ef1158a5e295a22",
    "abstract": "Point convolution operations rely on different embedding mechanisms to encode the neighborhood information of each point in order to detect patterns in 3D space. However, as convolutions are usually evaluated as a whole, not much work has been done to investigate which is the ideal mechanism to encode such neighborhood information. In this paper, we provide the first extensive study that analyzes such Point Neighborhood Embeddings (PNE) alone in a controlled experimental setup. From our experiments, we derive a set of recommendations for PNE that can help to improve future designs of neural network architectures for point clouds. Our most surprising finding shows that the most commonly used embedding based on a Multi-layer Perceptron (MLP) with ReLU activation functions provides the lowest performance among all embeddings, even being surpassed on some tasks by a simple linear combination of the point coordinates. Additionally, we show that a neural network architecture using simple convolutions based on such embeddings is able to achieve state-of-the-art results on several tasks, outperforming recent and more complex operations. Lastly, we show that these findings extrapolate to other more complex convolution operations, where we show how following our recommendations we are able to improve recent state-of-the-art architectures.",
    "authors": [
        "Pedro Hermosilla"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper provides the first extensive study that analyzes such Point Neighborhood Embeddings (PNE) alone in a controlled experimental setup and derives a set of recommendations for PNE that can help to improve future designs of neural network architectures for point clouds."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}