{
    "acronym": "4b6749c981de4c3f519ef18749ecd3059abbff32",
    "title": "C-LLM: Learn to Check Chinese Spelling Errors Character by Character",
    "seed_ids": [
        "bert",
        "5fc1a3a49e8f1d106118b69d1d6be3b6caa23da0",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4b6749c981de4c3f519ef18749ecd3059abbff32",
    "abstract": "Chinese Spell Checking (CSC) aims to detect and correct spelling errors in sentences. Despite Large Language Models (LLMs) exhibit robust capabilities and are widely applied in various tasks, their performance on CSC is often unsatisfactory. We find that LLMs fail to meet the Chinese character-level constraints of the CSC task, namely equal length and phonetic similarity, leading to a performance bottleneck. Further analysis reveal that this issue stems from the granularity of tokenization, as current mixed character-word tokenization struggles to satisfy these character-level constraints. To address this issue, we propose C-LLM, a Large Language Model-based Chinese Spell Checking method that learns to check errors Character by Character. Character-level tokenization enables the model to learn character-level alignment, effectively mitigating issues related to character-level constraints. Furthermore, CSC is simplified to replication-dominated and substitution-supplemented tasks. Experiments on two CSC benchmarks demonstrate that C-LLM achieves an average improvement of 10% over existing methods. Specifically, it shows a 2.1% improvement in general scenarios and a significant 12% improvement in vertical domain scenarios, establishing state-of-the-art performance. The source code can be accessed at https://github.com/ktlKTL/C-LLM.",
    "authors": [
        "Kunting Li",
        "Yong Hu",
        "Liang He",
        "Fandong Meng",
        "Jie Zhou"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "C-LLM is proposed, a Large Language Model-based Chinese Spell Checking method that learns to check errors Character by Character, which enables the model to learn character-level alignment, effectively mitigating issues related to character-level constraints."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}