{
    "acronym": "4bd35d344c635b05f97f4d749741d196ff541bf3",
    "title": "A Primer on Seq2Seq Models for Generative Chatbots",
    "seed_ids": [
        "gpt",
        "gpt2",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "5697a0ede5425954d48daa6e1893dc87bd7d8be7",
        "15190e8b459bd85d546286f7d7da61b4f4f3f58a",
        "53c3940f35b8b45d55ed49056282e1961954513d",
        "15704cdfe55ddd375e7fec9e71cba9956a73972e",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "6ebfbc954b9975d2f2651f380b9bdf46ae963178",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c",
        "d81f4f03913a0087e9b623f6d0dbd9f169b971f5",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4bd35d344c635b05f97f4d749741d196ff541bf3",
    "abstract": "The recent spread of Deep Learning-based solutions for Artificial Intelligence and the development of Large Language Models has pushed forwards significantly the Natural Language Processing area. The approach has quickly evolved in the last ten years, deeply affecting NLP, from low-level text pre-processing tasks –such as tokenisation or POS tagging– to high-level, complex NLP applications like machine translation and chatbots. This article examines recent trends in the development of open-domain data-driven generative chatbots, focusing on the Seq2Seq architectures. Such architectures are compatible with multiple learning approaches, ranging from supervised to reinforcement and, in the last years, allowed to realise very engaging open-domain chatbots. Not only do these architectures allow to directly output the next turn in a conversation but, to some extent, they also allow to control the style or content of the response. To offer a complete view on the subject, we examine possible architecture implementations as well as training and evaluation approaches. Additionally, we provide information about the openly available corpora to train and evaluate such models and about the current and past chatbot competitions. Finally, we present some insights on possible future directions, given the current research status.",
    "authors": [
        "Vincenzo Scotti",
        "L. Sbattella",
        "Roberto Tedesco"
    ],
    "venue": "ACM Computing Surveys",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Recent trends in the development of open-domain data-driven generative chatbots are examined, focusing on the Seq2Seq architectures, which allow to directly output the next turn in a conversation but also allow to control the style or content of the response."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}