{
    "acronym": "4bf51ac7e6f0819f5dae789b0d85559743cd17f4",
    "title": "A Dataset for Pharmacovigilance in German, French, and Japanese: Annotating Adverse Drug Reactions across Languages",
    "seed_ids": [
        "bert",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4bf51ac7e6f0819f5dae789b0d85559743cd17f4",
    "abstract": "User-generated data sources have gained significance in uncovering Adverse Drug Reactions (ADRs), with an increasing number of discussions occurring in the digital world. However, the existing clinical corpora predominantly revolve around scientific articles in English. This work presents a multilingual corpus of texts concerning ADRs gathered from diverse sources, including patient fora, social media, and clinical reports in German, French, and Japanese. Our corpus contains annotations covering 12 entity types, four attribute types, and 13 relation types. It contributes to the development of real-world multilingual language models for healthcare. We provide statistics to highlight certain challenges associated with the corpus and conduct preliminary experiments resulting in strong baselines for extracting entities and relations between these entities, both within and across languages.",
    "authors": [
        "Lisa Raithel",
        "Hui-Syuan Yeh",
        "Shuntaro Yada",
        "Cyril Grouin",
        "Thomas Lavergne",
        "Aur'elie N'ev'eol",
        "P. Paroubek",
        "Philippe Thomas",
        "Tomohiro Nishiyama",
        "Sebastian Moller",
        "E. Aramaki",
        "Yuji Matsumoto",
        "Roland Roller",
        "Pierre Zweigenbaum"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents a multilingual corpus of texts concerning ADRs gathered from diverse sources, including patient fora, social media, and clinical reports in German, French, and Japanese, which contributes to the development of real-world multilingual language models for healthcare."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}