{
    "acronym": "4c54e17ab11dcac2dfe9f1a77ce84c7845fa2592",
    "title": "General-Purpose Retrieval-Enhanced Medical Prediction Model Using Near-Infinite History",
    "seed_ids": [
        "mega",
        "performer",
        "rmt",
        "594d8e1696619f3cebb7c6bffdad8e0a5592f006",
        "70e91e16eb321067d9402710e14a40cf28311f73",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d"
    ],
    "s2id": "4c54e17ab11dcac2dfe9f1a77ce84c7845fa2592",
    "abstract": "Machine learning (ML) has recently shown promising results in medical predictions using electronic health records (EHRs). However, since ML models typically have a limited capability in terms of input sizes, selecting specific medical events from EHRs for use as input is necessary. This selection process, often relying on expert opinion, can cause bottlenecks in development. We propose Retrieval-Enhanced Medical prediction model (REMed) to address such challenges. REMed can essentially evaluate unlimited medical events, select the relevant ones, and make predictions. This allows for an unrestricted input size, eliminating the need for manual event selection. We verified these properties through experiments involving 27 clinical prediction tasks across four independent cohorts, where REMed outperformed the baselines. Notably, we found that the preferences of REMed align closely with those of medical experts. We expect our approach to significantly expedite the development of EHR prediction models by minimizing clinicians' need for manual involvement.",
    "authors": [
        "Junu Kim",
        "Chaeeun Shim",
        "Bosco Seong Kyu Yang",
        "Chami Im",
        "Sung Yoon Lim",
        "Han-Gil Jeong",
        "Edward Choi"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes Retrieval-Enhanced Medical prediction model (REMed), which can essentially evaluate unlimited medical events, select the relevant ones, and make predictions, allowing for an unrestricted input size, eliminating the need for manual event selection."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}