{
    "acronym": "4c69d79c0ee7ac964284a75135b317d1ce7fb2d6",
    "title": "Keyformer: KV Cache Reduction through Key Tokens Selection for Efficient Generative Inference",
    "seed_ids": [
        "gpt3",
        "364d04149674df5ae8501007768cd085c4c12cee",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "60b35c6d68acced19b0c66edcfc0ee0a2c11efed",
        "c193eb176985a81ae64f63c5e50b2f11cfb7c4e6",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "f78fe02f681a0a9a6867b007bd39e3884de64a91",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "dca4d9abbc82e57dfa52f932e893d467a63e0682",
        "2b38ddff8e24a07597c8d042ea7b8b85a678e9b2",
        "ce6b6046ad26e0f29932b539919c58333aedf1eb",
        "9dc624d7258d1a56117ca720aea953ce46b66b21",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "f4238bd2385a52413ccbacfd9e409a650235bd13",
        "690edf44e8739fd80bdfb76f40c9a4a222f3bba8",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "4c69d79c0ee7ac964284a75135b317d1ce7fb2d6",
    "abstract": "Transformers have emerged as the underpinning architecture for Large Language Models (LLMs). In generative language models, the inference process involves two primary phases: prompt processing and token generation. Token generation, which constitutes the majority of the computational workload, primarily entails vector-matrix multiplications and interactions with the Key-Value (KV) Cache. This phase is constrained by memory bandwidth due to the overhead of transferring weights and KV cache values from the memory system to the computing units. This memory bottleneck becomes particularly pronounced in applications that require long-context and extensive text generation, both of which are increasingly crucial for LLMs. This paper introduces\"Keyformer\", an innovative inference-time approach, to mitigate the challenges associated with KV cache size and memory bandwidth utilization. Keyformer leverages the observation that approximately 90% of the attention weight in generative inference focuses on a specific subset of tokens, referred to as\"key\"tokens. Keyformer retains only the key tokens in the KV cache by identifying these crucial tokens using a novel score function. This approach effectively reduces both the KV cache size and memory bandwidth usage without compromising model accuracy. We evaluate Keyformer's performance across three foundational models: GPT-J, Cerebras-GPT, and MPT, which employ various positional embedding algorithms. Our assessment encompasses a variety of tasks, with a particular emphasis on summarization and conversation tasks involving extended contexts. Keyformer's reduction of KV cache reduces inference latency by 2.1x and improves token generation throughput by 2.4x, while preserving the model's accuracy.",
    "authors": [
        "Muhammad Adnan",
        "Akhil Arunkumar",
        "Gaurav Jain",
        "Prashant J. Nair",
        "Ilya Soloveychik",
        "Purushotham Kamath"
    ],
    "venue": "Conference on Machine Learning and Systems",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces\"Keyformer\", an innovative inference-time approach, to mitigate the challenges associated with KV cache size and memory bandwidth utilization and evaluates Keyformer's performance across three foundational models: GPT-J, Cerebras-GPT, and MPT, which employ various positional embedding algorithms."
    },
    "citationCount": 12,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}