{
    "acronym": "4ccc6d562430f8098b5a59da61d8fb3ee1cf80be",
    "title": "Application Research of Word Vector in Component Parsing",
    "seed_ids": [
        "gpt"
    ],
    "s2id": "4ccc6d562430f8098b5a59da61d8fb3ee1cf80be",
    "abstract": "As we all know, syntactic analysis is one of the classic tasks in the field of natural language processing, and its goal is to analyze the input sentence and obtain the corresponding syntactic structure. The machine idea of syntactic analysis came from the 1950s. Due to the importance of this task in natural language processing, syntactic analysis has become one of the very basic and very important tasks in the field of natural language processing, and this task has not only attracted a large number of the computer experts also attracted a large number of linguists, who made great contributions to the development of syntactic analysis. Since the development of syntactic analysis tasks, this research has made great progress, which has played a positive role in promoting the progress of natural language processing. However, there have always been two difficulties in the task of syntactic analysis: one is the accuracy of the analysis results; the other is the speed of analyzing the input sentences. From rule-based to statistics-based, from word vector models to pre-trained models, every technological innovation has contributed to the development of syntactic analysis tasks. Nonetheless, the heights achieved by the syntactic analysis task have not completely overcome the long-standing challenges of accuracy of results and speed of analysis. Therefore, syntactic analysis still has great value and research significance. This paper will start from three aspects: the development status of component parsing algorithms, the impact of word vector technology on component parsing, and syntactic parsing algorithms.",
    "authors": [
        "Yimin Yang",
        "F. Wan"
    ],
    "venue": "International Conference Virtual and Augmented Reality Simulations",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The development status of component parsing algorithms, the impact of word vector technology on component parsing, and syntactic parsing algorithms are studied."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}