{
    "acronym": "4cf3bcd849baa318252e3340eceab465111390e5",
    "title": "Text-Guided Molecule Generation with Diffusion Language Model",
    "seed_ids": [
        "diffusionlm",
        "a979742220a88b1d32e1fbe72c41e8ba3007053c",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "4d2a05140dd9bafaf035a846e7bda05f956304d2"
    ],
    "s2id": "4cf3bcd849baa318252e3340eceab465111390e5",
    "abstract": "Text-guided molecule generation is a task where molecules are generated to match specific textual descriptions. Recently, most existing SMILES-based molecule generation methods rely on an autoregressive architecture. In this work, we propose the Text-Guided Molecule Generation with Diffusion Language Model (TGM-DLM), a novel approach that leverages diffusion models to address the limitations of autoregressive methods. TGM-DLM updates token embeddings within the SMILES string collectively and iteratively, using a two-phase diffusion generation process. The first phase optimizes embeddings from random noise, guided by the text description, while the second phase corrects invalid SMILES strings to form valid molecular representations. We demonstrate that TGM-DLM outperforms MolT5-Base, an autoregressive model, without the need for additional data resources. Our findings underscore the remarkable effectiveness of TGM-DLM in generating coherent and precise molecules with specific properties, opening new avenues in drug discovery and related scientific domains. Code will be released at: https://github.com/Deno-V/tgm-dlm.",
    "authors": [
        "Haisong Gong",
        "Q. Liu",
        "Shu Wu",
        "Liang Wang"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that TGM-DLM outperforms MolT5-Base, an autoregressive model, without the need for additional data resources, underscore the remarkable effectiveness of TGM-DLM in generating coherent and precise molecules with specific properties, opening new avenues in drug discovery and related scientific domains."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}