{
    "acronym": "4cfeb541a3bf9c63845e7f43bb10615628b08f34",
    "title": "Enhanced Transformer Model: A New Frontier in Diabetic Retinopathy Classification",
    "seed_ids": [
        "linformer",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87"
    ],
    "s2id": "4cfeb541a3bf9c63845e7f43bb10615628b08f34",
    "abstract": "Transformer networks have revolutionized the field of natural language processing and computer vision. The self attention mechanism embedded in transformers help the model to weigh the importance of different elements in the input sequence when making predictions. However, the computational complex-ity of large transformers is substantially high. In this research paper, we present a novel automated Diabetic Retinopathy (DR) grading system that utilizes the power of Vision Transformer Networks, augmented with an enhanced multiheaded self-attention (MSA) mechanism. The proposed system, designed to analyze fundus images, leverages the Vision Transformer's self-attention mechanism to focus on relevant features, thereby facilitating accurate and efficient DR grading. Furthermore, the incorpo-ration of the enhanced MSA network not only maintains the interpretative benefits of the original self-attention mechanism but also significantly optimizes computational efficiency. This optimization renders the system well-suited for real-world clinical applications, where both accuracy and speed are paramount. Encouraging results are obtained with the proposed solution, demonstrating its potential as a valuable tool in the field of medical imaging and diagnostics. This work contributes to the growing body of research that seeks to bridge the gap between advanced machine learning techniques and practical healthcare solutions.",
    "authors": [
        "Mili Rosline Mathews",
        "Anzar S. M."
    ],
    "venue": "IEEE International WIE Conference on Electrical and Computer Engineering",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel automated Diabetic Retinopathy (DR) grading system that utilizes the power of Vision Transformer Networks, augmented with an enhanced multiheaded self-attention (MSA) mechanism, demonstrating its potential as a valuable tool in the field of medical imaging and diagnostics."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}