{
    "acronym": "4d0071bdf337fa4cf9a36a17b22ebccce33a6cd5",
    "title": "Def2Vec: Extensible Word Embeddings from Dictionary Definitions",
    "seed_ids": [
        "gpt",
        "15190e8b459bd85d546286f7d7da61b4f4f3f58a",
        "e092ecf56fcca38d0cd6fe9e1e6b11c380f6c286",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4d0071bdf337fa4cf9a36a17b22ebccce33a6cd5",
    "abstract": "D EF 2V EC introduces a novel paradigm for word embeddings, leveraging dictionary definitions to learn semantic representations. By constructing term-document matrices from definitions and applying Latent Semantic Analysis (LSA), D EF 2V EC generates embeddings that offer both strong performance and extensibility. In evaluations encompassing Part-of-Speech tagging , Named Entity Recognition , chunking , and semantic similarity , D EF 2V EC often matches or surpasses state-of-the-art models like W ORD 2V EC , G LO V E , and F AST T EXT . Our model’s second factorised matrix resulting from LSA enables efficient embedding extension for out-of-vocabulary words. By effectively reconciling the advantages of dictionary definitions with LSA-based embeddings, D EF 2V EC yields informative semantic representations, especially considering its reduced data requirements. This paper advances the understanding of word embedding generation by incorporating structured lexical information and efficient embedding extension.",
    "authors": [
        "Irene Morazzoni",
        "Vincenzo Scotti",
        "Roberto Tedesco"
    ],
    "venue": "International Conference on Natural Language and Speech Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The understanding of word embedding generation is advanced by incorporating structured lexical information and efficient embedding extension by effectively reconciling the advantages of dictionary definitions with LSA-based embeddings."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}