{
    "acronym": "4e085f745cccc9085e9bec894d4995cf971ae85d",
    "title": "InterHandGen: Two-Hand Interaction Generation via Cascaded Reverse Diffusion",
    "seed_ids": [
        "classfreediffu",
        "15736f7c205d961c00378a938daffaacb5a0718d",
        "e342165a614588878ad0f4bc9bacf3905df34d08"
    ],
    "s2id": "4e085f745cccc9085e9bec894d4995cf971ae85d",
    "abstract": "We present InterHandGen, a novel framework that learns the generative prior of two-hand interaction. Sampling from our model yields plausible and diverse two-hand shapes in close interaction with or without an object. Our prior can be incorporated into any optimization or learning methods to reduce ambiguity in an ill-posed setup. Our key observation is that directly modeling the joint distribution of multiple instances imposes high learning complexity due to its combinatorial nature. Thus, we propose to decompose the modeling of joint distribution into the modeling of factored unconditional and conditional single instance distribution. In particular, we introduce a diffusion model that learns the single-hand distribution unconditional and conditional to another hand via conditioning dropout. For sampling, we combine anti-penetration and classifier-free guidance to enable plausible generation. Furthermore, we establish the rigorous evaluation protocol of two-hand synthesis, where our method significantly outperforms baseline generative models in terms of plausibility and diversity. We also demonstrate that our diffusion prior can boost the performance of two-hand reconstruction from monocular in-the-wild images, achieving new state-of-the-art accuracy.",
    "authors": [
        "Jihyun Lee",
        "Shunsuke Saito",
        "Giljoo Nam",
        "Minhyuk Sung",
        "Tae-Kyun Kim"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A diffusion model that learns the single-hand distribution unconditional and conditional to another hand via conditioning dropout is introduced, and the rigorous evaluation protocol of two-hand synthesis is established, where the method significantly outperforms baseline generative models in terms of plausibility and diversity."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}