{
    "acronym": "4e2a3ddeaf5defb9318b43c364b9a9efe3847dcf",
    "title": "Compressed Context Memory For Online Language Model Interaction",
    "seed_ids": [
        "rmt",
        "streamingllm",
        "compressivetransformer",
        "compresscontext",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "b069c32fcd77160f944ab3ba71ab6f0cfb782c68",
        "60b35c6d68acced19b0c66edcfc0ee0a2c11efed",
        "2f7364d8e5cf94315bf8905f57de9c5543e9a4bf",
        "c53e3020e4b8f9e1cd7b6ed35221480a2647ea26",
        "f78fe02f681a0a9a6867b007bd39e3884de64a91",
        "37ba9c33025fb31f25436010e12c65a0bafc0e1f",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "0e802c0739771acf70e60d59c2df51cd7e8c50c0",
        "736eb449526fe7128917954ec5532b59e318ec78",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "f51497f463566581874c941353dd9d80069c5b77",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4e2a3ddeaf5defb9318b43c364b9a9efe3847dcf",
    "abstract": "This paper presents a context key/value compression method for Transformer language models in online scenarios, where the context continually expands. As the context lengthens, the attention process demands increasing memory and computations, which in turn reduces the throughput of the language model. To address this challenge, we propose a compressed context memory system that continually compresses the accumulating attention key/value pairs into a compact memory space, facilitating language model inference in a limited memory space of computing environments. Our compression process involves integrating a lightweight conditional LoRA into the language model's forward pass during inference, without the need for fine-tuning the model's entire set of weights. We achieve efficient training by modeling the recursive compression process as a single parallelized forward computation. Through evaluations on conversation, personalization, and multi-task learning, we demonstrate that our approach achieves the performance level of a full context model with $5\\times$ smaller context memory size. We further demonstrate the applicability of our approach in a streaming setting with an unlimited context length, outperforming the sliding window approach. Codes are available at https://github.com/snu-mllab/context-memory.",
    "authors": [
        "Jang-Hyun Kim",
        "Junyoung Yeom",
        "Sangdoo Yun",
        "Hyun Oh Song"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a compressed context memory system that continually compresses the accumulating attention key/value pairs into a compact memory space, facilitating language model inference in a limited memory space of computing environments."
    },
    "citationCount": 2,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}