{
    "acronym": "4e35989ddf9bca3dfab54e4eff50e839ba9f356f",
    "title": "Time Machine GPT",
    "seed_ids": [
        "gpt2",
        "5b7f5488c380cf5085a5dd93e993ad293b225eee",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "5b1641b7661b4d9ec2826e847ebf1b36f2d5bdec",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "9405cc0d6169988371b2755e573cc28650d14dfe",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "4e35989ddf9bca3dfab54e4eff50e839ba9f356f",
    "abstract": "Large language models (LLMs) are often trained on extensive, temporally indiscriminate text corpora, reflecting the lack of datasets with temporal metadata. This approach is not aligned with the evolving nature of language. Conventional methods for creating temporally adapted language models often depend on further pre-training static models on time-specific data. This paper presents a new approach: a series of point-in-time LLMs called Time Machine GPT (TiMaGPT), specifically designed to be nonprognosticative. This ensures they remain uninformed about future factual information and linguistic changes. This strategy is beneficial for understanding language evolution and is of critical importance when applying models in dynamic contexts, such as time-series forecasting, where foresight of future information can prove problematic. We provide access to both the models and training datasets.",
    "authors": [
        "Felix Drinkall",
        "Eghbal Rahimikia",
        "J. Pierrehumbert",
        "Stefan Zohren"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A series of point-in-time LLMs specifically designed to be nonprognosticative, which ensures they remain uninformed about future factual information and linguistic changes when applying models in dynamic contexts, such as time-series forecasting, where foresight of future information can prove problematic."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}