{
    "acronym": "4e5aaf48999c84c44ce5b6867fe8edb3acf1d7c6",
    "title": "Advancing State of the Art in Language Modeling",
    "seed_ids": [
        "s4",
        "transformerxl",
        "70e91e16eb321067d9402710e14a40cf28311f73",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "0822f8d7e6a72a65e65f147d3a8d8fccd485da40",
        "b0cd93e95fb6885db47d755a4c631158b0198047"
    ],
    "s2id": "4e5aaf48999c84c44ce5b6867fe8edb3acf1d7c6",
    "abstract": "Generalization is arguably the most important goal of statistical language modeling research. Publicly available benchmarks and papers published with an open-source code have been critical to advancing the field. However, it is often very difficult, and sometimes even impossible, to reproduce the results fully as reported in publications. In this paper, we propose a simple framework that should help advance the state of the art in language modeling in terms of generalization. We propose to publish not just the code, but also probabilities on dev and test sets with future publications so that one can easily add the new model into an ensemble. This has crucial advantages: it is much easier to determine whether a newly proposed model is actually complementary to the current baseline. Therefore, instead of inventing new names for the old tricks, the scientific community can advance faster. Finally, this approach promotes diversity of ideas: one does not need to create an individual model that is the new state of the art to attract attention; it will be sufficient to develop a new model that learns patterns which other models do not. Thus, even a suboptimal model can be found to have value. Remarkably, our approach has yielded new state-of-the-art results across various language modeling benchmarks up to 10%.",
    "authors": [
        "David Herel",
        "Tomáš Mikolov"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a simple framework that should help advance the state of the art in language modeling in terms of generalization, and has yielded new state-of-the-art results across various language modeling benchmarks up to 10%."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}