{
    "acronym": "4e5d609f0819f7c9c5f98dbbb0144433ff5a5b88",
    "title": "Generating Role-Playing Game Quests With GPT Language Models",
    "seed_ids": [
        "gpt3",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "7a15950dc71079285a4eaf195de5aadd87c41b40",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4e5d609f0819f7c9c5f98dbbb0144433ff5a5b88",
    "abstract": "Quests represent an integral part of role-playing games (RPGs). While evocative, narrative-rich quests are still mostly hand-authored, player demands toward more and richer game content, as well as business requirements for continuous player engagement necessitate alternative, procedural quest generation methods. While existing methods produce mostly uninteresting, mechanical quest descriptions, recent advances in AI have brought forth generative language models with promising computational storytelling capabilities. We leverage two of the most successful transformer models, 1) GPT-2 and 2) GPT-3, to procedurally generate RPG video game quest descriptions. We gathered, processed, and openly published a dataset of 978 quests and their descriptions from six RPGs. We fine-tuned GPT-2 on this dataset with a range of optimizations informed by several ministudies. We validated the resulting Quest-GPT-2 model via an online user study involving 349 RPG players. Our results indicate that one in five quest descriptions would be deemed acceptable by a human critic, yet the variation in quality across individual quests is large. We provide recommendations on current applications of Quest-GPT-2. This is complemented by case-studies on GPT-3 to highlight the future potential of state-of-the-art natural language models for quest generation.",
    "authors": [
        "Susanna Värtinen",
        "Perttu Hämäläinen",
        "C. Guckelsberger"
    ],
    "venue": "IEEE Transactions on Games",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work leverage two of the most successful transformer models, 1) GPT-2 and 2) GPT-3, to procedurally generate RPG video game quest descriptions, and indicates that one in five quest descriptions would be deemed acceptable by a human critic, yet the variation in quality across individual quests is large."
    },
    "citationCount": 26,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}