{
    "acronym": "4e644dd3bd1faf77ad3a063a49b7d0bca8c80e9f",
    "title": "On pushing DeepFake Tweet Detection capabilities to the limits",
    "seed_ids": [
        "gpt2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4e644dd3bd1faf77ad3a063a49b7d0bca8c80e9f",
    "abstract": "The recent advances in natural language generation provide an additional tool to manipulate public opinion on social media. Even though there has not been any report of malicious exploit of the newest generative techniques so far, disturbing human-like scholarly examples of GPT-2 and GPT-3 can be found on social media. Therefore, our paper investigates how the state-of-the-art deepfake social media text detectors perform at recognizing GPT-2 tweets as machine-written, also trying to improve the state-of-the-art by hyper-parameter tuning and ensembling the most promising detectors; finally, our work concentrates on studying the detectors’ capabilities to generalize over tweets generated by the more sophisticated and complex evolution of GPT-2, that is GPT-3. Results demonstrate that hyper-parameter optimization and ensembling advance the state-of-the-art, especially on the detection of GPT-2 tweets. However, all tested detectors dramatically decreased their accuracy on GPT-3 tweets. Despite this, we found out that even though GPT-3 tweets are much closer to human-written tweets than the ones produced by GPT-2, they still have latent features in common share with other generative techniques like GPT-2, RNN and other older methods. All things considered, the research community should quickly devise methods to detect GPT-3 social media texts, as well as older generative methods.",
    "authors": [
        "Margherita Gambini",
        "T. Fagni",
        "F. Falchi",
        "Maurizio Tesconi"
    ],
    "venue": "Web Science Conference",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Investigation of how the state-of-the-art deepfake social media text detectors perform at recognizing GPT-2 tweets as machine-written shows that hyper-parameter optimization and ensembling advance the state of theart, especially on the detection of GPT -3 tweets."
    },
    "citationCount": 25,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}