{
    "acronym": "4e8b7546173a45f71da1fcb94f6efedfbd2de875",
    "title": "Is GPT-4 Conscious?",
    "seed_ids": [
        "transformer",
        "d9964ab436eefd21f923a4bc833c6b66692c7f00",
        "1b492746ee3a304a13950cad1a59861b9ee44645",
        "08ec1848527cd46e34b04ff401b01785cf04e935"
    ],
    "s2id": "4e8b7546173a45f71da1fcb94f6efedfbd2de875",
    "abstract": "GPT-4 (Generative Pre-Trained Transformer 4) is often heralded as a leading commercial AI offering, sparking debates over its potential as a steppingstone toward Artificial General Intelligence. But does it possess consciousness? This paper investigates this key question using the nine qualitative measurements of the Building Blocks theory. GPT-4’s design, architecture, and implementation are compared to each of the building blocks of consciousness to determine whether it has achieved the requisite milestones to be classified as conscious or, if not, how close to consciousness GPT-4 is. Our assessment is that, while GPT-4 in its native configuration is not currently conscious, current technological research and development is sufficient to modify GPT-4 to have all the building blocks of consciousness. Consequently, we argue that the emergence of a conscious AI model is plausible in the near term. The paper concludes with a comprehensive discussion of the ethical implications and societal ramifications of engineering conscious AI entities.",
    "authors": [
        "Izak Tait",
        "Joshua Bensemann",
        "Ziqi Wang"
    ],
    "venue": "Journal of Artificial Intelligence and Consciousness",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is argued that the emergence of a conscious AI model is plausible in the near term because current technological research and development is sufficient to modify GPT-4 to have all the building blocks of consciousness."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}