{
    "acronym": "4eb45f33446018175e266738be22f4d830ed697e",
    "title": "Semantic Self-Segmentation for Abstractive Summarization of Long Documents in Low-Resource Regimes",
    "seed_ids": [
        "longformer",
        "f4566761fe39c4b5273d696d9bc3f4195c9325bb",
        "9dc624d7258d1a56117ca720aea953ce46b66b21",
        "6fa1cfc4f97f03a8485692418c7aa1a06c574a85",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "01b15017ac59b8d6f2ce3598c4a7d6358c211426",
        "25db56fc85fe15625c3375064a35e908ba6dfd2a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "4d244972ed2e0286363bfb054cb269574d21a72c"
    ],
    "s2id": "4eb45f33446018175e266738be22f4d830ed697e",
    "abstract": "The quadratic memory complexity of transformers prevents long document summarization in low computational resource scenarios. State-of-the-art models need to apply input truncation, thus discarding and ignoring potential summary-relevant contents, leading to a performance drop. Furthermore, this loss is generally destructive for semantic text analytics in high-impact domains such as the legal one. In this paper, we propose a novel semantic self-segmentation (Se3) approach for long document summarization to address the critical problems of low-resource regimes, namely to process inputs longer than the GPU memory capacity and produce accurate summaries despite the availability of only a few dozens of training instances. Se3 segments a long input into semantically coherent chunks, allowing transformers to summarize very long documents without truncation by summarizing each chunk and concatenating the results. Experimental outcomes show the approach significantly improves the performance of abstractive summarization transformers, even with just a dozen of labeled data, achieving new state-of-the-art results on two legal datasets of different domains and contents. Finally, we report ablation studies to evaluate each contribution of the components of our method to the performance gain.",
    "authors": [
        "G. Moro",
        "Luca Ragazzi"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Experimental outcomes show the Se3 approach significantly improves the performance of abstractive summarization transformers, even with just a dozen of labeled data, achieving new state-of-the-art results on two legal datasets of different domains and contents."
    },
    "citationCount": 33,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}