{
    "acronym": "4ec4207fd4de8faae99ed08c397f634c7ec1a7b0",
    "title": "Large Language Models Need Holistically Thought in Medical Conversational QA",
    "seed_ids": [
        "gpt",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "b21670e8061a06ab97e7d6052c9345a326e84ff8",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c",
        "3693683c4e0405819fae7115ad680f769eb83534",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4ec4207fd4de8faae99ed08c397f634c7ec1a7b0",
    "abstract": "The medical conversational question answering (CQA) system aims at providing a series of professional medical services to improve the efficiency of medical care. Despite the success of large language models (LLMs) in complex reasoning tasks in various fields, such as mathematics, logic, and commonsense QA, they still need to improve with the increased complexity and specialization of the medical field. This is because medical CQA tasks require not only strong medical reasoning, but also the ability to think broadly and deeply. In this paper, to address these challenges in medical CQA tasks that need to be considered and understood in many aspects, we propose the Holistically Thought (HoT) method, which is designed to guide the LLMs to perform the diffused and focused thinking for generating high-quality medical responses. The proposed HoT method has been evaluated through automated and manual assessments in three different medical CQA datasets containing the English and Chinese languages. The extensive experimental results show that our method can produce more correctness, professional, and considerate answers than several state-of-the-art (SOTA) methods, manifesting its effectiveness. Our code in https://github.com/WENGSYX/HoT.",
    "authors": [
        "Yixuan Weng",
        "Bin Li",
        "Fei Xia",
        "Minjun Zhu",
        "Bing Sun",
        "Shizhu He",
        "Kang Liu",
        "Jun Zhao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Holistically Thought (HoT) method is proposed, which is designed to guide the large language models to perform the diffused and focused thinking for generating high-quality medical responses in CQA tasks."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}