{
    "acronym": "4eed559f559f00ac469bb8b20b95f1906d1aa778",
    "title": "Misinformation is not about Bad Facts: An Analysis of the Production and Consumption of Fringe Content",
    "seed_ids": [
        "bert"
    ],
    "s2id": "4eed559f559f00ac469bb8b20b95f1906d1aa778",
    "abstract": "What if misinformation is not an information problem at all? To understand the role of news publishers in potentially unintentionally propagating misinformation, we examine how far-right and fringe online groups share and leverage established legacy news media articles to advance their narratives. Our findings suggest that online fringe ideologies spread through the use of content that is consensus-based and\"factually correct\". We found that Australian news publishers with both moderate and far-right political leanings contain comparable levels of information completeness and quality; and furthermore, that far-right Twitter users often share from moderate sources. However, a stark difference emerges when we consider two additional factors: 1) the narrow topic selection of articles by far-right users, suggesting that they cherry pick only news articles that engage with their preexisting worldviews and specific topics of concern, and 2) the difference between moderate and far-right publishers when we examine the writing style of their articles. Furthermore, we can identify users prone to sharing misinformation based on their communication style. These findings have important implications for countering online misinformation, as they highlight the powerful role that personal biases towards specific topics and publishers' writing styles have in amplifying fringe ideologies online.",
    "authors": [
        "Jooyoung Lee",
        "Emily Booth",
        "Hany Farid",
        "Marian-Andrei Rizoiu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": null,
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}