{
    "acronym": "4f352758a8790b01d7b1d539592a780bd18efc91",
    "title": "Global Hierarchical Attention for 3D Point Cloud Analysis",
    "seed_ids": [
        "htransformer1d",
        "dbf53ece1a6a8860e41ff5f721c72ceb0fb18dd6",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "4f352758a8790b01d7b1d539592a780bd18efc91",
    "abstract": ". We propose a new attention mechanism, called Global Hierarchical Attention (GHA), for 3D point cloud analysis. GHA approximates the regular global dot-product attention via a series of coarsening and interpolation operations over multiple hierarchy levels. The advantage of GHA is two-fold. First, it has linear complexity with respect to the number of points, enabling the processing of large point clouds. Second, GHA inherently possesses the inductive bias to focus on spatially close points, while retaining the global connectivity among all points. Combined with a feedforward network, GHA can be inserted into many existing network architectures. We experiment with multiple baseline networks and show that adding GHA consistently improves performance across diﬀerent tasks and datasets. For the task of semantic segmentation, GHA gives a +1.7% mIoU increase to the MinkowskiEngine baseline on ScanNet. For the 3D object detection task, GHA improves the CenterPoint baseline by +0.5% mAP on the nuScenes dataset, and the 3DETR baseline by +2.1% mAP 25 and +1.5% mAP 50 on ScanNet.",
    "authors": [
        "Dan Jia",
        "Alexander Hermans",
        "Bastian Leibe"
    ],
    "venue": "German Conference on Pattern Recognition",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed new attention mechanism, called Global Hierarchical Attention (GHA), approximates the regular global dot-product attention via a series of coarsening and interpolation operations over multiple hierarchy levels, enabling the processing of large point clouds."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}