{
    "acronym": "4f5e020ca9ad8339f1f2026e9a93f1a70da324e2",
    "title": "Analysis of Privacy Leakage in Federated Large Language Models",
    "seed_ids": [
        "bert",
        "hopfield",
        "83edcfbb206ddad38a971d605da09390604248ea",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4f5e020ca9ad8339f1f2026e9a93f1a70da324e2",
    "abstract": "With the rapid adoption of Federated Learning (FL) as the training and tuning protocol for applications utilizing Large Language Models (LLMs), recent research highlights the need for significant modifications to FL to accommodate the large-scale of LLMs. While substantial adjustments to the protocol have been introduced as a response, comprehensive privacy analysis for the adapted FL protocol is currently lacking. To address this gap, our work delves into an extensive examination of the privacy analysis of FL when used for training LLMs, both from theoretical and practical perspectives. In particular, we design two active membership inference attacks with guaranteed theoretical success rates to assess the privacy leakages of various adapted FL configurations. Our theoretical findings are translated into practical attacks, revealing substantial privacy vulnerabilities in popular LLMs, including BERT, RoBERTa, DistilBERT, and OpenAI's GPTs, across multiple real-world language datasets. Additionally, we conduct thorough experiments to evaluate the privacy leakage of these models when data is protected by state-of-the-art differential privacy (DP) mechanisms.",
    "authors": [
        "Minh N. Vu",
        "Truc D. T. Nguyen",
        "Tre' R. Jeter",
        "My T. Thai"
    ],
    "venue": "International Conference on Artificial Intelligence and Statistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work designs two active membership inference attacks with guaranteed theoretical success rates to assess the privacy leakages of various adapted FL configurations, revealing substantial privacy vulnerabilities in popular LLMs, including BERT, RoBERTa, DistilBERT, and OpenAI's GPTs, across multiple real-world language datasets."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}