{
    "acronym": "4f695708a8b4c1fa09a49b0037916a57d7e7e562",
    "title": "Importance of Aligning Training Strategy with Evaluation for Diffusion Models in 3D Multiclass Segmentation",
    "seed_ids": [
        "classfreediffu",
        "71eac9b7729c48c4f5da8ca1a7de0cee9d46807a",
        "8f48171bf05474449777d9bbf6766d480332e09f",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "4f695708a8b4c1fa09a49b0037916a57d7e7e562",
    "abstract": "Recently, denoising diffusion probabilistic models (DDPM) have been applied to image segmentation by generating segmentation masks conditioned on images, while the applications were mainly limited to 2D networks without exploiting potential benefits from the 3D formulation. In this work, we studied the DDPM-based segmentation model for 3D multiclass segmentation on two large multiclass data sets (prostate MR and abdominal CT). We observed that the difference between training and test methods led to inferior performance for existing DDPM methods. To mitigate the inconsistency, we proposed a recycling method which generated corrupted masks based on the model's prediction at a previous time step instead of using ground truth. The proposed method achieved statistically significantly improved performance compared to existing DDPMs, independent of a number of other techniques for reducing train-test discrepancy, including performing mask prediction, using Dice loss, and reducing the number of diffusion time steps during training. The performance of diffusion models was also competitive and visually similar to non-diffusion-based U-net, within the same compute budget. The JAX-based diffusion framework has been released at https://github.com/mathpluscode/ImgX-DiffSeg.",
    "authors": [
        "Yunguan Fu",
        "Yiwen Li",
        "Shaheer U. Saeed",
        "M. Clarkson",
        "Yipeng Hu"
    ],
    "venue": "DGM4MICCAI",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work studied the DDPM-based segmentation model for 3D multiclass segmentation on two large multiclass data sets and proposed a recycling method which generated corrupted masks based on the model's prediction at a previous time step instead of using ground truth."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}