{
    "acronym": "4fdf88a4b0677360c333d122699547d8485090f4",
    "title": "From Matching to Generation: A Survey on Generative Information Retrieval",
    "seed_ids": [
        "gpt",
        "gpt3",
        "bert",
        "114dcd4be9eb6f5a7257fbfdb542cfab3153a292",
        "d0a21c79996815953f933286d848f11eca42f097",
        "2330035c7586a0dc0b1f09e9c00106b295acf543",
        "e6300ad75f730485978373e53db7c1c5e03fa062",
        "d99fcc9136b60a824752a0ccb656bb9ae0c1c4ea",
        "44d16a076c00ecada3d425203377e4ec951c4ed0",
        "8a2c9d1d1fa54d33a638743b6fcc3c4383fc4f43",
        "1e909e2a8cdacdcdff125ebcc566f37cb869a1c8",
        "5fc1a3a49e8f1d106118b69d1d6be3b6caa23da0",
        "aade40af0d85b0b4fe15c97f6222d5c2e4d6d9b3",
        "240103933ffe3dac2179cc160a2bd91299357a53",
        "8b25d0065d30ed3c9e6a6cae94de53ef132d656d",
        "ca7bd64d372e3bcb3f4633ca4a20291ff57de3c3",
        "470d2f3f92877cba3ec9ce2662737d7d76b33331",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "465471bb5bf1a945549d6291c2d23367966b4957",
        "a1186d7d9a9ef258c76afef1177e4f348061a537",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "df602516e28a9ef0ef665ed0aef551984d8d770d",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef",
        "72d8ffe0f1ee73c8ea6d742b960ef5eb591f9410",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4fdf88a4b0677360c333d122699547d8485090f4",
    "abstract": "Information Retrieval (IR) systems are crucial tools for users to access information, widely applied in scenarios like search engines, question answering, and recommendation systems. Traditional IR methods, based on similarity matching to return ranked lists of documents, have been reliable means of information acquisition, dominating the IR field for years. With the advancement of pre-trained language models, generative information retrieval (GenIR) has emerged as a novel paradigm, gaining increasing attention in recent years. Currently, research in GenIR can be categorized into two aspects: generative document retrieval (GR) and reliable response generation. GR leverages the generative model's parameters for memorizing documents, enabling retrieval by directly generating relevant document identifiers without explicit indexing. Reliable response generation, on the other hand, employs language models to directly generate the information users seek, breaking the limitations of traditional IR in terms of document granularity and relevance matching, offering more flexibility, efficiency, and creativity, thus better meeting practical needs. This paper aims to systematically review the latest research progress in GenIR. We will summarize the advancements in GR regarding model training, document identifier, incremental learning, downstream tasks adaptation, multi-modal GR and generative recommendation, as well as progress in reliable response generation in aspects of internal knowledge memorization, external knowledge augmentation, generating response with citations and personal information assistant. We also review the evaluation, challenges and future prospects in GenIR systems. This review aims to offer a comprehensive reference for researchers in the GenIR field, encouraging further development in this area.",
    "authors": [
        "Xiaoxi Li",
        "Jiajie Jin",
        "Yujia Zhou",
        "Yuyao Zhang",
        "Peitian Zhang",
        "Yutao Zhu",
        "Zhicheng Dou"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper will summarize the advancements in GR regarding model training, document identifier, incremental learning, downstream tasks adaptation, multi-modal GR and generative recommendation, as well as progress in reliable response generation in aspects of internal knowledge memorization, external knowledge augmentation, generating response with citations and personal information assistant."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}