{
    "acronym": "4ff394ada9298daaf25d75b41f5d52e3104ec8a6",
    "title": "Imagination-Augmented Natural Language Understanding",
    "seed_ids": [
        "gpt2",
        "b76e98a0a023d37c6534aa2ead09c8ff595f0bae",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "4ff394ada9298daaf25d75b41f5d52e3104ec8a6",
    "abstract": "Human brains integrate linguistic and perceptual information simultaneously to understand natural language, and hold the critical ability to render imaginations. Such abilities enable us to construct new abstract concepts or concrete objects, and are essential in involving practical knowledge to solve problems in low-resource scenarios. However, most existing methods for Natural Language Understanding (NLU) are mainly focused on textual signals. They do not simulate human visual imagination ability, which hinders models from inferring and learning efficiently from limited data samples. Therefore, we introduce an Imagination-Augmented Cross-modal Encoder (iACE) to solve natural language understanding tasks from a novel learning perspective—imagination-augmented cross-modal understanding. iACE enables visual imagination with external knowledge transferred from the powerful generative and pre-trained vision-and-language models. Extensive experiments on GLUE and SWAG show that iACE achieves consistent improvement over visually-supervised pre-trained models. More importantly, results in extreme and normal few-shot settings validate the effectiveness of iACE in low-resource natural language understanding circumstances.",
    "authors": [
        "Yujie Lu",
        "Wanrong Zhu",
        "X. Wang",
        "M. Eckstein",
        "William Yang Wang"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "iACE enables visual imagination with external knowledge transferred from the powerful generative and pre-trained vision-and-language models to solve natural language understanding tasks from a novel learning perspective—imagination-augmented cross-modal understanding."
    },
    "citationCount": 16,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}