{
    "acronym": "50244eb6d666cee4522979448071d34e2cc543cf",
    "title": "Audio Mamba: Selective State Spaces for Self-Supervised Audio Representations",
    "seed_ids": [
        "s4",
        "mamba",
        "a7d68b1702af08ce4dbbf2cd0b083e744ae5c6be",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87"
    ],
    "s2id": "50244eb6d666cee4522979448071d34e2cc543cf",
    "abstract": "Despite its widespread adoption as the prominent neural architecture, the Transformer has spurred several independent lines of work to address its limitations. One such approach is selective state space models, which have demonstrated promising results for language modelling. However, their feasibility for learning self-supervised, general-purpose audio representations is yet to be investigated. This work proposes Audio Mamba, a selective state space model for learning general-purpose audio representations from randomly masked spectrogram patches through self-supervision. Empirical results on ten diverse audio recognition downstream tasks show that the proposed models, pretrained on the AudioSet dataset, consistently outperform comparable self-supervised audio spectrogram transformer (SSAST) baselines by a considerable margin and demonstrate better performance in dataset size, sequence length and model size comparisons.",
    "authors": [
        "Sarthak Yadav",
        "Zheng-Hua Tan"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes Audio Mamba, a selective state space model for learning general-purpose audio representations from randomly masked spectrogram patches through self-supervision, and shows that the proposed models consistently outperform comparable self-supervised audio spectrogram transformer (SSAST) baselines and demonstrate better performance in dataset size, sequence length and model size comparisons."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}