{
    "acronym": "50410b3caf6f53438be3b3880691d0463bbda79f",
    "title": "Transformer-Augmented Network With Online Label Correction for Facial Expression Recognition",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "50410b3caf6f53438be3b3880691d0463bbda79f",
    "abstract": "Facial expression recognition (FER) in the wild is extremely challenging due to occlusions, variant head poses under unconstrained conditions and incorrect annotations (e.g., label noise). In this article, we aim to improve the performance of in-the-wild FER with Transformers and online label correction. Different from pure CNNs based methods, we propose a Transformer-augmented network (TAN) to dynamically capture the relationships within each facial patch and across the facial patches. Specifically, the TAN translates a number of facial patch images into a set of visual feature sequences by a backbone convolutional neural network. The intra-patch Transformer is subsequently utilized to capture the most discriminative features within each visual feature sequence. The position-disentangled attention mechanism of the intra-patch Transformer is proposed to better incorporate the positional information for feature sequences. Furthermore, we propose the inter-patch Transformer to model the dependencies across these feature sequences. More importantly, we present the online label correction (OLC) framework to correct suspicious hard labels and accumulate soft labels based on the predictions of the model, which strengthens the robustness of our model against label noise. We validate our method on several widely-used datasets (RAF-DB, FERPlus, AffectNet), realistic occlusion and pose variation datasets, and synthetic noisy datasets. Extensive experiments on these benchmarks demonstrate that the proposed method performs favorably against state-of-the-art methods. The source code will be made publicly available.",
    "authors": [
        "Fuyan Ma",
        "Bin Sun",
        "Shutao Li"
    ],
    "venue": "IEEE Transactions on Affective Computing",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Transformer-augmented network (TAN) to dynamically capture the relationships within each facial patch and across the facial patches and the online label correction (OLC) framework to correct suspicious hard labels and accumulate soft labels based on the predictions of the model is presented, which strengthens the robustness of the model against label noise."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}