{
    "acronym": "506178dcb27c8fba6e8a1076ab0dbbe578b01ebe",
    "title": "News-SBG: A novel news classification model with delivered label representation",
    "seed_ids": [
        "cosformer",
        "c49ac1f916d6d2edeb187e6619c8d23acd95eb21",
        "a022bda79947d1f656a1164003c1b3ae9a843df9"
    ],
    "s2id": "506178dcb27c8fba6e8a1076ab0dbbe578b01ebe",
    "abstract": "With the acceleration of news data updating, the amount of news data increases sharply. The traditional complex Chinese news classification model can not meet the needs of users. The previous methods most follow the English text classification methods, ignoring the semantic structure of Chinese news itself. In this paper, we propose the News-SBG, a model for exploiting the implicit structure of Chinese news data. Besides achieving better results on news text classification tasks, it is more effective to use compared to previous models. Then, We design the Label-GRU to combine the representation features of the following sentences with the state features. Additionally, we borrow the Cosformer [1], which roughly reduces the complexity of computing the attention matrix. The most crucial aspect is that it can increase the precision of our model and emphasize key sentence elements. Our experiments prove News-SBG has a better classification effect than the previous models, achieving a satisfactory accuracy on the selected Chinese text datasets. Code is released at https://github.com/hap123ccj/News-SBG.",
    "authors": [
        "Yao Tang",
        "Fuyong Xu",
        "Peiyu Liu"
    ],
    "venue": "2022 IEEE Smartworld, Ubiquitous Intelligence & Computing, Scalable Computing & Communications, Digital Twin, Privacy Computing, Metaverse, Autonomous & Trusted Vehicles (SmartWorld/UIC/ScalCom/DigitalTwin/PriComp/Meta)",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The News-SBG is proposed, a model for exploiting the implicit structure of Chinese news data, which has a better classification effect than the previous models, achieving a satisfactory accuracy on the selected Chinese text datasets."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}