{
    "acronym": "50d41335eae7e872f871d75107ca2becfc9a8da8",
    "title": "Enhancing Context Through Contrast",
    "seed_ids": [
        "bert",
        "3456c1e95d8d2f985a0701232dd55171b3cbd5e0",
        "2c7d213b2230dea4ff88f0e50631089d513e9528",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "50d41335eae7e872f871d75107ca2becfc9a8da8",
    "abstract": "Neural machine translation benefits from semantically rich representations. Considerable progress in learning such representations has been achieved by language modelling and mutual information maximization objectives using contrastive learning. The language-dependent nature of language modelling introduces a trade-off between the universality of the learned representations and the model's performance on the language modelling tasks. Although contrastive learning improves performance, its success cannot be attributed to mutual information alone. We propose a novel Context Enhancement step to improve performance on neural machine translation by maximizing mutual information using the Barlow Twins loss. Unlike other approaches, we do not explicitly augment the data but view languages as implicit augmentations, eradicating the risk of disrupting semantic information. Further, our method does not learn embeddings from scratch and can be generalised to any set of pre-trained embeddings. Finally, we evaluate the language-agnosticism of our embeddings through language classification and use them for neural machine translation to compare with state-of-the-art approaches.",
    "authors": [
        "Kshitij Ambilduke",
        "Aneesh Shetye",
        "Diksha Bagade",
        "Rishika Bhagwatkar",
        "Khurshed Fitter",
        "P. Vagdargi",
        "S. Chiddarwar"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel Context Enhancement step to improve performance on neural machine translation by maximizing mutual information using the Barlow Twins loss and views languages as implicit augmentations, eradicating the risk of disrupting semantic information."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}