{
    "acronym": "50d52d4986e229287bc716c326f1182be9b08167",
    "title": "Are AI-Generated Text Detectors Robust to Adversarial Perturbations?",
    "seed_ids": [
        "bert",
        "73081c0d391f057e89b21347860c89cd09c1d2b1",
        "02f0d5faa1cd88ea0afe48b756bfbf9adfefba28",
        "1c13af186d1e177b85ef1ec3fc7b8d33ec314cfd",
        "7845bfb55f5ce573b87d77bb76d4d38829b37620",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "50d52d4986e229287bc716c326f1182be9b08167",
    "abstract": "The widespread use of large language models (LLMs) has sparked concerns about the potential misuse of AI-generated text, as these models can produce content that closely resembles human-generated text. Current detectors for AI-generated text (AIGT) lack robustness against adversarial perturbations, with even minor changes in characters or words causing a reversal in distinguishing between human-created and AI-generated text. This paper investigates the robustness of existing AIGT detection methods and introduces a novel detector, the Siamese Calibrated Reconstruction Network (SCRN). The SCRN employs a reconstruction network to add and remove noise from text, extracting a semantic representation that is robust to local perturbations. We also propose a siamese calibration technique to train the model to make equally confidence predictions under different noise, which improves the model's robustness against adversarial perturbations. Experiments on four publicly available datasets show that the SCRN outperforms all baseline methods, achieving 6.5\\%-18.25\\% absolute accuracy improvement over the best baseline method under adversarial attacks. Moreover, it exhibits superior generalizability in cross-domain, cross-genre, and mixed-source scenarios. The code is available at \\url{https://github.com/CarlanLark/Robust-AIGC-Detector}.",
    "authors": [
        "Guanhua Huang",
        "Yuchen Zhang",
        "Zhe Li",
        "Yongjian You",
        "Mingze Wang",
        "Zhouwang Yang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper investigates the robustness of existing AIGT detection methods and introduces a novel detector, the Siamese Calibrated Reconstruction Network (SCRN), which exhibits superior generalizability in cross-domain, cross-genre, and mixed-source scenarios."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}