{
    "acronym": "5137ea664b392af5eaef8b4c76d7143c69c7ebb0",
    "title": "Fine-tuning BERT models to extract transcriptional regulatory interactions of bacteria from biomedical literature",
    "seed_ids": [
        "bert"
    ],
    "s2id": "5137ea664b392af5eaef8b4c76d7143c69c7ebb0",
    "abstract": "Curation of biomedical literature has been the traditional approach to extract relevant biological knowledge; however, this is time-consuming and demanding. Recently, Large language models (LLMs) based on pre-trained transformers have addressed biomedical relation extraction tasks outperforming classical machine learning approaches. Nevertheless, LLMs have not been used for the extraction of transcriptional regulatory interactions between transcription factors and regulated elements (genes or operons) of bacteria, a first step to reconstruct a transcriptional regulatory network (TRN). These networks are incomplete or missing for many bacteria. We compared six state-of-the-art BERT architectures (BERT, BioBERT, BioLinkBERT, BioMegatron, BioRoBERTa, LUKE) for extracting this type of regulatory interactions. We fine-tuned 72 models to classify sentences in four categories: activator, repressor, regulator, and no relation. A dataset of 1562 sentences manually curated from literature of Escherichia coli was utilized. The best model of LUKE architecture obtained a relevant performance in the evaluation dataset (Precision: 0.8601, Recall: 0.8788, F1-Score Macro: 0.8685, MCC: 0.8163). An examination of model predictions revealed that the model learned different ways to express the regulatory effect. The model was applied to reconstruct a TRN of Salmonella Typhimurium using 264 complete articles. We were able to accurately reconstruct 82% of the network. A network analysis confirmed that the transcription factor PhoP regulated many genes (uppermost degree), some of them responsible for antimicrobial resistance. Our work is a starting point to address the limitations of curating regulatory interactions, especially for the reconstruction of TRNs of bacteria or diseases of biological interest.",
    "authors": [
        "A. Varela-Vega",
        "Ali-Berenice Posada-Reyes",
        "Carlos-Francisco Méndez-Cruz"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work compared six state-of-the-art BERT architectures for extracting transcriptional regulatory interactions between transcription factors and regulated elements of bacteria and applied the best model of LUKE architecture to reconstruct a TRN of Salmonella Typhimurium using 264 complete articles."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}