{
    "acronym": "5156b3be33abbc3267b2d41e35537bf33c149420",
    "title": "Does Human Collaboration Enhance the Accuracy of Identifying LLM-Generated Deepfake Texts?",
    "seed_ids": [
        "gpt2",
        "8aa2c70563bb2c03e17297d8d726890da3d5f001",
        "a279d7d05ce4cf849879e6948c34613b2dade858",
        "fd1b829261ba04bb92e0ab60c4f6e7cea0d99fbf",
        "7845bfb55f5ce573b87d77bb76d4d38829b37620",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5156b3be33abbc3267b2d41e35537bf33c149420",
    "abstract": "Advances in Large Language Models (e.g., GPT-4, LLaMA) have improved the generation of coherent sentences resembling human writing on a large scale, resulting in the creation of so-called deepfake texts. However, this progress poses security and privacy concerns, necessitating effective solutions for distinguishing deepfake texts from human-written ones. Although prior works studied humans’ ability to detect deepfake texts, none has examined whether “collaboration” among humans improves the detection of deepfake texts. In this study, to address this gap of understanding on deepfake texts, we conducted experiments with two groups: (1) nonexpert individuals from the AMT platform and (2) writing experts from the Upwork platform. The results demonstrate that collaboration among humans can potentially improve the detection of deepfake texts for both groups, increasing detection accuracies by 6.36% for non-experts and 12.76% for experts, respectively, compared to individuals’ detection accuracies. We further analyze the explanations that humans used for detecting a piece of text as deepfake text, and find that the strongest indicator of deepfake texts is their lack of coherence and consistency. Our study provides useful insights for future tools and framework designs to facilitate the collaborative human detection of deepfake texts. The experiment datasets and AMT implementations are available at: https://github.com/huashen218/llm-deepfake-human-study.git",
    "authors": [
        "Adaku Uchendu",
        "Jooyoung Lee",
        "Hua Shen",
        "Thai Le",
        "Ting-Hao 'Kenneth' Huang",
        "Dongwon Lee"
    ],
    "venue": "Proceedings of the AAAI Conference on Human Computation and Crowdsourcing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is found that the strongest indicator of deepfake texts is their lack of coherence and consistency, and this study provides useful insights for future tools and framework designs to facilitate the collaborative human detection of deep fake texts."
    },
    "citationCount": 15,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}