{
    "acronym": "5195b73c54d79ebecb26b547ec2c32b2b11ce194",
    "title": "An LLM-based Recommender System Environment",
    "seed_ids": [
        "gpt3",
        "9cd7b13442bc58cc414a72a630065ba3e2fb2e4e"
    ],
    "s2id": "5195b73c54d79ebecb26b547ec2c32b2b11ce194",
    "abstract": "Reinforcement learning (RL) has gained popularity in the realm of recommender systems due to its ability to optimize long-term rewards and guide users in discovering relevant content. However, the successful implementation of RL in recommender systems is challenging because of several factors, including the limited availability of online data for training on-policy methods. This scarcity requires expensive human interaction for online model training. Furthermore, the development of effective evaluation frameworks that accurately reflect the quality of models remains a fundamental challenge in recommender systems. To address these challenges, we propose a comprehensive framework for synthetic environments that simulate human behavior by harnessing the capabilities of large language models (LLMs). We complement our framework with in-depth ablation studies and demonstrate its effectiveness with experiments on movie and book recommendations. By utilizing LLMs as synthetic users, this work introduces a modular and novel framework for training RL-based recommender systems. The software, including the RL environment, is publicly available.",
    "authors": [
        "Nathan Corecco",
        "Giorgio Piatti",
        "Luca A. Lanzendorfer",
        "Flint Xiaofeng Fan",
        "R. Wattenhofer"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a comprehensive framework for synthetic environments that simulate human behavior by harnessing the capabilities of large language models (LLMs) as synthetic users and introduces a modular and novel framework for training RL-based recommender systems."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}