{
    "acronym": "522828823ff726598675971036fff01b57320578",
    "title": "A Survey of Time Series Foundation Models: Generalizing Time Series Representation with Large Language Model",
    "seed_ids": [
        "gpt2",
        "83ac79bb8e8695fb3c3c024be74790d862adea74",
        "d84cf745c534c010b8e55e5a4a04878906848dc3",
        "584ca135b61482fd89247113da87d784f738dbfa",
        "c2a5073564be916b900ed4c610b3be06805df598",
        "d98b5c1d0f9a4e39dc79ea7a3f74e54789df5e13",
        "5b7f5488c380cf5085a5dd93e993ad293b225eee",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "15190e8b459bd85d546286f7d7da61b4f4f3f58a",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "7422756d2416c62d7660bd217d817acc8ec35a09",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "522828823ff726598675971036fff01b57320578",
    "abstract": "Time series data are ubiquitous across various domains, making time series analysis critically important. Traditional time series models are task-specific, featuring singular functionality and limited generalization capacity. Recently, large language foundation models have unveiled their remarkable capabilities for cross-task transferability, zero-shot/few-shot learning, and decision-making explainability. This success has sparked interest in the exploration of foundation models to solve multiple time series challenges simultaneously. There are two main research lines, namely pre-training foundation models from scratch for time series and adapting large language foundation models for time series. They both contribute to the development of a unified model that is highly generalizable, versatile, and comprehensible for time series analysis. This survey offers a 3E analytical framework for comprehensive examination of related research. Specifically, we examine existing works from three dimensions, namely Effectiveness, Efficiency and Explainability. In each dimension, we focus on discussing how related works devise tailored solution by considering unique challenges in the realm of time series. Furthermore, we provide a domain taxonomy to help followers keep up with the domain-specific advancements. In addition, we introduce extensive resources to facilitate the field's development, including datasets, open-source, time series libraries. A GitHub repository is also maintained for resource updates (https://github.com/start2020/Awesome-TimeSeries-LLM-FM).",
    "authors": [
        "Jiexia Ye",
        "Weiqi Zhang",
        "Ke Yi",
        "Yongzi Yu",
        "Ziyue Li",
        "Jia Li",
        "F. Tsung"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A 3E analytical framework for comprehensive examination of related research, which examines existing works from three dimensions, namely Effectiveness, Efficiency and Explainability, and provides a domain taxonomy to help followers keep up with the domain-specific advancements."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}