{
    "acronym": "525e04db32139395dcf7125cf330dae35af84f35",
    "title": "4D Facial Expression Diffusion Model",
    "seed_ids": [
        "diffusionlm",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "525e04db32139395dcf7125cf330dae35af84f35",
    "abstract": "Facial expression generation is one of the most challenging and long-sought aspects of character animation, with many interesting applications. The challenging task, traditionally having relied heavily on digital craftspersons, remains yet to be explored. In this paper, we introduce a generative framework for generating 3D facial expression sequences (i.e. 4D faces) that can be conditioned on different inputs to animate an arbitrary 3D face mesh. It is composed of two tasks: (1) Learning the generative model that is trained over a set of 3D landmark sequences, and (2) Generating 3D mesh sequences of an input facial mesh driven by the generated landmark sequences. The generative model is based on a Denoising Diffusion Probabilistic Model (DDPM), which has achieved remarkable success in generative tasks of other domains. While it can be trained unconditionally, its reverse process can still be conditioned by various condition signals. This allows us to efficiently develop several downstream tasks involving various conditional generation, by using expression labels, text, partial sequences, or simply a facial geometry. To obtain the full mesh deformation, we then develop a landmark-guided encoder-decoder to apply the geometrical deformation embedded in landmarks on a given facial mesh. Experiments show that our model has learned to generate realistic, quality expressions solely from the dataset of relatively small size, improving over the state-of-the-art methods. Videos and qualitative comparisons with other methods can be found at https://github.com/ZOUKaifeng/4DFM. Code and models will be made available upon acceptance.",
    "authors": [
        "K. Zou",
        "S. Faisan",
        "Boyang Yu",
        "S. Valette",
        "H. Seo"
    ],
    "venue": "ACM Transactions on Multimedia Computing, Communications, and Applications (TOMCCAP)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Experiments show that this generative framework for generating 3D facial expression sequences that can be conditioned on different inputs to animate an arbitrary 3D face mesh has learned to generate realistic, quality expressions solely from the dataset of relatively small size, improving over the state-of-the-art methods."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}