{
    "acronym": "5278b81db686b4d36143941bff1c683bea963a63",
    "title": "SWARM Parallelism: Training Large Models Can Be Surprisingly Communication-Efficient",
    "seed_ids": [
        "gpt2",
        "319b84be7a843250bc81d7086f79a4126d550277",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "d931f84abfc4550c10ceb113b142c8eb3e07571e",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5278b81db686b4d36143941bff1c683bea963a63",
    "abstract": "Many deep learning applications benefit from using large models with billions of parameters. Training these models is notoriously expensive due to the need for specialized HPC clusters. In this work, we consider alternative setups for training large models: using cheap\"preemptible\"instances or pooling existing resources from multiple regions. We analyze the performance of existing model-parallel algorithms in these conditions and find configurations where training larger models becomes less communication-intensive. Based on these findings, we propose SWARM parallelism, a model-parallel training algorithm designed for poorly connected, heterogeneous and unreliable devices. SWARM creates temporary randomized pipelines between nodes that are rebalanced in case of failure. We empirically validate our findings and compare SWARM parallelism with existing large-scale training approaches. Finally, we combine our insights with compression strategies to train a large Transformer language model with 1B shared parameters (approximately 13B before sharing) on preemptible T4 GPUs with less than 200Mb/s network.",
    "authors": [
        "Max Ryabinin",
        "Tim Dettmers",
        "Michael Diskin",
        "Alexander Borzunov"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work considers alternative setups for training large models: using cheap\"preemptible\" instances or pooling existing resources from multiple regions, and proposes SWARM parallelism, a model-parallel training algorithm designed for poorly connected, heterogeneous and unreliable devices."
    },
    "citationCount": 21,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}