{
    "acronym": "52b7c596185233ca269b4db5fe54ab6e356e64fa",
    "title": "Can AI Be as Creative as Humans?",
    "seed_ids": [
        "gpt3",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "e04a80263d252a3d8a382ba37a249b9345620570"
    ],
    "s2id": "52b7c596185233ca269b4db5fe54ab6e356e64fa",
    "abstract": "Creativity serves as a cornerstone for societal progress and innovation. With the rise of advanced generative AI models capable of tasks once reserved for human creativity, the study of AI's creative potential becomes imperative for its responsible development and application. In this paper, we prove in theory that AI can be as creative as humans under the condition that it can properly fit the data generated by human creators. Therefore, the debate on AI's creativity is reduced into the question of its ability to fit a sufficient amount of data. To arrive at this conclusion, this paper first addresses the complexities in defining creativity by introducing a new concept called Relative Creativity. Rather than attempting to define creativity universally, we shift the focus to whether AI can match the creative abilities of a hypothetical human. The methodological shift leads to a statistically quantifiable assessment of AI's creativity, term Statistical Creativity. This concept, statistically comparing the creative abilities of AI with those of specific human groups, facilitates theoretical exploration of AI's creative potential. Our analysis reveals that by fitting extensive conditional data without marginalizing out the generative conditions, AI can emerge as a hypothetical new creator. The creator possesses the same creative abilities on par with the human creators it was trained on. Building on theoretical findings, we discuss the application in prompt-conditioned autoregressive models, providing a practical means for evaluating creative abilities of generative AI models, such as Large Language Models (LLMs). Additionally, this study provides an actionable training guideline, bridging the theoretical quantification of creativity with practical model training.",
    "authors": [
        "Haonan Wang",
        "James Zou",
        "M. Mozer",
        "Anirudh Goyal",
        "Alex Lamb",
        "Linjun Zhang",
        "Weijie J. Su",
        "Zhun Deng",
        "Michael Qizhe Xie",
        "Hannah Brown",
        "Kenji Kawaguchi"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is proved in theory that AI can be as creative as humans under the condition that it can properly fit the data generated by human creators, thereby reducing the debate on AI's creativity to the question of its ability to fit a sufficient amount of data."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}