{
    "acronym": "52c5ddedc205a7968e2f0a4d713f78abba4b832b",
    "title": "No Training, No Problem: Rethinking Classifier-Free Guidance for Diffusion Models",
    "seed_ids": [
        "classfreediffu",
        "bb857c72e7c75fc3d4b44b1dcaa66c62ea10a2e1",
        "1206b05eae5a06ba662ae79fb291b50e359c4f42",
        "6e3a3b7a8a0376d867cad72eedf2f9b746f29a33",
        "465b80aea2b99ffe0710325f5c256e8d2ac642a5",
        "15736f7c205d961c00378a938daffaacb5a0718d",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "82482585e94192b4e9913727e461f89cd08e9725",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "52c5ddedc205a7968e2f0a4d713f78abba4b832b",
    "abstract": "Classifier-free guidance (CFG) has become the standard method for enhancing the quality of conditional diffusion models. However, employing CFG requires either training an unconditional model alongside the main diffusion model or modifying the training procedure by periodically inserting a null condition. There is also no clear extension of CFG to unconditional models. In this paper, we revisit the core principles of CFG and introduce a new method, independent condition guidance (ICG), which provides the benefits of CFG without the need for any special training procedures. Our approach streamlines the training process of conditional diffusion models and can also be applied during inference on any pre-trained conditional model. Additionally, by leveraging the time-step information encoded in all diffusion networks, we propose an extension of CFG, called time-step guidance (TSG), which can be applied to any diffusion model, including unconditional ones. Our guidance techniques are easy to implement and have the same sampling cost as CFG. Through extensive experiments, we demonstrate that ICG matches the performance of standard CFG across various conditional diffusion models. Moreover, we show that TSG improves generation quality in a manner similar to CFG, without relying on any conditional information.",
    "authors": [
        "Seyedmorteza Sadat",
        "Manuel Kansy",
        "Otmar Hilliges",
        "Romann M. Weber"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper revisits the core principles of CFG and introduces a new method, independent condition guidance (ICG), which provides the benefits of CFG without the need for any special training procedures, and proposes an extension of CFG, called time-step guidance (TSG), which can be applied to any diffusion model, including unconditional ones."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}