{
    "acronym": "53332cb160c5d9d542e08523dfac43c9399b79ab",
    "title": "Referee Can Play: An Alternative Approach to Conditional Generation via Model Inversion",
    "seed_ids": [
        "classfreediffu",
        "d38cab3b343cd13fb349a79287ddba921ff1c20c",
        "81583156b7786f50f3a2ede06ccd308c6c80f2e1",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "53332cb160c5d9d542e08523dfac43c9399b79ab",
    "abstract": "As a dominant force in text-to-image generation tasks, Diffusion Probabilistic Models (DPMs) face a critical challenge in controllability, struggling to adhere strictly to complex, multi-faceted instructions. In this work, we aim to address this alignment challenge for conditional generation tasks. First, we provide an alternative view of state-of-the-art DPMs as a way of inverting advanced Vision-Language Models (VLMs). With this formulation, we naturally propose a training-free approach that bypasses the conventional sampling process associated with DPMs. By directly optimizing images with the supervision of discriminative VLMs, the proposed method can potentially achieve a better text-image alignment. As proof of concept, we demonstrate the pipeline with the pre-trained BLIP-2 model and identify several key designs for improved image generation. To further enhance the image fidelity, a Score Distillation Sampling module of Stable Diffusion is incorporated. By carefully balancing the two components during optimization, our method can produce high-quality images with near state-of-the-art performance on T2I-Compbench.",
    "authors": [
        "Xuantong Liu",
        "Tianyang Hu",
        "Wenjia Wang",
        "Kenji Kawaguchi",
        "Yuan Yao"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work provides an alternative view of state-of-the-art DPMs as a way of inverting advanced Vision-Language Models (VLMs) and proposes a training-free approach that bypasses the conventional sampling process associated with DPMs."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}