{
    "acronym": "5351614e845a70c7df0582fc306336b56dd51f25",
    "title": "FiT: Flexible Vision Transformer for Diffusion Model",
    "seed_ids": [
        "yarn",
        "classfreediffu",
        "539fadfb615ef84c240f4741061c44eeda540091",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "af385c0fdd0eda2bbf429bea6fedffc327c8a180",
        "9575afb5702bc33d7df14c48feeee5901ea00369",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "5351614e845a70c7df0582fc306336b56dd51f25",
    "abstract": "Nature is infinitely resolution-free. In the context of this reality, existing diffusion models, such as Diffusion Transformers, often face challenges when processing image resolutions outside of their trained domain. To overcome this limitation, we present the Flexible Vision Transformer (FiT), a transformer architecture specifically designed for generating images with unrestricted resolutions and aspect ratios. Unlike traditional methods that perceive images as static-resolution grids, FiT conceptualizes images as sequences of dynamically-sized tokens. This perspective enables a flexible training strategy that effortlessly adapts to diverse aspect ratios during both training and inference phases, thus promoting resolution generalization and eliminating biases induced by image cropping. Enhanced by a meticulously adjusted network structure and the integration of training-free extrapolation techniques, FiT exhibits remarkable flexibility in resolution extrapolation generation. Comprehensive experiments demonstrate the exceptional performance of FiT across a broad range of resolutions, showcasing its effectiveness both within and beyond its training resolution distribution. Repository available at https://github.com/whlzy/FiT.",
    "authors": [
        "Zeyu Lu",
        "Zidong Wang",
        "Di Huang",
        "Chengyue Wu",
        "Xihui Liu",
        "Wanli Ouyang",
        "Lei Bai"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Flexible Vision Transformer (FiT), a transformer architecture specifically designed for generating images with unrestricted resolutions and aspect ratios, exhibits remarkable flexibility in resolution extrapolation generation."
    },
    "citationCount": 13,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}