{
    "acronym": "53a3e2c9f7151da00280677d89cc42e1762404aa",
    "title": "In-Context Symbolic Regression: Leveraging Large Language Models for Function Discovery",
    "seed_ids": [
        "gpt3",
        "690df0820f35a47e1ce44f90e6ddb4132aa09267",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "53a3e2c9f7151da00280677d89cc42e1762404aa",
    "abstract": "State of the art Symbolic Regression (SR) methods currently build specialized models, while the application of Large Language Models (LLMs) remains largely unexplored. In this work, we introduce the first comprehensive framework that utilizes LLMs for the task of SR. We propose In-Context Symbolic Regression (ICSR), an SR method which iteratively refines a functional form with an LLM and determines its coefficients with an external optimizer. ICSR leverages LLMs' strong mathematical prior both to propose an initial set of possible functions given the observations and to refine them based on their errors. Our findings reveal that LLMs are able to successfully find symbolic equations that fit the given data, matching or outperforming the overall performance of the best SR baselines on four popular benchmarks, while yielding simpler equations with better out of distribution generalization.",
    "authors": [
        "Matteo Merler",
        "Katsiaryna Haitsiukevich",
        "Nicola Dainese",
        "Pekka Marttinen"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes In-Context Symbolic Regression (ICSR), an SR method which iteratively refines a functional form with an LLM and determines its coefficients with an external optimizer and leverages LLMs' strong mathematical prior both to propose an initial set of possible functions given the observations and to refine them based on their errors."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}