{
    "acronym": "54b6e5dcef733c151adef0ac06430f63cb301a36",
    "title": "AR-Diffusion: Auto-Regressive Diffusion Model for Text Generation",
    "seed_ids": [
        "diffusionlm",
        "dinoiser",
        "020a50f6a7154850ac81e3cde69ad8198ded6751",
        "a1186d7d9a9ef258c76afef1177e4f348061a537",
        "22775e58932cdfbd273a2a835a22c5d86800a458",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "17d068e78e6f25e65cb08319b19b58279bb8b214",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "599bc7cfe98c2b57ddbe111412203a636da57be0",
        "25db56fc85fe15625c3375064a35e908ba6dfd2a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "54b6e5dcef733c151adef0ac06430f63cb301a36",
    "abstract": "Diffusion models have gained significant attention in the realm of image generation due to their exceptional performance. Their success has been recently expanded to text generation via generating all tokens within a sequence concurrently. However, natural language exhibits a far more pronounced sequential dependency in comparison to images, and the majority of existing language models are trained with a left-to-right auto-regressive approach. To account for the inherent sequential characteristic of natural language, we introduce Auto-Regressive Diffusion (AR-Diffusion). AR-Diffusion ensures that the generation of tokens on the right depends on the generated ones on the left, a mechanism achieved through employing a dynamic number of denoising steps that vary based on token position. This results in tokens on the left undergoing fewer denoising steps than those on the right, thereby enabling them to generate earlier and subsequently influence the generation of tokens on the right. In a series of experiments on various text generation tasks, including text summarization, machine translation, and common sense generation, AR-Diffusion clearly demonstrated its superiority over existing diffusion language models and that it can be $100\\times\\sim600\\times$ faster when achieving comparable results. Our code is available at https://github.com/microsoft/ProphetNet/tree/master/AR-diffusion.",
    "authors": [
        "Tong Wu",
        "Zhihao Fan",
        "Xiao Liu",
        "Yeyun Gong",
        "Yelong Shen",
        "Jian Jiao",
        "Haitao Zheng",
        "Juntao Li",
        "Zhongyu Wei",
        "Jian Guo",
        "Nan Duan",
        "Weizhu Chen"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 18,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}