{
    "acronym": "54ee2435014a23f06018a77a9d32e875a0152249",
    "title": "Fast Text-Conditional Discrete Denoising on Vector-Quantized Latent Spaces",
    "seed_ids": [
        "classfreediffu",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "54ee2435014a23f06018a77a9d32e875a0152249",
    "abstract": "Conditional text-to-image generation has seen countless recent improvements in terms of quality, diversity and ﬁ-delity. Nevertheless, most state-of-the-art models require numerous inference steps to produce faithful generations, resulting in performance bottlenecks for end-user applications. In this paper we introduce Paella, a novel text-to-image model requiring less than 10 steps to sample high-ﬁdelity images, using a speed-optimized architecture allowing to sample a single image in less than 500 ms, while having 573M parameters. The model operates on a compressed & quantized latent space, it is conditioned on CLIP embed-dings and uses an improved sampling function over previous works. Aside from text-conditional image generation, our model is able to do latent space interpolation and image manipulations such as inpainting, outpainting, and structural editing. We release all of our code and pretrained models at https://github.com/dome272/Paella .",
    "authors": [
        "Dominic Rampas",
        "Pablo Pernias",
        "Elea Zhong",
        "Marc Aubreville"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Paella is introduced, a novel text-to-image model requiring less than 10 steps to sample high-ﬁdelity images, using a speed-optimized architecture allowing to sample a single image in less than 500 ms, while having 573M parameters."
    },
    "citationCount": 10,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}