{
    "acronym": "550692bcacb8129b5863840c95acf9d4a99e5f67",
    "title": "UpFusion: Novel View Diffusion from Unposed Sparse View Observations",
    "seed_ids": [
        "classfreediffu",
        "e3f5a9251529f34bc15b89e3294e576efbc0af4c",
        "18c3cccc509ddee99c4ce2eb412e2b624ef41db1",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "550692bcacb8129b5863840c95acf9d4a99e5f67",
    "abstract": "We propose UpFusion, a system that can perform novel view synthesis and infer 3D representations for an object given a sparse set of reference images without corresponding pose information. Current sparse-view 3D inference methods typically rely on camera poses to geometrically aggregate information from input views, but are not robust in-the-wild when such information is unavailable/inaccurate. In contrast, UpFusion sidesteps this requirement by learning to implicitly leverage the available images as context in a conditional generative model for synthesizing novel views. We incorporate two complementary forms of conditioning into diffusion models for leveraging the input views: a) via inferring query-view aligned features using a scene-level transformer, b) via intermediate attentional layers that can directly observe the input image tokens. We show that this mechanism allows generating high-fidelity novel views while improving the synthesis quality given additional (unposed) images. We evaluate our approach on the Co3Dv2 and Google Scanned Objects datasets and demonstrate the benefits of our method over pose-reliant sparse-view methods as well as single-view methods that cannot leverage additional views. Finally, we also show that our learned model can generalize beyond the training categories and even allow reconstruction from self-captured images of generic objects in-the-wild.",
    "authors": [
        "Bharath Raj Nagoor Kani",
        "Hsin-Ying Lee",
        "S. Tulyakov",
        "Shubham Tulsiani"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "UpFusion is a system that can perform novel view synthesis and infer 3D representations for an object given a sparse set of reference images without corresponding pose information and can generalize beyond the training categories and even allow reconstruction from self-captured images of generic objects in-the-wild."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}