{
    "acronym": "550d0100c65a786f509f1670fcd701e387fbf00e",
    "title": "Classification Study of Collapse Accident Potentials Based on BERT Modeling",
    "seed_ids": [
        "bert",
        "a554a0aae55be5597de8f6ece0a4dd0bd5a0e5f4"
    ],
    "s2id": "550d0100c65a786f509f1670fcd701e387fbf00e",
    "abstract": "With the rise of information technology in construction enterprises, the need for intelligent management is increasing. The conventional method of text classification depends mostly on professional technicians who comprehend the information, resulting in a significant amount of time and labor being expended when dealing with large amounts of textual data, and it has several drawbacks. In order to achieve automatic classification and identification of hidden danger investigation information related to accidents within a large volume of accident-related text, this study proposes a BERT-based classification model for collapse accident hidden dangers. Initially, the study collects, cleans, and labels the text of hidden collapse accidents. It then utilizes the BERTmodel to classify the text by merging the Softmax layer in reverse. The study's results demonstrate a 92% accuracy rate in classifying hidden collapse accidents, establishing superior text classification performance and theoretical backing for the intelligentization of project safety management in construction firms.",
    "authors": [
        "Yuan Shen",
        "Yifan Wu",
        "Shuling Gan"
    ],
    "venue": "International Conference on Robotics, Intelligent Control and Artificial Intelligence",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The study's results demonstrate a 92% accuracy rate in classifying hidden collapse accidents, establishing superior text classification performance and theoretical backing for the intelligentization of project safety management in construction firms."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}