{
    "acronym": "5535a3cd501e5639657e2683011043813069d89f",
    "title": "Recent Advances in Generative AI and Large Language Models: Current Status, Challenges, and Perspectives",
    "seed_ids": [
        "transformer",
        "gpt",
        "gpt3",
        "bert",
        "sparsetransformer",
        "transformerxl",
        "94ce1d5924e05e8d75e43ce70044293ddcef850a",
        "980e55d9226cac302d0fae7732da4e67b8bc952c",
        "71ba5f845bd22d42003675b7cea970ca9e590bcc",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "5d22b241836e30d5b0d852b463951ab7e3245ea4",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "f6390beca54411b06f3bde424fb983a451789733",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5535a3cd501e5639657e2683011043813069d89f",
    "abstract": "The emergence of Generative Artificial Intelligence (AI) and Large Language Models (LLMs) has marked a new era of Natural Language Processing (NLP), introducing unprecedented capabilities that are revolutionizing various domains. This paper explores the current state of these cutting-edge technologies, demonstrating their remarkable advancements and wide-ranging applications. Our paper contributes to providing a holistic perspective on the technical foundations, practical applications, and emerging challenges within the evolving landscape of Generative AI and LLMs. We believe that understanding the generative capabilities of AI systems and the specific context of LLMs is crucial for researchers, practitioners, and policymakers to collaboratively shape the responsible and ethical integration of these technologies into various domains. Furthermore, we identify and address main research gaps, providing valuable insights to guide future research endeavors within the AI research community.",
    "authors": [
        "D. Hagos",
        "Rick Battle",
        "Danda B. Rawat"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is believed that understanding the generative capabilities of AI systems and the specific context of LLMs is crucial for researchers, practitioners, and policymakers to collaboratively shape the responsible and ethical integration of these technologies into various domains."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}