{
    "acronym": "5564dfc349eff1adf0fb7c06b182139d75588d5d",
    "title": "Zero-Shot Image Harmonization with Generative Model Prior",
    "seed_ids": [
        "classfreediffu",
        "81621c53c6aa421deb81bb1359138ded0fb4e258",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "5564dfc349eff1adf0fb7c06b182139d75588d5d",
    "abstract": "We propose a zero-shot approach to image harmonization, aiming to overcome the reliance on large amounts of synthetic composite images in existing methods. These methods, while showing promising results, involve significant training expenses and often struggle with generalization to unseen images. To this end, we introduce a fully modularized framework inspired by human behavior. Leveraging the reasoning capabilities of recent foundation models in language and vision, our approach comprises three main stages. Initially, we employ a pretrained vision-language model (VLM) to generate descriptions for the composite image. Subsequently, these descriptions guide the foreground harmonization direction of a text-to-image generative model (T2I). We refine text embeddings for enhanced representation of imaging conditions and employ self-attention and edge maps for structure preservation. Following each harmonization iteration, an evaluator determines whether to conclude or modify the harmonization direction. The resulting framework, mirroring human behavior, achieves harmonious results without the need for extensive training. We present compelling visual results across diverse scenes and objects, along with a user study validating the effectiveness of our approach.",
    "authors": [
        "Jianqi Chen",
        "Zhengxia Zou",
        "Yilan Zhang",
        "Keyan Chen",
        "Z. Shi"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A fully modularized framework inspired by human behavior is introduced, aiming to overcome the reliance on large amounts of synthetic composite images in existing methods and achieves harmonious results without the need for extensive training."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}