{
    "acronym": "559652ebfa7d4a23419430fff1aef961e5b9698c",
    "title": "Audio-Driven Co-Speech Gesture Video Generation",
    "seed_ids": [
        "gpt2",
        "5d2289dea222330dcab41b3fbec12a6de9c91365",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "559652ebfa7d4a23419430fff1aef961e5b9698c",
    "abstract": "Co-speech gesture is crucial for human-machine interaction and digital entertainment. While previous works mostly map speech audio to human skeletons (e.g., 2D keypoints), directly generating speakers' gestures in the image domain remains unsolved. In this work, we formally define and study this challenging problem of audio-driven co-speech gesture video generation, i.e., using a unified framework to generate speaker image sequence driven by speech audio. Our key insight is that the co-speech gestures can be decomposed into common motion patterns and subtle rhythmic dynamics. To this end, we propose a novel framework, Audio-driveN Gesture vIdeo gEneration (ANGIE), to effectively capture the reusable co-speech gesture patterns as well as fine-grained rhythmic movements. To achieve high-fidelity image sequence generation, we leverage an unsupervised motion representation instead of a structural human body prior (e.g., 2D skeletons). Specifically, 1) we propose a vector quantized motion extractor (VQ-Motion Extractor) to summarize common co-speech gesture patterns from implicit motion representation to codebooks. 2) Moreover, a co-speech gesture GPT with motion refinement (Co-Speech GPT) is devised to complement the subtle prosodic motion details. Extensive experiments demonstrate that our framework renders realistic and vivid co-speech gesture video. Demo video and more resources can be found in: https://alvinliu0.github.io/projects/ANGIE",
    "authors": [
        "Xian Liu",
        "Qianyi Wu",
        "Hang Zhou",
        "Yuanqi Du",
        "Wayne Wu",
        "Dahua Lin",
        "Ziwei Liu"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work formally defines and study the challenging problem of audio-driven co-speech gesture video generation, i.e., using a unified framework to generate speaker image sequence driven by speech audio, and proposes a vector quantized motion extractor (VQ-Motion Extractor) to summarize common co- speech gesture patterns from implicit motion representation to codebooks."
    },
    "citationCount": 25,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}