{
    "acronym": "55bc8ef1a6acc4edcee04fe48b19b7897fcfa2e2",
    "title": "Characterizing Prompt Compression Methods for Long Context Inference",
    "seed_ids": [
        "gpt2",
        "b085968c4362fb286ad6c5ef71a5db9630da0498",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "5df422fc18974d687febd171adcac35b3012c50a",
        "e586a4591ba0303b769f2c07cbddaf1899cb72e4",
        "2f7364d8e5cf94315bf8905f57de9c5543e9a4bf",
        "83edcfbb206ddad38a971d605da09390604248ea",
        "4e3935ef7da6bcbb202ec7f8b285c313cadcd044",
        "9dc624d7258d1a56117ca720aea953ce46b66b21",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "55bc8ef1a6acc4edcee04fe48b19b7897fcfa2e2",
    "abstract": "Long context inference presents challenges at the system level with increased compute and memory requirements, as well as from an accuracy perspective in being able to reason over long contexts. Recently, several methods have been proposed to compress the prompt to reduce the context length. However, there has been little work on comparing the different proposed methods across different tasks through a standardized analysis. This has led to conflicting results. To address this, here we perform a comprehensive characterization and evaluation of different prompt compression methods. In particular, we analyze extractive compression, summarization-based abstractive compression, and token pruning methods. Surprisingly, we find that extractive compression often outperforms all the other approaches, and enables up to 10x compression with minimal accuracy degradation. Interestingly, we also find that despite several recent claims, token pruning methods often lag behind extractive compression. We only found marginal improvements on summarization tasks.",
    "authors": [
        "Siddharth Jha",
        "Lutfi Eren Erdogan",
        "Sehoon Kim",
        "Kurt Keutzer",
        "A. Gholami"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Surprisingly, it is found that extractive compression often outperforms all the other approaches, and enables up to 10x compression with minimal accuracy degradation, and despite several recent claims, token pruning methods often lag behind extractive compression."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}