{
    "acronym": "55d8837c72863e63259a506b56222d08812699b0",
    "title": "Online learning of long-range dependencies",
    "seed_ids": [
        "hippo",
        "resurrectrnn",
        "f393aff1593c2d370ec0ae004910d18e40524967",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "7e9ff94476f41041c75e253e84f487db00e9c861"
    ],
    "s2id": "55d8837c72863e63259a506b56222d08812699b0",
    "abstract": "Online learning holds the promise of enabling efficient long-term credit assignment in recurrent neural networks. However, current algorithms fall short of offline backpropagation by either not being scalable or failing to learn long-range dependencies. Here we present a high-performance online learning algorithm that merely doubles the memory and computational requirements of a single inference pass. We achieve this by leveraging independent recurrent modules in multi-layer networks, an architectural motif that has recently been shown to be particularly powerful. Experiments on synthetic memory problems and on the challenging long-range arena benchmark suite reveal that our algorithm performs competitively, establishing a new standard for what can be achieved through online learning. This ability to learn long-range dependencies offers a new perspective on learning in the brain and opens a promising avenue in neuromorphic computing.",
    "authors": [
        "Nicolas Zucchet",
        "Robert Meier",
        "Simon Schug",
        "Asier Mujika",
        "J. Sacramento"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A high-performance online learning algorithm that merely doubles the memory and computational requirements of a single inference pass is presented, achieved by leveraging independent recurrent modules in multi-layer networks, an architectural motif that has recently been shown to be particularly powerful."
    },
    "citationCount": 10,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}