{
    "acronym": "55f4056f56ec65c6f888cb080da26acb2ee3c55f",
    "title": "BadEdit: Backdooring large language models by model editing",
    "seed_ids": [
        "gpt2",
        "56da914761e445a24481629cfc116336a0aec978",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "55f4056f56ec65c6f888cb080da26acb2ee3c55f",
    "abstract": "Mainstream backdoor attack methods typically demand substantial tuning data for poisoning, limiting their practicality and potentially degrading the overall performance when applied to Large Language Models (LLMs). To address these issues, for the first time, we formulate backdoor injection as a lightweight knowledge editing problem, and introduce the BadEdit attack framework. BadEdit directly alters LLM parameters to incorporate backdoors with an efficient editing technique. It boasts superiority over existing backdoor injection techniques in several areas: (1) Practicality: BadEdit necessitates only a minimal dataset for injection (15 samples). (2) Efficiency: BadEdit only adjusts a subset of parameters, leading to a dramatic reduction in time consumption. (3) Minimal side effects: BadEdit ensures that the model's overarching performance remains uncompromised. (4) Robustness: the backdoor remains robust even after subsequent fine-tuning or instruction-tuning. Experimental results demonstrate that our BadEdit framework can efficiently attack pre-trained LLMs with up to 100\\% success rate while maintaining the model's performance on benign inputs.",
    "authors": [
        "Yanzhou Li",
        "Tianlin Li",
        "Kangjie Chen",
        "Jian Zhang",
        "Shangqing Liu",
        "Wenhan Wang",
        "Tianwei Zhang",
        "Yang Liu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The BadEdit attack framework is introduced, which directly alters LLM parameters to incorporate backdoors with an efficient editing technique, and boasts superiority over existing backdoor injection techniques in several areas."
    },
    "citationCount": 13,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}