{
    "acronym": "560153fbadf7dd147fee5688cbd13f445118fc15",
    "title": "Direct May Not Be the Best: An Incremental Evolution View of Pose Generation",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "560153fbadf7dd147fee5688cbd13f445118fc15",
    "abstract": "Pose diversity is an inherent representative characteristic of 2D images. Due to the 3D to 2D projection mechanism, there is evident content discrepancy among distinct pose images. This is the main obstacle bothering pose transformation related researches. To deal with this challenge, we propose a fine-grained incremental evolution centered pose generation framework, rather than traditional direct one-to-one in a rush. Since proposed approach actually bypasses the theoretical difficulty of directly modeling dramatic non-linear variation, the incurred content distortion and blurring could be effectively constrained, at the same time the various individual pose details, especially clothes texture, could be precisely maintained. In order to systematically guide the evolution course, both global and incremental evolution constraints are elaborately designed and merged into the overall framework. And a novel triple-path knowledge fusion structure is worked out to take full advantage of all available valuable knowledge to conduct high-quality pose synthesis. In addition, our framework could generate a series of valuable by-products, namely the various intermediate poses. Extensive experiments have been conducted to verify the effectiveness of the proposed approach. Code is available at https://github.com/Xiaofei-CN/Incremental-Evolution-Pose-Generation.",
    "authors": [
        "Yuelong Li",
        "Tengfei Xiao",
        "Lei Geng",
        "Jianming Wang"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A fine-grained incremental evolution centered pose generation framework that bypasses the theoretical difficulty of directly modeling dramatic non-linear variation, and could generate a series of valuable by-products, namely the various intermediate poses."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}