{
    "acronym": "5616cd91c5134d3ceaa578fd3c5521aed20c8f82",
    "title": "HMT: Hierarchical Memory Transformer for Long Context Language Processing",
    "seed_ids": [
        "rwkv4",
        "unlimiformer",
        "5fc1a3a49e8f1d106118b69d1d6be3b6caa23da0",
        "80980cd10d19f021c14a6b7eee871b6a5d328024",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "dbc368bc8b49347dd27679894524fa62f88492c9",
        "e1325b35533282876f5793748b00d316a048cccf",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d5e999aae76d5270ef272076979c809817458212",
        "e32a12b14e212506115cc6804667b3d8297917e1",
        "67ee20536c30a225b86902af2f091e28e5e19b40",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77"
    ],
    "s2id": "5616cd91c5134d3ceaa578fd3c5521aed20c8f82",
    "abstract": "Transformer-based large language models (LLM) have been widely used in language processing applications. However, most of them restrict the context window that permits the model to attend to every token in the inputs. Previous works in recurrent models can memorize past tokens to enable unlimited context and maintain effectiveness. However, they have\"flat\"memory architectures, which have limitations in selecting and filtering information. Since humans are good at learning and self-adjustment, we speculate that imitating brain memory hierarchy is beneficial for model memorization. We propose the Hierarchical Memory Transformer (HMT), a novel framework that enables and improves models' long-context processing ability by imitating human memorization behavior. Leveraging memory-augmented segment-level recurrence, we organize the memory hierarchy by preserving tokens from early input token segments, passing memory embeddings along the sequence, and recalling relevant information from history. Evaluating general language modeling (Wikitext-103, PG-19) and question-answering tasks (PubMedQA), we show that HMT steadily improves the long-context processing ability of context-constrained and long-context models. With an additional 0.5% - 2% of parameters, HMT can easily plug in and augment future LLMs to handle long context effectively. Our code is open-sourced on Github: https://github.com/OswaldHe/HMT-pytorch.",
    "authors": [
        "Zifan He",
        "Zongyue Qin",
        "Neha Prakriya",
        "Yizhou Sun",
        "Jason Cong"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Hierarchical Memory Transformer is proposed, a novel framework that enables and improves models' long-context processing ability by imitating human memorization behavior and steadily improves the long-context processing ability of context-constrained and long-context models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}