{
    "acronym": "5648f619ab888f6400c1063bff15a98de89f115b",
    "title": "Voxelwise Encoding Models Show That Cerebellar Language Representations Are Highly Conceptual",
    "seed_ids": [
        "gpt",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5648f619ab888f6400c1063bff15a98de89f115b",
    "abstract": "There is a growing body of research demonstrating that the cerebellum is involved in language understanding. Early theories assumed that the cerebellum is involved in low-level language processing. However, those theories are at odds with recent work demonstrating cerebellar activation during cognitive tasks. Using natural language stimuli and an encoding model framework, we performed an fMRI experiment on 3 men and 2 women, where subjects passively listened to 5 h of natural language stimuli, which allowed us to analyze language processing in the cerebellum with higher precision than previous work. We used these data to fit voxelwise encoding models with five different feature spaces that span the hierarchy of language processing from acoustic input to high-level conceptual processing. Examining the prediction performance of these models on separate BOLD data shows that cerebellar responses to language are almost entirely explained by high-level conceptual language features rather than low-level acoustic or phonemic features. Additionally, we found that the cerebellum has a higher proportion of voxels that represent social semantic categories, which include “social” and “people” words, and lower representations of all other semantic categories, including “mental,” “concrete,” and “place” words, than cortex. This suggests that the cerebellum is representing language at a conceptual level with a preference for social information. SIGNIFICANCE STATEMENT Recent work has demonstrated that, beyond its typical role in motor planning, the cerebellum is implicated in a wide variety of tasks, including language. However, little is known about the language representations in the cerebellum, or how those representations compare to cortex. Using voxelwise encoding models and natural language fMRI data, we demonstrate here that language representations are significantly different in the cerebellum compared with cortex. Cerebellum language representations are almost entirely semantic, and the cerebellum contains overrepresentation of social semantic information compared with cortex. These results suggest that the cerebellum is not involved in language processing per se, but cognitive processing more generally.",
    "authors": [
        "Amanda LeBel",
        "Shailee Jain",
        "Alexander G. Huth"
    ],
    "venue": "Journal of Neuroscience",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Cerebellum language representations are almost entirely semantic, and the cerebellum contains overrepresentation of social semantic information compared with cortex, which suggests that the Cerebellum is not involved in language processing per se, but cognitive processing more generally."
    },
    "citationCount": 25,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}