{
    "acronym": "56765a17295370c70cbc510329c082ec60ed3c62",
    "title": "WikiGraphs: A Wikipedia Text - Knowledge Graph Paired Dataset",
    "seed_ids": [
        "transformerxl"
    ],
    "s2id": "56765a17295370c70cbc510329c082ec60ed3c62",
    "abstract": "We present a new dataset of Wikipedia articles each paired with a knowledge graph, to facilitate the research in conditional text generation, graph generation and graph representation learning. Existing graph-text paired datasets typically contain small graphs and short text (1 or few sentences), thus limiting the capabilities of the models that can be learned on the data. Our new dataset WikiGraphs is collected by pairing each Wikipedia article from the established WikiText-103 benchmark (Merity et al., 2016) with a subgraph from the Freebase knowledge graph (Bollacker et al., 2008). This makes it easy to benchmark against other state-of-the-art text generative models that are capable of generating long paragraphs of coherent text. Both the graphs and the text data are of significantly larger scale compared to prior graph-text paired datasets. We present baseline graph neural network and transformer model results on our dataset for 3 tasks: graph -> text generation, graph -> text retrieval and text -> graph retrieval. We show that better conditioning on the graph provides gains in generation and retrieval quality but there is still large room for improvement.",
    "authors": [
        "Luyu Wang",
        "Yujia Li",
        "Özlem Aslan",
        "O. Vinyals"
    ],
    "venue": "Proceedings of the Fifteenth Workshop on Graph-Based Methods for Natural Language Processing (TextGraphs-15)",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that better conditioning on the graph provides gains in generation and retrieval quality but there is still large room for improvement."
    },
    "citationCount": 16,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}