{
    "acronym": "568942c2ca574fdb89517b7d1c86f7be9026b66d",
    "title": "Diffusion Model-Based Video Editing: A Survey",
    "seed_ids": [
        "classfreediffu",
        "d599dc40c9cb8d6d76554ee7d21d20c22cc7cdb5",
        "43bafa19f94a42caea89b32a86489aa850317617",
        "1206b05eae5a06ba662ae79fb291b50e359c4f42",
        "e8bbffb8413cb1f88e99a7ecbabd21a6eac82271",
        "0439bbee19b4fba596d1e2498b3f45ca265432ba",
        "05d6db8f4727c0cb4fd7bb63cd98de25b2888016",
        "cf694df964caa156ec306b45d3a3127533cb458f",
        "b8b5015b153709176385873e34339f9e520d128f",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "e342165a614588878ad0f4bc9bacf3905df34d08",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "71cc838d8a50a0d62cc9c679536f1f25b2ea6b7f"
    ],
    "s2id": "568942c2ca574fdb89517b7d1c86f7be9026b66d",
    "abstract": "The rapid development of diffusion models (DMs) has significantly advanced image and video applications, making\"what you want is what you see\"a reality. Among these, video editing has gained substantial attention and seen a swift rise in research activity, necessitating a comprehensive and systematic review of the existing literature. This paper reviews diffusion model-based video editing techniques, including theoretical foundations and practical applications. We begin by overviewing the mathematical formulation and image domain's key methods. Subsequently, we categorize video editing approaches by the inherent connections of their core technologies, depicting evolutionary trajectory. This paper also dives into novel applications, including point-based editing and pose-guided human video editing. Additionally, we present a comprehensive comparison using our newly introduced V2VBench. Building on the progress achieved to date, the paper concludes with ongoing challenges and potential directions for future research.",
    "authors": [
        "Wenhao Sun",
        "Rongcheng Tu",
        "Jingyi Liao",
        "Dacheng Tao"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper categorizes video editing approaches by the inherent connections of their core technologies, depicting evolutionary trajectory, and dives into novel applications, including point-based editing and pose-guided human video editing."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}