{
    "acronym": "569d2323b494459f3fc0e4a5eb5cf4d831b8104b",
    "title": "Natural Language Processing to Detect Cognitive Concerns in Electronic Health Records Using Deep Learning",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "569d2323b494459f3fc0e4a5eb5cf4d831b8104b",
    "abstract": "Dementia is under-recognized in the community, under-diagnosed by healthcare professionals, and under-coded in claims data. Information on cognitive dysfunction, however, is often found in unstructured clinician notes within medical records but manual review by experts is time consuming and often prone to errors. Automated mining of these notes presents a potential opportunity to label patients with cognitive concerns who could benefit from an evaluation or be referred to specialist care. In order to identify patients with cognitive concerns in electronic medical records, we applied natural language processing (NLP) algorithms and compared model performance to a baseline model that used structured diagnosis codes and medication data only. An attention-based deep learning model outperformed the baseline model and other simpler models.",
    "authors": [
        "Zhuoqiao Hong",
        "C. Magdamo",
        "Y. Sheu",
        "P. Mohite",
        "Ayush Noori",
        "E. Ye",
        "Wendong Ge",
        "Haoqi Sun",
        "L. Brenner",
        "Gregory K. Robbins",
        "S. Mukerji",
        "Sahar F. Zafar",
        "Nicole M. Benson",
        "L. Moura",
        "J. Hsu",
        "B. Hyman",
        "M. Westover",
        "D. Blacker",
        "Sudeshna Das"
    ],
    "venue": "arXiv.org",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "In order to identify patients with cognitive concerns in electronic medical records, natural language processing (NLP) algorithms are applied and model performance is compared to a baseline model that used structured diagnosis codes and medication data only."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}