{
    "acronym": "56b35f7bca65566543469e79b04497e3d7436637",
    "title": "Active Acquisition for Multimodal Temporal Data: A Challenging Decision-Making Task",
    "seed_ids": [
        "perceiverio"
    ],
    "s2id": "56b35f7bca65566543469e79b04497e3d7436637",
    "abstract": "We introduce a challenging decision-making task that we call active acquisition for multimodal temporal data (A2MT). In many real-world scenarios, input features are not readily available at test time and must instead be acquired at significant cost. With A2MT, we aim to learn agents that actively select which modalities of an input to acquire, trading off acquisition cost and predictive performance. A2MT extends a previous task called active feature acquisition to temporal decision making about high-dimensional inputs. We propose a method based on the Perceiver IO architecture to address A2MT in practice. Our agents are able to solve a novel synthetic scenario requiring practically relevant cross-modal reasoning skills. On two large-scale, real-world datasets, Kinetics-700 and AudioSet, our agents successfully learn cost-reactive acquisition behavior. However, an ablation reveals they are unable to learn adaptive acquisition strategies, emphasizing the difficulty of the task even for state-of-the-art models. Applications of A2MT may be impactful in domains like medicine, robotics, or finance, where modalities differ in acquisition cost and informativeness.",
    "authors": [
        "Jannik Kossen",
        "Cătălina Cangea",
        "Eszter V'ertes",
        "Andrew Jaegle",
        "Viorica Patraucean",
        "Ira Ktena",
        "Nenad Tomašev",
        "D. Belgrave"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A method based on the Perceiver IO architecture to address A2MT in practice is proposed and agents are able to solve a novel synthetic scenario requiring practically relevant cross-modal reasoning skills, but are unable to learn adaptive acquisition strategies."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}