{
    "acronym": "56bd3d4169514c3fd2b404615eaecd9cba9a0377",
    "title": "Modeling the Quality of Dialogical Explanations",
    "seed_ids": [
        "longformer",
        "9166caa474031b62bacad8a920db8308e6a15120",
        "231e768f0cd280faa0f725bb353262cb4fed08d1",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "56bd3d4169514c3fd2b404615eaecd9cba9a0377",
    "abstract": "Explanations are pervasive in our lives. Mostly, they occur in dialogical form where an explainer discusses a concept or phenomenon of interest with an explainee. Leaving the explainee with a clear understanding is not straightforward due to the knowledge gap between the two participants. Previous research looked at the interaction of explanation moves, dialogue acts, and topics in successful dialogues with expert explainers. However, daily-life explanations often fail, raising the question of what makes a dialogue successful. In this work, we study explanation dialogues in terms of the interactions between the explainer and explainee and how they correlate with the quality of explanations in terms of a successful understanding on the explainee’s side. In particular, we first construct a corpus of 399 dialogues from the Reddit forum Explain Like I am Five and annotate it for interaction flows and explanation quality. We then analyze the interaction flows, comparing them to those appearing in expert dialogues. Finally, we encode the interaction flows using two language models that can handle long inputs, and we provide empirical evidence for the effectiveness boost gained through the encoding in predicting the success of explanation dialogues.",
    "authors": [
        "Milad Alshomary",
        "Felix Lange",
        "Meisam Booshehri",
        "Meghdut Sengupta",
        "Philipp Cimiano",
        "Henning Wachsmuth"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work studies explanation dialogues in terms of the interactions between the explainer and explainee and how they correlate with the quality of explanations in terms of a successful understanding on the explainee’s side and encode the interaction flows using two language models that can handle long inputs."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}