{
    "acronym": "56eca8bb6b4a26ec84e6f635bd4640dc93db8a74",
    "title": "Sarcasm Detection via sentiment and emotion analysis of News Headlines Using optimized simulation of Weibull entropy distribution",
    "seed_ids": [
        "bert"
    ],
    "s2id": "56eca8bb6b4a26ec84e6f635bd4640dc93db8a74",
    "abstract": "Sarcasm, a significant aspect of communication, finds expression through words, facial cues, and vocal intonations. In today's digital era, the prevalence of sarcastic comments is evident across social media comments, and news headlines. Detecting sarcasm in text data through mechanized means presents a challenging hurdle in Natural Language Processing, as it requires discerning expressions that convey the opposite of their literal meaning. This paper delves into the realm of sarcasm detection using an unsupervised mathematical optimization approach, drawing on an optimized probabilistic distribution technique and a sentiment lexicon tool. Incorporating a news headline dataset, we explore the nuances of sarcasm detection. The headlines often employ sarcasm to captivate readers, and this very tactic could result in misinterpretations or misconceptions which led readers to misjudge the intended meaning of these headlines, potentially leading to the propagation of incorrect information among peers and colleagues. This underlines the necessity of sarcasm detection, particularly within the realm of news and social media. We also delve into the identification of sentiment and emotional language traits embedded within sarcastic content. Our results spotlight the superiority of the proposed statistical strategy when compared to alternative methods. The amalgamation of optimized probabilistic distribution and sentiment lexicon tool contributes to the effectiveness of our approach, offering valuable insights into sarcasm, sentiment, and emotion within textual content.",
    "authors": [
        "Himani Pokhriyal",
        "Goonjan Jain"
    ],
    "venue": "International Conference on Intelligent Control and Instrumentation",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper delves into the realm of sarcasm detection using an unsupervised mathematical optimization approach, drawing on an optimized probabilistic distribution technique and a sentiment lexicon tool, offering valuable insights into sarcasm, sentiment, and emotion within textual content."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}