{
    "acronym": "5735e49e501c8e51e9be4079592e46e047747b03",
    "title": "Dissecting Transformer Length Extrapolation via the Lens of Receptive Field Analysis",
    "seed_ids": [
        "longformer",
        "alibi",
        "roformer",
        "kerple",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "d6c5aab433d9871cabc01ffb1e5e1ea89141155b",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "63857190aaf5aab1d94b54bb257b7b03b8cb5a50",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "d6b414487787d0b6efd735a3236a690ad13aae70"
    ],
    "s2id": "5735e49e501c8e51e9be4079592e46e047747b03",
    "abstract": "Length extrapolation permits training a transformer language model on short sequences that preserves perplexities when tested on substantially longer sequences.A relative positional embedding design, ALiBi, has had the widest usage to date. We dissect ALiBi via the lens of receptive field analysis empowered by a novel cumulative normalized gradient tool. The concept of receptive field further allows us to modify the vanilla Sinusoidal positional embedding to create Sandwich, the first parameter-free relative positional embedding design that truly length information uses longer than the training sequence. Sandwich shares with KERPLE and T5 the same logarithmic decaying temporal bias pattern with learnable relative positional embeddings; these elucidate future extrapolatable positional embedding design.",
    "authors": [
        "Ta-Chung Chi",
        "Ting-Han Fan",
        "A. Rudnicky",
        "P. Ramadge"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Sandwich is created, the first parameter-free relative positional embedding design that truly length information uses longer than the training sequence, to elucidate future extrapolatable positionalembedding design."
    },
    "citationCount": 24,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}