{
    "acronym": "573dad7b2fca7ce72a7f0daf681391d96379ebe3",
    "title": "Low-Parameter Federated Learning with Large Language Models",
    "seed_ids": [
        "gpt",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "573dad7b2fca7ce72a7f0daf681391d96379ebe3",
    "abstract": "We study few-shot Natural Language Understanding (NLU) tasks with Large Language Models (LLMs) in federated learning (FL) scenarios. It is a challenging task due to limited labeled data and communication capacities in FL, especially with mobile devices. Recent studies show LLMs can be prompted to perform few-shot NLU tasks like sentiment analysis and arithmetic reasoning. However, the huge sizes of LLMs result in high computation and communication costs, making classical FL schemes impractical. To address these challenges, we propose Low-Parameter Federated Learning (LP-FL). LP-FL combines few-shot prompt learning from LLMs with efficient communication and federating techniques. Our approach enables federated clients to assign soft labels to unlabeled data using gradually learned knowledge from the global model. Through iterative soft-label assigning, we continually expand the labeled set during the FL process. Additionally, to reduce computation and communication costs, LP-FL utilizes the Low-Rank Adaptation (LoRA) technique for compact learnable parameter construction, efficient local model fine-tuning, and affordable global model federation. LP-FL consistently outperforms Full-Parameter Federated Learning (FP-FL) in sentiment analysis tasks across various FL settings. Its resistance to overfitting allows LP-FL to equal or surpass centralized training in few-shot scenarios.",
    "authors": [
        "Jing Jiang",
        "Xiangyang Liu",
        "Chenyou Fan"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Low-Parameter Federated Learning (LP-FL) combines few-shot prompt learning from LLMs with efficient communication and federating techniques and resistance to overfitting allows LP-FL to equal or surpass centralized training in few- shot scenarios."
    },
    "citationCount": 12,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}