{
    "acronym": "57622fd0f43bbf48a8db872dd1023d2fcb2c0870",
    "title": "Humane Speech Synthesis through Zero-Shot Emotion and Disfluency Generation",
    "seed_ids": [
        "gpt2",
        "23c265ba884b92ecbd9d18641078d964697e4590",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "57622fd0f43bbf48a8db872dd1023d2fcb2c0870",
    "abstract": "Contemporary conversational systems often present a significant limitation: their responses lack the emotional depth and disfluent characteristic of human interactions. This absence becomes particularly noticeable when users seek more personalized and empathetic interactions. Consequently, this makes them seem mechanical and less relatable to human users. Recognizing this gap, we embarked on a journey to humanize machine communication, to ensure AI systems not only comprehend but also resonate. To address this shortcoming, we have designed an innovative speech synthesis pipeline. Within this framework, a cutting-edge language model introduces both human-like emotion and disfluencies in a zero-shot setting. These intricacies are seamlessly integrated into the generated text by the language model during text generation, allowing the system to mirror human speech patterns better, promoting more intuitive and natural user interactions. These generated elements are then adeptly transformed into corresponding speech patterns and emotive sounds using a rule-based approach during the text-to-speech phase. Based on our experiments, our novel system produces synthesized speech that's almost indistinguishable from genuine human communication, making each interaction feel more personal and authentic.",
    "authors": [
        "Rohan Chaudhury",
        "Mihir Godbole",
        "Aakash Garg",
        "Jinsil Hwaryoung Seo"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work has designed an innovative speech synthesis pipeline that produces synthesized speech that's almost indistinguishable from genuine human communication, making each interaction feel more personal and authentic."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}