{
    "acronym": "580aa5082617dde7bde2e0a9a9122badca77fee9",
    "title": "MTAD: Multiobjective Transformer Network for Unsupervised Multisensor Anomaly Detection",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "580aa5082617dde7bde2e0a9a9122badca77fee9",
    "abstract": "Multisensor anomaly detection plays a crucial role in several applications, including industrial monitoring, network-intrusion detection, and healthcare monitoring. However, the task poses significant challenges due to the presence of massive unlabeled data, the difficulty of identifying normal patterns in the spatio-temporal data, and the inherent complexity of defining an anomaly. Moreover, noisy sensor measurements could potentially result in models erroneously detecting noise as an anomaly, and the existence of different types of anomalies adds to the complexity. Existing multisensor anomaly detection methods are mostly designed for labeled datasets and often disregard crucial factors such as spatio-temporal dependencies, noise presence in training data, and the existence of multiple types of anomalies; thus, their applicability is limited. In this article, we propose a novel framework called multiobjective transformer networks for anomaly detection (MTAD) that leverages the power of transformer architectures and optimal truncated singular value decomposition (OT-SVD) for robust unsupervised multisensor anomaly detection. MTAD comprises a multihead transformer encoder for effective time series representation learning, a convolutional decoder for reconstruction, and a memory network for predictive analysis. The model processes denoised (via OT-SVD) input through the network and computes both reconstruction and prediction losses. MTAD jointly optimizes the modules in an end-to-end mechanism to minimize the combined weighted loss. We compare MTAD with other state-of-the-art methods using several metrics and demonstrate that our approach outperforms existing solutions. Furthermore, we conducted an ablation to demonstrate the contribution of each module to the overall performance.",
    "authors": [
        "M. Belay",
        "Adil Rasheed",
        "P. S. Rossi"
    ],
    "venue": "IEEE Sensors Journal",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel framework called multiobjective transformer networks for anomaly detection (MTAD) is proposed that leverages the power of transformer architectures and optimal truncated singular value decomposition (OT-SVD) for robust unsupervised multisensor anomaly detection."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}