{
    "acronym": "587a67407437ad1ec3b46a291f25b3e400ecd4e5",
    "title": "Infinite-Dimensional Feature Interaction",
    "seed_ids": [
        "transformer",
        "d1869155960e4b1b882b39171dbecd25a7eda3cd",
        "fa717a2e31f0cef4e26921f3b147a98644d2e64c",
        "687f0af2b6b6eb9dde326d7c6759dedf4b9e917a",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "587a67407437ad1ec3b46a291f25b3e400ecd4e5",
    "abstract": "The past neural network design has largely focused on feature representation space dimension and its capacity scaling (e.g., width, depth), but overlooked the feature interaction space scaling. Recent advancements have shown shifted focus towards element-wise multiplication to facilitate higher-dimensional feature interaction space for better information transformation. Despite this progress, multiplications predominantly capture low-order interactions, thus remaining confined to a finite-dimensional interaction space. To transcend this limitation, classic kernel methods emerge as a promising solution to engage features in an infinite-dimensional space. We introduce InfiNet, a model architecture that enables feature interaction within an infinite-dimensional space created by RBF kernel. Our experiments reveal that InfiNet achieves new state-of-the-art, owing to its capability to leverage infinite-dimensional interactions, significantly enhancing model performance.",
    "authors": [
        "Chenhui Xu",
        "Fuxun Yu",
        "Maoliang Li",
        "Zihao Zheng",
        "Zirui Xu",
        "Jinjun Xiong",
        "Xiang Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces InfiNet, a model architecture that enables feature interaction within an infinite-dimensional space created by RBF kernel and achieves new state-of-the-art status, owing to its capability to leverage infinite-dimensional interactions, significantly enhancing model performance."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}