{
    "acronym": "594d8e1696619f3cebb7c6bffdad8e0a5592f006",
    "title": "Scaling Transformer to 1M tokens and beyond with RMT",
    "seed_ids": [
        "gpt2",
        "colt5",
        "longformer",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "0e802c0739771acf70e60d59c2df51cd7e8c50c0",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "afad10da0a3b83a4f2a94e8c16c84ac64338e9fe",
        "67ee20536c30a225b86902af2f091e28e5e19b40",
        "168fc3525f7b97695a97b04e257ee9bd1e832acb",
        "63857190aaf5aab1d94b54bb257b7b03b8cb5a50",
        "70557ea6b65846fc30729ceed224acd4ac64ca5d",
        "baed71eed57ad462f3ab138d4b1700a738cd5414",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "2a31319e73d4486716168b65cdf7559baeda18ce",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "594d8e1696619f3cebb7c6bffdad8e0a5592f006",
    "abstract": "A major limitation for the broader scope of problems solvable by transformers is the quadratic scaling of computational complexity with input size. In this study, we investigate the recurrent memory augmentation of pre-trained transformer models to extend input context length while linearly scaling compute. Our approach demonstrates the capability to store information in memory for sequences of up to an unprecedented two million tokens while maintaining high retrieval accuracy. Experiments with language modeling tasks show perplexity improvement as the number of processed input segments increases. These results underscore the effectiveness of our method, which has significant potential to enhance long-term dependency handling in natural language understanding and generation tasks, as well as enable large-scale context processing for memory-intensive applications.",
    "authors": [
        "Aydar Bulatov",
        "Yuri Kuratov",
        "M. Burtsev"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study investigates the recurrent memory augmentation of pre-trained transformer models to extend input context length while linearly scaling compute and demonstrates the capability to store information in memory for sequences of up to an unprecedented two million tokens while maintaining high retrieval accuracy."
    },
    "citationCount": 59,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}