{
    "acronym": "596afbae35cda1e2da5fdaec1cb21582374f65d9",
    "title": "EpilepsyLLM: Domain-Specific Large Language Model Fine-tuned with Epilepsy Medical Knowledge",
    "seed_ids": [
        "gpt3",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c"
    ],
    "s2id": "596afbae35cda1e2da5fdaec1cb21582374f65d9",
    "abstract": "With large training datasets and massive amounts of computing sources, large language models (LLMs) achieve remarkable performance in comprehensive and generative ability. Based on those powerful LLMs, the model fine-tuned with domain-specific datasets posseses more specialized knowledge and thus is more practical like medical LLMs. However, the existing fine-tuned medical LLMs are limited to general medical knowledge with English language. For disease-specific problems, the model's response is inaccurate and sometimes even completely irrelevant, especially when using a language other than English. In this work, we focus on the particular disease of Epilepsy with Japanese language and introduce a customized LLM termed as EpilepsyLLM. Our model is trained from the pre-trained LLM by fine-tuning technique using datasets from the epilepsy domain. The datasets contain knowledge of basic information about disease, common treatment methods and drugs, and important notes in life and work. The experimental results demonstrate that EpilepsyLLM can provide more reliable and specialized medical knowledge responses.",
    "authors": [
        "Xuyang Zhao",
        "Qibin Zhao",
        "Toshihisa Tanaka"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work focuses on the particular disease of Epilepsy with Japanese language and introduces a customized LLM termed as EpilepsyLLM, trained from the pre-trained LLM by fine-tuning technique using datasets from the epilepsy domain."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}