{
    "acronym": "59998090499c95bf3ea20f31defa5767c55f3bf4",
    "title": "PTNet3D: A 3D High-Resolution Longitudinal Infant Brain MRI Synthesizer Based on Transformers",
    "seed_ids": [
        "performer",
        "6e8f35c6d54acb14109c9b792a62609eac8a7b5e",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "59998090499c95bf3ea20f31defa5767c55f3bf4",
    "abstract": "An increased interest in longitudinal neurodevelopment during the first few years after birth has emerged in recent years. Noninvasive magnetic resonance imaging (MRI) can provide crucial information about the development of brain structures in the early months of life. Despite the success of MRI collections and analysis for adults, it remains a challenge for researchers to collect high-quality multimodal MRIs from developing infant brains because of their irregular sleep pattern, limited attention, inability to follow instructions to stay still during scanning. In addition, there are limited analytic approaches available. These challenges often lead to a significant reduction of usable MRI scans and pose a problem for modeling neurodevelopmental trajectories. Researchers have explored solving this problem by synthesizing realistic MRIs to replace corrupted ones. Among synthesis methods, the convolutional neural network-based (CNN-based) generative adversarial networks (GANs) have demonstrated promising performance. In this study, we introduced a novel 3D MRI synthesis framework– pyramid transformer network (PTNet3D)– which relies on attention mechanisms through transformer and performer layers. We conducted extensive experiments on high-resolution Developing Human Connectome Project (dHCP) and longitudinal Baby Connectome Project (BCP) datasets. Compared with CNN-based GANs, PTNet3D consistently shows superior synthesis accuracy and superior generalization on two independent, large-scale infant brain MRI datasets. Notably, we demonstrate that PTNet3D synthesized more realistic scans than CNN-based models when the input is from multi-age subjects. Potential applications of PTNet3D include synthesizing corrupted or missing images. By replacing corrupted scans with synthesized ones, we observed significant improvement in infant whole brain segmentation.",
    "authors": [
        "Xuzhe Zhang",
        "Xinzi He",
        "Jia Guo",
        "Nabil Ettehadi",
        "Natalie Aw",
        "David P. Semanek",
        "J. Posner",
        "A. Laine",
        "Yun Wang"
    ],
    "venue": "IEEE Transactions on Medical Imaging",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel 3D MRI synthesis framework– pyramid transformer network (PTNet3D)– which relies on attention mechanisms through transformer and performer layers and consistently shows superior synthesis accuracy and superior generalization on two independent, large-scale infant brain MRI datasets."
    },
    "citationCount": 15,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}