{
    "acronym": "599bc7cfe98c2b57ddbe111412203a636da57be0",
    "title": "Autoregressive Diffusion Models",
    "seed_ids": [
        "d3pms",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "dd6de9423afcc0f821fee2bd0363a4091c7f8cd3"
    ],
    "s2id": "599bc7cfe98c2b57ddbe111412203a636da57be0",
    "abstract": "We introduce Autoregressive Diffusion Models (ARDMs), a model class encompassing and generalizing order-agnostic autoregressive models (Uria et al., 2014) and absorbing discrete diffusion (Austin et al., 2021), which we show are special cases of ARDMs under mild assumptions. ARDMs are simple to implement and easy to train. Unlike standard ARMs, they do not require causal masking of model representations, and can be trained using an efficient objective similar to modern probabilistic diffusion models that scales favourably to highly-dimensional data. At test time, ARDMs support parallel generation which can be adapted to fit any given generation budget. We find that ARDMs require significantly fewer steps than discrete diffusion models to attain the same performance. Finally, we apply ARDMs to lossless compression, and show that they are uniquely suited to this task. Contrary to existing approaches based on bits-back coding, ARDMs obtain compelling results not only on complete datasets, but also on compressing single data points. Moreover, this can be done using a modest number of network calls for (de)compression due to the model's adaptable parallel generation.",
    "authors": [
        "Emiel Hoogeboom",
        "Alexey A. Gritsenko",
        "Jasmijn Bastings",
        "Ben Poole",
        "Rianne van den Berg",
        "Tim Salimans"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is found that ARDMs require significantly fewer steps than discrete diffusion models to attain the same performance, and this can be done using a modest number of network calls for (de)compression due to the model's adaptable parallel generation."
    },
    "citationCount": 93,
    "influentialCitationCount": 11,
    "code": null,
    "description": null,
    "url": null
}