{
    "acronym": "59b7448f816908cfb49a2ab5e63b2fa5786387f7",
    "title": "Exphormer: Sparse Transformers for Graphs",
    "seed_ids": [
        "bigbird",
        "277dd73bfeb5c46513ce305136b0e71fcd2a311c",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "40ca4fcfffa7ca9aa9b7ff06ecf3cd0436712d78"
    ],
    "s2id": "59b7448f816908cfb49a2ab5e63b2fa5786387f7",
    "abstract": "Graph transformers have emerged as a promising architecture for a variety of graph learning and representation tasks. Despite their successes, though, it remains challenging to scale graph transformers to large graphs while maintaining accuracy competitive with message-passing networks. In this paper, we introduce Exphormer, a framework for building powerful and scalable graph transformers. Exphormer consists of a sparse attention mechanism based on two mechanisms: virtual global nodes and expander graphs, whose mathematical characteristics, such as spectral expansion, pseduorandomness, and sparsity, yield graph transformers with complexity only linear in the size of the graph, while allowing us to prove desirable theoretical properties of the resulting transformer models. We show that incorporating Exphormer into the recently-proposed GraphGPS framework produces models with competitive empirical results on a wide variety of graph datasets, including state-of-the-art results on three datasets. We also show that Exphormer can scale to datasets on larger graphs than shown in previous graph transformer architectures. Code can be found at \\url{https://github.com/hamed1375/Exphormer}.",
    "authors": [
        "Hamed Shirzad",
        "A. Velingker",
        "B. Venkatachalam",
        "Danica J. Sutherland",
        "A. Sinop"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that incorporating Exphormer into the recently-proposed GraphGPS framework produces models with competitive empirical results on a wide variety of graph datasets, including state-of-the-art results on three datasets."
    },
    "citationCount": 53,
    "influentialCitationCount": 12,
    "code": null,
    "description": null,
    "url": null
}