{
    "acronym": "59eab60a208fbd99c0a8d0ffdba689d281e97b39",
    "title": "A Mamba-based Siamese Network for Remote Sensing Change Detection",
    "seed_ids": [
        "mamba",
        "02425d2af6368145ce23508fa05e3b4f04c93ff7",
        "e730beb44042499763d36214c0498434e470dfd5",
        "21ddc4fc3551619b8a64db6ae124acc72aaae2c2",
        "38c48a1cd296d16dc9c56717495d6e44cc354444",
        "bb6644a9f5920abfc1fa008f366a9ff48468e063",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "59eab60a208fbd99c0a8d0ffdba689d281e97b39",
    "abstract": "Change detection in remote sensing images is an essential tool for analyzing a region at different times. It finds varied applications in monitoring environmental changes, man-made changes as well as corresponding decision-making and prediction of future trends. Deep learning methods like Convolutional Neural Networks (CNNs) and Transformers have achieved remarkable success in detecting significant changes, given two images at different times. In this paper, we propose a Mamba-based Change Detector (M-CD) that segments out the regions of interest even better. Mamba-based architectures demonstrate linear-time training capabilities and an improved receptive field over transformers. Our experiments on four widely used change detection datasets demonstrate significant improvements over existing state-of-the-art (SOTA) methods. Our code and pre-trained models are available at https://github.com/JayParanjape/M-CD",
    "authors": [
        "Jay N. Paranjape",
        "C. D. Melo",
        "Vishal M. Patel"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Mamba-based Change Detector (M-CD) that segments out the regions of interest even better and demonstrates linear-time training capabilities and an improved receptive field over transformers."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}