{
    "acronym": "59f9b5c6167ff40327cc1abc75aa22711872c545",
    "title": "Improving Language Understanding from Screenshots",
    "seed_ids": [
        "bert",
        "e4d31c8a94acc557bf21c8aa0936b3c3593ba123",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "182ba87b08726063765f3bed20ca53adf6e1f472",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "3e53e010303e6c9b975f48895d4ece5122847584"
    ],
    "s2id": "59f9b5c6167ff40327cc1abc75aa22711872c545",
    "abstract": "An emerging family of language models (LMs), capable of processing both text and images within a single visual view, has the promise to unlock complex tasks such as chart understanding and UI navigation. We refer to these models as screenshot language models. Despite their appeal, existing screenshot LMs substantially lag behind text-only models on language understanding tasks. To close this gap, we adopt a simplified setting where the model inputs are plain-text-rendered screenshots, and we focus on improving the text ability of screenshot LMs. We propose a novel Patch-and-Text Prediction (PTP) objective, which masks and recovers both image patches of screenshots and text within screenshots. We also conduct extensive ablation studies on masking rates and patch sizes, as well as designs for improving training stability. Our pre-trained model, while solely taking visual inputs, achieves comparable performance with BERT on 6 out of 8 GLUE tasks (within 2%) and improves up to 8% over prior work. Additionally, we extend PTP to train autoregressive screenshot LMs and demonstrate its effectiveness--our models can significantly reduce perplexity by utilizing the screenshot context. Together, we hope our findings can inspire future research on developing powerful screenshot LMs and extending their reach to broader applications.",
    "authors": [
        "Tianyu Gao",
        "Zirui Wang",
        "Adithya Bhaskar",
        "Danqi Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel Patch-and-Text Prediction (PTP) objective is proposed, which masks and recovers both image patches of screenshots and text within screenshots, and can significantly reduce perplexity by utilizing the screenshot context."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}