{
    "acronym": "5a61757c0e8584ebfda121362a12d0d20ca72eb0",
    "title": "Context-Aware Machine Translation with Source Coreference Explanation",
    "seed_ids": [
        "transformer",
        "68850153b0210615c86f9a72624f34e2913bcddf",
        "4293121e2bef84aa8db5aab6634cfcd2d06947d4",
        "b0de1d5fe394226cec0a59d783ab739eb52da76f",
        "3029263ca51e6c2907f9f99277083cf6afb1adb7",
        "26963fda30da20ee342b8e5250667ef702c5aed2"
    ],
    "s2id": "5a61757c0e8584ebfda121362a12d0d20ca72eb0",
    "abstract": "Abstract Despite significant improvements in enhancing the quality of translation, context-aware machine translation (MT) models underperform in many cases. One of the main reasons is that they fail to utilize the correct features from context when the context is too long or their models are overly complex. This can lead to the explain-away effect, wherein the models only consider features easier to explain predictions, resulting in inaccurate translations. To address this issue, we propose a model that explains the decisions made for translation by predicting coreference features in the input. We construct a model for input coreference by exploiting contextual features from both the input and translation output representations on top of an existing MT model. We evaluate and analyze our method in the WMT document-level translation task of English-German dataset, the English-Russian dataset, and the multilingual TED talk dataset, demonstrating an improvement of over 1.0 BLEU score when compared with other context-aware models.",
    "authors": [
        "Huy Hien Vu",
        "Hidetaka Kamigaito",
        "Taro Watanabe"
    ],
    "venue": "Transactions of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A model that explains the decisions made for translation by predicting coreference features in the input by exploiting contextual features from both the input and translation output representations on top of an existing context-aware machine translation model is proposed."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}