{
    "acronym": "5ac3e887de399e6c9149b0356e8992460be51ebd",
    "title": "New Approaches to Long Document Summarization: Fourier Transform Based Attention in a Transformer Model",
    "seed_ids": [
        "longformer",
        "fnet",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "5ac3e887de399e6c9149b0356e8992460be51ebd",
    "abstract": "In this work, we extensively redesign the newly introduced method of token mixing using Fourier Transforms (FNET) to replace the computationally expensive self-attention mechanism in a full transformer implementation on a long document summarization task (>512 tokens). As a baseline, we also carried out long document summarization using established methods such as Longformer and Big Bird transformer models that are capable of processing over 8000 tokens and are currently the state of the art methods for these type of problems. The original FNET paper implemented this in an encoder only architecture while abstractive summarization requires both an encoder and a decoder. Since such a pretrained transformer model does not currently exist in the public domain, we decided to implement a full transformer based on this Fourier token mixing approach in an encoder/decoder architecture which we trained starting with Glove embeddings for the individual words in the corpus. We investigated a number of different extensions to the original FNET architecture and evaluated them on their Rouge F1-score performance on a summarization task. All modifications showed better performance on the summarization task than when using the original FNET encoder in a transformer architecture.",
    "authors": [
        "A. Kiruluta",
        "Andreas Lemos",
        "Eric Lundy"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 1,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}