{
    "acronym": "5ae837949dca9fedcc72704746a1ba6c83868f97",
    "title": "BORT: Back and Denoising Reconstruction for End-to-End Task-Oriented Dialog",
    "seed_ids": [
        "gpt2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5ae837949dca9fedcc72704746a1ba6c83868f97",
    "abstract": "A typical end-to-end task-oriented dialog system transfers context into dialog state, and upon which generates a response, which usually faces the problem of error propagation from both previously generated inaccurate dialog states and responses, especially in low-resource scenarios. To alleviate these issues, we propose BORT, a back and denoising reconstruction approach for end-to-end task-oriented dialog system. Squarely, to improve the accuracy of dialog states, back reconstruction is used to reconstruct the original input context from the generated dialog states since inaccurate dialog states cannot recover the corresponding input context. To enhance the denoising capability of the model to reduce the impact of error propagation, denoising reconstruction is used to reconstruct the corrupted dialog state and response. Extensive experiments conducted on MultiWOZ 2.0 and CamRest676 show the effectiveness of BORT. Furthermore, BORT demonstrates its advanced capabilities in the zero-shot domain and low-resource scenarios.",
    "authors": [
        "Haipeng Sun",
        "Junwei Bao",
        "Youzheng Wu",
        "Xiaodong He"
    ],
    "venue": "NAACL-HLT",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "BORT, a back and denoising reconstruction approach for end-to-end task-oriented dialog system, which demonstrates its advanced capabilities in the zero-shot domain and low-resource scenarios."
    },
    "citationCount": 29,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}