{
    "acronym": "5b7c820dec29f38438b89bc6d483a63de0084402",
    "title": "Copilot4D: Learning Unsupervised World Models for Autonomous Driving via Discrete Diffusion",
    "seed_ids": [
        "gpt3",
        "d3pms",
        "e875667d1ae8fd8f3b760eee6feb6c8a79497e8c",
        "235303a8bc1e4892efd525a38ead657422d8a519",
        "e9b9a47cd81c66603c827f0f2bc4fba0d9ae77c4",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5b7c820dec29f38438b89bc6d483a63de0084402",
    "abstract": "Learning world models can teach an agent how the world works in an unsupervised manner. Even though it can be viewed as a special case of sequence modeling, progress for scaling world models on robotic applications such as autonomous driving has been somewhat less rapid than scaling language models with Generative Pre-trained Transformers (GPT). We identify two reasons as major bottlenecks: dealing with complex and unstructured observation space, and having a scalable generative model. Consequently, we propose Copilot4D, a novel world modeling approach that first tokenizes sensor observations with VQVAE, then predicts the future via discrete diffusion. To efficiently decode and denoise tokens in parallel, we recast Masked Generative Image Transformer as discrete diffusion and enhance it with a few simple changes, resulting in notable improvement. When applied to learning world models on point cloud observations, Copilot4D reduces prior SOTA Chamfer distance by more than 65% for 1s prediction, and more than 50% for 3s prediction, across NuScenes, KITTI Odometry, and Argoverse2 datasets. Our results demonstrate that discrete diffusion on tokenized agent experience can unlock the power of GPT-like unsupervised learning for robotics.",
    "authors": [
        "Lunjun Zhang",
        "Yuwen Xiong",
        "Ze Yang",
        "Sergio Casas",
        "Rui Hu",
        "R. Urtasun"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Copilot4D, a novel world modeling approach that first tokenizes sensor observations with VQVAE, then predicts the future via discrete diffusion, demonstrates that discrete diffusion on tokenized agent experience can unlock the power of GPT-like unsupervised learning for robotics."
    },
    "citationCount": 24,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}