{
    "acronym": "5c0544c74e4fb017d782d9754c6bd7f3fc28c9c7",
    "title": "Self-training with Two-phase Self-augmentation for Few-shot Dialogue Generation",
    "seed_ids": [
        "gpt2",
        "a8ec7942f0a77bfb61a8c534ad951e66e2f94188",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5c0544c74e4fb017d782d9754c6bd7f3fc28c9c7",
    "abstract": "In task-oriented dialogue systems, response generation from meaning representations (MRs) often suffers from limited training examples, due to the high cost of annotating MR-to-Text pairs. Previous works on self-training leverage fine-tuned conversational models to automatically generate pseudo-labeled MR-to-Text pairs for further fine-tuning. However, some self-augmented data may be noisy or uninformative for the model to learn from. In this work, we propose a two-phase self-augmentation procedure to generate high-quality pseudo-labeled MR-to-Text pairs: the first phase selects the most informative MRs based on model's prediction uncertainty; with the selected MRs, the second phase generates accurate responses by aggregating multiple perturbed latent representations from each MR. Empirical experiments on two benchmark datasets, FewShotWOZ and FewShotSGD, show that our method generally outperforms existing self-training methods on both automatic and human evaluations.",
    "authors": [
        "Wanyu Du",
        "Hanjie Chen",
        "Yangfeng Ji"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a two-phase self-augmentation procedure to generate high-quality pseudo-labeled MR-to-Text pairs and shows that this method generally outperforms existing self-training methods on both automatic and human evaluations."
    },
    "citationCount": 1,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}