{
    "acronym": "5c228f40c8cf6e5810bc712628ddaf03863c61a2",
    "title": "MG-MLP: Multi-gated MLP for Restoring Images from Spatially Variant Degradations",
    "seed_ids": [
        "gmlp",
        "fbf68eb0cf8237cef59ebdb301569c79b9676ff9",
        "485c08025157973bb52a935c6aa3bee74f990c01",
        "f75cddf2d42ed01b34686704eb3504becef67442",
        "71363797140647ebb3f540584de0a8758d2f7aa2",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "5c228f40c8cf6e5810bc712628ddaf03863c61a2",
    "abstract": "We propose a novel gating mechanism, which can be applied to the MLP mixer-based architecture for image restoration. In the proposed architecture, embedded tokens are subjected to channel and token mixing, which are the primary data ﬂow of the existing MLP mixer. The token vectors are subsequently reﬁned through the proposed intra-token and cross-token gating. Intra-token gating determines the information that is to be propagated or discarded by the interaction of information within each token. By contrast, cross-token gating calculates the propagation weights of local information and recycles information discarded from intra-token gating by comparing the information with adjacent tokens. The two gating paths result in third-order interaction because of cascaded gating multiplication, which is similar to the self-attention of Transformer. However, the proposed method is more efﬁcient than Transformer because it does not involve the quadratic cost of self-attention. The proposed network was applied to various spatially variant deblurring tasks; it outperformed baselines in terms of restoration performance and computational cost.",
    "authors": [
        "Jaihyun Koh",
        "Jaihyun Lew",
        "Jangho Lee",
        "Sungroh Yoon"
    ],
    "venue": "British Machine Vision Conference",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel gating mechanism that can be applied to the MLP mixer-based architecture for image restoration outperformed baselines in terms of restoration performance and computational cost."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}