{
    "acronym": "5c30033ef4ae122da51b466cc537126e3c2d7b7b",
    "title": "Weakly Supervised Detection of Hallucinations in LLM Activations",
    "seed_ids": [
        "bert",
        "94ce1d5924e05e8d75e43ce70044293ddcef850a",
        "682ee9c06f3eff3e3708b4d0419dc85ecf9c6c87",
        "039b1c1210c437f3b3ce6e0275ee2137bf5b951c",
        "5e9c85235210b59a16bdd84b444a904ae271f7e7",
        "b47381e04739ea3f392ba6c8faaf64105493c196",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5c30033ef4ae122da51b466cc537126e3c2d7b7b",
    "abstract": "We propose an auditing method to identify whether a large language model (LLM) encodes patterns such as hallucinations in its internal states, which may propagate to downstream tasks. We introduce a weakly supervised auditing technique using a subset scanning approach to detect anomalous patterns in LLM activations from pre-trained models. Importantly, our method does not need knowledge of the type of patterns a-priori. Instead, it relies on a reference dataset devoid of anomalies during testing. Further, our approach enables the identification of pivotal nodes responsible for encoding these patterns, which may offer crucial insights for fine-tuning specific sub-networks for bias mitigation. We introduce two new scanning methods to handle LLM activations for anomalous sentences that may deviate from the expected distribution in either direction. Our results confirm prior findings of BERT's limited internal capacity for encoding hallucinations, while OPT appears capable of encoding hallucination information internally. Importantly, our scanning approach, without prior exposure to false statements, performs comparably to a fully supervised out-of-distribution classifier.",
    "authors": [
        "Miriam Rateike",
        "C. Cintas",
        "John Wamburu",
        "Tanya Akumu",
        "Skyler Speakman"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results confirm prior findings of BERT's limited internal capacity for encoding hallucinations, while OPT appears capable of encoding hallucination information internally."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}