{
    "acronym": "5c51513d331128ed957ee57c3fa87ac4d4ab0852",
    "title": "Interpretation modeling: Social grounding of sentences by reasoning over their implicit moral judgments",
    "seed_ids": [
        "gpt2",
        "f78fe02f681a0a9a6867b007bd39e3884de64a91",
        "6d23532a1e9a8116041fd5aac6b0ef8ddd6d8171",
        "2ea64b7c7617f6cc1768373124ca0243d772a90f",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5c51513d331128ed957ee57c3fa87ac4d4ab0852",
    "abstract": "The social and implicit nature of human communication ramifies readers' understandings of written sentences. Single gold-standard interpretations rarely exist, challenging conventional assumptions in natural language processing. This work introduces the interpretation modeling (IM) task which involves modeling several interpretations of a sentence's underlying semantics to unearth layers of implicit meaning. To obtain these, IM is guided by multiple annotations of social relation and common ground - in this work approximated by reader attitudes towards the author and their understanding of moral judgments subtly embedded in the sentence. We propose a number of modeling strategies that rely on one-to-one and one-to-many generation methods that take inspiration from the philosophical study of interpretation. A first-of-its-kind IM dataset is curated to support experiments and analyses. The modeling results, coupled with scrutiny of the dataset, underline the challenges of IM as conflicting and complex interpretations are socially plausible. This interplay of diverse readings is affirmed by automated and human evaluations on the generated interpretations. Finally, toxicity analyses in the generated interpretations demonstrate the importance of IM for refining filters of content and assisting content moderators in safeguarding the safety in online discourse.",
    "authors": [
        "Liesbeth Allein",
        "Maria Mihaela Trucscva",
        "Marie-Francine Moens"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The interpretation modeling (IM) task which involves modeling several interpretations of a sentence's underlying semantics to unearth layers of implicit meaning is introduced, and a first-of-its-kind IM dataset is curated to support experiments and analyses."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}