{
    "acronym": "5c982f5dbb653d748e1ada858004e0847e09edff",
    "title": "Position Matters! Empirical Study of Order Effect in Knowledge-grounded Dialogue",
    "seed_ids": [
        "gpt2",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5c982f5dbb653d748e1ada858004e0847e09edff",
    "abstract": "With the power of large pretrained language models, various research works have integrated knowledge into dialogue systems. The traditional techniques treat knowledge as part of the input sequence for the dialogue system, prepending a set of knowledge statements in front of dialogue history.However, such a mechanism forces knowledge sets to be concatenated in an ordered manner, making models implicitly pay imbalanced attention to the sets during training.In this paper, we first investigate how the order of the knowledge set can influence autoregressive dialogue systems’ responses. We conduct experiments on two commonly used dialogue datasets with two types of transformer-based models and find that models view the input knowledge unequally. To this end, we propose a simple and novel technique to alleviate the order effect by modifying the position embeddings of knowledge input in these models. With the proposed position embedding method, the experimental results show that each knowledge statement is uniformly considered to generate responses.",
    "authors": [
        "Hsuan Su",
        "Shachi H. Kumar",
        "Sahisnu Mazumder",
        "Wenda Chen",
        "R. Manuvinakurike",
        "Eda Okur",
        "Saurav Sahay",
        "L. Nachman",
        "Shang-Tse Chen",
        "Hung-yi Lee"
    ],
    "venue": "Workshop on Document-grounded Dialogue and Conversational Question Answering",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a simple and novel technique to alleviate the order effect by modifying the position embeddings of knowledge input in transformer-based models, and shows that each knowledge statement is uniformly considered to generate responses."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}