{
    "acronym": "5cf102759e2d3759a2ddcc4ec4d4770f781577c8",
    "title": "From Softmax to Nucleusmax: A Novel Sparse Language Model for Chinese Radiology Report Summarization",
    "seed_ids": [
        "rela",
        "e6d46cce0bc4c49941cb81ff26860b9b6bc7cc40",
        "a7721b6523971394a8bd4bfda139122ef59b22cd"
    ],
    "s2id": "5cf102759e2d3759a2ddcc4ec4d4770f781577c8",
    "abstract": "The Chinese radiology report summarization is a crucial component in smart healthcare that employs language models to summarize key findings in radiology reports and communicate these findings to physicians. However, most language models for radiology report summarization utilize a softmax transformation in their output layer, leading to dense alignments and strictly positive output probabilities. This density is inefficient, reducing model interpretability and giving probability mass to many unrealistic outputs. To tackle this issue, we propose a novel approach named nucleusmax. Nucleusmax is able to mitigate dense outputs and improve model interpretability by truncating the unreliable tail of the probability distribution. In addition, we incorporate nucleusmax with a copy mechanism, a useful technique to avoid professional errors in the generated diagnostic opinions. To further promote the research of radiology report summarization, we also have created a Chinese radiology report summarization dataset, which is freely available. Experimental results showed via both automatic and human evaluation that the proposed approach substantially improves the sparsity and overall quality of outputs over competitive softmax models, producing radiology summaries that approach the quality of those authored by physicians. In general, our work demonstrates the feasibility and prospect of the language model to the domain of radiology and smart healthcare.",
    "authors": [
        "Shuai Zhao",
        "Qing Li",
        "Yuer Yang",
        "Jinming Wen",
        "Weiqing Luo"
    ],
    "venue": "ACM Trans. Asian Low Resour. Lang. Inf. Process.",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Nucleusmax is able to mitigate dense outputs and improve model interpretability by truncating the unreliable tail of the probability distribution, and demonstrates the feasibility and prospect of the language model to the domain of radiology and smart healthcare."
    },
    "citationCount": 18,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}