{
    "acronym": "5d6f2d03d7fa1b37d7240975a3176de4612866cb",
    "title": "Deep Learning Models to Study Sentence Comprehension in the Human Brain",
    "seed_ids": [
        "gpt2",
        "06e40b7a703079c280f8f0886ac2bd984cd318ce",
        "89711a7e91ad81874a5a0b1c3359bb67b27c0578",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5d6f2d03d7fa1b37d7240975a3176de4612866cb",
    "abstract": "Recent artificial neural networks that process natural language achieve unprecedented performance in tasks requiring sentence-level understanding. As such, they could be interesting models of the integration of linguistic information in the human brain. We review works that compare these artificial language models with human brain activity and we assess the extent to which this approach has improved our understanding of the neural processes involved in natural language comprehension. Two main results emerge. First, the neural representation of word meaning aligns with the context-dependent, dense word vectors used by the artificial neural networks. Second, the processing hierarchy that emerges within artificial neural networks broadly matches the brain, but is surprisingly inconsistent across studies. We discuss current challenges in establishing artificial neural networks as process models of natural language comprehension. We suggest exploiting the highly structured representational geometry of artificial neural networks when mapping representations to brain data.",
    "authors": [
        "S. Arana",
        "Jacques Pesnot Lerousseau",
        "P. Hagoort"
    ],
    "venue": "Language, Cognition and Neuroscience",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work reviews works that compare these artificial language models with human brain activity and assesses the extent to which this approach has improved the understanding of the neural processes involved in natural language comprehension, and suggests exploiting the highly structured representational geometry of artificial neural networks when mapping representations to brain data."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}