{
    "acronym": "5dce85ea9ab0a716159077960f370a9a11541e65",
    "title": "Depth-Wise Attention (DWAtt): A Layer Fusion Method for Data-Efficient Classification",
    "seed_ids": [
        "universaltrans",
        "39dbb929461a0a601d3e58b4c6dd36fc81caf8d2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "5dce85ea9ab0a716159077960f370a9a11541e65",
    "abstract": "Language Models pretrained on large textual data have been shown to encode different types of knowledge simultaneously. Traditionally, only the features from the last layer are used when adapting to new tasks or data. We put forward that, when using or finetuning deep pretrained models, intermediate layer features that may be relevant to the downstream task are buried too deep to be used efficiently in terms of needed samples or steps. To test this, we propose a new layer fusion method: Depth-Wise Attention (DWAtt), to help re-surface signals from non-final layers. We compare DWAtt to a basic concatenation-based layer fusion method (Concat), and compare both to a deeper model baseline—all kept within a similar parameter budget. Our findings show that DWAtt and Concat are more step- and sample-efficient than the baseline, especially in the few-shot setting. DWAtt outperforms Concat on larger data sizes. On CoNLL-03 NER, layer fusion shows 3.68 − 9.73% F1 gain at different few-shot sizes. The layer fusion models presented significantly outperform the baseline in various training scenarios with different data sizes, architectures, and training constraints.",
    "authors": [
        "Muhammad N. ElNokrashy",
        "Badr AlKhamissi",
        "Mona T. Diab"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a new layer fusion method: Depth-Wise Attention (DWAtt), to help re-surface signals from non-final layers, and shows that DWAtt and Concat are more step- and sample-efficient than the baseline, especially in the few-shot setting."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}