{
    "acronym": "5df1d39d1bdf0129250f1858f9d91acf66f08b88",
    "title": "IDEAL: Leveraging Infinite and Dynamic Characterizations of Large Language Models for Query-focused Summarization",
    "seed_ids": [
        "infiniti",
        "3fd5bc3077d04965eaa3498372c39bbdd09d55e4",
        "dbc368bc8b49347dd27679894524fa62f88492c9",
        "d2fe7536b347a7039a241bb60d507880ada686e8",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "5df1d39d1bdf0129250f1858f9d91acf66f08b88",
    "abstract": "Query-focused summarization (QFS) aims to produce summaries that answer particular questions of interest, enabling greater user control and personalization. With the advent of large language models (LLMs), shows their impressive capability of textual understanding through large-scale pretraining, which implies the great potential of extractive snippet generation. In this paper, we systematically investigated two indispensable characteristics that the LLMs-based QFS models should be harnessed, Lengthy Document Summarization and Efficiently Fine-grained Query-LLM Alignment, respectively. Correspondingly, we propose two modules called Query-aware HyperExpert and Query-focused Infini-attention to access the aforementioned characteristics. These innovations pave the way for broader application and accessibility in the field of QFS technology. Extensive experiments conducted on existing QFS benchmarks indicate the effectiveness and generalizability of the proposed approach. Our code is publicly available at https://github.com/DCDmllm/IDEAL_Summary.",
    "authors": [
        "Jie Cao",
        "Dian Jiao",
        "Qiang Yan",
        "Wenqiao Zhang",
        "Siliang Tang",
        "Yueting Zhuang"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper systematically investigated two indispensable characteristics that the LLMs-based QFS models should be harnessed, Lengthy Document Summarization and Efficiently Fine-grained Query-LLM Alignment, respectively and proposes two modules called Query-aware HyperExpert and Query-focused Infini-attention to access the aforementioned characteristics."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}