{
    "acronym": "5e00596fa946670d894b1bdaeff5a98e3867ef13",
    "title": "SimVLM: Simple Visual Language Model Pretraining with Weak Supervision",
    "seed_ids": [
        "gpt",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5e00596fa946670d894b1bdaeff5a98e3867ef13",
    "abstract": "With recent progress in joint modeling of visual and textual representations, Vision-Language Pretraining (VLP) has achieved impressive performance on many multimodal downstream tasks. However, the requirement for expensive annotations including clean image captions and regional labels limits the scalability of existing approaches, and complicates the pretraining procedure with the introduction of multiple dataset-specific objectives. In this work, we relax these constraints and present a minimalist pretraining framework, named Simple Visual Language Model (SimVLM). Unlike prior work, SimVLM reduces the training complexity by exploiting large-scale weak supervision, and is trained end-to-end with a single prefix language modeling objective. Without utilizing extra data or task-specific customization, the resulting model significantly outperforms previous pretraining methods and achieves new state-of-the-art results on a wide range of discriminative and generative vision-language benchmarks, including VQA (+3.74% vqa-score), NLVR2 (+1.17% accuracy), SNLI-VE (+1.37% accuracy) and image captioning tasks (+10.1% average CIDEr score). Furthermore, we demonstrate that SimVLM acquires strong generalization and transfer ability, enabling zero-shot behavior including open-ended visual question answering and cross-modality transfer.",
    "authors": [
        "Zirui Wang",
        "Jiahui Yu",
        "Adams Wei Yu",
        "Zihang Dai",
        "Yulia Tsvetkov",
        "Yuan Cao"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents a minimalist pretraining framework, named SimVLM, which significantly outperforms previous pretraining methods and achieves new state-of-the-art results on a wide range of discriminative and generative vision-language benchmarks, including VQA, NLVR2, and image captioning tasks."
    },
    "citationCount": 645,
    "influentialCitationCount": 83,
    "code": null,
    "description": null,
    "url": null
}