{
    "acronym": "5e865f421b11c88f53b599c091c2972ae659b8f9",
    "title": "Predicting Long-Term Human Behaviors in Discrete Representations via Physics-Guided Diffusion",
    "seed_ids": [
        "analogbits",
        "5ed27de050c7c31769af6e15ceae2dfcf0830c3f",
        "8f5fc3ca4fa3df5e7b37c0a6dd4645d5b5920629",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "5e865f421b11c88f53b599c091c2972ae659b8f9",
    "abstract": "Long-term human trajectory prediction is a challenging yet critical task in robotics and autonomous systems. Prior work that studied how to predict accurate short-term human trajectories with only unimodal features often failed in long-term prediction. Reinforcement learning provides a good solution for learning human long-term behaviors but can suffer from challenges in data efficiency and optimization. In this work, we propose a long-term human trajectory forecasting framework that leverages a guided diffusion model to generate diverse long-term human behaviors in a high-level latent action space, obtained via a hierarchical action quantization scheme using a VQ-VAE to discretize continuous trajectories and the available context. The latent actions are predicted by our guided diffusion model, which uses physics-inspired guidance at test time to constrain generated multimodal action distributions. Specifically, we use reachability analysis during the reverse denoising process to guide the diffusion steps toward physically feasible latent actions. We evaluate our framework on two publicly available human trajectory forecasting datasets: SFU-Store-Nav and JRDB, and extensive experimental results show that our framework achieves superior performance in long-term human trajectory forecasting.",
    "authors": [
        "Zhitian Zhang",
        "Anjian Li",
        "Angelica Lim",
        "Mo Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a long-term human trajectory forecasting framework that leverages a guided diffusion model to generate diverse long-term human behaviors in a high-level latent action space, obtained via a hierarchical action quantization scheme using a VQ-VAE to discretize continuous trajectories and the available context."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}