{
    "acronym": "5ea8d6a4a778bea1b3131cf241bf5d5293c83886",
    "title": "SCHEME: Scalable Channel Mixer for Vision Transformers",
    "seed_ids": [
        "metaformer",
        "dd1139cfc609c2f3263d02e97176d5275caebc0a",
        "8326dba15f6b8ee6e43c23eea3265a05e59e8135",
        "0d9b8ccb1135b8e380dd8015b080158c6aae3ae5",
        "90b21dbad8969b74d704eed15a3d98722a88e464",
        "333212e246fb65f7c9d43862021e78f007c48449",
        "a9c214e846188adb645021cd7b1964b8ea1fef6f",
        "3cbe314cc5407a6c3249815b5173f22ea15173c2",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "5ea8d6a4a778bea1b3131cf241bf5d5293c83886",
    "abstract": "Vision Transformers have achieved impressive performance in many vision tasks. While the token mixer or attention block has been studied in great detail, much less research has been devoted to the channel mixer or feature mixing block (FFN or MLP), which accounts for a significant portion of of the model parameters and computation. In this work, we show that the dense MLP connections can be replaced with a block diagonal MLP structure that supports larger expansion ratios by splitting MLP features into groups. To improve the feature clusters formed by this structure we propose the use of a lightweight, parameter-free, channel covariance attention (CCA) mechanism as a parallel branch during training. This enables gradual feature mixing across channel groups during training whose contribution decays to zero as the training progresses to convergence. In result, the CCA block can be discarded during inference, enabling enhanced performance at no additional computational cost. The resulting $\\textit{Scalable CHannEl MixEr}$ (SCHEME) can be plugged into any ViT architecture to obtain a gamut of models with different trade-offs between complexity and performance by controlling the block diagonal MLP structure. This is shown by the introduction of a new family of SCHEMEformer models. Experiments on image classification, object detection, and semantic segmentation, with different ViT backbones, consistently demonstrate substantial accuracy gains over existing designs, especially for lower complexity regimes. The SCHEMEformer family is shown to establish new Pareto frontiers for accuracy vs FLOPS, accuracy vs model size, and accuracy vs throughput, especially for fast transformers of small size.",
    "authors": [
        "Deepak Sridhar",
        "Yunsheng Li",
        "Nuno Vasconcelos"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work shows that the dense MLP connections can be replaced with a block diagonal MLP structure that supports larger expansion ratios by splitting MLP features into groups and proposes the use of a lightweight, parameter-free, channel covariance attention (CCA) mechanism as a parallel branch during training."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}