{
    "acronym": "5ed1f797eb35c6cf822a76bac79ce3232ec34121",
    "title": "Framing is Mightier than the Sword: Detection of Episodic and Thematic Framing in News Media",
    "seed_ids": [
        "bert"
    ],
    "s2id": "5ed1f797eb35c6cf822a76bac79ce3232ec34121",
    "abstract": "Many people today watch news videos to get informed. However, news videos can frame information differently and be prone to bias that might lead to miscommunication. Bias is ubiquitous andinherent in interactions between news consumers’ groups, but framing can introduce additional bias in news communications. Citizens that interpret the news have different political orientations and, thus, understand them differently. Experts can be more capable of detecting biased or differently framed information. However, the ever-increasing amount of news videos also make it difficult for experts alone to analyze. While automated methods exist for identifying different types of bias, frame detection approaches, namely episodic and thematic framing, are scarce and focused on texts. In this work, we address the issue of scalable thematic and episodic frame detection in news videos through crowdsourcing and machine learning techniques. We design a crowdsourcing task for annotating thematic and episodic framing in videos with the help of domain experts in political and social sciences. We then use the annotations gathered from experts and crowds to investigate whether machine learning methods can scale up the annotation process by automatically labelling videos on episodic and thematic framing. Our results indicate that framing analysis is a challenging task, both for humans and machines, with high disagreement amongst experts and crowd annotators. Nevertheless, our results suggest that machine learning has potential by combining crowd and expert annotations and building upon them a classifier.",
    "authors": [
        "Panagiotis Mavridis",
        "Oana Inel",
        "Xander Wilcke",
        "M. Makhortykh",
        "M. D. Jong",
        "Honorata Mazepus",
        "Antoaneta Dimitrova",
        "Jesse de Vos",
        "Alessandro Bozzon",
        "Tobias Kuhn"
    ],
    "venue": "Human Computation",
    "year": 2024,
    "tldr": null,
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}