{
    "acronym": "5ed27de050c7c31769af6e15ceae2dfcf0830c3f",
    "title": "Trace and Pace: Controllable Pedestrian Animation via Guided Trajectory Diffusion",
    "seed_ids": [
        "classfreediffu",
        "247fbf266e70e196d983f53e7b4990b9548b0fc5",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "5ed27de050c7c31769af6e15ceae2dfcf0830c3f",
    "abstract": "We introduce a method for generating realistic pedestrian trajectories and full-body animations that can be controlled to meet user-defined goals. We draw on recent advances in guided diffusion modeling to achieve test-time controllability of trajectories, which is normally only associated with rule-based systems. Our guided diffusion model allows users to constrain trajectories through target waypoints, speed, and specified social groups while accounting for the surrounding environment context. This trajectory diffusion model is integrated with a novel physics-based humanoid controller to form a closed-loop, full-body pedestrian animation system capable of placing large crowds in a simulated environment with varying terrains. We further propose utilizing the value function learned during RL training of the animation controller to guide diffusion to produce trajectories better suited for particular scenarios such as collision avoidance and traversing uneven terrain. Video results are available on the project page.",
    "authors": [
        "Davis Rempe",
        "Zhengyi Luo",
        "X. B. Peng",
        "Ye Yuan",
        "Kris Kitani",
        "Karsten Kreis",
        "S. Fidler",
        "O. Litany"
    ],
    "venue": "Computer Vision and Pattern Recognition",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A method for generating realistic pedestrian trajectories and full-body animations that can be controlled to meet user-defined goals and utilizing the value function learned during RL training of the animation controller to guide diffusion to produce trajectories better suited for particular scenarios such as collision avoidance and traversing uneven terrain is introduced."
    },
    "citationCount": 58,
    "influentialCitationCount": 7,
    "code": null,
    "description": null,
    "url": null
}