{
    "acronym": "5f1391e2849ff35452ee85454746ea0a15d65be2",
    "title": "Towards Modeling Learner Performance with Large Language Models",
    "seed_ids": [
        "gpt2",
        "gpt3",
        "83ac79bb8e8695fb3c3c024be74790d862adea74",
        "663dc434fabc1cf1d3e85fff3f7ddcd313035d18",
        "94ce1d5924e05e8d75e43ce70044293ddcef850a",
        "8cf819f6ee33909484ece40d79944c9c37f01a89",
        "5b7f5488c380cf5085a5dd93e993ad293b225eee",
        "a022bda79947d1f656a1164003c1b3ae9a843df9",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5f1391e2849ff35452ee85454746ea0a15d65be2",
    "abstract": "Recent work exploring the capabilities of pre-trained large language models (LLMs) has demonstrated their ability to act as general pattern machines by completing complex token sequences representing a wide array of tasks, including time-series prediction and robot control. This paper investigates whether the pattern recognition and sequence modeling capabilities of LLMs can be extended to the domain of knowledge tracing, a critical component in the development of intelligent tutoring systems (ITSs) that tailor educational experiences by predicting learner performance over time. In an empirical evaluation across multiple real-world datasets, we compare two approaches to using LLMs for this task, zero-shot prompting and model fine-tuning, with existing, non-LLM approaches to knowledge tracing. While LLM-based approaches do not achieve state-of-the-art performance, fine-tuned LLMs surpass the performance of naive baseline models and perform on par with standard Bayesian Knowledge Tracing approaches across multiple metrics. These findings suggest that the pattern recognition capabilities of LLMs can be used to model complex learning trajectories, opening a novel avenue for applying LLMs to educational contexts. The paper concludes with a discussion of the implications of these findings for future research, suggesting that further refinements and a deeper understanding of LLMs' predictive mechanisms could lead to enhanced performance in knowledge tracing tasks.",
    "authors": [
        "Seyed Parsa Neshaei",
        "Richard Lee Davis",
        "Adam Hazimeh",
        "Bojan Lazarevski",
        "Pierre Dillenbourg",
        "Tanja Kaser"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is suggested that the pattern recognition capabilities of LLMs can be used to model complex learning trajectories, opening a novel avenue for applying LLMs to educational contexts and suggesting that further refinements and a deeper understanding of LLMs' predictive mechanisms could lead to enhanced performance in knowledge tracing tasks."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}