{
    "acronym": "5f432dd869cd1f9b764783a3b4fee8e67e74f16c",
    "title": "RAEE: A Training-Free Retrieval-Augmented Early Exiting Framework for Efficient Inference",
    "seed_ids": [
        "bert",
        "80980cd10d19f021c14a6b7eee871b6a5d328024",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a"
    ],
    "s2id": "5f432dd869cd1f9b764783a3b4fee8e67e74f16c",
    "abstract": "Deploying large language model inference remains challenging due to their high computational overhead. Early exiting accelerates model inference by adaptively reducing the number of inference layers. Existing methods require training internal classifiers to determine whether to exit at each intermediate layer. However, such classifier-based early exiting frameworks require significant effort to design and train the classifiers. To address these limitations, this paper proposes RAEE, a training-free Retrieval-Augmented Early Exiting framework for efficient inference. First, this paper demonstrates that the early exiting problem can be modeled as a distribution prediction problem, where the distribution is approximated using similar data's existing information. Next, the paper details the process of collecting existing information to build the retrieval database. Finally, based on the pre-built retrieval database, RAEE leverages the retrieved similar data's exiting information to guide the backbone model to exit at the layer, which is predicted by the approximated distribution. Experimental results demonstrate that the proposed RAEE can significantly accelerate inference. RAEE also achieves state-of-the-art zero-shot performance on 8 classification tasks.",
    "authors": [
        "Lianming Huang",
        "Shangyu Wu",
        "Yufei Cui",
        "Ying Xiong",
        "Xue Liu",
        "Tei-Wei Kuo",
        "Nan Guan",
        "C. Xue"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "RAEE is proposed, a training-free Retrieval-Augmented Early Exiting framework for efficient inference that leverages the retrieved similar data's exiting information to guide the backbone model to exit at the layer, which is predicted by the approximated distribution."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}