{
    "acronym": "5fa48d3721d94fc7d639b40a870e1b99d9eea682",
    "title": "Assessing the Argument Quality of Persuasive Essays using Neural Text Generation",
    "seed_ids": [
        "gpt",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "5fa48d3721d94fc7d639b40a870e1b99d9eea682",
    "abstract": "In this thesis, we will explore the potential of large pre-trained Language Models to assess the Local Sufficiency quality dimension of an argument. We study two different approaches: (1) Directly assessing the Local Sufficiency of an argument as a (binary) classification task and (2) Indirectly assessing Local Sufficiency of an argument by generating a conclusion based on a set of premises first and afterward use the generated conclusion to augment the (binary) classification task in (1). We establish a new state-of-the-art Local Sufficiency assessment approach using the BERT model achieving 96.7% of human performance. Subsequently, we show that leveraging Argument Mining to obtain argumentative units and thus, following the Local Sufficiency definition more strictly, decreases the assessment performance. We also investigate the reasons for this behavior. In addition, we study the task of conclusion generation and its similarity to other tasks in the NLP domain using the BART model. We show that the conclusions generated by our models are of equal quality and could not be discriminated from those written by humans in a manual ranking study. Furthermore, we find that multiple different conclusions are equally likely to be drawn without further context of the conclusion target given a set of premises. Finally, using the generated conclusion to augment the Local Sufficiency assessment approach led to no performance improvements. Still, it revealed that, given the currently available datasets, the Local Sufficiency assessment of arguments relies mostly on the given premises and not on the corresponding conclusions, displaying the need for further research in this direction to better fulfill the task of Local Sufficiency assessment.",
    "authors": [
        "Timon Ziegenbein",
        "Henning Wachsmuth"
    ],
    "venue": "",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This thesis establishes a new state-of-the-art Local Sufficiency assessment approach using the BERT model achieving 96.7% of human performance and finds that multiple different conclusions are equally likely to be drawn without further context of the conclusion target given a set of premises."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}