{
    "acronym": "5fe4c19fb7827d1edb69d34318b86346686071fc",
    "title": "GAAMA 2.0: An Integrated System that Answers Boolean and Extractive Questions",
    "seed_ids": [
        "poolingformer",
        "e32a12b14e212506115cc6804667b3d8297917e1",
        "1a88e53ab07328a497b8e153e18c78cb174e0e89",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "5fe4c19fb7827d1edb69d34318b86346686071fc",
    "abstract": "Recent machine reading comprehension datasets include extractive and boolean questions but current approaches do not offer integrated support for answering both question types. We present a front-end demo to a multilingual machine reading comprehension system that handles boolean and extractive questions. It provides a yes/no answer and highlights the supporting evidence for boolean questions. It provides an answer for extractive questions and highlights the answer in the passage. Our system, GAAMA 2.0, achieved first place on the TyDi QA leaderboard at the time of submission. We contrast two different implementations of our approach: including multiple transformer models for easy deployment, and a shared transformer model utilizing adapters to reduce GPU memory footprint for a resource-constrained environment.",
    "authors": [
        "Scott McCarley",
        "Mihaela A. Bornea",
        "Sara Rosenthal",
        "Anthony Ferritto",
        "Md Arafat Sultan",
        "Avirup Sil",
        "Radu Florian"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents a front-end demo to a multilingual machine reading comprehension system that handles boolean and extractive questions, and contrasts two different implementations of the approach: including multiple transformer models for easy deployment, and a shared transformer model utilizing adapters to reduce GPU memory footprint for a resource-constrained environment."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}