{
    "acronym": "601901be7d9bc0a3e460eee0ef9ab953b60cf715",
    "title": "Enhancing Customer Service in Banking with AI: Intent Classification Using Distilbert",
    "seed_ids": [
        "bert",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "80cf2a6af4200ecfca1c18fc89de16148f1cd4bf",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "b47381e04739ea3f392ba6c8faaf64105493c196"
    ],
    "s2id": "601901be7d9bc0a3e460eee0ef9ab953b60cf715",
    "abstract": "With the increasing demand for efficient and responsive customer service in the banking sector, artificial intelligence offers a promising solution. This paper presents a comparative analysis of artificial intelligence methodologies applied to intent classification within the banking sector customer service domain. Utilizing a comprehensive dataset of banking service inquiries, we evaluate several machine learning approaches, including Naive Bayes, Logistic Regression, Support Vector Machine with Linear Kernel, Random Forest, XGBoost, and the transformer-based DistilBERT model. The models are assessed based on their accuracy, precision, recall, and F1 score metrics. Our findings indicate that DistilBERT, with its distilled architecture, not only outstrips traditional models but also demonstrates exceptional performance with an accuracy and F1 score exceeding 92%. The paper delves into the advantages of employing such an efficient and powerful model in real-time customer service settings, suggesting that DistilBERT offers a substantial enhancement over conventional methods. By providing detailed insights into the model’s capabilities, we underscore the transformative impact of employing advanced AI in the financial industry to elevate customer service standards, streamline operational efficiency, and harness the power of state-of-the-art technology for improved client interactions. The results showcased in this study are indicative of the strides being made in AI applications for financial services and set a benchmark for future exploratory and practical endeavors in the field.",
    "authors": [
        "Saurabh Kumar",
        "Suman Deep",
        "Pourush Kalra"
    ],
    "venue": "International Journal of Current Science Research and Review",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A comparative analysis of artificial intelligence methodologies applied to intent classification within the banking sector customer service domain indicates that DistilBERT, with its distilled architecture, not only outstrips traditional models but also demonstrates exceptional performance."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}