{
    "acronym": "60332206dd6a64c6361e78614c65076cc43f069f",
    "title": "On the Effect of Anticipation on Reading Times",
    "seed_ids": [
        "gpt2",
        "eaee0b647d336c6fc8b844812675ec35cddf14a1",
        "7d73cdbfab83757576b072c3718c47491fa2a53f",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "60332206dd6a64c6361e78614c65076cc43f069f",
    "abstract": "Abstract Over the past two decades, numerous studies have demonstrated how less-predictable (i.e., higher surprisal) words take more time to read. In general, these studies have implicitly assumed the reading process is purely responsive: Readers observe a new word and allocate time to process it as required. We argue that prior results are also compatible with a reading process that is at least partially anticipatory: Readers could make predictions about a future word and allocate time to process it based on their expectation. In this work, we operationalize this anticipation as a word’s contextual entropy. We assess the effect of anticipation on reading by comparing how well surprisal and contextual entropy predict reading times on four naturalistic reading datasets: two self-paced and two eye-tracking. Experimentally, across datasets and analyses, we find substantial evidence for effects of contextual entropy over surprisal on a word’s reading time (RT): In fact, entropy is sometimes better than surprisal in predicting a word’s RT. Spillover effects, however, are generally not captured by entropy, but only by surprisal. Further, we hypothesize four cognitive mechanisms through which contextual entropy could impact RTs—three of which we are able to design experiments to analyze. Overall, our results support a view of reading that is not just responsive, but also anticipatory.1",
    "authors": [
        "Tiago Pimentel",
        "Clara Meister",
        "Ethan Gotlieb Wilcox",
        "R. Levy",
        "Ryan Cotterell"
    ],
    "venue": "Transactions of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": null,
    "citationCount": 11,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}