{
    "acronym": "605c69f22a2be97e18478987c69be29d596a3dd2",
    "title": "Redesigning the Transformer Architecture with Insights from Multi-particle Dynamical Systems",
    "seed_ids": [
        "performer",
        "linformer",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "6fa1cfc4f97f03a8485692418c7aa1a06c574a85",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "34a4e6818d680875ff0bef9a76de0376118446d1",
        "c6c734e16f66fbfcefac7625cc64599e83292c1e",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06",
        "62dc8ddb4907db4b889c5e93673d9b3c189d1f25",
        "f4238bd2385a52413ccbacfd9e409a650235bd13"
    ],
    "s2id": "605c69f22a2be97e18478987c69be29d596a3dd2",
    "abstract": "The Transformer and its variants have been proven to be efficient sequence learners in many different domains. Despite their staggering success, a critical issue has been the enormous number of parameters that must be trained (ranging from $10^7$ to $10^{11}$) along with the quadratic complexity of dot-product attention. In this work, we investigate the problem of approximating the two central components of the Transformer -- multi-head self-attention and point-wise feed-forward transformation, with reduced parameter space and computational complexity. We build upon recent developments in analyzing deep neural networks as numerical solvers of ordinary differential equations. Taking advantage of an analogy between Transformer stages and the evolution of a dynamical system of multiple interacting particles, we formulate a temporal evolution scheme, TransEvolve, to bypass costly dot-product attention over multiple stacked layers. We perform exhaustive experiments with TransEvolve on well-known encoder-decoder as well as encoder-only tasks. We observe that the degree of approximation (or inversely, the degree of parameter reduction) has different effects on the performance, depending on the task. While in the encoder-decoder regime, TransEvolve delivers performances comparable to the original Transformer, in encoder-only tasks it consistently outperforms Transformer along with several subsequent variants.",
    "authors": [
        "Subhabrata Dutta",
        "Tanya Gautam",
        "Soumen Chakrabarti",
        "Tanmoy Chakraborty"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work investigates the problem of approximating the two central components of the Transformer -- multi-head self-attention and point-wise feed-forward transformation, with reduced parameter space and computational complexity, and forms a temporal evolution scheme, TransEvolve, to bypass costly dot-product attention over multiple stacked layers."
    },
    "citationCount": 9,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}