{
    "acronym": "609d2c0c747860afcabf8731f884f22001c3630a",
    "title": "Knowledge graph augmented advanced learning models for commonsense reasoning",
    "seed_ids": [
        "gpt",
        "710d183174844da5b7f392667f3cc25d2b098dde",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47"
    ],
    "s2id": "609d2c0c747860afcabf8731f884f22001c3630a",
    "abstract": "Machine learning is the key solution to many AI issues, but learning models rely heavily on specific training data. While a Bayesian setup can be used to incorporate some learning patterns with previous knowledge, those patterns can not access any organized world knowledge on requirements. The primary objective is to enable human-capable machines in ordinary everyday circumstances to estimate and make presumptions. In this paper we propose to respond to such common sense issues through a textual inference system with external, organized common sense graphs for explanatory inferences. The framework is based on a schematic map as a pair of questions and answers, a linked subgraph from the semantine to the symbolic space of knowledge-based external information. It displays a schematic map with a new network graphic module for information knowledge and performance with graph representations. LSTMs and graphical networks with a hierarchical attention-based direction are the basis of our model. It is flexible and understandable from the intermediate attention scores, leading to confident results. We also achieved state-of-the-art reliability on CommonsenseQA, a broad database of common sense reasoning utilizing ConceptNet as the only external tool for BERT-based models.",
    "authors": [
        "Akhilesh Pothuri",
        "Hari Sai Raghuram Veeramallu",
        "Pooja Malik"
    ],
    "venue": "IOP Conference Series: Materials Science and Engineering",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes to respond to common sense issues through a textual inference system with external, organized common sense graphs for explanatory inferences, and achieves state-of-the-art reliability on CommonsenseQA, a broad database of common sense reasoning utilizing ConceptNet as the only external tool for BERT-based models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}