{
    "acronym": "609e1c196fced582caf9113aa6a003b64d3cdcd6",
    "title": "Better Language Model with Hypernym Class Prediction",
    "seed_ids": [
        "transformerxl",
        "0822f8d7e6a72a65e65f147d3a8d8fccd485da40",
        "320efa53dea3e8f836790682fbd4196132c49749",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "f51497f463566581874c941353dd9d80069c5b77"
    ],
    "s2id": "609e1c196fced582caf9113aa6a003b64d3cdcd6",
    "abstract": "Class-based language models (LMs) have been long devised to address context sparsity in n-gram LMs. In this study, we revisit this approach in the context of neural LMs. We hypothesize that class-based prediction leads to an implicit context aggregation for similar words and thus can improve generalization for rare words. We map words that have a common WordNet hypernym to the same class and train large neural LMs by gradually annealing from predicting the class to token prediction during training. Empirically, this curriculum learning strategy consistently improves perplexity over various large, highly-performant state-of-the-art Transformer-based models on two datasets, WikiText-103 and ARXIV. Our analysis shows that the performance improvement is achieved without sacrificing performance on rare words. Finally, we document other attempts that failed to yield empirical gains, and discuss future directions for the adoption of class-based LMs on a larger scale.",
    "authors": [
        "Richard He Bai",
        "Tong Wang",
        "Alessandro Sordoni",
        "Peng Shi"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study hypothesizes that class-based prediction leads to an implicit context aggregation for similar words and thus can improve generalization for rare words and train large neural LMs by gradually annealing from predicting the class to token prediction during training."
    },
    "citationCount": 11,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}