{
    "acronym": "60ab170ae89f7a38798263f4a1fedabfc9ddd967",
    "title": "Multilayer Sparse Matrix Factorization",
    "seed_ids": [
        "butterfly"
    ],
    "s2id": "60ab170ae89f7a38798263f4a1fedabfc9ddd967",
    "abstract": "Matrix factorization plays an important role in many machine learning and data mining problems such as dictionary learning, data visualization, dimension reduction, to name but a few. In most scenarios, additional constraints are posed to enforce certain properties of the factorization such as: low-rank, weighted low rank, non-negative. Sparsity is one of such desired characteristics and has been at the heart of a plethora of signal processing and data analysis. Since sparsity is usually enforced with regularization ( l 1 norm, nuclear norm), current techniques lack control over the sparse pattern of the solution, especially in non-convex optimization. This report is devoted to address this issue. On the one hand, it will describe a new projection operator to increase the variety of proximal algorithm, a promising method to tackle sparse structured factorization. On the other hand, it will discuss the incorporation of Hard Thresholding Pursuit (HTP), a mechanism in Compressive Sensing to burst the robustness of current algorithms. Research on ﬁxed support factorization is also introduced. Experiments carried out on classical linear operators such as the Discrete Fourier Transform, the Hadamard Transform and other self-crafted matrices will demonstrate the effect of the proposals.",
    "authors": [
        "Le Quoc Tung"
    ],
    "venue": "",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new projection operator to increase the variety of proximal algorithm, a promising method to tackle sparse structured factorization and the incorporation of Hard Thresholding Pursuit, a mechanism in Compressive Sensing to burst the robustness of current algorithms are described."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}