{
    "acronym": "60acc34101dc0395ae6d2ab6abf26cbedb00e961",
    "title": "Distilling the Knowledge of BERT for Text Generation",
    "seed_ids": [
        "lighdynconv",
        "80cf2a6af4200ecfca1c18fc89de16148f1cd4bf",
        "7a09101ac03b74db501648597fa54e992a0fc84f",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc"
    ],
    "s2id": "60acc34101dc0395ae6d2ab6abf26cbedb00e961",
    "abstract": "Large-scale pre-trained language model, such as BERT, has recently achieved great success in a wide range of language understanding tasks. However, it remains an open question how to utilize BERT for text generation tasks. In this paper, we present a novel approach to addressing this challenge in a generic sequence-to-sequence (Seq2Seq) setting. We first propose a new task, Conditional Masked Language Modeling (C-MLM), to enable fine-tuning of BERT on target text-generation dataset. The fine-tuned BERT (i.e., teacher) is then exploited as extra supervision to improve conventional Seq2Seq models (i.e., student) for text generation. By leveraging BERT's idiosyncratic bidirectional nature, distilling the knowledge learned from BERT can encourage auto-regressive Seq2Seq models to plan ahead, imposing global sequence-level supervision for coherent text generation. Experiments show that the proposed approach significantly outperforms strong baselines of Transformer on multiple text generation tasks, including machine translation (MT) and text summarization. Our proposed model also achieves new state-of-the-art results on the IWSLT German-English and English-Vietnamese MT datasets.",
    "authors": [
        "Yen-Chun Chen",
        "Zhe Gan",
        "Yu Cheng",
        "Jingzhou Liu",
        "Jingjing Liu"
    ],
    "venue": "arXiv.org",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a new task, Conditional Masked Language Modeling (C-MLM), to enable fine-tuning of BERT on target text-generation dataset, and significantly outperforms strong baselines of Transformer on multiple text generation tasks, including machine translation (MT) and text summarization."
    },
    "citationCount": 28,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}