{
    "acronym": "616e98ba9e60f36c6ee226cc66c787610f0bbb62",
    "title": "MM-Interleaved: Interleaved Image-Text Generative Modeling via Multi-modal Feature Synchronizer",
    "seed_ids": [
        "classfreediffu",
        "154cc4e8a9e8ad24d4f9c9440b187d06b9ba57bd",
        "42a30dc5470f54ec249f25d3c31e05d7c376c8e3",
        "17d068e78e6f25e65cb08319b19b58279bb8b214",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "5e00596fa946670d894b1bdaeff5a98e3867ef13",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "616e98ba9e60f36c6ee226cc66c787610f0bbb62",
    "abstract": "Developing generative models for interleaved image-text data has both research and practical value. It requires models to understand the interleaved sequences and subsequently generate images and text. However, existing attempts are limited by the issue that the fixed number of visual tokens cannot efficiently capture image details, which is particularly problematic in the multi-image scenarios. To address this, this paper presents MM-Interleaved, an end-to-end generative model for interleaved image-text data. It introduces a multi-scale and multi-image feature synchronizer module, allowing direct access to fine-grained image features in the previous context during the generation process. MM-Interleaved is end-to-end pre-trained on both paired and interleaved image-text corpora. It is further enhanced through a supervised fine-tuning phase, wherein the model improves its ability to follow complex multi-modal instructions. Experiments demonstrate the versatility of MM-Interleaved in recognizing visual details following multi-modal instructions and generating consistent images following both textual and visual conditions. Code and models are available at \\url{https://github.com/OpenGVLab/MM-Interleaved}.",
    "authors": [
        "Changyao Tian",
        "Xizhou Zhu",
        "Yuwen Xiong",
        "Weiyun Wang",
        "Zhe Chen",
        "Wenhai Wang",
        "Yuntao Chen",
        "Lewei Lu",
        "Tong Lu",
        "Jie Zhou",
        "Hongsheng Li",
        "Yu Qiao",
        "Jifeng Dai"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "MM-Interleaved is an end-to-end generative model for interleaved image-text data that introduces a multi-scale and multi-image feature synchronizer module, allowing direct access to fine-grained image features in the previous context during the generation process."
    },
    "citationCount": 22,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}