{
    "acronym": "6172422f0c4f244d82c5767c11191a5df46a1715",
    "title": "MAVE: A Product Dataset for Multi-source Attribute Value Extraction",
    "seed_ids": [
        "etc",
        "49a77a36a0a60d29aa7838ac49a055a69658b195",
        "d27669c82faf78ea08cceaa0a171b540cccc304d"
    ],
    "s2id": "6172422f0c4f244d82c5767c11191a5df46a1715",
    "abstract": "Attribute value extraction refers to the task of identifying values of an attribute of interest from product information. Product attribute values are essential in many e-commerce scenarios, such as customer service robots, product ranking, retrieval and recommendations. While in the real world, the attribute values of a product are usually incomplete and vary over time, which greatly hinders the practical applications. In this paper, we introduce MAVE, a new dataset to better facilitate research on product attribute value extraction. MAVE is composed of a curated set of 2.2 million products from Amazon pages, with 3 million attribute-value annotations across 1257 unique categories. MAVE has four main and unique advantages: First, MAVE is the largest product attribute value extraction dataset by the number of attribute-value examples. Second, MAVE includes multi-source representations from the product, which captures the full product information with high attribute coverage. Third, MAVE represents a more diverse set of attributes and values relative to what previous datasets cover. Lastly, MAVE provides a very challenging zero-shot test set, as we empirically illustrate in the experiments. We further propose a novel approach that effectively extracts the attribute value from the multi-source product information. We conduct extensive experiments with several baselines and show that MAVE is an effective dataset for attribute value extraction task. It is also a very challenging task on zero-shot attribute extraction. Data is available at \\urlhttps://github.com/google-research-datasets/MAVE .",
    "authors": [
        "Li Yang",
        "Qifan Wang",
        "Zac Yu",
        "Anand Kulkarni",
        "Sumit K. Sanghai",
        "Bin Shu",
        "Jonathan L. Elsas",
        "Bhargav Kanagal"
    ],
    "venue": "Web Search and Data Mining",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces MAVE, a new dataset to better facilitate research on product attribute value extraction, and proposes a novel approach that effectively extracts the attribute value from the multi-source product information."
    },
    "citationCount": 46,
    "influentialCitationCount": 11,
    "code": null,
    "description": null,
    "url": null
}