{
    "acronym": "61d486ebad528ebafb1f34cf5780cb586c2892d4",
    "title": "ContraSim – Analyzing Neural Representations Based on Contrastive Learning",
    "seed_ids": [
        "gpt2",
        "ca4ecf116a9b97ce525a01f3f51117877688ddf5",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "61d486ebad528ebafb1f34cf5780cb586c2892d4",
    "abstract": "Recent work has compared neural network representations via similarity-based analyses to improve model interpretation. The quality of a similarity measure is typically evaluated by its success in assigning a high score to representations that are expected to be matched. However, existing similarity measures perform mediocrely on standard benchmarks. In this work, we develop a new similarity measure, dubbed ContraSim, based on contrastive learning. In contrast to common closed-form similarity measures, ContraSim learns a parameterized measure by using both similar and dissimilar examples. We perform an extensive experimental evaluation of our method, with both language and vision models, on the standard layer prediction benchmark and two new benchmarks that we introduce: the multilingual benchmark and the image–caption benchmark. In all cases, ContraSim achieves much higher accuracy than previous similarity measures, even when presented with challenging examples. Finally, ContraSim is more suitable for the analysis of neural networks, revealing new insights not captured by previous measures.",
    "authors": [
        "Adir Rahamim",
        "Yonatan Belinkov"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new similarity measure, dubbed ContraSim, based on contrastive learning that achieves much higher accuracy than previous similarity measures, even when presented with challenging examples, and is more suitable for the analysis of neural networks."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}