{
    "acronym": "61f35e2b4de59c74963c53b7379b306d6b24b2ba",
    "title": "IsoScore: Measuring the Uniformity of Vector Space Utilization",
    "seed_ids": [
        "gpt",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "61f35e2b4de59c74963c53b7379b306d6b24b2ba",
    "abstract": "The recent success of distributed word representations has led to an increased interest in analyzing the properties of their spatial distribution. Current metrics suggest that contextualized word embedding models do not uniformly utilize all dimensions when embedding tokens in vector space. Here we argue that existing metrics are fragile and tend to obfuscate the true spatial distribution of point clouds. To ameliorate this issue, we propose IsoScore: a novel metric which quantifies the degree to which a point cloud uniformly utilizes the ambient vector space. We demonstrate that IsoScore has several desirable properties such as mean invariance and direct correspondence to the number of dimensions used—properties that existing scores do not possess. Furthermore, IsoScore is conceptually intuitive and computationally efficient, making it well suited for analyzing the distribution of point clouds in arbitrary vector spaces, not necessarily limited to those of word embeddings alone. Additionally, we use IsoScore to demonstrate that a number of recent conclusions in the NLP literature that have been derived using brittle metrics of spatial distribution, such as average cosine similarity, may be incomplete or altogether inaccurate.",
    "authors": [
        "W. Rudman",
        "Nate Gillman",
        "T. Rayne",
        "Carsten Eickhoff"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "IsoScore is proposed: a novel metric which quantifies the degree to which a point cloud uniformly utilizes the ambient vector space and has several desirable properties such as mean invariance and direct correspondence to the number of dimensions used—properties that existing scores do not possess."
    },
    "citationCount": 4,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}