{
    "acronym": "6246ce88c98e4d7ec6421782f7cfd3c910595000",
    "title": "Towards Graph Foundation Models: A Survey and Beyond",
    "seed_ids": [
        "gpt3",
        "42a30dc5470f54ec249f25d3c31e05d7c376c8e3",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "efb6899d2eeb27fbd099220146f511aeb78acfa9",
        "5eda60d4940d4185df45c5703e103458171d465d",
        "277dd73bfeb5c46513ce305136b0e71fcd2a311c",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "6246ce88c98e4d7ec6421782f7cfd3c910595000",
    "abstract": "Foundation models have emerged as critical components in a variety of artificial intelligence applications, and showcase significant success in natural language processing and several other domains. Meanwhile, the field of graph machine learning is witnessing a paradigm transition from shallow methods to more sophisticated deep learning approaches. The capabilities of foundation models to generalize and adapt motivate graph machine learning researchers to discuss the potential of developing a new graph learning paradigm. This paradigm envisions models that are pre-trained on extensive graph data and can be adapted for various graph tasks. Despite this burgeoning interest, there is a noticeable lack of clear definitions and systematic analyses pertaining to this new domain. To this end, this article introduces the concept of Graph Foundation Models (GFMs), and offers an exhaustive explanation of their key characteristics and underlying technologies. We proceed to classify the existing work related to GFMs into three distinct categories, based on their dependence on graph neural networks and large language models. In addition to providing a thorough review of the current state of GFMs, this article also outlooks potential avenues for future research in this rapidly evolving domain.",
    "authors": [
        "Jiawei Liu",
        "Cheng Yang",
        "Zhiyuan Lu",
        "Junze Chen",
        "Yibo Li",
        "Mengmei Zhang",
        "Ting Bai",
        "Yuan Fang",
        "Lichao Sun",
        "Philip S. Yu",
        "Chuan Shi"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This article introduces the concept of Graph Foundation Models (GFMs), and offers an exhaustive explanation of their key characteristics and underlying technologies, and classify the existing work related to GFMs into three distinct categories, based on their dependence on graph neural networks and large language models."
    },
    "citationCount": 47,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}