{
    "acronym": "62ac8b0ab1078dbcc2081fa07e7c001b669d2302",
    "title": "CL4DIV: A Contrastive Learning Framework for Search Result Diversification",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "62ac8b0ab1078dbcc2081fa07e7c001b669d2302",
    "abstract": "Search result diversification aims to provide a diversified document ranking list so as to cover as many intents as possible and satisfy the various information needs of different users. Existing approaches usually represented documents by pretrained embeddings (such as doc2vec and Glove). These document representations cannot adequately represent the document's content and are hard to capture the intrinsic user's intent coverage of the given query. Moreover, the limited number of labeled data for search result diversification exacerbates the difficulty of obtaining more efficient document representations. To alleviate these problems and learn more effective document representations, we propose a Contrastive Learning framework for search result DIVersification (CL4DIV). Specifically, we design three contrastive learning tasks from the perspective of subtopics, documents, and candidate document sequences, which correspond to three essential elements in search result diversification. These training tasks are employed to pretrain the document encoder and the document sequence encoder, which are used in the diversified ranking model. Experimental results show that øurs significantly outperforms all existing diversification models. Further analysis demonstrates that our method has wide applicability and can also be used to improve several existing methods.",
    "authors": [
        "Zhirui Deng",
        "Zhicheng Dou",
        "Yutao Zhu",
        "Ji-Rong Wen"
    ],
    "venue": "Web Search and Data Mining",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Contrastive Learning framework for search result DIVersification (CL4DIV) is proposed, which designs three contrastive learning tasks from the perspective of subtopics, documents, and candidate document sequences, which correspond to three essential elements in search result diversification."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}