{
    "acronym": "62ac3ef81e54e1d1930fb5980b236345ee2e4f32",
    "title": "PlainMamba: Improving Non-Hierarchical Mamba in Visual Recognition",
    "seed_ids": [
        "mamba",
        "5867382590f9f0ff8caf15804d20bde10845b2d2",
        "e730beb44042499763d36214c0498434e470dfd5",
        "7154fc93bdefcd237a0ce3902511c0b154049253",
        "b24e899ec0f77eef2fc87a9b8e50516367aa1f97",
        "38c48a1cd296d16dc9c56717495d6e44cc354444",
        "240103933ffe3dac2179cc160a2bd91299357a53",
        "debbb47abc9fb757857f7c06aa86ca558d37c2d7",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "a30ac45ac5b7bd2148d3fb80ee7f3c29724e3170",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "3cbe314cc5407a6c3249815b5173f22ea15173c2",
        "cec7872b194aadf54140578b9be52939eb1112e9",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "62ac3ef81e54e1d1930fb5980b236345ee2e4f32",
    "abstract": "We present PlainMamba: a simple non-hierarchical state space model (SSM) designed for general visual recognition. The recent Mamba model has shown how SSMs can be highly competitive with other architectures on sequential data and initial attempts have been made to apply it to images. In this paper, we further adapt the selective scanning process of Mamba to the visual domain, enhancing its ability to learn features from two-dimensional images by (i) a continuous 2D scanning process that improves spatial continuity by ensuring adjacency of tokens in the scanning sequence, and (ii) direction-aware updating which enables the model to discern the spatial relations of tokens by encoding directional information. Our architecture is designed to be easy to use and easy to scale, formed by stacking identical PlainMamba blocks, resulting in a model with constant width throughout all layers. The architecture is further simplified by removing the need for special tokens. We evaluate PlainMamba on a variety of visual recognition tasks including image classification, semantic segmentation, object detection, and instance segmentation. Our method achieves performance gains over previous non-hierarchical models and is competitive with hierarchical alternatives. For tasks requiring high-resolution inputs, in particular, PlainMamba requires much less computing while maintaining high performance. Code and models are available at https://github.com/ChenhongyiYang/PlainMamba",
    "authors": [
        "Chenhongyi Yang",
        "Zehui Chen",
        "Miguel Espinosa",
        "Linus Ericsson",
        "Zhenyu Wang",
        "Jiaming Liu",
        "Elliot J. Crowley"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "PlainMamba is presented, a simple non-hierarchical state space model (SSM) designed for general visual recognition that achieves performance gains over previous non-hierarchical models and is competitive with hierarchical alternatives."
    },
    "citationCount": 20,
    "influentialCitationCount": 7,
    "code": null,
    "description": null,
    "url": null
}