{
    "acronym": "62edb02f5e2e4a388516bfffef467774de120367",
    "title": "Improving BERT-based FAQ Retrieval System using Query, Question and Answer Simultaneously",
    "seed_ids": [
        "gpt2",
        "bert",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "62edb02f5e2e4a388516bfffef467774de120367",
    "abstract": "FAQ retrieval systems are one of the fields of information retrieval and perform the task of retrieving appropriate question-answer pairs from user queries. Recent studies separately train deep learning models using dense representations of query-question similarity and query-answer relationships. However, since the sentences of a question-answer pair may contain different information, retrieval performance can be improved by using both sentences simultaneously when measuring similarity to the user's query. In this paper, we propose a learning method that can improve retrieval performance by training the relationship between queries and question-answer pairs with a single encoder. We evaluated P@5, MAP, and MRR performance using human-labeled queries on the StackFAQ dataset. To show that performance can be increased by improving the learning method, we trained and verified using the same model as in the previous study and the same query dataset created with GPT-2. Furthermore, we showed that performance can be further improved by training using queries created with GPT-3.5.",
    "authors": [
        "Hyunsoo Cho",
        "Jiwon Choi",
        "Changju Noh",
        "Kwang-Hyun Park"
    ],
    "venue": "International Conference on Information Networking",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a learning method that can improve retrieval performance by training the relationship between queries and question-answer pairs with a single encoder and shows that performance can be increased by improving the learning method."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}