{
    "acronym": "62f7f806a0e914c360f0640d247f4df1974c1f3b",
    "title": "Semi-Structured Object Sequence Encoders",
    "seed_ids": [
        "longformer",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "eecc0a575c5f76abc634a1e31f4f0bcec0ea74c8",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "e0d3b7d2b7bd26dd526e48c2bae64e14dc5babcf",
        "dca4d9abbc82e57dfa52f932e893d467a63e0682",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "62f7f806a0e914c360f0640d247f4df1974c1f3b",
    "abstract": "In this paper we explore the task of modeling semi-structured object sequences; in particular, we focus our attention on the problem of developing a structure-aware input representation for such sequences. Examples of such data include user activity on websites, machine logs, and many others. This type of data is often represented as a sequence of sets of key-value pairs over time and can present modeling challenges due to an ever-increasing sequence length. We propose a two-part approach, which first considers each key independently and encodes a representation of its values over time; we then self-attend over these value-aware key representations to accomplish a downstream task. This allows us to operate on longer object sequences than existing methods. We introduce a novel shared-attention-head architecture between the two modules and present an innovative training schedule that interleaves the training of both modules with shared weights for some attention heads. Our experiments on multiple prediction tasks using real-world data demonstrate that our approach outperforms a unified network with hierarchical encoding, as well as other methods including a record-centric representation and a flattened representation of the sequence.",
    "authors": [
        "V. Rudramurthy",
        "Riyaz Ahmad Bhat",
        "Chulaka Gunasekara",
        "H. Wan",
        "Tejas I. Dhamecha",
        "Danish Contractor",
        "Marina Danilevsky"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a two-part approach, which first considers each key independently and encodes a representation of its values over time; it then self-attend over these value-aware key representations to accomplish a downstream task."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}