{
    "acronym": "63027eacc927be2a0735e0226300f81e262cc695",
    "title": "Out of Length Text Recognition with Sub-String Matching",
    "seed_ids": [
        "transformer",
        "584ca135b61482fd89247113da87d784f738dbfa"
    ],
    "s2id": "63027eacc927be2a0735e0226300f81e262cc695",
    "abstract": "Scene Text Recognition (STR) methods have demonstrated robust performance in word-level text recognition. However, in applications the text image is sometimes long due to detected with multiple horizontal words. It triggers the requirement to build long text recognition models from readily available short word-level text datasets, which has been less studied previously. In this paper, we term this the Out of Length (OOL) text recognition. We establish a new Long Text Benchmark (LTB) to facilitate the assessment of different methods in long text recognition. Meanwhile, we propose a novel method called OOL Text Recognition with sub-String Matching (SMTR). SMTR comprises two cross-attention-based modules: one encodes a sub-string containing multiple characters into next and previous queries, and the other employs the queries to attend to the image features, matching the sub-string and simultaneously recognizing its next and previous character. SMTR can recognize text of arbitrary length by iterating the process above. To avoid being trapped in recognizing highly similar sub-strings, we introduce a regularization training to compel SMTR to effectively discover subtle differences between similar sub-strings for precise matching. In addition, we propose an inference augmentation to alleviate confusion caused by identical sub-strings and improve the overall recognition efficiency. Extensive experimental results reveal that SMTR, even when trained exclusively on short text, outperforms existing methods in public short text benchmarks and exhibits a clear advantage on LTB. Code: \\url{https://github.com/Topdu/OpenOCR}.",
    "authors": [
        "Yongkun Du",
        "Zhineng Chen",
        "Caiyan Jia",
        "Xieping Gao",
        "Yu-Gang Jiang"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A regularization training is introduced to compel SMTR to effectively discover subtle differences between similar sub-strings for precise matching and an inference augmentation is proposed to alleviate confusion caused by identical sub-strings and improve the overall recognition efficiency."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}