{
    "acronym": "637bf7152547fde890118ee57463b499f0956f67",
    "title": "Entity Disambiguation with Entity Definitions",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "aea0600d241ee9b311ef92eee9c3976fbc7d6ed9"
    ],
    "s2id": "637bf7152547fde890118ee57463b499f0956f67",
    "abstract": "Local models have recently attained astounding performances in Entity Disambiguation (ED), with generative and extractive formulations being the most promising research directions. However, previous works have so far limited their studies to using, as the textual representation of each candidate, only its Wikipedia title. Although certainly effective, this strategy presents a few critical issues, especially when titles are not sufficiently informative or distinguishable from one another. In this paper, we address this limitation and investigate the extent to which more expressive textual representations can mitigate it. We evaluate our approach thoroughly against standard benchmarks in ED and find extractive formulations to be particularly well-suited to such representations. We report a new state of the art on 2 out of the 6 benchmarks we consider and strongly improve the generalization capability over unseen patterns. We release our code, data and model checkpoints at https://github.com/SapienzaNLP/extend.",
    "authors": [
        "Luigi Procopio",
        "Simone Conia",
        "Edoardo Barba",
        "Roberto Navigli"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper evaluates their approach thoroughly against standard benchmarks in ED and find extractive formulations to be particularly well-suited to such representations, and strongly improves the generalization capability over unseen patterns."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}