{
    "acronym": "63b5226b5cea33e7b862f737d5bf1a766ea3281a",
    "title": "Two-Stage Movie Script Summarization: An Efficient Method For Low-Resource Long Document Summarization",
    "seed_ids": [
        "longformer",
        "4eb45f33446018175e266738be22f4d830ed697e",
        "3d318019788418b21478e8736d03afadc1607690",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "c600b697700c844cbc85009be70f1cdfeef3593e",
        "274f903041b1a830b37f57929d837c1706e94ec7",
        "0a41cb292242a82b2b09b3bf23b48349b981a640",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "34a4e6818d680875ff0bef9a76de0376118446d1",
        "2cf3bd0cc1382f35384e259d99e4f9744eeaed28",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "f6390beca54411b06f3bde424fb983a451789733",
        "f213032f4340a424106227c900310045cba0f4e8"
    ],
    "s2id": "63b5226b5cea33e7b862f737d5bf1a766ea3281a",
    "abstract": "The Creative Summarization Shared Task at COLING 2022 aspires to generate summaries given long-form texts from creative writing. This paper presents the system architecture and the results of our participation in the Scriptbase track that focuses on generating movie plots given movie scripts. The core innovation in our model employs a two-stage hierarchical architecture for movie script summarization. In the first stage, a heuristic extraction method is applied to extract actions and essential dialogues, which reduces the average length of input movie scripts by 66% from about 24K to 8K tokens. In the second stage, a state-of-the-art encoder-decoder model, Longformer-Encoder-Decoder (LED), is trained with effective fine-tuning methods, BitFit and NoisyTune. Evaluations on the unseen test set indicate that our system outperforms both zero-shot LED baselines as well as other participants on various automatic metrics and ranks 1st in the Scriptbase track.",
    "authors": [
        "Dongqi Pu",
        "Xudong Hong",
        "Pin-Jie Lin",
        "Ernie Chang",
        "Vera Demberg"
    ],
    "venue": "CREATIVESUMM",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The core innovation in the model employs a two-stage hierarchical architecture for movie script summarization, which reduces the average length of input movie scripts by 66% and outperforms both zero-shot LED baselines as well as other participants on various automatic metrics and ranks 1st in the Scriptbase track."
    },
    "citationCount": 9,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}