{
    "acronym": "63bd3382e4fba884ad67052c458081510cfdcb9e",
    "title": "Evaluation of Patients’ Levels of Walking Independence Using Inertial Sensors and Neural Networks in an Acute-Care Hospital",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "63bd3382e4fba884ad67052c458081510cfdcb9e",
    "abstract": "This study aimed to evaluate walking independence in acute-care hospital patients using neural networks based on acceleration and angular velocity from two walking tests. Forty patients underwent the 10-m walk test and the Timed Up-and-Go test at normal speed, with or without a cane. Physiotherapists divided the patients into two groups: 24 patients who were monitored or independent while walking with a cane or without aids in the ward, and 16 patients who were not. To classify these groups, the Transformer model analyzes the left gait cycle data from eight inertial sensors. The accuracy using all the sensor data was 0.836. When sensor data from the right ankle, right wrist, and left wrist were excluded, the accuracy decreased the most. When analyzing the data from these three sensors alone, the accuracy was 0.795. Further reducing the number of sensors to only the right ankle and wrist resulted in an accuracy of 0.736. This study demonstrates the potential of a neural network-based analysis of inertial sensor data for clinically assessing a patient’s level of walking independence.",
    "authors": [
        "Tatsuya Sugimoto",
        "Nobuhito Taniguchi",
        "Ryoto Yoshikura",
        "Hiroshi Kawaguchi",
        "S. Izumi"
    ],
    "venue": "Bioengineering",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The potential of a neural network-based analysis of inertial sensor data for clinically assessing a patient’s level of walking independence in acute-care hospital patients is demonstrated."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}