{
    "acronym": "63cdbfb5b5f4912ef16ba524dd4fa5aaef90573a",
    "title": "Deep Learning Approach to Estimate Relative Humidity Contribution in VOC Response of LCM-Graphene Oxide-Based VOC Sensors",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "63cdbfb5b5f4912ef16ba524dd4fa5aaef90573a",
    "abstract": "The development of volatile organic compound (VOC) sensors is of great importance for many application fields such as air quality monitoring and healthcare. Graphene oxide (GO)-based VOC sensors have gained considerable attention due to their beneficial properties for the detection and measurement of VOCs. However, the performance of these sensors suffers under relative humidity (RH) changes in the ambient environment, as GO has an affinity toward both moisture and VOC molecules. Accordingly, we present a novel instrumentation technique comprising a GO-based VOC sensor and a predictive uncertainty estimation framework based on deep learning (DL) to determine the contribution of RH toward the sensor response. The sensor utilized is a langasite crystal microbalance (LCM) coated with a GO-platinum nanocomposite (Pt-GO-LCM). The performance of two DL models, transformer and long short-term memory (LSTM) architectures were compared when using the sensor resonance characteristics as input. Results showed that both DL models are capable of providing accurate prediction at the level of 1% change in RH, with the transformer approach proving to be the optimal option. Consequently, this combination of acoustic wave sensors and DL-based instrumentation aids in calibrating laboratory-developed gas sensors for the typical range of RH conditions.",
    "authors": [
        "Yun Mun Lim",
        "Ainan Leong",
        "Keenan Zhihong Yap",
        "Varghese Swamy",
        "N. Ramakrishnan"
    ],
    "venue": "IEEE Sensors Journal",
    "year": 2024,
    "tldr": null,
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}