{
    "acronym": "645e7a5b9caa88a61c11bb87a10b07b90945640d",
    "title": "Quantifying the redundancy between prosody and text",
    "seed_ids": [
        "gpt2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "645e7a5b9caa88a61c11bb87a10b07b90945640d",
    "abstract": "Prosody -- the suprasegmental component of speech, including pitch, loudness, and tempo -- carries critical aspects of meaning. However, the relationship between the information conveyed by prosody vs. by the words themselves remains poorly understood. We use large language models (LLMs) to estimate how much information is redundant between prosody and the words themselves. Using a large spoken corpus of English audiobooks, we extract prosodic features aligned to individual words and test how well they can be predicted from LLM embeddings, compared to non-contextual word embeddings. We find a high degree of redundancy between the information carried by the words and prosodic information across several prosodic features, including intensity, duration, pauses, and pitch contours. Furthermore, a word's prosodic information is redundant with both the word itself and the context preceding as well as following it. Still, we observe that prosodic features can not be fully predicted from text, suggesting that prosody carries information above and beyond the words. Along with this paper, we release a general-purpose data processing pipeline for quantifying the relationship between linguistic information and extra-linguistic features.",
    "authors": [
        "Lukas Wolf",
        "Tiago Pimentel",
        "Evelina Fedorenko",
        "Ryan Cotterell",
        "Alex Warstadt",
        "Ethan Wilcox",
        "Tamar I. Regev"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A general-purpose data processing pipeline for quantifying the relationship between linguistic information and extra-linguistic features is released, observing that prosodic features can not be fully predicted from text, suggesting that prosody carries information above and beyond the words."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}