{
    "acronym": "647a42d78e5bd405014a8c878e37fb7b2da8eaa6",
    "title": "Graph Machine Learning in the Era of Large Language Models (LLMs)",
    "seed_ids": [
        "bert",
        "eb9c4a07a336e8deefe7b399c550d3af0241238e",
        "f0a4ea1386ba62561019ef7d33bbb2aec23239c5",
        "b3d634dcd30d24422e82ce118e635ddbd18f1bba",
        "67239d6e9c2c5f8a6d19cb35154e5aa7eaa00f51",
        "6246ce88c98e4d7ec6421782f7cfd3c910595000",
        "d60bc65862c9aca2b4c18595cc1d0f34cadaf4cf",
        "233e48a00e5172819b36d3834cd0f4335b7ed595",
        "ca7bd64d372e3bcb3f4633ca4a20291ff57de3c3",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "83edcfbb206ddad38a971d605da09390604248ea",
        "df602516e28a9ef0ef665ed0aef551984d8d770d",
        "319b84be7a843250bc81d7086f79a4126d550277",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef"
    ],
    "s2id": "647a42d78e5bd405014a8c878e37fb7b2da8eaa6",
    "abstract": "Graphs play an important role in representing complex relationships in various domains like social networks, knowledge graphs, and molecular discovery. With the advent of deep learning, Graph Neural Networks (GNNs) have emerged as a cornerstone in Graph Machine Learning (Graph ML), facilitating the representation and processing of graph structures. Recently, LLMs have demonstrated unprecedented capabilities in language tasks and are widely adopted in a variety of applications such as computer vision and recommender systems. This remarkable success has also attracted interest in applying LLMs to the graph domain. Increasing efforts have been made to explore the potential of LLMs in advancing Graph ML's generalization, transferability, and few-shot learning ability. Meanwhile, graphs, especially knowledge graphs, are rich in reliable factual knowledge, which can be utilized to enhance the reasoning capabilities of LLMs and potentially alleviate their limitations such as hallucinations and the lack of explainability. Given the rapid progress of this research direction, a systematic review summarizing the latest advancements for Graph ML in the era of LLMs is necessary to provide an in-depth understanding to researchers and practitioners. Therefore, in this survey, we first review the recent developments in Graph ML. We then explore how LLMs can be utilized to enhance the quality of graph features, alleviate the reliance on labeled data, and address challenges such as graph heterogeneity and out-of-distribution (OOD) generalization. Afterward, we delve into how graphs can enhance LLMs, highlighting their abilities to enhance LLM pre-training and inference. Furthermore, we investigate various applications and discuss the potential future directions in this promising field.",
    "authors": [
        "Wenqi Fan",
        "Shijie Wang",
        "Jiani Huang",
        "Zhikai Chen",
        "Yu Song",
        "Wenzhuo Tang",
        "Haitao Mao",
        "Hui Liu",
        "Xiaorui Liu",
        "Dawei Yin",
        "Qing Li"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey reviews the recent developments in Graph ML and explores how LLMs can be utilized to enhance the quality of graph features, alleviate the reliance on labeled data, and address challenges such as graph heterogeneity and out-of-distribution (OOD) generalization."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}