{
    "acronym": "64a29bee2e1ad29547d590a3cc26274f4c537145",
    "title": "Not All Memories are Created Equal: Learning to Forget by Expiring",
    "seed_ids": [
        "compressivetransformer",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "0b991a1a5bcdb13646ac0b6873d09bde4cc36fb5",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "2e14e84ccec924ed770b58108ad1d9de6f0ca295",
        "83fac78857c7e65fe10a11a798674dd3cd259c1d",
        "59a916cdc943f0282908e6f3fa0360f4c5fb78d0",
        "9a618cca0d2fc78db1be1aed70517401cb3f3859",
        "f6390beca54411b06f3bde424fb983a451789733",
        "830995ef17cc291c13f42dfd9f462137de1d2179",
        "f4238bd2385a52413ccbacfd9e409a650235bd13",
        "2ff74d426e712522030057624510c03713fa77ba"
    ],
    "s2id": "64a29bee2e1ad29547d590a3cc26274f4c537145",
    "abstract": "Attention mechanisms have shown promising results in sequence modeling tasks that require long-term memory. Recent work investigated mechanisms to reduce the computational cost of preserving and storing memories. However, not all content in the past is equally important to remember. We propose Expire-Span, a method that learns to retain the most important information and expire the irrelevant information. This forgetting of memories enables Transformers to scale to attend over tens of thousands of previous timesteps efficiently, as not all states from previous timesteps are preserved. We demonstrate that Expire-Span can help models identify and retain critical information and show it can achieve strong performance on reinforcement learning tasks specifically designed to challenge this functionality. Next, we show that Expire-Span can scale to memories that are tens of thousands in size, setting a new state of the art on incredibly long context tasks such as character-level language modeling and a frame-by-frame moving objects task. Finally, we analyze the efficiency of Expire-Span compared to existing approaches and demonstrate that it trains faster and uses less memory.",
    "authors": [
        "Sainbayar Sukhbaatar",
        "Da Ju",
        "Spencer Poff",
        "Stephen Roller",
        "Arthur Szlam",
        "J. Weston",
        "Angela Fan"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that Expire-Span can help models identify and retain critical information and show it can achieve strong performance on reinforcement learning tasks specifically designed to challenge this functionality, and it is shown that it trains faster and uses less memory."
    },
    "citationCount": 30,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}