{
    "acronym": "64cc584aa9bafebbab0bc012e225563cf2873ecc",
    "title": "Introduction to Neural Transfer Learning with Transformers for Social Science Text Analysis",
    "seed_ids": [
        "gpt",
        "longformer",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee",
        "a022bda79947d1f656a1164003c1b3ae9a843df9",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "8659bf379ca8756755125a487c43cfe8611ce842",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "64cc584aa9bafebbab0bc012e225563cf2873ecc",
    "abstract": "Transformer-based models for transfer learning have the potential to achieve high prediction accuracies on text-based supervised learning tasks with relatively few training data instances. These models are thus likely to benefit social scientists that seek to have as accurate as possible text-based measures but only have limited resources for annotating training data. To enable social scientists to leverage these potential benefits for their research, this paper explains how these methods work, why they might be advantageous, and what their limitations are. Additionally, three Transformer-based models for transfer learning, BERT (Devlin et al. 2019), RoBERTa (Liu et al. 2019), and the Longformer (Beltagy et al. 2020), are compared to conventional machine learning algorithms on three applications. Across all evaluated tasks, textual styles, and training data set sizes, the conventional models are consistently outperformed by transfer learning with Transformers, thereby demonstrating the benefits these models can bring to textbased social science research.",
    "authors": [
        "Sandra Wankmuller"
    ],
    "venue": "",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper explains how Transformer-based models for transfer learning work, why they might be advantageous, and what their limitations are, and demonstrates the benefits these models can bring to textbased social science research."
    },
    "citationCount": 8,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}