{
    "acronym": "65281bb8f04f4b18640fa6daeb5e16da79148d24",
    "title": "Root Cause Analysis of Anomalies in 5G RAN Using Graph Neural Network and Transformer",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "65281bb8f04f4b18640fa6daeb5e16da79148d24",
    "abstract": "The emergence of 5G technology marks a significant milestone in developing telecommunication networks, enabling exciting new applications such as augmented reality and self-driving vehicles. However, these improvements bring an increased management complexity and a special concern in dealing with failures, as the applications 5G intends to support heavily rely on high network performance and low latency. Thus, automatic self-healing solutions have become effective in dealing with this requirement, allowing a learning-based system to automatically detect anomalies and perform Root Cause Analysis (RCA). However, there are inherent challenges to the implementation of such intelligent systems. First, there is a lack of suitable data for anomaly detection and RCA, as labelled data for failure scenarios is uncommon. Secondly, current intelligent solutions are tailored to LTE networks and do not fully capture the spatio-temporal characteristics present in the data. Considering this, we utilize a calibrated simulator, Simu5G, and generate open-source data for normal and failure scenarios. Using this data, we propose Simba, a state-of-the-art approach for anomaly detection and root cause analysis in 5G Radio Access Networks (RANs). We leverage Graph Neural Networks to capture spatial relationships while a Transformer model is used to learn the temporal dependencies of the data. We implement a prototype of Simba and evaluate it over multiple failures. The outcomes are compared against existing solutions to confirm the superiority of Simba.",
    "authors": [
        "Antor Hasan",
        "Conrado Boeira",
        "K. Papry",
        "Yue Ju",
        "Zhongwen Zhu",
        "I. Haque"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Simba, a state-of-the-art approach for anomaly detection and root cause analysis in 5G Radio Access Networks (RANs), is proposed and implemented, using Graph Neural Networks to capture spatial relationships while a Transformer model is used to learn the temporal dependencies of the data."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}