{
    "acronym": "65369dc97a17dd7c2a2b4fa65d4fa73eb191fd59",
    "title": "Conversational Recommender System and Large Language Model Are Made for Each Other in E-commerce Pre-sales Dialogue",
    "seed_ids": [
        "gpt2",
        "ca7bd64d372e3bcb3f4633ca4a20291ff57de3c3",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "d6db74a36301fdbb4859b5f7ff302337666b93ce",
        "fa52baef4ba2603c4382858669887b89cb9e62a0",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "65369dc97a17dd7c2a2b4fa65d4fa73eb191fd59",
    "abstract": "E-commerce pre-sales dialogue aims to understand and elicit user needs and preferences for the items they are seeking so as to provide appropriate recommendations. Conversational recommender systems (CRSs) learn user representation and provide accurate recommendations based on dialogue context, but rely on external knowledge. Large language models (LLMs) generate responses that mimic pre-sales dialogues after fine-tuning, but lack domain-specific knowledge for accurate recommendations. Intuitively, the strengths of LLM and CRS in E-commerce pre-sales dialogues are complementary, yet no previous work has explored this. This paper investigates the effectiveness of combining LLM and CRS in E-commerce pre-sales dialogues, proposing two collaboration methods: CRS assisting LLM and LLM assisting CRS. We conduct extensive experiments on a real-world dataset of Ecommerce pre-sales dialogues. We analyze the impact of two collaborative approaches with two CRSs and two LLMs on four tasks of Ecommerce pre-sales dialogue. We find that collaborations between CRS and LLM can be very effective in some cases.",
    "authors": [
        "Yuanxing Liu",
        "Wei-Nan Zhang",
        "Yifan Chen",
        "Yuchi Zhang",
        "Haopeng Bai",
        "Fan Feng",
        "Hengbin Cui",
        "Yongbin Li",
        "Wanxiang Che"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper investigates the effectiveness of combiningLLM and CRS in E-commerce pre-sales dialogues, proposing two collaboration methods: CRS assisting LLM and LLM assisting CRS, and finds that collaborations between CRS andLLM can be very effective in some cases."
    },
    "citationCount": 9,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}