{
    "acronym": "656d40a68662ac480a6c56677f7fc12aad26a50e",
    "title": "Physics of Language Models: Part 1, Learning Hierarchical Language Structures",
    "seed_ids": [
        "gpt2",
        "c6d38add1b7bbc10f0da37a90e3f1b51ee5fb617",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "656d40a68662ac480a6c56677f7fc12aad26a50e",
    "abstract": "Transformer-based language models are effective but complex, and understanding their inner workings is a significant challenge. Previous research has primarily explored how these models handle simple tasks like name copying or selection, and we extend this by investigating how these models grasp complex, recursive language structures defined by context-free grammars (CFGs). We introduce a family of synthetic CFGs that produce hierarchical rules, capable of generating lengthy sentences (e.g., hundreds of tokens) that are locally ambiguous and require dynamic programming to parse. Despite this complexity, we demonstrate that generative models like GPT can accurately learn this CFG language and generate sentences based on it. We explore the model's internals, revealing that its hidden states precisely capture the structure of CFGs, and its attention patterns resemble the information passing in a dynamic programming algorithm. This paper also presents several corollaries, including showing why positional embedding is inferior to relative attention or rotary embedding; demonstrating that encoder-based models (e.g., BERT, deBERTa) cannot learn very deeply nested CFGs as effectively as generative models (e.g., GPT); and highlighting the necessity of adding structural and syntactic errors to the pretraining data to make the model more robust to corrupted language prefixes.",
    "authors": [
        "Zeyuan Allen-Zhu",
        "Yuanzhi Li"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces a family of synthetic CFGs that produce hierarchical rules, capable of generating lengthy sentences that are locally ambiguous and require dynamic programming to parse, and demonstrates that generative models like GPT can accurately learn this CFG language and generate sentences based on it."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}