{
    "acronym": "65ccc1c6f45b8f9054578deb419557df9ec9f1f9",
    "title": "Where to Hide a Stolen Elephant: Leaps in Creative Writing with Multimodal Machine Intelligence",
    "seed_ids": [
        "gpt2",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "65ccc1c6f45b8f9054578deb419557df9ec9f1f9",
    "abstract": "While developing a story, novices and published writers alike have had to look outside themselves for inspiration. Language models have recently been able to generate text fluently, producing new stochastic narratives upon request. However, effectively integrating such capabilities with human cognitive faculties and creative processes remains challenging. We propose to investigate this integration with a multimodal writing support interface that offers writing suggestions textually, visually, and aurally. We conduct an extensive study that combines elicitation of prior expectations before writing, observation and semi-structured interviews during writing, and outcome evaluations after writing. Our results illustrate the individual and situational variation in machine-in-the-loop writing approaches, suggestion acceptance, and ways the system is helpful. Centrally, we report how participants perform integrative leaps, by which they do cognitive work to integrate suggestions of varying semantic relevance into their developing stories. We interpret these findings, offering modeling and design recommendations for future creative writing support technologies.",
    "authors": [
        "Nikhil Singh",
        "Guillermo Bernal",
        "D. Savchenko",
        "Elena L. Glassman"
    ],
    "venue": "ACM Trans. Comput. Hum. Interact.",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work conducts an extensive study that combines elicitation of prior expectations before writing, observation and semi-structured interviews during writing, and outcome evaluations after writing to investigate integration with a multimodal writing support interface."
    },
    "citationCount": 89,
    "influentialCitationCount": 8,
    "code": null,
    "description": null,
    "url": null
}