{
    "acronym": "65e8a4cca1a80f517bab8b4c3a39cc63d7527e66",
    "title": "CogView3: Finer and Faster Text-to-Image Generation via Relay Diffusion",
    "seed_ids": [
        "classfreediffu",
        "169fd6c457d99a21c32b6f23bbfd1e09a2513684",
        "02dde8e9fefafae8e0b9ee2eef0ddc74c511f7cd",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "65e8a4cca1a80f517bab8b4c3a39cc63d7527e66",
    "abstract": "Recent advancements in text-to-image generative systems have been largely driven by diffusion models. However, single-stage text-to-image diffusion models still face challenges, in terms of computational efficiency and the refinement of image details. To tackle the issue, we propose CogView3, an innovative cascaded framework that enhances the performance of text-to-image diffusion. CogView3 is the first model implementing relay diffusion in the realm of text-to-image generation, executing the task by first creating low-resolution images and subsequently applying relay-based super-resolution. This methodology not only results in competitive text-to-image outputs but also greatly reduces both training and inference costs. Our experimental results demonstrate that CogView3 outperforms SDXL, the current state-of-the-art open-source text-to-image diffusion model, by 77.0\\% in human evaluations, all while requiring only about 1/2 of the inference time. The distilled variant of CogView3 achieves comparable performance while only utilizing 1/10 of the inference time by SDXL.",
    "authors": [
        "Wendi Zheng",
        "Jiayan Teng",
        "Zhuoyi Yang",
        "Weihan Wang",
        "Jidong Chen",
        "Xiaotao Gu",
        "Yuxiao Dong",
        "Ming Ding",
        "Jie Tang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "CogView3 is the first model implementing relay diffusion in the realm of text-to-image generation, executing the task by first creating low-resolution images and subsequently applying relay-based super-resolution, which results in competitive text-to-image outputs and greatly reduces both training and inference costs."
    },
    "citationCount": 12,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}