{
    "acronym": "65f788fb964901e3f1149a0a53317535ca85ed7d",
    "title": "Unicoder: A Universal Language Encoder by Pre-training with Multiple Cross-lingual Tasks",
    "seed_ids": [
        "gpt",
        "7ebed46b7f3ec913e508e6468304fcaea832eda1",
        "2fa3f7ce620a1c7155daef6620dd6bb0e01934f3",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc"
    ],
    "s2id": "65f788fb964901e3f1149a0a53317535ca85ed7d",
    "abstract": "We present Unicoder, a universal language encoder that is insensitive to different languages. Given an arbitrary NLP task, a model can be trained with Unicoder using training data in one language and directly applied to inputs of the same task in other languages. Comparing to similar efforts such as Multilingual BERT and XLM , three new cross-lingual pre-training tasks are proposed, including cross-lingual word recovery, cross-lingual paraphrase classification and cross-lingual masked language model. These tasks help Unicoder learn the mappings among different languages from more perspectives. We also find that doing fine-tuning on multiple languages together can bring further improvement. Experiments are performed on two tasks: cross-lingual natural language inference (XNLI) and cross-lingual question answering (XQA), where XLM is our baseline. On XNLI, 1.8% averaged accuracy improvement (on 15 languages) is obtained. On XQA, which is a new cross-lingual dataset built by us, 5.5% averaged accuracy improvement (on French and German) is obtained.",
    "authors": [
        "Haoyang Huang",
        "Yaobo Liang",
        "Nan Duan",
        "Ming Gong",
        "Linjun Shou",
        "Daxin Jiang",
        "M. Zhou"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is found that doing fine-tuning on multiple languages together can bring further improvement in Unicoder, a universal language encoder that is insensitive to different languages."
    },
    "citationCount": 219,
    "influentialCitationCount": 19,
    "code": null,
    "description": null,
    "url": null
}