{
    "acronym": "66e7edf09589527ebb58418632418758cee668cd",
    "title": "On the Essence and Prospect: An Investigation of Alignment Approaches for Big Models",
    "seed_ids": [
        "gpt3",
        "31d65e179b1d00484154b3525d93846dd82f23d8",
        "e8e035f9768a4d4e7fe9a2e167cd93d170407b1b",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "fd1b829261ba04bb92e0ab60c4f6e7cea0d99fbf",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "14c3cf58192774b9b6fc6188df99efd6ab5fc739",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "66e7edf09589527ebb58418632418758cee668cd",
    "abstract": "Big models have achieved revolutionary breakthroughs in the field of AI, but they also pose potential ethical and societal risks to humans. Addressing such problems, alignment technologies were introduced to make these models conform to human preferences and values. Despite the considerable advancements in the past year, various challenges lie in establishing the optimal alignment strategy, such as data cost and scalable oversight, and how to align remains an open question. In this survey paper, we comprehensively investigate value alignment approaches. We first unpack the historical context of alignment tracing back to the 1920s (where it comes from), then delve into the mathematical essence of alignment (what it is), shedding light on the inherent challenges. Following this foundation, we provide a detailed examination of existing alignment methods, which fall into three categories: RL-based Alignment, SFT-based Alignment, and Inference-Time Alignment, and demonstrate their intrinsic connections, strengths, and limitations, helping readers better understand this research area. In addition, two emerging topics, alignment goal and multimodal alignment, are also discussed as novel frontiers in the field. Looking forward, we discuss potential alignment paradigms and how they could handle remaining challenges, prospecting where future alignment will go.",
    "authors": [
        "Xinpeng Wang",
        "Shitong Duan",
        "Xiaoyuan Yi",
        "Jing Yao",
        "Shanlin Zhou",
        "Zhihua Wei",
        "Peng Zhang",
        "Dongkuan Xu",
        "Maosong Sun",
        "Xing Xie"
    ],
    "venue": "Proceedings of the Thirty-ThirdInternational Joint Conference on Artificial Intelligence",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A detailed examination of existing alignment methods, which fall into three categories: RL-based Alignment, SFT-based Alignment, and Inference-Time Alignment, and demonstrate their intrinsic connections, strengths, and limitations are provided, to help readers better understand this research area."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}