{
    "acronym": "670edecb7a0d3887893c8f287e66209b87e5f56f",
    "title": "CTRLEval: An Unsupervised Reference-Free Metric for Evaluating Controlled Text Generation",
    "seed_ids": [
        "gpt",
        "b6c4a96e09b9f11e7c70e7f1fbe3f3971b92762d",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "e7c698bdace380f7183dedbe657686f1885f615c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "d81f4f03913a0087e9b623f6d0dbd9f169b971f5"
    ],
    "s2id": "670edecb7a0d3887893c8f287e66209b87e5f56f",
    "abstract": "Existing reference-free metrics have obvious limitations for evaluating controlled text generation models. Unsupervised metrics can only provide a task-agnostic evaluation result which correlates weakly with human judgments, whereas supervised ones may overfit task-specific data with poor generalization ability to other datasets. In this paper, we propose an unsupervised reference-free metric called CTRLEval, which evaluates controlled text generation from different aspects by formulating each aspect into multiple text infilling tasks. On top of these tasks, the metric assembles the generation probabilities from a pre-trained language model without any model training. Experimental results show that our metric has higher correlations with human judgments than other baselines, while obtaining better generalization of evaluating generated texts from different models and with different qualities.",
    "authors": [
        "Pei Ke",
        "Hao Zhou",
        "Yankai Lin",
        "Peng Li",
        "Jie Zhou",
        "Xiaoyan Zhu",
        "Minlie Huang"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Experimental results show that the proposed unsupervised reference-free metric, CTRLEval, has higher correlations with human judgments than other baselines, while obtaining better generalization of evaluating generated texts from different models and with different qualities."
    },
    "citationCount": 32,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}