{
    "acronym": "6784651527c5c25cf7c202124ef55e2fcea58a96",
    "title": "Arabic Automatic Story Generation with Large Language Models",
    "seed_ids": [
        "gpt3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "6784651527c5c25cf7c202124ef55e2fcea58a96",
    "abstract": "Large language models (LLMs) have recently emerged as a powerful tool for a wide range of language generation tasks. Nevertheless, this progress has been slower in Arabic. In this work, we focus on the task of generating stories from LLMs. For our training, we use stories acquired through machine translation (MT) as well as GPT-4. For the MT data, we develop a careful pipeline that ensures we acquire high-quality stories. For our GPT-41 data, we introduce crafted prompts that allow us to generate data well-suited to the Arabic context in both Modern Standard Arabic (MSA) and two Arabic dialects (Egyptian and Moroccan). For example, we generate stories tailored to various Arab countries on a wide host of topics. Our manual evaluation shows that our model fine-tuned on these training datasets can generate coherent stories that adhere to our instructions. We also conduct an extensive automatic and human evaluation comparing our models against state-of-the-art proprietary and open-source models. Our datasets and models will be made publicly available at https: //github.com/UBC-NLP/arastories.",
    "authors": [
        "Ahmed Oumar El-Shangiti",
        "Fakhraddin Alwajih",
        "Muhammad Abdul-Mageed"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work uses stories acquired through machine translation as well as GPT-4 to generate stories tailored to various Arab countries on a wide host of topics and conducts an extensive automatic and human evaluation comparing the models against state-of-the-art proprietary and open-source models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}