{
    "acronym": "67af926a717625476f50cf08466ad8e3c644f5c7",
    "title": "In-Context Former: Lightning-fast Compressing Context for Large Language Model",
    "seed_ids": [
        "roformer",
        "7b2470f0f53fcd79b82ed6a0e6062f39b07c27d6",
        "2f7364d8e5cf94315bf8905f57de9c5543e9a4bf",
        "dbc368bc8b49347dd27679894524fa62f88492c9",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "67af926a717625476f50cf08466ad8e3c644f5c7",
    "abstract": "With the rising popularity of Transformer-based large language models (LLMs), reducing their high inference costs has become a significant research focus. One effective approach is to compress the long input contexts. Existing methods typically leverage the self-attention mechanism of the LLM itself for context compression. While these methods have achieved notable results, the compression process still involves quadratic time complexity, which limits their applicability. To mitigate this limitation, we propose the In-Context Former (IC-Former). Unlike previous methods, IC-Former does not depend on the target LLMs. Instead, it leverages the cross-attention mechanism and a small number of learnable digest tokens to directly condense information from the contextual word embeddings. This approach significantly reduces inference time, which achieves linear growth in time complexity within the compression range. Experimental results indicate that our method requires only 1/32 of the floating-point operations of the baseline during compression and improves processing speed by 68 to 112 times while achieving over 90% of the baseline performance on evaluation metrics. Overall, our model effectively reduces compression costs and makes real-time compression scenarios feasible.",
    "authors": [
        "Xiangfeng Wang",
        "Zaiyi Chen",
        "Zheyong Xie",
        "Tong Xu",
        "Yongyi He",
        "Enhong Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The In-Context Former (IC-Former) model effectively reduces compression costs and makes real-time compression scenarios feasible and significantly reduces inference time, which achieves linear growth in time complexity within the compression range."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}