{
    "acronym": "67f80a740340671ae55e087ed1feb643d4654aaa",
    "title": "High Performance Computing for Understanding Natural Language",
    "seed_ids": [
        "gpt",
        "98332ae5475bfa286d9ab74e20d86c72ceb3cde6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "67f80a740340671ae55e087ed1feb643d4654aaa",
    "abstract": "The amount of user-generated text available online is growing at an ever-increasing rate due to tremendous progress in enlarging inexpensive storage capacity, processing capabilities, and the popularity of online outlets and social networks. Learning language representation and solving tasks in an end-to-end manner, without a need for human-expert feature extraction and creation, has made models more accurate and much more complicated in the number of parameters, requiring parallelized and distributed resources high-performance computing or cloud. This chapter gives an overview of state-of-the-art natural language processing problems, algorithms, models, and libraries. Parallelized and distributed ways to solve text understanding, representation, and classification tasks are also discussed. Additionally, the importance of high-performance computing for natural language processing applications is illustrated by showing details of a few specific applications that use pre-training or self-supervised learning on large amounts of data in text understanding.",
    "authors": [
        "Marija Stanojevic",
        "Jumanah Alshehri",
        "Z. Obradovic"
    ],
    "venue": "Advances in Systems Analysis, Software Engineering, and High Performance Computing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This chapter gives an overview of state-of-the-art natural language processing problems, algorithms, models, and libraries, and details of a few specific applications that use pre-training or self-supervised learning on large amounts of data in text understanding."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}