{
    "acronym": "684e712f59f11d2bdc98be4c210824ab9e6f11f4",
    "title": "GLoMo: Unsupervised Learning of Transferable Relational Graphs",
    "seed_ids": [
        "memcompress",
        "6084b58d8b4b0caf3a2a7f3a1bee1cc527927e39"
    ],
    "s2id": "684e712f59f11d2bdc98be4c210824ab9e6f11f4",
    "abstract": "Modern deep transfer learning approaches have mainly focused on learning generic feature vectors from one task that are transferable to other tasks, such as word embeddings in language and pretrained convolutional features in vision. However, these approaches usually transfer unary features and largely ignore more structured graphical representations. This work explores the possibility of learning generic latent relational graphs that capture dependencies between pairs of data units (e.g., words or pixels) from large-scale unlabeled data and transferring the graphs to downstream tasks. Our proposed transfer learning framework improves performance on various tasks including question answering, natural language inference, sentiment analysis, and image classification. We also show that the learned graphs are generic enough to be transferred to different embeddings on which the graphs have not been trained (including GloVe embeddings, ELMo embeddings, and task-specific RNN hidden units), or embedding-free units such as image pixels.",
    "authors": [
        "Zhilin Yang",
        "J. Zhao",
        "Bhuwan Dhingra",
        "Kaiming He",
        "William W. Cohen",
        "R. Salakhutdinov",
        "Yann LeCun"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2018,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work explores the possibility of learning generic latent relational graphs that capture dependencies between pairs of data units from large-scale unlabeled data and transferring the graphs to downstream tasks, and shows that the learned graphs are generic enough to be transferred to different embeddings on which the graphs have been trained."
    },
    "citationCount": 23,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}