{
    "acronym": "68571a8c3598888035c5c4f0a99793434ad61ef4",
    "title": "LoRaLay: A Multilingual and Multimodal Dataset for Long Range and Layout-Aware Summarization",
    "seed_ids": [
        "bigbird",
        "3d318019788418b21478e8736d03afadc1607690",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "68571a8c3598888035c5c4f0a99793434ad61ef4",
    "abstract": "Text Summarization is a popular task and an active area of research for the Natural Language Processing community. By definition, it requires to account for long input texts, a characteristic which poses computational challenges for neural models. Moreover, real-world documents come in a variety of complex, visually-rich, layouts. This information is of great relevance, whether to highlight salient content or to encode long-range interactions between textual passages. Yet, all publicly available summarization datasets only provide plain text content. To facilitate research on how to exploit visual/layout information to better capture long-range dependencies in summarization models, we present LoRaLay, a collection of datasets for long-range summarization with accompanying visual/layout information. We extend existing and popular English datasets (arXiv and PubMed) with layout information and propose four novel datasets – consistently built from scholar resources – covering French, Spanish, Portuguese, and Korean languages. Further, we propose new baselines merging layout-aware and long-range models – two orthogonal approaches – and obtain state-of-the-art results, showing the importance of combining both lines of research.",
    "authors": [
        "Laura Nguyen",
        "Thomas Scialom",
        "Benjamin Piwowarski",
        "Jacopo Staiano"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "LoRaLay is presented, a collection of datasets for long-range summarization with accompanying visual/layout information and four novel datasets – consistently built from scholar resources – covering French, Spanish, Portuguese, and Korean languages are proposed."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}