{
    "acronym": "68708ea853006387537df85f4b811f7aeab6c4f5",
    "title": "DreamStyler: Paint by Style Inversion with Text-to-Image Diffusion Models",
    "seed_ids": [
        "classfreediffu",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "68708ea853006387537df85f4b811f7aeab6c4f5",
    "abstract": "Recent progresses in large-scale text-to-image models have yielded remarkable accomplishments, finding various applications in art domain.\nHowever, expressing unique characteristics of an artwork (e.g. brushwork, colortone, or composition) with text prompts alone may encounter limitations due to the inherent constraints of verbal description.\nTo this end, we introduce DreamStyle, a novel framework designed for artistic image synthesis, proficient in both text-to-image synthesis and style transfer.\nDreamStyle optimizes a multi-stage textual embedding with a context-aware text prompt, resulting in prominent image quality.\nIn addition, with content and style guidance, DreamStyle exhibits flexibility to accommodate a range of style references.\nExperimental results demonstrate its superior performance across multiple scenarios, suggesting its promising potential in artistic product creation.\nProject page: https://nmhkahn.github.io/dreamstyler/",
    "authors": [
        "Namhyuk Ahn",
        "Junsoo Lee",
        "Chunggi Lee",
        "Kunhee Kim",
        "Daesik Kim",
        "Seung-Hun Nam",
        "Kibeom Hong"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces DreamStyle, a novel framework designed for artistic image synthesis, proficient in both text-to-image synthesis and style transfer, and demonstrates its promising potential in artistic product creation."
    },
    "citationCount": 10,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}