{
    "acronym": "6872272b70337024a9b8637c1fee9bde19cb20a9",
    "title": "JaFIn: Japanese Financial Instruction Dataset",
    "seed_ids": [
        "gpt2",
        "83edcfbb206ddad38a971d605da09390604248ea",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "6872272b70337024a9b8637c1fee9bde19cb20a9",
    "abstract": "We construct an instruction dataset for the large language model (LLM) in the Japanese finance domain. Domain adaptation of language models, including LLMs, is receiving more attention as language models become more popular. This study demonstrates the effectiveness of domain adaptation through instruction tuning. To achieve this, we propose an instruction tuning data in Japanese called JaFIn, the Japanese Financial Instruction Dataset. JaFIn is manually constructed based on multiple data sources, including Japanese government websites, which provide extensive financial knowledge. We then utilize JaFIn to apply instruction tuning for several LLMs, demonstrating that our models specialized in finance have better domain adaptability than the original models. The financial-specialized LLMs created were evaluated using a quantitative Japanese financial benchmark and qualitative response comparisons, showing improved performance over the originals.",
    "authors": [
        "Kota Tanabe",
        "Masahiro Suzuki",
        "Hiroki Sakaji",
        "Itsuki Noda"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study constructs an instruction dataset for the large language model (LLM) in the Japanese finance domain and proposes an instruction tuning data in Japanese called JaFIn, the Japanese Financial Instruction Dataset, demonstrating the effectiveness of domain adaptation through instruction tuning."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}