{
    "acronym": "68dce2e05cd4a4941de992028b94c1290bc32ff0",
    "title": "Let AI Entertain You: Increasing User Engagement with Generative AI and Rejection Sampling",
    "seed_ids": [
        "gpt3",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "ef57ad148ec2eeef5eb3467f3e37e30042b2c7bd",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "68dce2e05cd4a4941de992028b94c1290bc32ff0",
    "abstract": "While generative AI excels in content generation, it does not always increase user engagement. This can be attributed to two main factors. First, generative AI generates content without incorporating explicit or implicit feedback about user interactions. Even if the generated content seems to be more informative or well-written, it does not necessarily lead to an increase in user activities, such as clicks. Second, there is a concern with the quality of the content generative AI produces, which often lacks the distinctiveness and authenticity that human-created content possesses. These two factors can lead to content that fails to meet specific needs and preferences of users, ultimately reducing its potential to be engaging. This paper presents a generic framework of how to improve user engagement with generative AI by leveraging user feedback. Our solutions employ rejection sampling, a technique used in reinforcement learning, to boost engagement metrics. We leveraged the framework in the context of email notification subject lines generation for an online social network, and achieved significant engagement metric lift including +1% Session and +0.4% Weekly Active Users. We believe our work offers a universal framework that enhances user engagement with generative AI, particularly when standard generative AI reaches its limits in terms of enhancing content to be more captivating. To the best of our knowledge, this represents an early milestone in the industry's successful use of generative AI to enhance user engagement.",
    "authors": [
        "Jingying Zeng",
        "Jaewon Yang",
        "Waleed Malik",
        "Xiao Yan",
        "Richard Huang",
        "Qi He"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper presents a generic framework of how to improve user engagement with generative AI by leveraging user feedback and leveraged the framework in the context of email notification subject lines generation for an online social network, and achieved significant engagement metric lift."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}