{
    "acronym": "68fd6cc9b41291d625b41761149016be6485c0b3",
    "title": "ChatGPT in the Age of Generative AI and Large Language Models: A Concise Survey",
    "seed_ids": [
        "gpt2",
        "7b6a8c6d44e0f77bf930484e438d77b7465a69fb",
        "f9bfc6d9ba1665b73af3323d46c7642b852759ef",
        "4de290467d903b9977e31b3d4084006789bd6ebd",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "1b492746ee3a304a13950cad1a59861b9ee44645",
        "db4ab91d5675c37795e719e997a2827d3d83cd45",
        "15736f7c205d961c00378a938daffaacb5a0718d",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "68fd6cc9b41291d625b41761149016be6485c0b3",
    "abstract": "ChatGPT is a large language model (LLM) created by OpenAI that has been carefully trained on a large amount of data. It has revolutionized the field of natural language processing (NLP) and has pushed the boundaries of LLM capabilities. ChatGPT has played a pivotal role in enabling widespread public interaction with generative artificial intelligence (GAI) on a large scale. It has also sparked research interest in developing similar technologies and investigating their applications and implications. In this paper, our primary goal is to provide a concise survey on the current lines of research on ChatGPT and its evolution. We considered both the glass box and black box views of ChatGPT, encompassing the components and foundational elements of the technology, as well as its applications, impacts, and implications. The glass box approach focuses on understanding the inner workings of the technology, and the black box approach embraces it as a complex system, and thus examines its inputs, outputs, and effects. This paves the way for a comprehensive exploration of the technology and provides a road map for further research and experimentation. We also lay out essential foundational literature on LLMs and GAI in general and their connection with ChatGPT. This overview sheds light on existing and missing research lines in the emerging field of LLMs, benefiting both public users and developers. Furthermore, the paper delves into the broad spectrum of applications and significant concerns in fields such as education, research, healthcare, finance, etc.",
    "authors": [
        "S. Mohamadi",
        "G. Mujtaba",
        "N. Le",
        "Gianfranco Doretto",
        "Don Adjeroh"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A concise survey on the current lines of research on ChatGPT and its evolution is provided, encompassing the components and foundational elements of the technology, as well as its applications, impacts, and implications."
    },
    "citationCount": 11,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}