{
    "acronym": "698b3306698316b95860110d25dc9c846c3528c9",
    "title": "LEST: Large-scale LiDAR Semantic Segmentation with Transformer",
    "seed_ids": [
        "cosformer",
        "lineartransformer",
        "c49ac1f916d6d2edeb187e6619c8d23acd95eb21",
        "2e644c67a697073d561da4f4dad35e5ad5316cfd",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "b1c39d042fdf8f00a407b0df734764beb6c3b062",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "698b3306698316b95860110d25dc9c846c3528c9",
    "abstract": "Large-scale LiDAR-based point cloud semantic segmentation is a critical task in autonomous driving perception. Almost all of the previous state-of-the-art LiDAR semantic segmentation methods are variants of sparse 3D convolution. Although the Transformer architecture is becoming popular in the field of natural language processing and 2D computer vision, its application to large-scale point cloud semantic segmentation is still limited. In this paper, we propose a LiDAR sEmantic Segmentation architecture with pure Transformer, LEST. LEST comprises two novel components: a Space Filling Curve (SFC) Grouping strategy and a Distance-based Cosine Linear Transformer, DISCO. On the public nuScenes semantic segmentation validation set and SemanticKITTI test set, our model outperforms all the other state-of-the-art methods.",
    "authors": [
        "Chuanyu Luo",
        "Nuo Cheng",
        "Sikun Ma",
        "Han Li",
        "Xiaohan Li",
        "Shengguang Lei",
        "Pu Li"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A LiDAR sEmantic Segmentation architecture with pure Transformer, LEST is proposed, which outperforms all the other state-of-the-art methods on the public nuScenes semantic segmentation validation set and SemanticKITTI test set."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}