{
    "acronym": "69958f6cacf86537c8fb7e4efaa8fb2d8e519ce2",
    "title": "Mathador-LM: A Dynamic Benchmark for Mathematical Reasoning on Large Language Models",
    "seed_ids": [
        "gpt2",
        "5fc1a3a49e8f1d106118b69d1d6be3b6caa23da0",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "69958f6cacf86537c8fb7e4efaa8fb2d8e519ce2",
    "abstract": "We introduce Mathador-LM, a new benchmark for evaluating the mathematical reasoning on large language models (LLMs), combining ruleset interpretation, planning, and problem-solving. This benchmark is inspired by the Mathador game, where the objective is to reach a target number using basic arithmetic operations on a given set of base numbers, following a simple set of rules. We show that, across leading LLMs, we obtain stable average performance while generating benchmark instances dynamically, following a target difficulty level. Thus, our benchmark alleviates concerns about test-set leakage into training data, an issue that often undermines popular benchmarks. Additionally, we conduct a comprehensive evaluation of both open and closed-source state-of-the-art LLMs on Mathador-LM. Our findings reveal that contemporary models struggle with Mathador-LM, scoring significantly lower than average 3rd graders. This stands in stark contrast to their strong performance on popular mathematical reasoning benchmarks.",
    "authors": [
        "Eldar Kurtic",
        "Amir Moeini",
        "Dan Alistarh"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that, across leading LLMs, it is possible to obtain stable average performance while generating benchmark instances dynamically, following a target difficulty level, which alleviates concerns about test-set leakage into training data, an issue that often undermines popular benchmarks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}