{
    "acronym": "69b78fe66c910f1164f414accd1c8f18be6ba157",
    "title": "Personalized Adapter for Large Meteorology Model on Devices: Towards Weather Foundation Models",
    "seed_ids": [
        "gpt2",
        "83ac79bb8e8695fb3c3c024be74790d862adea74",
        "16f01c1b3ddd0b2abd5ddfe4fdb3f74767607277",
        "863171ed35ca0035074f73bb202b153cc346f2f3",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "30dcc0e191a376fea0e7a46f94c53872c029efc9",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "69b78fe66c910f1164f414accd1c8f18be6ba157",
    "abstract": "This paper demonstrates that pre-trained language models (PLMs) are strong foundation models for on-device meteorological variables modeling. We present LM-Weather, a generic approach to taming PLMs, that have learned massive sequential knowledge from the universe of natural language databases, to acquire an immediate capability to obtain highly customized models for heterogeneous meteorological data on devices while keeping high efficiency. Concretely, we introduce a lightweight personalized adapter into PLMs and endows it with weather pattern awareness. During communication between clients and the server, low-rank-based transmission is performed to effectively fuse the global knowledge among devices while maintaining high communication efficiency and ensuring privacy. Experiments on real-wold dataset show that LM-Weather outperforms the state-of-the-art results by a large margin across various tasks (e.g., forecasting and imputation at different scales). We provide extensive and in-depth analyses experiments, which verify that LM-Weather can (1) indeed leverage sequential knowledge from natural language to accurately handle meteorological sequence, (2) allows each devices obtain highly customized models under significant heterogeneity, and (3) generalize under data-limited and out-of-distribution (OOD) scenarios.",
    "authors": [
        "Shengchao Chen",
        "Guodong Long",
        "Jing Jiang",
        "Chengqi Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "LM-Weather is presented, a generic approach to taming PLMs that have learned massive sequential knowledge from the universe of natural language databases to acquire an immediate capability to obtain highly customized models for heterogeneous meteorological data on devices while keeping high efficiency."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}