{
    "acronym": "69c120355fdcdce1628446cd2da02686b4e678d4",
    "title": "Assessing Inter-metric Correlation for Multi-document Summarization Evaluation",
    "seed_ids": [
        "longformer",
        "274f903041b1a830b37f57929d837c1706e94ec7",
        "fa51076458b7bcf9a60f476d525755e47199a6d8",
        "42e41ab2211b8ba78e36326ea21e05bd25d92c42",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "69c120355fdcdce1628446cd2da02686b4e678d4",
    "abstract": "Recent advances in automatic text summarization have contemporaneously been accompanied by a great deal of new metrics of automatic evaluation. This in turn has inspired recent research to re-assess these evaluation metrics to see how well they correlate with each other as well as with human evaluation, mostly focusing on single-document summarization (SDS) tasks. Although many of these metrics are typically also used for evaluating multi-document summarization (MDS) tasks, so far, little attention has been paid to studying them under such a distinct scenario. To address this gap, we present a systematic analysis of the inter-metric correlations for MDS tasks, while comparing and contrasting the results with SDS models. Using datasets from a wide range of domains (news, peer reviews, tweets, dialogues), we thus study a unified set of metrics under both the task setups. Our empirical analysis suggests that while most reference-based metrics show fairly similar trends across both multi- and single-document summarization, there is a notable lack of correlation between reference-free metrics in multi-document summarization tasks.",
    "authors": [
        "M. Ridenour",
        "Ameeta Agrawal",
        "Olubusayo Olabisi"
    ],
    "venue": "IEEE Games Entertainment Media Conference",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents a systematic analysis of the inter-metric correlations for MDS tasks, while comparing and contrasting the results with SDS models and suggests that there is a notable lack of correlation between reference-free metrics in multi-document summarization tasks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}