{
    "acronym": "69f6de04d1dc37634dadfc5147d9b43cee3c7ee3",
    "title": "CofiPara: A Coarse-to-fine Paradigm for Multimodal Sarcasm Target Identification with Large Multimodal Models",
    "seed_ids": [
        "bert",
        "10eabe1578e74b4fb33e53269177d78a6a02aa06",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "ba2a423d8c7ae6cfa3424fb13bdbe3a35e5f2273",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "69f6de04d1dc37634dadfc5147d9b43cee3c7ee3",
    "abstract": "Social media abounds with multimodal sarcasm, and identifying sarcasm targets is particularly challenging due to the implicit incongruity not directly evident in the text and image modalities. Current methods for Multimodal Sarcasm Target Identification (MSTI) predominantly focus on superficial indicators in an end-to-end manner, overlooking the nuanced understanding of multimodal sarcasm conveyed through both the text and image. This paper proposes a versatile MSTI framework with a coarse-to-fine paradigm, by augmenting sarcasm explainability with reasoning and pre-training knowledge. Inspired by the powerful capacity of Large Multimodal Models (LMMs) on multimodal reasoning, we first engage LMMs to generate competing rationales for coarser-grained pre-training of a small language model on multimodal sarcasm detection. We then propose fine-tuning the model for finer-grained sarcasm target identification. Our framework is thus empowered to adeptly unveil the intricate targets within multimodal sarcasm and mitigate the negative impact posed by potential noise inherently in LMMs. Experimental results demonstrate that our model far outperforms state-of-the-art MSTI methods, and markedly exhibits explainability in deciphering sarcasm as well.",
    "authors": [
        "Hongzhan Lin",
        "Zixin Chen",
        "Ziyang Luo",
        "Mingfei Cheng",
        "Jing Ma",
        "Guang Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A versatile MSTI framework with a coarse-to-fine paradigm empowered to adeptly unveil the intricate targets within multimodal sarcasm and mitigate the negative impact posed by potential noise inherently in LMMs is proposed."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}