{
    "acronym": "6a1387ba717202c74638d83c82b23328fd557b02",
    "title": "Attention-Driven Multi-Agent Reinforcement Learning: Enhancing Decisions with Expertise-Informed Tasks",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "6a1387ba717202c74638d83c82b23328fd557b02",
    "abstract": "In this paper, we introduce an alternative approach to enhancing Multi-Agent Reinforcement Learning (MARL) through the integration of domain knowledge and attention-based policy mechanisms. Our methodology focuses on the incorporation of domain-specific expertise into the learning process, which simplifies the development of collaborative behaviors. This approach aims to reduce the complexity and learning overhead typically associated with MARL by enabling agents to concentrate on essential aspects of complex tasks, thus optimizing the learning curve. The utilization of attention mechanisms plays a key role in our model. It allows for the effective processing of dynamic context data and nuanced agent interactions, leading to more refined decision-making. Applied in standard MARL scenarios, such as the Stanford Intelligent Systems Laboratory (SISL) Pursuit and Multi-Particle Environments (MPE) Simple Spread, our method has been shown to improve both learning efficiency and the effectiveness of collaborative behaviors. The results indicate that our attention-based approach can be a viable approach for improving the efficiency of MARL training process, integrating domain-specific knowledge at the action level.",
    "authors": [
        "A. R. Kuroswiski",
        "Annie S Wu",
        "Angelo Passaro"
    ],
    "venue": "The International FLAIRS Conference Proceedings",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results indicate that the attention-based approach can be a viable approach for improving the efficiency of MARL training process, integrating domain-specific knowledge at the action level."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}