{
    "acronym": "6a8c4404f7349eaf404b25ecd62b8c405181d4c2",
    "title": "Understanding the RoPE Extensions of Long-Context LLMs: An Attention Perspective",
    "seed_ids": [
        "scalelawrope",
        "dddf8ebf50aef9f6ac683ea086215223425b95ce",
        "93765da00ae8f14bb7675b95fc55a8a57fff091f",
        "a1f76db91c0debcf93ae9889736bce8470902113",
        "0595dac8260443365dfbe4821787419736baaa66",
        "539fadfb615ef84c240f4741061c44eeda540091",
        "5fc1a3a49e8f1d106118b69d1d6be3b6caa23da0",
        "0b0debb710366cdff461938c80763eace1651af6",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "e3aa232577bb427b1f3a34acbdef84bd85734042"
    ],
    "s2id": "6a8c4404f7349eaf404b25ecd62b8c405181d4c2",
    "abstract": "Enabling LLMs to handle lengthy context is currently a research hotspot. Most LLMs are built upon rotary position embedding (RoPE), a popular position encoding method. Therefore, a prominent path is to extrapolate the RoPE trained on comparably short texts to far longer texts. A heavy bunch of efforts have been dedicated to boosting the extrapolation via extending the formulations of the RoPE, however, few of them have attempted to showcase their inner workings comprehensively. In this paper, we are driven to offer a straightforward yet in-depth understanding of RoPE extensions from an attention perspective and on two benchmarking tasks. A broad array of experiments reveals several valuable findings: 1) Maintaining attention patterns to those at the pretrained length improves extrapolation; 2) Large attention uncertainty leads to retrieval errors; 3) Using longer continual pretraining lengths for RoPE extensions could reduce attention uncertainty and significantly enhance extrapolation.",
    "authors": [
        "M. Zhong",
        "Chen Zhang",
        "Yikun Lei",
        "Xikai Liu",
        "Yan Gao",
        "Yao Hu",
        "Kehai Chen",
        "Min Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A broad array of experiments reveals several valuable findings that could reduce attention uncertainty and significantly enhance extrapolation in RoPE extensions, and using longer continual pretraining lengths for RoPE extensions could reduce attention uncertainty and significantly enhance extrapolation."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}