{
    "acronym": "6aa6003c7d7b3d275ae981aa6200014968c32430",
    "title": "A Survey of Confidence Estimation and Calibration in Large Language Models",
    "seed_ids": [
        "gpt3",
        "7bd4ca8706a79983d31ab74e6c79bfdfd949602e",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "6aa6003c7d7b3d275ae981aa6200014968c32430",
    "abstract": "Large language models (LLMs) have demonstrated remarkable capabilities across a wide range of tasks in various domains. Despite their impressive performance, they can be unreliable due to factual errors in their generations. Assessing their confidence and calibrating them across different tasks can help mitigate risks and enable LLMs to produce better generations. There has been a lot of recent research aiming to address this, but there has been no comprehensive overview to organize it and to outline the main lessons learned. The present survey aims to bridge this gap. In particular, we outline the challenges and we summarize recent technical advancements for LLM confidence estimation and calibration. We further discuss their applications and suggest promising directions for future work.",
    "authors": [
        "Jiahui Geng",
        "Fengyu Cai",
        "Yuxia Wang",
        "Heinz Koeppl",
        "Preslav Nakov",
        "Iryna Gurevych"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The challenges are outlined and recent technical advancements for LLM confidence estimation and calibration are summarized, and their applications are discussed and suggested promising directions for future work are suggested."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}