{
    "acronym": "6aaec722a90eee0185d4bbfebbcd4f228ed1577f",
    "title": "Cross-Document Language Modeling",
    "seed_ids": [
        "longformer",
        "5397ef2da78aac248826b66156bed824d8aa03fb",
        "93f118e4f583c0ee6a97b39ef8b6bc23565229bb",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "8382402fe166df3de499dac182e42baa51335926",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "7cc730da554003dda77796d2cb4f06da5dfd5592",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc"
    ],
    "s2id": "6aaec722a90eee0185d4bbfebbcd4f228ed1577f",
    "abstract": "We introduce a new pretraining approach geared for multi-document language modeling, incorporating two key ideas into the masked language modeling self-supervised objective. First, instead of considering documents in isolation, we pretrain over sets of multiple related documents, encouraging the model to learn cross-document relationships. Second, we improve over recent long-range transformers by introducing dynamic global attention that has access to the entire input to predict masked tokens. We release CDLM (Cross-Document Language Model), a new general language model for multi-document setting that can be easily applied to downstream tasks. Our extensive analysis shows that both ideas are essential for the success of CDLM, and work in synergy to set new state-of-the-art results for several multi-text tasks. Code and models are available at https://github.com/aviclu/CDLM.",
    "authors": [
        "Avi Caciularu",
        "Arman Cohan",
        "Iz Beltagy",
        "Matthew E. Peters",
        "Arie Cattan",
        "Ido Dagan"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new pretraining approach geared for multi-document language modeling, incorporating two key ideas into the masked language modeling self-supervised objective, which improves over recent long-range transformers by introducing dynamic global attention that has access to the entire input to predict masked tokens."
    },
    "citationCount": 31,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}