{
    "acronym": "6abc706f116a4d64c2b39dfade3c5cd4cd744f4a",
    "title": "Towards Large-Scale Interpretable Knowledge Graph Reasoning for Dialogue Systems",
    "seed_ids": [
        "gpt2",
        "395aae6e7a79e5760457ca38e868acc970016230",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "6abc706f116a4d64c2b39dfade3c5cd4cd744f4a",
    "abstract": "Users interacting with voice assistants today need to phrase their requests in a very specific manner to elicit an appropriate response. This limits the user experience, and is partly due to the lack of reasoning capabilities of dialogue platforms and the hand-crafted rules that require extensive labor. One possible solution to improve user experience and relieve the manual efforts of designers is to build an end-to-end dialogue system that can do reasoning itself while perceiving user’s utterances. In this work, we propose a novel method to incorporate the knowledge reasoning capability into dialog systems in a more scalable and generalizable manner. Our proposed method allows a single transformer model to directly walk on a large-scale knowledge graph to generate responses. To the best of our knowledge, this is the first work to have transformer models generate responses by reasoning over differentiable knowledge graphs. We investigate the reasoning abilities of the proposed method on both task-oriented and domain-specific chit-chat dialogues. Empirical results show that this method can effectively and efficiently incorporate a knowledge graph into a dialogue system with fully-interpretable reasoning paths.",
    "authors": [
        "Yi-Lin Tuan",
        "Sajjad Beygi",
        "Maryam Fazel-Zarandi",
        "Qiaozi Gao",
        "Alessandra Cervone",
        "William Yang Wang"
    ],
    "venue": "Findings",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel method to incorporate the knowledge reasoning capability into dialog systems in a more scalable and generalizable manner and is believed to be the first work to have transformer models generate responses by reasoning over differentiable knowledge graphs."
    },
    "citationCount": 16,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}