{
    "acronym": "6acbc413e8cf3c5c52d37c2aeefe80334ec0fccf",
    "title": "RankMamba: Benchmarking Mamba's Document Ranking Performance in the Era of Transformers",
    "seed_ids": [
        "mamba",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "2c5211cf8433b5e45d0eac70a3cb641fce798bf0",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "bb15f3727f827a3cb88b5d3ca48415c09b40a88f",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "3f848e8620a1f1ccef544e46b483ceff5cbc7f2a",
        "ca444821352a4bd91884413d8070446e2960715a",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "15190e8b459bd85d546286f7d7da61b4f4f3f58a",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "6acbc413e8cf3c5c52d37c2aeefe80334ec0fccf",
    "abstract": "Transformer structure has achieved great success in multiple applied machine learning communities, such as natural language processing (NLP), computer vision (CV) and information retrieval (IR). Transformer architecture's core mechanism -- attention requires $O(n^2)$ time complexity in training and $O(n)$ time complexity in inference. Many works have been proposed to improve the attention mechanism's scalability, such as Flash Attention and Multi-query Attention. A different line of work aims to design new mechanisms to replace attention. Recently, a notable model structure -- Mamba, which is based on state space models, has achieved transformer-equivalent performance in multiple sequence modeling tasks. In this work, we examine \\mamba's efficacy through the lens of a classical IR task -- document ranking. A reranker model takes a query and a document as input, and predicts a scalar relevance score. This task demands the language model's ability to comprehend lengthy contextual inputs and to capture the interaction between query and document tokens. We find that (1) Mamba models achieve competitive performance compared to transformer-based models with the same training recipe; (2) but also have a lower training throughput in comparison to efficient transformer implementations such as flash attention. We hope this study can serve as a starting point to explore Mamba models in other classical IR tasks. Our code implementation and trained checkpoints are made public to facilitate reproducibility (https://github.com/zhichaoxu-shufe/RankMamba).",
    "authors": [
        "Zhichao Xu"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Mamba models achieve competitive performance compared to transformer-based models with the same training recipe; but also have a lower training throughput in comparison to efficient transformer implementations such as flash attention."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}