{
    "acronym": "6aeb465e168b071ff8f24f6042cf75d96faf59b0",
    "title": "Multi-Source Log Parsing With Pre-Trained Domain Classifier",
    "seed_ids": [
        "bert",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c"
    ],
    "s2id": "6aeb465e168b071ff8f24f6042cf75d96faf59b0",
    "abstract": "Automated log analysis with AI technologies is commonly used in network, system, and service operation and maintenance to ensure reliability and quality assurance. Log parsing serves as an essential primary stage in log analysis, where unstructured logs are transformed into structured data to facilitate subsequent downstream analysis. However, traditional log parsing algorithms designed for single-domain processing struggle to handle the challenges posed by multi-source log inputs, leading to a decline in parsing accuracy. Adapting these algorithms to multi-source logs often requires extensive manual labeling efforts. To address this, we propose Domain-aware Parser (DA-Parser), a framework that includes a domain classifier to identify the source domains of multi-source logs. This enables the conversion of the multi-source log parsing problem into a series of single-source parsing problems. The classifier is pre-trained on a corpus of logs from 16 domains, eliminating the need for additional human labeling. The predicted source domain tags serve as constraints, limiting the template extraction process to logs from the same domain. Empirical evaluation on a multi-domain dataset demonstrates that DA-Parser outperforms the existing SOTA algorithm by 21.6% in terms of parsing accuracy. The proposed approach also shows potential efficiency improvements, requiring only 6.67% of the time consumed by existing parsers, while maintaining robustness against minor domain classification errors.",
    "authors": [
        "Yilun Liu",
        "Shimin Tao",
        "Weibin Meng",
        "Jingyu Wang",
        "Hao Yang",
        "Yanfei Jiang"
    ],
    "venue": "IEEE Transactions on Network and Service Management",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Domain-aware Parser (DA-Parser), a framework that includes a domain classifier to identify the source domains of multi-source logs that outperforms the existing SOTA algorithm by 21.6% in terms of parsing accuracy, is proposed."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}