{
    "acronym": "6b1000592d43e40e26c6bdec93c0f3fea9101439",
    "title": "Geometric Algebra Transformers",
    "seed_ids": [
        "roformer",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "53c3940f35b8b45d55ed49056282e1961954513d",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06"
    ],
    "s2id": "6b1000592d43e40e26c6bdec93c0f3fea9101439",
    "abstract": "—Problems involving geometric data arise in a variety of fields, including computer vision, robotics, chemistry, and physics. Such data can take numerous forms, such as points, direction vectors, planes, or transformations, but to date there is no single architecture that can be applied to such a wide variety of geometric types while respecting their symmetries. In this paper we introduce the Geometric Algebra Transformer (GATr), a general-purpose architecture for geometric data. GATr represents inputs, outputs, and hidden states in the projective geometric algebra, which offers an efficient 16 -dimensional vector space representation of common geometric objects as well as operators acting on them. GATr is equivariant with respect to E(3) , the symmetry group of 3D Euclidean space. As a transformer, GATr is scalable, expressive, and versatile. In experiments with n -body modeling and robotic planning, GATr shows strong improvements over non-geometric baselines.",
    "authors": [
        "Johann Brehmer",
        "P. D. Haan",
        "Sönke Behrends",
        "Taco Cohen"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Geometric Algebra Transformer (GATr), a general-purpose architecture for geometric data that represents inputs, outputs, and hidden states in the projective geometric algebra, which offers an efficient 16 -dimensional vector space representation of common geometric objects as well as operators acting on them."
    },
    "citationCount": 10,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}