{
    "acronym": "6b47f13216b730ab1e46f77b2f92f6a8120b281f",
    "title": "Grammatical Error Correction: A Survey of the State of the Art",
    "seed_ids": [
        "gpt2",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "98332ae5475bfa286d9ab74e20d86c72ceb3cde6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "6b47f13216b730ab1e46f77b2f92f6a8120b281f",
    "abstract": "Abstract Grammatical Error Correction (GEC) is the task of automatically detecting and correcting errors in text. The task not only includes the correction of grammatical errors, such as missing prepositions and mismatched subject–verb agreement, but also orthographic and semantic errors, such as misspellings and word choice errors, respectively. The field has seen significant progress in the last decade, motivated in part by a series of five shared tasks, which drove the development of rule-based methods, statistical classifiers, statistical machine translation, and finally neural machine translation systems, which represent the current dominant state of the art. In this survey paper, we condense the field into a single article and first outline some of the linguistic challenges of the task, introduce the most popular datasets that are available to researchers (for both English and other languages), and summarize the various methods and techniques that have been developed with a particular focus on artificial error generation. We next describe the many different approaches to evaluation as well as concerns surrounding metric reliability, especially in relation to subjective human judgments, before concluding with an overview of recent progress and suggestions for future work and remaining challenges. We hope that this survey will serve as a comprehensive resource for researchers who are new to the field or who want to be kept apprised of recent developments.",
    "authors": [
        "Christopher Bryant",
        "Zheng Yuan",
        "Muhammad Reza Qorib",
        "Hannan Cao",
        "H. Ng",
        "Ted Briscoe"
    ],
    "venue": "Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The field is condense into a single article and some of the linguistic challenges of the task are outlined, the most popular datasets that are available to researchers are introduced, and the various methods and techniques that have been developed with a particular focus on artificial error generation are summarized."
    },
    "citationCount": 44,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}