{
    "acronym": "6b655b74da908e2e0d7c37996d36d5ff4a28f030",
    "title": "Sequence Modeling with Multiresolution Convolutional Memory",
    "seed_ids": [
        "s4",
        "hippo",
        "sgconv",
        "a7d68b1702af08ce4dbbf2cd0b083e744ae5c6be",
        "240300b1da360f22bf0b82c6817eacebba6deed4",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "ca444821352a4bd91884413d8070446e2960715a",
        "4f82bd927f6d79fd2e3ddf9d34bec0dc46b8e18c",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "dbf53ece1a6a8860e41ff5f721c72ceb0fb18dd6",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "6fa1cfc4f97f03a8485692418c7aa1a06c574a85",
        "1d5c8c6e5a774d2fef8d92bd28670a6345a97f7a",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "34a4e6818d680875ff0bef9a76de0376118446d1"
    ],
    "s2id": "6b655b74da908e2e0d7c37996d36d5ff4a28f030",
    "abstract": "Efficiently capturing the long-range patterns in sequential data sources salient to a given task -- such as classification and generative modeling -- poses a fundamental challenge. Popular approaches in the space tradeoff between the memory burden of brute-force enumeration and comparison, as in transformers, the computational burden of complicated sequential dependencies, as in recurrent neural networks, or the parameter burden of convolutional networks with many or large filters. We instead take inspiration from wavelet-based multiresolution analysis to define a new building block for sequence modeling, which we call a MultiresLayer. The key component of our model is the multiresolution convolution, capturing multiscale trends in the input sequence. Our MultiresConv can be implemented with shared filters across a dilated causal convolution tree. Thus it garners the computational advantages of convolutional networks and the principled theoretical motivation of wavelet decompositions. Our MultiresLayer is straightforward to implement, requires significantly fewer parameters, and maintains at most a $\\mathcal{O}(N\\log N)$ memory footprint for a length $N$ sequence. Yet, by stacking such layers, our model yields state-of-the-art performance on a number of sequence classification and autoregressive density estimation tasks using CIFAR-10, ListOps, and PTB-XL datasets.",
    "authors": [
        "Jiaxin Shi",
        "Ke Alexander Wang",
        "E. Fox"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The key component of the model is the multiresolution convolution, capturing multiscale trends in the input sequence, and can be implemented with shared filters across a dilated causal convolution tree, garners the computational advantages of convolutional networks and the principled theoretical motivation of wavelet decompositions."
    },
    "citationCount": 6,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}