{
    "acronym": "6b65fa6e89a41fa2e7c9fd5e4a5219ca775ba76e",
    "title": "Dialogue with Robots: Proposals for Broadening Participation and Research in the SLIVAR Community",
    "seed_ids": [
        "bert",
        "f78fe02f681a0a9a6867b007bd39e3884de64a91"
    ],
    "s2id": "6b65fa6e89a41fa2e7c9fd5e4a5219ca775ba76e",
    "abstract": "The ability to interact with machines using natural human language is becoming not just commonplace, but expected. The next step is not just text interfaces, but speech interfaces and not just with computers, but with all machines including robots. In this paper, we chronicle the recent history of this growing field of spoken dialogue with robots and offer the community three proposals, the first focused on education, the second on benchmarks, and the third on the modeling of language when it comes to spoken interaction with robots. The three proposals should act as white papers for any researcher to take and build upon.",
    "authors": [
        "Casey Kennington",
        "Malihe Alikhani",
        "Heather Pon-Barry",
        "Katherine Atwell",
        "Yonatan Bisk",
        "Daniel Fried",
        "Felix Gervits",
        "Zhao Han",
        "Mert Inan",
        "Michael Johnston",
        "Raj Korpan",
        "Diane Litman",
        "M. Marge",
        "Cynthia Matuszek",
        "Ross Mead",
        "Shiwali Mohan",
        "Raymond Mooney",
        "Natalie Parde",
        "Jivko Sinapov",
        "Angela Stewart",
        "Matthew Stone",
        "Stefanie Tellex",
        "Tom Williams"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper chronicle the recent history of this growing field of spoken dialogue with robots and offers the community three proposals, the first focused on education, the second on benchmarks, and the third on the modeling of language when it comes to spoken interaction with robots."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}