{
    "acronym": "6b6ffb94626e672caffafc77097491d9ee7a8682",
    "title": "On the Connection between Local Attention and Dynamic Depth-wise Convolution",
    "seed_ids": [
        "gmlp",
        "3cbe314cc5407a6c3249815b5173f22ea15173c2",
        "81fcd9309e1168fe0664d8df4213771e4ebfa343",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "6b6ffb94626e672caffafc77097491d9ee7a8682",
    "abstract": "Vision Transformer (ViT) attains state-of-the-art performance in visual recognition, and the variant, Local Vision Transformer, makes further improvements. The major component in Local Vision Transformer, local attention, performs the attention separately over small local windows. We rephrase local attention as a channel-wise locally-connected layer and analyze it from two network regularization manners, sparse connectivity and weight sharing, as well as weight computation. Sparse connectivity: there is no connection across channels, and each position is connected to the positions within a small local window. Weight sharing: the connection weights for one position are shared across channels or within each group of channels. Dynamic weight: the connection weights are dynamically predicted according to each image instance. We point out that local attention resembles depth-wise convolution and its dynamic version in sparse connectivity. The main difference lies in weight sharing - depth-wise convolution shares connection weights (kernel weights) across spatial positions. We empirically observe that the models based on depth-wise convolution and the dynamic variant with lower computation complexity perform on-par with or sometimes slightly better than Swin Transformer, an instance of Local Vision Transformer, for ImageNet classification, COCO object detection and ADE semantic segmentation. These observations suggest that Local Vision Transformer takes advantage of two regularization forms and dynamic weight to increase the network capacity. Code is available at https://github.com/Atten4Vis/DemystifyLocalViT.",
    "authors": [
        "Qi Han",
        "Zejia Fan",
        "Qi Dai",
        "Lei Sun",
        "Ming-Ming Cheng",
        "Jiaying Liu",
        "Jingdong Wang"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work rephrase local attention as a channel-wise locally-connected layer and analyzes it from two network regularization manners, sparse connectivity and weight sharing, as well as weight computation to suggest that Local Vision Transformer takes advantage of two regularization forms and dynamic weight to increase the network capacity."
    },
    "citationCount": 82,
    "influentialCitationCount": 13,
    "code": null,
    "description": null,
    "url": null
}