{
    "acronym": "6b7bf6cf5d0e1004d4468edfac4e8f81c0d0c50d",
    "title": "MineRL Diamond 2021 Competition: Overview, Results, and Lessons Learned",
    "seed_ids": [
        "gpt2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "6b7bf6cf5d0e1004d4468edfac4e8f81c0d0c50d",
    "abstract": "Reinforcement learning competitions advance the field by providing appropriate scope and support to develop solutions toward a specific problem. To promote the development of more broadly applicable methods, organizers need to enforce the use of general techniques, the use of sample-efficient methods, and the reproducibility of the results. While beneficial for the research community, these restrictions come at a cost -- increased difficulty. If the barrier for entry is too high, many potential participants are demoralized. With this in mind, we hosted the third edition of the MineRL ObtainDiamond competition, MineRL Diamond 2021, with a separate track in which we permitted any solution to promote the participation of newcomers. With this track and more extensive tutorials and support, we saw an increased number of submissions. The participants of this easier track were able to obtain a diamond, and the participants of the harder track progressed the generalizable solutions in the same task.",
    "authors": [
        "A. Kanervisto",
        "Stephanie Milani",
        "Karolis Ramanauskas",
        "Nicholay Topin",
        "Zichuan Lin",
        "Junyou Li",
        "Jian-yong Shi",
        "Deheng Ye",
        "Qiang Fu",
        "Wei Yang",
        "Weijun Hong",
        "Zhong-Hao Huang",
        "Haicheng Chen",
        "Guangjun Zeng",
        "Yue Lin",
        "Vincent Micheli",
        "Eloi Alonso",
        "Franccois Fleuret",
        "Alexander Nikulin",
        "Yury Belousov",
        "Oleg Svidchenko",
        "A. Shpilman"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2022,
    "tldr": null,
    "citationCount": 24,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}