{
    "acronym": "6ba81a45f334a287ff84c1320b53c75541d2c671",
    "title": "Rapid Diffusion: Building Domain-Specific Text-to-Image Synthesizers with Fast Inference Speed",
    "seed_ids": [
        "flashattn",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "82482585e94192b4e9913727e461f89cd08e9725",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "6ba81a45f334a287ff84c1320b53c75541d2c671",
    "abstract": "Text-to-Image Synthesis (TIS) aims to generate images based on textual inputs. Recently, several large pre-trained diffusion models have been released to create high-quality images with pre-trained text encoders and diffusion-based image synthesizers. However, popular diffusion-based models from the open-source community cannot support industrial domain-specific applications due to the lack of entity knowledge and low inference speed.In this paper, we propose Rapid Diffusion, a novel framework for training and deploying super-resolution, text-to-image latent diffusion models with rich entity knowledge injected and optimized networks.Furthermore, we employ BladeDISC, an end-to-end Artificial Intelligence (AI) compiler, and FlashAttention techniques to optimize computational graphs of the generated models for online deployment. Experiments verify the effectiveness of our approach in terms of image quality and inference speed. In addition, we present industrial use cases and integrate Rapid Diffusion to an AI platform to show its practical values.",
    "authors": [
        "Bingyan Liu",
        "Wei-Shiang Lin",
        "Zhongjie Duan",
        "Chengyu Wang",
        "Wu Ziheng",
        "Zhang Zipeng",
        "K. Jia",
        "Lianwen Jin",
        "Cen Chen",
        "Jun Huang"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes Rapid Diffusion, a novel framework for training and deploying super-resolution, text-to-image latent diffusion models with rich entity knowledge injected and optimized networks and employs BladeDISC and FlashAttention techniques to optimize computational graphs of the generated models for online deployment."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}