{
    "acronym": "6cbc8af05a19350a8ab75fbc022fd970b52e95e3",
    "title": "Generating Music with Structure Using Self-Similarity as Attention",
    "seed_ids": [
        "transformer",
        "eb0931c39904a40c6cb4aa35c9b21d5e3b7dc856",
        "479eaafcee15a44b632b3cab41491b517e1531fe"
    ],
    "s2id": "6cbc8af05a19350a8ab75fbc022fd970b52e95e3",
    "abstract": "Despite the innovations in deep learning and generative AI, creating long term structure as well as the layers of repeated structure common in musical works remains an open challenge in music generation. We propose an attention layer that uses a novel approach applying user-supplied self-similarity matrices to previous time steps, and demonstrate it in our Similarity Incentivized Neural Generator (SING) system, a deep learning autonomous music generation system with two layers. The first is a vanilla Long Short Term Memory layer, and the second is the proposed attention layer. During generation, this attention mechanism imposes a suggested structure from a template piece on the generated music. We train SING on the MAESTRO dataset using a novel variable batching method, and compare its performance to the same model without the attention mechanism. The addition of our proposed attention mechanism significantly improves the network's ability to replicate specific structures, and it performs better on an unseen test set than a model without the attention mechanism.",
    "authors": [
        "Sophia Hager",
        "Kathleen R. Hablutzel",
        "Katherine Kinnaird"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The addition of the proposed attention mechanism significantly improves the network's ability to replicate specific structures, and it performs better on an unseen test set than a model without the attention mechanism."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}