{
    "acronym": "6cc9926fe3bac0e5558302e66e1ca5b6349ad604",
    "title": "Fostering the Ecosystem of Open Neural Encoders for Portuguese with Albertina PT* Family",
    "seed_ids": [
        "bert",
        "1ebcf1884390c28f24b3adaf5a7aba5b9453b48b",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "319b84be7a843250bc81d7086f79a4126d550277",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "2fa3f7ce620a1c7155daef6620dd6bb0e01934f3",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc"
    ],
    "s2id": "6cc9926fe3bac0e5558302e66e1ca5b6349ad604",
    "abstract": "To foster the neural encoding of Portuguese, this paper contributes foundation encoder models that represent an expansion of the still very scarce ecosystem of large language models specifically developed for this language that are fully open, in the sense that they are open source and openly distributed for free under an open license for any purpose, thus including research and commercial usages. Like most languages other than English, Portuguese is low-resourced in terms of these foundational language resources, there being the inaugural 900 million parameter Albertina and 335 million Bertimbau. Taking this couple of models as an inaugural set, we present the extension of the ecosystem of state-of-the-art open encoders for Portuguese with a larger, top performance-driven model with 1.5 billion parameters, and a smaller, efficiency-driven model with 100 million parameters. While achieving this primary goal, further results that are relevant for this ecosystem were obtained as well, namely new datasets for Portuguese based on the SuperGLUE benchmark, which we also distribute openly.",
    "authors": [
        "Rodrigo Santos",
        "João Rodrigues",
        "Luís Gomes",
        "Joao Silva",
        "Ant'onio Branco",
        "Henrique Lopes Cardoso",
        "T. Os'orio",
        "Bernardo Leite"
    ],
    "venue": "SIGUL",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper contributes foundation encoder models that represent an expansion of the still very scarce ecosystem of large language models specifically developed for this language that are fully open, in the sense that they are open source and openly distributed for free under an open license for any purpose, thus including research and commercial usages."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}