{
    "acronym": "6d0ca1437b6bbfd51325c8ebcf29f2b31ccd84cb",
    "title": "Beyond Scaling Laws: Understanding Transformer Performance with Associative Memory",
    "seed_ids": [
        "hopfield",
        "3fd5bc3077d04965eaa3498372c39bbdd09d55e4",
        "98755a7ca75afbb29a19f8129b9f25796ad0e0b7",
        "5e0cb1c4b91a7486e1c2b15a44a0be56bd74bdc0",
        "9e16d8cc6096ec0d2733a4ecf41ce09d9a4bd19c",
        "830995ef17cc291c13f42dfd9f462137de1d2179",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "6d0ca1437b6bbfd51325c8ebcf29f2b31ccd84cb",
    "abstract": "Increasing the size of a Transformer model does not always lead to enhanced performance. This phenomenon cannot be explained by the empirical scaling laws. Furthermore, improved generalization ability occurs as the model memorizes the training samples. We present a theoretical framework that sheds light on the memorization process and performance dynamics of transformer-based language models. We model the behavior of Transformers with associative memories using Hopfield networks, such that each transformer block effectively conducts an approximate nearest-neighbor search. Based on this, we design an energy function analogous to that in the modern continuous Hopfield network which provides an insightful explanation for the attention mechanism. Using the majorization-minimization technique, we construct a global energy function that captures the layered architecture of the Transformer. Under specific conditions, we show that the minimum achievable cross-entropy loss is bounded from below by a constant approximately equal to 1. We substantiate our theoretical results by conducting experiments with GPT-2 on various data sizes, as well as training vanilla Transformers on a dataset of 2M tokens.",
    "authors": [
        "Xueyan Niu",
        "Bo Bai",
        "Lei Deng",
        "Wei Han"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A theoretical framework that sheds light on the memorization process and performance dynamics of transformer-based language models, and model the behavior of Transformers with associative memories using Hopfield networks, such that each transformer block effectively conducts an approximate nearest-neighbor search."
    },
    "citationCount": 2,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}