{
    "acronym": "6d49ed0ea24b9c218f5ec6731cd261ce618df2ac",
    "title": "VL-Mamba: Exploring State Space Models for Multimodal Learning",
    "seed_ids": [
        "mamba",
        "b24e899ec0f77eef2fc87a9b8e50516367aa1f97",
        "38c48a1cd296d16dc9c56717495d6e44cc354444",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "ca444821352a4bd91884413d8070446e2960715a",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2"
    ],
    "s2id": "6d49ed0ea24b9c218f5ec6731cd261ce618df2ac",
    "abstract": "Multimodal large language models (MLLMs) have attracted widespread interest and have rich applications. However, the inherent attention mechanism in its Transformer structure requires quadratic complexity and results in expensive computational overhead. Therefore, in this work, we propose VL-Mamba, a multimodal large language model based on state space models, which have been shown to have great potential for long-sequence modeling with fast inference and linear scaling in sequence length. Specifically, we first replace the transformer-based backbone language model such as LLama or Vicuna with the pre-trained Mamba language model. Then, we empirically explore how to effectively apply the 2D vision selective scan mechanism for multimodal learning and the combinations of different vision encoders and variants of pretrained Mamba language models. The extensive experiments on diverse multimodal benchmarks with competitive performance show the effectiveness of our proposed VL-Mamba and demonstrate the great potential of applying state space models for multimodal learning tasks.",
    "authors": [
        "Yanyuan Qiao",
        "Zheng Yu",
        "Longteng Guo",
        "Sihan Chen",
        "Zijia Zhao",
        "Mingzhen Sun",
        "Qi Wu",
        "Jing Liu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "VL-Mamba is proposed, a multimodal large language model based on state space models, which have been shown to have great potential for long-sequence modeling with fast inference and linear scaling in sequence length and to effectively apply the 2D vision selective scan mechanism for multimodal learning."
    },
    "citationCount": 20,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}