{
    "acronym": "6d7f7f11bc3f2affeee2a97c406e300f85f1a4a9",
    "title": "Exploiting the Signal-Leak Bias in Diffusion Models",
    "seed_ids": [
        "classfreediffu",
        "82482585e94192b4e9913727e461f89cd08e9725",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "6d7f7f11bc3f2affeee2a97c406e300f85f1a4a9",
    "abstract": "There is a bias in the inference pipeline of most diffusion models. This bias arises from a signal leak whose distribution deviates from the noise distribution, creating a discrepancy between training and inference processes. We demonstrate that this signal-leak bias is particularly significant when models are tuned to a specific style, causing sub-optimal style matching. Recent research tries to avoid the signal leakage during training. We instead show how we can exploit this signal-leak bias in existing diffusion models to allow more control over the generated images. This enables us to generate images with more varied brightness, and images that better match a desired style or color. By modeling the distribution of the signal leak in the spatial frequency and pixel domains, and including a signal leak in the initial latent, we generate images that better match expected results without any additional training.",
    "authors": [
        "Martin Nicolas Everaert",
        "Athanasios Fitsios",
        "Marco Bocchio",
        "Sami Arpa",
        "Sabine Susstrunk",
        "R. Achanta"
    ],
    "venue": "IEEE Workshop/Winter Conference on Applications of Computer Vision",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "By modeling the distribution of the signal leak in the spatial frequency and pixel domains, and including a signal leaks in the initial latent, this work generates images that better match expected results without any additional training."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}