{
    "acronym": "6d8d5490aef1db27a60ad33a34d78a117fb32610",
    "title": "Controlling Space and Time with Diffusion Models",
    "seed_ids": [
        "classfreediffu",
        "02ad9f3fefe33cb9ca546591bec65dbdf7766c80",
        "6e3a3b7a8a0376d867cad72eedf2f9b746f29a33",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "94bcd712aed610b8eaeccc57136d65ec988356f2"
    ],
    "s2id": "6d8d5490aef1db27a60ad33a34d78a117fb32610",
    "abstract": "We present 4DiM, a cascaded diffusion model for 4D novel view synthesis (NVS), conditioned on one or more images of a general scene, and a set of camera poses and timestamps. To overcome challenges due to limited availability of 4D training data, we advocate joint training on 3D (with camera pose), 4D (pose+time) and video (time but no pose) data and propose a new architecture that enables the same. We further advocate the calibration of SfM posed data using monocular metric depth estimators for metric scale camera control. For model evaluation, we introduce new metrics to enrich and overcome shortcomings of current evaluation schemes, demonstrating state-of-the-art results in both fidelity and pose control compared to existing diffusion models for 3D NVS, while at the same time adding the ability to handle temporal dynamics. 4DiM is also used for improved panorama stitching, pose-conditioned video to video translation, and several other tasks. For an overview see https://4d-diffusion.github.io",
    "authors": [
        "Daniel Watson",
        "Saurabh Saxena",
        "Lala Li",
        "Andrea Tagliasacchi",
        "David J. Fleet"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "4DiM is presented, a cascaded diffusion model for 4D novel view synthesis (NVS), conditioned on one or more images of a general scene, and a set of camera poses and timestamps, demonstrating state-of-the-art results in both fidelity and pose control compared to existing diffusion models for 3D NVS."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}