{
    "acronym": "6e0cc226b01424b9309eaef4af0dd0b8abc502e2",
    "title": "Simple-Sampling and Hard-Mixup with Prototypes to Rebalance Contrastive Learning for Text Classification",
    "seed_ids": [
        "bert",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c"
    ],
    "s2id": "6e0cc226b01424b9309eaef4af0dd0b8abc502e2",
    "abstract": "Text classification is a crucial and fundamental task in natural language processing. Compared with the previous learning paradigm of pre-training and fine-tuning by cross entropy loss, the recently proposed supervised contrastive learning approach has received tremendous attention due to its powerful feature learning capability and robustness. Although several studies have incorporated this technique for text classification, some limitations remain. First, many text datasets are imbalanced, and the learning mechanism of supervised contrastive learning is sensitive to data imbalance, which may harm the model performance. Moreover, these models leverage separate classification branch with cross entropy and supervised contrastive learning branch without explicit mutual guidance. To this end, we propose a novel model named SharpReCL for imbalanced text classification tasks. First, we obtain the prototype vector of each class in the balanced classification branch to act as a representation of each class. Then, by further explicitly leveraging the prototype vectors, we construct a proper and sufficient target sample set with the same size for each class to perform the supervised contrastive learning procedure. The empirical results show the effectiveness of our model, which even outperforms popular large language models across several datasets.",
    "authors": [
        "Mengyu Li",
        "Yonghao Liu",
        "Fausto Giunchiglia",
        "Xiaoyue Feng",
        "Renchu Guan"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel model named SharpReCL is proposed, which even outperforms popular large language models across several datasets, and explicitly leveraging the prototype vectors of each class in the balanced classification branch to act as a representation of each class."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}