{
    "acronym": "6e1450f2e3b674bd672823e9ce3176ab8a896aed",
    "title": "Machine learning strategies to tackle data challenges in mass spectrometry-based proteomics",
    "seed_ids": [
        "transformer",
        "46f489808b42403c456aeb4f07c6ce3e772d382e"
    ],
    "s2id": "6e1450f2e3b674bd672823e9ce3176ab8a896aed",
    "abstract": "In computational proteomics, machine learning (ML) has emerged as a vital tool for enhancing data analysis. Despite significant advancements, the diversity of ML model architectures and the complexity of proteomics data present substantial challenges in the effective development and evaluation of these tools. Here, we highlight the necessity for high-quality, comprehensive datasets to train ML models and advocate for the standardization of data to support robust model development. We emphasize the instrumental role of key datasets like ProteomeTools and MassIVE-KB in advancing ML applications in proteomics and discuss the implications of dataset size on model performance, highlighting that larger datasets typically yield more accurate models. To address data scarcity, we explore algorithmic strategies such as self-supervised pretraining and multi-task learning. Ultimately, we hope that this discussion can serve as a call to action for the proteomics community to collaborate on data standardization and collection efforts, which are crucial for the sustainable advancement and refinement of ML methodologies in the field.",
    "authors": [
        "Ceder Dens",
        "Charlotte Adams",
        "Kris Laukens",
        "Wout Bittremieux"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The necessity for high-quality, comprehensive datasets to train ML models and advocate for the standardization of data to support robust model development are highlighted and algorithmic strategies such as self-supervised pretraining and multi-task learning are explored."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}