{
    "acronym": "6e143bcd24789523fcf92dd3464b8023d4c6833b",
    "title": "Language-conditioned Learning for Robotic Manipulation: A Survey",
    "seed_ids": [
        "bert",
        "2029349c55c1dba3493c5b3bd25152f18ba21ae2",
        "25425e299101b13ec2872417a14f961f4f8aa18e",
        "60c8d0619481eaafdd1189af610d0e636271fed5",
        "ada81a4de88a6ce474df2e2446ad11fea480616e",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "270f3bea8ca801870a6cc56b4d36f7f2019c9ed0",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "6e143bcd24789523fcf92dd3464b8023d4c6833b",
    "abstract": "Language-conditioned robotic manipulation represents a cutting-edge area of research, enabling seamless communication and cooperation between humans and robotic agents. This field focuses on teaching robotic systems to comprehend and execute instructions conveyed in natural language. To achieve this, the development of robust language understanding models capable of extracting actionable insights from textual input is essential. In this comprehensive survey, we systematically explore recent advancements in language-conditioned approaches within the context of robotic manipulation. We analyze these approaches based on their learning paradigms, which encompass reinforcement learning, imitation learning, and the integration of foundational models, such as large language models and vision-language models. Furthermore, we conduct an in-depth comparative analysis, considering aspects like semantic information extraction, environment&evaluation, auxiliary tasks, and task representation. Finally, we outline potential future research directions in the realm of language-conditioned learning for robotic manipulation, with the topic of generalization capabilities and safety issues. The GitHub repository of this paper can be found at https://github.com/hk-zh/language-conditioned-robot-manipulation-models",
    "authors": [
        "Hongkuan Zhou",
        "Xiangtong Yao",
        "Yuan Meng",
        "Siming Sun",
        "Zhenshan Bing",
        "Kai Huang",
        "Alois Knoll"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This comprehensive survey systematically explores recent advancements in language-conditioned approaches within the context of robotic manipulation, and analyze these approaches based on their learning paradigms, which encompass reinforcement learning, imitation learning, and the integration of foundational models, such as large language models and vision-language models."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}