{
    "acronym": "6e6f458033f72f95cf2b235f5fd278993f48daea",
    "title": "A Fuzzy Graph Convolutional Network Model for Sentence-Level Sentiment Analysis",
    "seed_ids": [
        "bert",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a"
    ],
    "s2id": "6e6f458033f72f95cf2b235f5fd278993f48daea",
    "abstract": "Various methods have been developed to improve the performance of sentence-level sentiment analysis (SLSA), the newest as graph convolutional networks (GCNs), with promising accuracy. However, it often happens that many sentences contain high ambiguity of sentiment. GCNs are not capable of capturing these inherent ambiguities with performance. Meanwhile, the fuzzy logic theory can improve knowledge representation under uncertainty. These facts motivate us to propose a novel fuzzy graph convolutional network (FGCN) method for SLSA by integrating fuzzy logic into GCNs to reduce the ambiguities of sentiment in sentences. In this method, the BERT+BiLSTM model is first used to convert sentences into a matrix of contextualized vectors. Second, the fuzzy function is integrated into the contextualized matrix to transform it into the fuzzy contextualized representation. Third, the sentence adjacency matrix is constructed based on the dependency tree. Fourth, the fuzzy function is continuously used to transform the sentence adjacency matrix into the fuzzy adjacency matrix. After that, the defuzzy function is used to convert the fuzzy adjacency matrix to continuous values before deriving significant features. Next, the fuzzy adjacency matrix and the fuzzy contextualized representation are concatenated to create the final representation and fed into GCN layers to capture the high-level features of the sentence. Finally, the sentiment classifier is constructed to learn the output distribution by applying the softmax function over the final representation. The experimental results on benchmark datasets prove that the FGCN can enhance the accuracy and $F_{1}$ score of SLSA compared to the state-of-the-art methods.",
    "authors": [
        "H. Phan",
        "N. Nguyen"
    ],
    "venue": "IEEE transactions on fuzzy systems",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel fuzzy graph convolutional network (FGCN) method for SLSA by integrating fuzzy logic into GCNs to reduce the ambiguities of sentiment in sentences is proposed."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}