{
    "acronym": "6ecc5c7316983523d6cfa17c3dfd5d50b5bd3a99",
    "title": "Designing the Conversational Agent: Asking Follow-up Questions for Information Elicitation",
    "seed_ids": [
        "bert",
        "b47381e04739ea3f392ba6c8faaf64105493c196"
    ],
    "s2id": "6ecc5c7316983523d6cfa17c3dfd5d50b5bd3a99",
    "abstract": "Conversational Agents (CAs) can facilitate information elicitation in various scenarios, such as semi-structured interviews. Current CAs can ask predetermined questions but lack skills for asking follow-up questions. Thus, we designed three approaches for CAs to automatically ask follow-up questions, i.e., follow-ups on concepts, follow-ups on related concepts, and general follow-ups. To investigate their effects, we conducted a user study (N=26) in which a CA interviewer asked follow-up questions generated by algorithms and crafted by human wizards. Our results showed that the CA's follow-up questions were readable and effective in information elicitation. The follow-ups on concepts and related concepts achieved a lower drop rate and better relevance, while the general follow-ups elicited more informative responses. Further qualitative analysis of the human-CA interview data revealed algorithm drawbacks and identified follow-up question techniques used by the human wizards. We provided design implications for improving information elicitation of future CAs based on the results.",
    "authors": [
        "Jiaxiong Hu",
        "Jingya Guo",
        "Ningjing Tang",
        "Xiaojuan Ma",
        "Yuan Yao",
        "Changyuan Yang",
        "Yingqing Xu"
    ],
    "venue": "Proc. ACM Hum. Comput. Interact.",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Three approaches for CAs to automatically ask follow-up questions are designed, i.e., follow-ups on concepts, follow-ups on related concepts, and general follow-ups, which showed that the CA's follow-up questions were readable and effective in information elicitation."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}