{
    "acronym": "6ee0f922daae002c12b3bc3a9a79807f09a094ee",
    "title": "LongFin: A Multimodal Document Understanding Model for Long Financial Domain Documents",
    "seed_ids": [
        "bert",
        "longformer",
        "ba827e53286f9b7d94c48afc529af086eaf7be82",
        "d1cec8d516931428b492a8e4fbbcef38957bce2b",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "6ee0f922daae002c12b3bc3a9a79807f09a094ee",
    "abstract": "Document AI is a growing research field that focuses on the comprehension and extraction of information from scanned and digital documents to make everyday business operations more efficient. Numerous downstream tasks and datasets have been introduced to facilitate the training of AI models capable of parsing and extracting information from various document types such as receipts and scanned forms. Despite these advancements, both existing datasets and models fail to address critical challenges that arise in industrial contexts. Existing datasets primarily comprise short documents consisting of a single page, while existing models are constrained by a limited maximum length, often set at 512 tokens. Consequently, the practical application of these methods in financial services, where documents can span multiple pages, is severely impeded. To overcome these challenges, we introduce LongFin, a multimodal document AI model capable of encoding up to 4K tokens. We also propose the LongForms dataset, a comprehensive financial dataset that encapsulates several industrial challenges in financial documents. Through an extensive evaluation, we demonstrate the effectiveness of the LongFin model on the LongForms dataset, surpassing the performance of existing public models while maintaining comparable results on existing single-page benchmarks.",
    "authors": [
        "Ahmed Masry",
        "Amir Hajian"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The effectiveness of the LongFin model on the LongForms dataset is demonstrated, surpassing the performance of existing public models while maintaining comparable results on existing single-page benchmarks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}