{
    "acronym": "6f22b0da3447eebff003d0f6d4b9ed0864b85d2a",
    "title": "Transformer Language Models with LSTM-Based Cross-Utterance Information Representation",
    "seed_ids": [
        "transformerxl",
        "f4238bd2385a52413ccbacfd9e409a650235bd13"
    ],
    "s2id": "6f22b0da3447eebff003d0f6d4b9ed0864b85d2a",
    "abstract": "The effective incorporation of cross-utterance information has the potential to improve language models (LMs) for automatic speech recognition (ASR). To extract more powerful and robust cross-utterance representations for the Transformer LM (TLM), this paper proposes the R-TLM which uses hidden states in a long short-term memory (LSTM) LM. To encode the cross-utterance information, the R-TLM incorporates an LSTM module together with a segment-wise recurrence in some of the Transformer blocks. In addition to the LSTM module output, a shortcut connection using a fusion layer which bypasses the LSTM module is also investigated. The proposed system was evaluated on the AMI meeting corpus, the Eval2000 and the RT03 telephone conversation evaluation sets. The best R-TLM achieved 0.9%, 0.6% and 0.8% absolute WER reductions over the single-utterance TLM baseline, and 0.5%, 0.3%, 0.2% absolute WER reductions over a strong cross-utterance TLM baseline on the AMI evaluation set, Eval2000 and RT03 respectively. Improvements on Eval2000 and RT03 were further supported by significance tests. R-TLMs were found to have better LM scores on words where recognition errors are more likely to occur. The R-TLM WER can be further reduced by interpolation with an LSTM-LM.",
    "authors": [
        "G. Sun",
        "C. Zhang",
        "P. Woodland"
    ],
    "venue": "IEEE International Conference on Acoustics, Speech, and Signal Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The R-TLM which uses hidden states in a long short-term memory (LSTM) LM to encode the cross-utterance information and was found to have better LM scores on words where recognition errors are more likely to occur."
    },
    "citationCount": 27,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}