{
    "acronym": "6f7e03e4ccd26c762090e25dc5d2eb1e1f8c641d",
    "title": "Self-Guided Noise-Free Data Generation for Efficient Zero-Shot Learning",
    "seed_ids": [
        "gpt2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "23c265ba884b92ecbd9d18641078d964697e4590",
        "4badd753be64c5c5b57dd2bb2e515fbe0c0720d8",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "7eba731a7fd8de712b7b79b5af41a6e2d4dbd191",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "6f7e03e4ccd26c762090e25dc5d2eb1e1f8c641d",
    "abstract": "There is a rising interest in further exploring the zero-shot learning potential of large pre-trained language models (PLMs). A new paradigm called data-generation-based zero-shot learning has achieved impressive success. In this paradigm, the synthesized data from the PLM acts as the carrier of knowledge, which is used to train a task-specific model with orders of magnitude fewer parameters than the PLM, achieving both higher performance and efficiency than prompt-based zero-shot learning methods on PLMs. The main hurdle of this approach is that the synthesized data from PLM usually contains a significant portion of low-quality samples. Fitting on such data will greatly hamper the performance of the task-specific model, making it unreliable for deployment. Previous methods remedy this issue mainly by filtering synthetic data using heuristic metrics(e.g., output confidence), or refining the data with the help of a human expert, which comes with excessive manual tuning or expensive costs. In this paper, we propose a novel noise-robust re-weighting framework SunGen to automatically construct high-quality data for zero-shot classification problems. Our framework features the ability to learn the sample weights indicating data quality without requiring any human annotation. We theoretically and empirically verify the ability of our method to help construct good-quality synthetic datasets. Notably, SunGen-LSTM yields a 9.8% relative improvement than the baseline on average accuracy across eight different established text classification tasks.",
    "authors": [
        "Jiahui Gao",
        "Renjie Pi",
        "Yong Lin",
        "Hang Xu",
        "Jiacheng Ye",
        "Zhiyong Wu",
        "Weizhong Zhang",
        "Xiaodan Liang",
        "Zhenguo Li",
        "Lingpeng Kong"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel noise-robust re-weighting framework SunGen is proposed to automatically construct high-quality data for zero-shot classification problems, which features the ability to learn the sample weights indicating data quality without requiring any human annotation."
    },
    "citationCount": 21,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}