{
    "acronym": "6fb0b072c4fcdc0c78218bfd1b181fd562f07cd2",
    "title": "COMPS: Conceptual Minimal Pair Sentences for testing Robust Property Knowledge and its Inheritance in Pre-trained Language Models",
    "seed_ids": [
        "gpt2",
        "9cffc161896ce2b8d1a3083ab4f293bc166134ce",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "92173d081b15824d22a9ef070e118744ceee8052",
        "7096304d19457833972daec4d3f5107befe30b1c",
        "5a2263092f49540fd0e049050a96882ff29b00c3",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "6fb0b072c4fcdc0c78218bfd1b181fd562f07cd2",
    "abstract": "A characteristic feature of human semantic cognition is its ability to not only store and retrieve the properties of concepts observed through experience, but to also facilitate the inheritance of properties (can breathe) from superordinate concepts (animal) to their subordinates (dog)—i.e. demonstrate property inheritance. In this paper, we present COMPS, a collection of minimal pair sentences that jointly tests pre-trained language models (PLMs) on their ability to attribute properties to concepts and their ability to demonstrate property inheritance behavior. Analyses of 22 different PLMs on COMPS reveal that they can easily distinguish between concepts on the basis of a property when they are trivially different, but find it relatively difficult when concepts are related on the basis of nuanced knowledge representations. Furthermore, we find that PLMs can show behaviors suggesting successful property inheritance in simple contexts, but fail in the presence of distracting information, which decreases the performance of many models sometimes even below chance. This lack of robustness in demonstrating simple reasoning raises important questions about PLMs’ capacity to make correct inferences even when they appear to possess the prerequisite knowledge.",
    "authors": [
        "Kanishka Misra",
        "J. Rayz",
        "Allyson Ettinger"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "COMPS, a collection of minimal pair sentences that jointly tests pre-trained language models (PLMs) on their ability to attribute properties to concepts and their able to demonstrate property inheritance behavior, reveals that PLMs can show behaviors suggesting successful property inheritance in simple contexts, but fail in the presence of distracting information."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}