{
    "acronym": "6fc87ce6191beccb3b8a8539c2386a81c642bf92",
    "title": "Improving Linear Models for Univariate Long-term Time Series Forecasting",
    "seed_ids": [
        "transformer",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "30dcc0e191a376fea0e7a46f94c53872c029efc9"
    ],
    "s2id": "6fc87ce6191beccb3b8a8539c2386a81c642bf92",
    "abstract": "Transformer models have achieved state-of-the-art performance in fields such as natural language processing and computer vision. However, they encounter difficulties when applied to time series forecasting due to the permutation invariance of their self-attention mechanism. This has encouraged adapting simpler models, including those based on CNNs, RNNs, and MLPs. While MLP-based models succeed at capturing the moving average and seasonal patterns in data, they struggle with trends and sudden changes. To address this issue, we propose a Univariate Multi-Scale Linear (UMS-Linear) model that leverages timestamps and multi-scale decomposition. UMS-Linear improves the forecasting ability of MLP-based models by capturing the intricate dynamics of data. Empirical results demonstrate that UMS-Linear surpasses existing methods across multiple benchmarks, indicating its potential to advance time series forecasting accuracy.",
    "authors": [
        "Mohammed Abdelhadi Sellami",
        "Oussama Seyf Elislam Hamzi",
        "Belal Khaldi"
    ],
    "venue": "International Conference on Pattern Analysis and Intelligent Systems",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Univariate Multi-Scale Linear (UMS-Linear) model that leverages timestamps and multi-scale decomposition is proposed that surpasses existing methods across multiple benchmarks, indicating its potential to advance time series forecasting accuracy."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}