{
    "acronym": "6fc983030c84537b59ee0654beed81f9e4fa5449",
    "title": "A deep hierarchy of predictions enables online meaning extraction in a computational model of human speech comprehension",
    "seed_ids": [
        "gpt2",
        "2b31936832bdadb4b751c5294f73888571c37db0",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "6fc983030c84537b59ee0654beed81f9e4fa5449",
    "abstract": "Understanding speech requires mapping fleeting and often ambiguous soundwaves to meaning. While humans are known to exploit their capacity to contextualize to facilitate this process, how internal knowledge is deployed online remains an open question. Here, we present a model that extracts multiple levels of information from continuous speech online. The model applies linguistic and nonlinguistic knowledge to speech processing, by periodically generating top-down predictions and incorporating bottom-up incoming evidence in a nested temporal hierarchy. We show that a nonlinguistic context level provides semantic predictions informed by sensory inputs, which are crucial for disambiguating among multiple meanings of the same word. The explicit knowledge hierarchy of the model enables a more holistic account of the neurophysiological responses to speech compared to using lexical predictions generated by a neural network language model (GPT-2). We also show that hierarchical predictions reduce peripheral processing via minimizing uncertainty and prediction error. With this proof-of-concept model, we demonstrate that the deployment of hierarchical predictions is a possible strategy for the brain to dynamically utilize structured knowledge and make sense of the speech input.",
    "authors": [
        "Yaqing Su",
        "L. MacGregor",
        "I. Olasagasti",
        "A. Giraud"
    ],
    "venue": "PLoS Biology",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that the deployment of hierarchical predictions is a possible strategy for the brain to dynamically utilize structured knowledge and make sense of the speech input and it is shown that hierarchical predictions reduce peripheral processing via minimizing uncertainty and prediction error."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}