{
    "acronym": "700a6b189877f6b3cd795a30b30acb27c18d3354",
    "title": "Multi-level Contrastive Learning for Script-based Character Understanding",
    "seed_ids": [
        "bigbird",
        "longformer",
        "093fa870057469c94dae48e0dbc839c78d874760",
        "21233223e6f14006106f3acedd60e59af18816e1",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a"
    ],
    "s2id": "700a6b189877f6b3cd795a30b30acb27c18d3354",
    "abstract": "In this work, we tackle the scenario of understanding characters in scripts, which aims to learn the characters' personalities and identities from their utterances. We begin by analyzing several challenges in this scenario, and then propose a multi-level contrastive learning framework to capture characters' global information in a fine-grained manner. To validate the proposed framework, we conduct extensive experiments on three character understanding sub-tasks by comparing with strong pre-trained language models, including SpanBERT, Longformer, BigBird and ChatGPT-3.5. Experimental results demonstrate that our method improves the performances by a considerable margin. Through further in-depth analysis, we show the effectiveness of our method in addressing the challenges and provide more hints on the scenario of character understanding. We will open-source our work on github at https://github.com/David-Li0406/Script-based-Character-Understanding.",
    "authors": [
        "Dawei Li",
        "Hengyuan Zhang",
        "Yanran Li",
        "Shiping Yang"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a multi-level contrastive learning framework to capture characters' global information in a fine-grained manner and shows the effectiveness of the method in addressing the challenges and provides more hints on the scenario of character understanding."
    },
    "citationCount": 11,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}