{
    "acronym": "7017cdbfbecca360080b319d01310b78d25aaaa5",
    "title": "Beyond KV Caching: Shared Attention for Efficient LLMs",
    "seed_ids": [
        "mqa",
        "b085968c4362fb286ad6c5ef71a5db9630da0498",
        "5fc1a3a49e8f1d106118b69d1d6be3b6caa23da0",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad"
    ],
    "s2id": "7017cdbfbecca360080b319d01310b78d25aaaa5",
    "abstract": "The efficiency of large language models (LLMs) remains a critical challenge, particularly in contexts where computational resources are limited. Traditional attention mechanisms in these models, while powerful, require significant computational and memory resources due to the necessity of recalculating and storing attention weights across different layers. This paper introduces a novel Shared Attention (SA) mechanism, designed to enhance the efficiency of LLMs by directly sharing computed attention weights across multiple layers. Unlike previous methods that focus on sharing intermediate Key-Value (KV) caches, our approach utilizes the isotropic tendencies of attention distributions observed in advanced LLMs post-pretraining to reduce both the computational flops and the size of the KV cache required during inference. We empirically demonstrate that implementing SA across various LLMs results in minimal accuracy loss on standard benchmarks. Our findings suggest that SA not only conserves computational resources but also maintains robust model performance, thereby facilitating the deployment of more efficient LLMs in resource-constrained environments.",
    "authors": [
        "Bingli Liao",
        "Danilo Vasconcellos Vargas"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel Shared Attention mechanism, designed to enhance the efficiency of LLMs by directly sharing computed attention weights across multiple layers, which utilizes the isotropic tendencies of attention distributions observed in advanced LLMs post-pretraining to reduce both the computational flops and the size of the KV cache required during inference."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}