{
    "acronym": "70546742ecfeb46ff41be90d88a4d5c27c55ed2d",
    "title": "When Is Multilinguality a Curse? Language Modeling for 250 High- and Low-Resource Languages",
    "seed_ids": [
        "bert",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "70546742ecfeb46ff41be90d88a4d5c27c55ed2d",
    "abstract": "Multilingual language models are widely used to extend NLP systems to low-resource languages. However, concrete evidence for the effects of multilinguality on language modeling performance in individual languages remains scarce. Here, we pre-train over 10,000 monolingual and multilingual language models for over 250 languages, including multiple language families that are under-studied in NLP. We assess how language modeling performance in each language varies as a function of (1) monolingual dataset size, (2) added multilingual dataset size, (3) linguistic similarity of the added languages, and (4) model size (up to 45M parameters). We find that in moderation, adding multilingual data improves low-resource language modeling performance, similar to increasing low-resource dataset sizes by up to 33%. Improvements depend on the syntactic similarity of the added multilingual data, with marginal additional effects of vocabulary overlap. However, high-resource languages consistently perform worse in multilingual pre-training scenarios. As dataset sizes increase, adding multilingual data begins to hurt performance for both low-resource and high-resource languages, likely due to limited model capacity (the\"curse of multilinguality\"). These results suggest that massively multilingual pre-training may not be optimal for any languages involved, but that more targeted models can significantly improve performance.",
    "authors": [
        "Tyler A. Chang",
        "Catherine Arnett",
        "Zhuowen Tu",
        "Benjamin Bergen"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results suggest that massively multilingual pre-training may not be optimal for any languages involved, but that more targeted models can significantly improve performance."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}