{
    "acronym": "705c9b4e477484080b0a1a0368640891ab89edf3",
    "title": "CORE-BEHRT: A Carefully Optimized and Rigorously Evaluated BEHRT",
    "seed_ids": [
        "bert",
        "4990f7542f0600e0501a7e7a931b32eb7cb804d5",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "705c9b4e477484080b0a1a0368640891ab89edf3",
    "abstract": "BERT-based models for Electronic Health Records (EHR) have surged in popularity following the release of BEHRT and Med-BERT. Subsequent models have largely built on these foundations despite the fundamental design choices of these pioneering models remaining underexplored. To address this issue, we introduce CORE-BEHRT, a Carefully Optimized and Rigorously Evaluated BEHRT. Through incremental optimization, we isolate the sources of improvement for key design choices, giving us insights into the effect of data representation and individual technical components on performance. Evaluating this across a set of generic tasks (death, pain treatment, and general infection), we showed that improving data representation can increase the average downstream performance from 0.785 to 0.797 AUROC, primarily when including medication and timestamps. Improving the architecture and training protocol on top of this increased average downstream performance to 0.801 AUROC. We then demonstrated the consistency of our optimization through a rigorous evaluation across 25 diverse clinical prediction tasks. We observed significant performance increases in 17 out of 25 tasks and improvements in 24 tasks, highlighting the generalizability of our findings. Our findings provide a strong foundation for future work and aim to increase the trustworthiness of BERT-based EHR models.",
    "authors": [
        "Mikkel Odgaard",
        "K. Klein",
        "Sanne Moller Thysen",
        "E. Jimenez‐Solem",
        "Martin Sillesen",
        "Mads Nielsen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "CORE-BEHRT, a Carefully Optimized and Rigorously Evaluated BEHRT, introduces CORE-BEHRT, a Carefully Optimized and Rigorously Evaluated BERT-based EHR models to increase the trustworthiness of BERT-based EHR models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}