{
    "acronym": "706b2da6201fa3bd82be1592f61bb84e9cc45bf9",
    "title": "Linguistic Landscape of Generative AI Perception: A Global Twitter Analysis Across 14 Languages",
    "seed_ids": [
        "gpt3"
    ],
    "s2id": "706b2da6201fa3bd82be1592f61bb84e9cc45bf9",
    "abstract": "The advent of generative AI tools has had a profound impact on societies globally, transcending geographical boundaries. Understanding these tools' global reception and utilization is crucial for service providers and policymakers in shaping future policies. Therefore, to unravel the perceptions and engagements of individuals within diverse linguistic communities with regard to generative AI tools, we extensively analyzed over 6.8 million tweets in 14 different languages. Our findings reveal a global trend in the perception of generative AI, accompanied by language-specific nuances. While sentiments toward these tools vary significantly across languages, there is a prevalent positive inclination toward Image tools and a negative one toward Chat tools. Notably, the ban of ChatGPT in Italy led to a sentiment decline and initiated discussions across languages. Furthermore, we established a taxonomy for interactions with chatbots, creating a framework for social analysis underscoring variations in generative AI usage among linguistic communities. We find that the Chinese community predominantly employs chatbots as substitutes for search, while the Italian community tends to present more intricate prompts. Our research provides a robust foundation for further explorations of the social dynamics surrounding generative AI tools and offers invaluable insights for decision-makers in policy, technology, and education.",
    "authors": [
        "Taichi Murayama",
        "Kunihiro Miyazaki",
        "Yasuko Matsubara",
        "Yasushi Sakurai"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A global trend in the perception of generative AI is revealed, accompanied by language-specific nuances, and it is found that the Chinese community predominantly employs chatbots as substitutes for search, while the Italian community tends to present more intricate prompts."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}