{
    "acronym": "70ffc32ecb69740bd508a7863a2d303d4eb4f208",
    "title": "xVal: A Continuous Number Encoding for Large Language Models",
    "seed_ids": [
        "gpt2",
        "e82e3f4347674b75c432cb80604d38ee630d4bf6",
        "8db711adf1beb3e0c2ec492f3936841d827404e9",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "70ffc32ecb69740bd508a7863a2d303d4eb4f208",
    "abstract": "Large Language Models have not yet been broadly adapted for the analysis of scientific datasets due in part to the unique difficulties of tokenizing numbers. We propose xVal, a numerical encoding scheme that represents any real number using just a single token. xVal represents a given real number by scaling a dedicated embedding vector by the number value. Combined with a modified number-inference approach, this strategy renders the model end-to-end continuous when considered as a map from the numbers of the input string to those of the output string. This leads to an inductive bias that is generally more suitable for applications in scientific domains. We empirically evaluate our proposal on a number of synthetic and real-world datasets. Compared with existing number encoding schemes, we find that xVal is more token-efficient and demonstrates improved generalization.",
    "authors": [
        "Siavash Golkar",
        "Mariel Pettee",
        "Michael Eickenberg",
        "Alberto Bietti",
        "M. Cranmer",
        "G. Krawezik",
        "Francois Lanusse",
        "Michael McCabe",
        "Ruben Ohana",
        "L. Parker",
        "Bruno Régaldo-Saint Blancard",
        "Tiberiu Teşileanu",
        "Kyunghyun Cho",
        "Shirley Ho"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "XVal is a numerical encoding scheme that represents any real number using just a single token that is more token-efficient and demonstrates improved generalization than existing number encoding schemes."
    },
    "citationCount": 18,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}