{
    "acronym": "7177fcb8e0311eeebd4070b62312a4bec1432ea3",
    "title": "When Do Transformers Shine in RL? Decoupling Memory from Credit Assignment",
    "seed_ids": [
        "gpt2",
        "99b0c3a18050889c591e1db6d51ca01298638437",
        "235303a8bc1e4892efd525a38ead657422d8a519",
        "82ec4a03a945f18bae23f8c5224d6495ec6cd1b0",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "008cfd24dfdfb28fc6a89c32772c7ffe5cb0cf8a",
        "59a916cdc943f0282908e6f3fa0360f4c5fb78d0",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7177fcb8e0311eeebd4070b62312a4bec1432ea3",
    "abstract": "Reinforcement learning (RL) algorithms face two distinct challenges: learning effective representations of past and present observations, and determining how actions influence future returns. Both challenges involve modeling long-term dependencies. The Transformer architecture has been very successful to solve problems that involve long-term dependencies, including in the RL domain. However, the underlying reason for the strong performance of Transformer-based RL methods remains unclear: is it because they learn effective memory, or because they perform effective credit assignment? After introducing formal definitions of memory length and credit assignment length, we design simple configurable tasks to measure these distinct quantities. Our empirical results reveal that Transformers can enhance the memory capability of RL algorithms, scaling up to tasks that require memorizing observations $1500$ steps ago. However, Transformers do not improve long-term credit assignment. In summary, our results provide an explanation for the success of Transformers in RL, while also highlighting an important area for future research and benchmark design. Our code is open-sourced at https://github.com/twni2016/Memory-RL",
    "authors": [
        "Tianwei Ni",
        "Michel Ma",
        "Benjamin Eysenbach",
        "Pierre-Luc Bacon"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The empirical results reveal that Transformers can enhance the memory capability of RL algorithms, scaling up to tasks that require memorizing observations $1500$ steps ago, however, Transformers do not improve long-term credit assignment."
    },
    "citationCount": 16,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}