{
    "acronym": "71a0f419b5e8d466979e3bae5aee3505c5088d1c",
    "title": "Reliable Trajectory Prediction and Uncertainty Quantification with Conditioned Diffusion Models",
    "seed_ids": [
        "classfreediffu",
        "247fbf266e70e196d983f53e7b4990b9548b0fc5",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "15736f7c205d961c00378a938daffaacb5a0718d",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "71a0f419b5e8d466979e3bae5aee3505c5088d1c",
    "abstract": "This work introduces the conditioned Vehicle Motion Diffusion (cVMD) model, a novel network architecture for highway trajectory prediction using diffusion models. The proposed model ensures the drivability of the predicted trajectory by integrating non-holonomic motion constraints and physical constraints into the generative prediction module. Central to the architecture of cVMD is its capacity to perform uncertainty quantification, a feature that is crucial in safety-critical applications. By integrating the quantified uncertainty into the prediction process, the cVMD's trajectory prediction performance is improved considerably. The model's performance was evaluated using the publicly available highD dataset. Experiments show that the proposed architecture achieves competitive trajectory prediction accuracy compared to state-of-the-art models, while providing guaranteed drivable trajectories and uncertainty quantification.",
    "authors": [
        "Marion Neumeier",
        "Sebastian Dorn",
        "M. Botsch",
        "Wolfgang Utschick"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The conditioned Vehicle Motion Diffusion model is introduced, a novel network architecture for highway trajectory prediction using diffusion models that achieves competitive trajectory prediction accuracy compared to state-of-the-art models, while providing guaranteed drivable trajectories and uncertainty quantification."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}