{
    "acronym": "71ba5f845bd22d42003675b7cea970ca9e590bcc",
    "title": "Editing Models with Task Arithmetic",
    "seed_ids": [
        "gpt2",
        "023edab4738690444e3924e224c2641017a0d794",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "71ba5f845bd22d42003675b7cea970ca9e590bcc",
    "abstract": "Changing how pre-trained models behave -- e.g., improving their performance on a downstream task or mitigating biases learned during pre-training -- is a common practice when developing machine learning systems. In this work, we propose a new paradigm for steering the behavior of neural networks, centered around \\textit{task vectors}. A task vector specifies a direction in the weight space of a pre-trained model, such that movement in that direction improves performance on the task. We build task vectors by subtracting the weights of a pre-trained model from the weights of the same model after fine-tuning on a task. We show that these task vectors can be modified and combined together through arithmetic operations such as negation and addition, and the behavior of the resulting model is steered accordingly. Negating a task vector decreases performance on the target task, with little change in model behavior on control tasks. Moreover, adding task vectors together can improve performance on multiple tasks at once. Finally, when tasks are linked by an analogy relationship of the form ``A is to B as C is to D\", combining task vectors from three of the tasks can improve performance on the fourth, even when no data from the fourth task is used for training. Overall, our experiments with several models, modalities and tasks show that task arithmetic is a simple, efficient and effective way of editing models.",
    "authors": [
        "Gabriel Ilharco",
        "Marco Tulio Ribeiro",
        "Mitchell Wortsman",
        "Suchin Gururangan",
        "Ludwig Schmidt",
        "Hannaneh Hajishirzi",
        "Ali Farhadi"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new paradigm for steering the behavior of neural networks, centered around task vectors, is proposed, which shows that task arithmetic is a simple, efficient and effective way of editing models."
    },
    "citationCount": 186,
    "influentialCitationCount": 46,
    "code": null,
    "description": null,
    "url": null
}