{
    "acronym": "7265a46ddcae3b2ebefbebf0b5cee1cf6d229085",
    "title": "RevBiFPN: The Fully Reversible Bidirectional Feature Pyramid Network",
    "seed_ids": [
        "reformer",
        "9a618cca0d2fc78db1be1aed70517401cb3f3859",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "7265a46ddcae3b2ebefbebf0b5cee1cf6d229085",
    "abstract": "This work introduces RevSilo, the first reversible bidirectional multi-scale feature fusion module. Like other reversible methods, RevSilo eliminates the need to store hidden activations by recomputing them. However, existing reversible methods do not apply to multi-scale feature fusion and are, therefore, not applicable to a large class of networks. Bidirectional multi-scale feature fusion promotes local and global coherence and has become a de facto design principle for networks targeting spatially sensitive tasks, e.g., HRNet (Sun et al., 2019a) and EfficientDet (Tan et al., 2020). These networks achieve state-of-the-art results across various computer vision tasks when paired with high-resolution inputs. However, training them requires substantial accelerator memory for saving large, multi-resolution activations. These memory requirements inherently cap the size of neural networks, limiting improvements that come from scale. Operating across resolution scales, RevSilo alleviates these issues. Stacking RevSilos, we create RevBiFPN, a fully reversible bidirectional feature pyramid network. RevBiFPN is competitive with networks such as EfficientNet while using up to 19.8x lesser training memory for image classification. When fine-tuned on MS COCO, RevBiFPN provides up to a 2.5% boost in AP over HRNet using fewer MACs and a 2.4x reduction in training-time memory.",
    "authors": [
        "Vitaliy Chiley",
        "Vithursan Thangarasa",
        "Abhay Gupta",
        "Anshul Samar",
        "Joel Hestness",
        "D. DeCoste"
    ],
    "venue": "Conference on Machine Learning and Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces RevSilo, the first reversible bidirectional multi-scale feature fusion module, and creates RevBiFPN, a fully reversible biddirectional feature pyramid network that is competitive with networks such as EfficientNet while using up to 19.8x lesser training memory for image classification."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}