{
    "acronym": "72862e6e858c44ebd94d6ba90dc420963d9d0f39",
    "title": "Image as Set of Points",
    "seed_ids": [
        "gmlp",
        "ba637c4f1a170f1e2dadeadb71a63cf2b9a46de2",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "f75cddf2d42ed01b34686704eb3504becef67442",
        "71363797140647ebb3f540584de0a8758d2f7aa2",
        "a96d038246c4ad4a16bf97de09329bdcd0dc2ddf",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "72862e6e858c44ebd94d6ba90dc420963d9d0f39",
    "abstract": "What is an image and how to extract latent features? Convolutional Networks (ConvNets) consider an image as organized pixels in a rectangular shape and extract features via convolutional operation in local region; Vision Transformers (ViTs) treat an image as a sequence of patches and extract features via attention mechanism in a global range. In this work, we introduce a straightforward and promising paradigm for visual representation, which is called Context Clusters. Context clusters (CoCs) view an image as a set of unorganized points and extract features via simplified clustering algorithm. In detail, each point includes the raw feature (e.g., color) and positional information (e.g., coordinates), and a simplified clustering algorithm is employed to group and extract deep features hierarchically. Our CoCs are convolution- and attention-free, and only rely on clustering algorithm for spatial interaction. Owing to the simple design, we show CoCs endow gratifying interpretability via the visualization of clustering process. Our CoCs aim at providing a new perspective on image and visual representation, which may enjoy broad applications in different domains and exhibit profound insights. Even though we are not targeting SOTA performance, COCs still achieve comparable or even better results than ConvNets or ViTs on several benchmarks. Codes are available at: https://github.com/ma-xu/Context-Cluster.",
    "authors": [
        "Xu Ma",
        "Yuqian Zhou",
        "Huan Wang",
        "Can Qin",
        "Bin Sun",
        "Chang Liu",
        "Yun Fu"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Context clusters aim at providing a new perspective on image and visual representation, which may enjoy broad applications in different domains and exhibit profound insights, and achieve comparable or even better results than Convolutional Networks or ViTs on several benchmarks."
    },
    "citationCount": 28,
    "influentialCitationCount": 6,
    "code": null,
    "description": null,
    "url": null
}