{
    "acronym": "7294c426b8a95975ca932eaf8f700acdd3d950b2",
    "title": "Lightning Attention-2: A Free Lunch for Handling Unlimited Sequence Lengths in Large Language Models",
    "seed_ids": [
        "transnormerllm",
        "transnormer",
        "434d751d355d7a7c20efa570e785c76286245e77",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "2a38daf98d506477f8180806f503409d5036eaf4",
        "2f0203386f3dcbffb47c9f7fe2d19d373d9dda2f",
        "8bc8b9ae855bc0aa19e7223899440ffbdc61f4d8",
        "240103933ffe3dac2179cc160a2bd91299357a53",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "f35f5aedc30e2c5ded210d9c91ba6e84bd029425",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "ac608a4a6b19b3208e560eee5daadb3cc18638a2",
        "5735e49e501c8e51e9be4079592e46e047747b03",
        "e3fc46d5f4aae2c7a8a86b6bd21ca8db5d40fcbd",
        "6be32b4321f95b79bb2e37feeab0c3c7f902195e",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "1944cebf4e41a10ea7bd02ce30404c18c9c4e04f",
        "dc0102a51a9d33e104a4a3808a18cf17f057228c",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "7294c426b8a95975ca932eaf8f700acdd3d950b2",
    "abstract": "Linear attention is an efficient attention mechanism that has recently emerged as a promising alternative to conventional softmax attention. With its ability to process tokens in linear computational complexities, linear attention, in theory, can handle sequences of unlimited length without sacrificing speed, i.e., maintaining a constant training speed for various sequence lengths with a fixed memory consumption. However, due to the issue with cumulative summation (cumsum), current linear attention algorithms cannot demonstrate their theoretical advantage in a causal setting. In this paper, we present Lightning Attention-2, the first linear attention implementation that enables linear attention to realize its theoretical computational benefits. To achieve this, we leverage the thought of tiling, separately handling the intra-block and inter-block components in linear attention calculation. Specifically, we utilize the conventional attention computation mechanism for the intra-blocks and apply linear attention kernel tricks for the inter-blocks. A tiling technique is adopted through both forward and backward procedures to take full advantage of the GPU hardware. We implement our algorithm in Triton to make it IO-aware and hardware-friendly. Various experiments are conducted on different model sizes and sequence lengths. Lightning Attention-2 retains consistent training and inference speed regardless of input sequence length and is significantly faster than other attention mechanisms. The source code is available at https://github.com/OpenNLPLab/lightning-attention.",
    "authors": [
        "Zhen Qin",
        "Weigao Sun",
        "Dong Li",
        "Xuyang Shen",
        "Weixuan Sun",
        "Yiran Zhong"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Lightning Attention-2 is presented, the first linear attention implementation that enables linear attention to realize its theoretical computational benefits and retains consistent training and inference speed regardless of input sequence length and is significantly faster than other attention mechanisms."
    },
    "citationCount": 9,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}