{
    "acronym": "7305aeb2e93735f5bc78a1b5df281f7258778f7b",
    "title": "TML: A Temporal-aware Multitask Learning Framework for Time-sensitive Question Answering",
    "seed_ids": [
        "bigbird",
        "5d733042a5185a97eb80e4c665eaeaf71f9d1bba",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "867915b9587c046ce8e4b71ab4dee2a1d8bf0b48"
    ],
    "s2id": "7305aeb2e93735f5bc78a1b5df281f7258778f7b",
    "abstract": "Many facts change over time, Time-sensitive Question Answering(TSQA) answers questions about time evolution facts to test the model’s ability in the dimension of the time. The existing methods obtain the representations of questions and documents and then compute their similarity to find the answer spans. These methods perform well in simple moment questions, but they are difficult to solve hard duration problems that need temporal relations and temporal numeric comparisons. In this paper, we propose Temporal-aware Multitask Learning (TML) with three auxiliary tasks to tackle with them. First, we propose a temporal-aware sequence labeling task to help the model distinguish the temporal expressions by detecting temporal types of tokens in the document. Then a temporal-aware masked language modeling task is used to capture the temporal relation between events based on the context. Furthermore, temporal-aware order learning is proposed to inject the ability of numeric comparison into the model. We carried out comprehensive experiments on the TimeQA benchmark, aiming to evaluate the performance of our proposed methodology in handling temporal question answering. TML significantly outperforms the baselines by a relative 10% on the two splits of the dataset.",
    "authors": [
        "Ziqiang Chen",
        "Shaojuan Wu",
        "Xiaowang Zhang",
        "Zhiyong Feng"
    ],
    "venue": "The Web Conference",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes Temporal-aware Multitask Learning (TML) with three auxiliary tasks to tackle with them, and proposes a temporal-aware sequence labeling task to help the model distinguish the temporal expressions by detecting temporal types of tokens in the document."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}