{
    "acronym": "73081c0d391f057e89b21347860c89cd09c1d2b1",
    "title": "Few-Shot Detection of Machine-Generated Text using Style Representations",
    "seed_ids": [
        "gpt2",
        "1c13af186d1e177b85ef1ec3fc7b8d33ec314cfd",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "73081c0d391f057e89b21347860c89cd09c1d2b1",
    "abstract": "The advent of instruction-tuned language models that convincingly mimic human writing poses a significant risk of abuse. However, such abuse may be counteracted with the ability to detect whether a piece of text was composed by a language model rather than a human author. Some previous approaches to this problem have relied on supervised methods by training on corpora of confirmed human- and machine- written documents. Unfortunately, model under-specification poses an unavoidable challenge for neural network-based detectors, making them brittle in the face of data shifts, such as the release of newer language models producing still more fluent text than the models used to train the detectors. Other approaches require access to the models that may have generated a document in question, which is often impractical. In light of these challenges, we pursue a fundamentally different approach not relying on samples from language models of concern at training time. Instead, we propose to leverage representations of writing style estimated from human-authored text. Indeed, we find that features effective at distinguishing among human authors are also effective at distinguishing human from machine authors, including state-of-the-art large language models like Llama-2, ChatGPT, and GPT-4. Furthermore, given a handful of examples composed by each of several specific language models of interest, our approach affords the ability to predict which model generated a given document. The code and data to reproduce our experiments are available at https://github.com/LLNL/LUAR/tree/main/fewshot_iclr2024.",
    "authors": [
        "Rafael A. Rivera Soto",
        "Kailin Koch",
        "Aleem Khan",
        "Barry Chen",
        "M. Bishop",
        "Nicholas Andrews"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work finds that features effective at distinguishing among human authors are also effective at distinguishing human from machine authors in state-of-the-art large language models, including state-of-the-art large language models like Llama-2, ChatGPT, and GPT-4."
    },
    "citationCount": 9,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}