{
    "acronym": "731f664de6b9dd5d378071e2eced4818491232c9",
    "title": "Let the Pretrained Language Models \"Imagine\" for Short Texts Topic Modeling",
    "seed_ids": [
        "gpt2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "731f664de6b9dd5d378071e2eced4818491232c9",
    "abstract": "Topic models are one of the compelling methods for discovering latent semantics in a document collection. However, it assumes that a document has sufficient co-occurrence information to be effective. However, in short texts, co-occurrence information is minimal, which results in feature sparsity in document representation. Therefore, existing topic models (probabilistic or neural) mostly fail to mine patterns from them to generate coherent topics. In this paper, we take a new approach to short-text topic modeling to address the data-sparsity issue by extending short text into longer sequences using existing pre-trained language models (PLMs). Besides, we provide a simple solution extending a neural topic model to reduce the effect of noisy out-of-topics text generation from PLMs. We observe that our model can substantially improve the performance of short-text topic modeling. Extensive experiments on multiple real-world datasets under extreme data sparsity scenarios show that our models can generate high-quality topics outperforming state-of-the-art models.",
    "authors": [
        "Pritom Saha Akash",
        "Jie Huang",
        "Kevin Chen-Chuan Chang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new approach to short-text topic modeling is taken to address the data-sparsity issue by extending short text into longer sequences using existing pre-trained language models (PLMs) and provides a simple solution extending a neural topic model to reduce the effect of noisy out-of-topics text generation from PLMs."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}