{
    "acronym": "73290ecbec2f38d1d647ddef1ada69cee41725b3",
    "title": "PoSE: Efficient Context Window Extension of LLMs via Positional Skip-wise Training",
    "seed_ids": [
        "pi",
        "yarn",
        "landmarkattn",
        "b6346f9fa093b8e85df712485a2b851b9f680dac",
        "b069c32fcd77160f944ab3ba71ab6f0cfb782c68",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "80980cd10d19f021c14a6b7eee871b6a5d328024",
        "af385c0fdd0eda2bbf429bea6fedffc327c8a180",
        "60b35c6d68acced19b0c66edcfc0ee0a2c11efed",
        "2e6fa3095df1d1ed041dfb4f5a18e31d4b7bd7bb",
        "9575afb5702bc33d7df14c48feeee5901ea00369",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "a2fc77f075f666b462d9350e7576f0ba9845c61b",
        "0e802c0739771acf70e60d59c2df51cd7e8c50c0",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "9dc624d7258d1a56117ca720aea953ce46b66b21",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "f51497f463566581874c941353dd9d80069c5b77",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "e3aa232577bb427b1f3a34acbdef84bd85734042",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "73290ecbec2f38d1d647ddef1ada69cee41725b3",
    "abstract": "Large Language Models (LLMs) are trained with a pre-defined context length, restricting their use in scenarios requiring long inputs. Previous efforts for adapting LLMs to a longer length usually requires fine-tuning with this target length (Full-length fine-tuning), suffering intensive training cost. To decouple train length from target length for efficient context window extension, we propose Positional Skip-wisE (PoSE) training that smartly simulates long inputs using a fixed context window. This is achieved by first dividing the original context window into several chunks, then designing distinct skipping bias terms to manipulate the position indices of each chunk. These bias terms and the lengths of each chunk are altered for every training example, allowing the model to adapt to all positions within target length. Experimental results show that PoSE greatly reduces memory and time overhead compared with Full-length fine-tuning, with minimal impact on performance. Leveraging this advantage, we have successfully extended the LLaMA model to 128k tokens using a 2k training context window. Furthermore, we empirically confirm that PoSE is compatible with all RoPE-based LLMs and position interpolation strategies. Notably, our method can potentially support infinite length, limited only by memory usage in inference. With ongoing progress for efficient inference, we believe PoSE can further scale the context window beyond 128k.",
    "authors": [
        "Dawei Zhu",
        "Nan Yang",
        "Liang Wang",
        "Yifan Song",
        "Wenhao Wu",
        "Furu Wei",
        "Sujian Li"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Positional Skip-wisE (PoSE) training that smartly simulates long inputs using a fixed context window is proposed, and can potentially support infinite length, limited only by memory usage in inference."
    },
    "citationCount": 39,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}