{
    "acronym": "732e3faec4e5be4d144256f2c379b9dc49f0b227",
    "title": "Efficient Long-Text Understanding with Short-Text Models",
    "seed_ids": [
        "longformer",
        "dssm",
        "6edccbd83a9aae204785d4821f97855677c33866",
        "eaef083b9d661f42cc0d89d9d8156218f33a91d9",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "13850aabbe8b70e99560a42504773a76ab5a4f47",
        "2d82ee05b132d4681c3bd517afc17d608fe6e525",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "af679d69fcc1d0fcf0f039aba937853bcb50a8de",
        "4e3935ef7da6bcbb202ec7f8b285c313cadcd044",
        "9dc624d7258d1a56117ca720aea953ce46b66b21",
        "bf80051ca9ae1e76e2bdbdcf44df559e7eb73cb1",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "63857190aaf5aab1d94b54bb257b7b03b8cb5a50",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "732e3faec4e5be4d144256f2c379b9dc49f0b227",
    "abstract": "Transformer-based pretrained language models (LMs) are ubiquitous across natural language understanding, but cannot be applied to long sequences such as stories, scientific articles, and long documents due to their quadratic complexity. While a myriad of efficient transformer variants have been proposed, they are typically based on custom implementations that require expensive pretraining from scratch. In this work, we propose SLED: SLiding-Encoder and Decoder, a simple approach for processing long sequences that re-uses and leverages battle-tested short-text pretrained LMs. Specifically, we partition the input into overlapping chunks, encode each with a short-text LM encoder and use the pretrained decoder to fuse information across chunks (fusion-in-decoder). We illustrate through controlled experiments that SLED offers a viable strategy for long text understanding and evaluate our approach on SCROLLS, a benchmark with seven datasets across a wide range of language understanding tasks. We find that SLED is competitive with specialized models that are up to 50x larger and require a dedicated and expensive pretraining step.",
    "authors": [
        "Maor Ivgi",
        "Uri Shaham",
        "Jonathan Berant"
    ],
    "venue": "Transactions of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes SLED: SLiding-Encoder and Decoder, a simple approach for processing long sequences that re-uses and leverages battle-tested short-text pretrained LMs and finds that SLED is competitive with specialized models that are up to 50x larger and require a dedicated and expensive pretraining step."
    },
    "citationCount": 50,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}