{
    "acronym": "733ded5b1f8ab236165a4645142681c832c86ca1",
    "title": "On prefrontal working memory and hippocampal episodic memory: Unifying memories stored in weights and activity slots",
    "seed_ids": [
        "transformer",
        "240103933ffe3dac2179cc160a2bd91299357a53",
        "06e40b7a703079c280f8f0886ac2bd984cd318ce",
        "6f68e1bb253925d8431588555d3010419f322e04"
    ],
    "s2id": "733ded5b1f8ab236165a4645142681c832c86ca1",
    "abstract": "Remembering events in the past is crucial to intelligent behaviour. Flexible memory retrieval, beyond simple recall, requires a cognitive map, or model of how sensations, actions, and latent environmental or task states are all related to one another. Two key brain systems are implicated in this process: the hippocampal episodic memory (EM) system and the prefrontal working memory (WM) system. While an understanding of the hippocampal system, from computation to algorithm and representation, is emerging, less is understood about how the prefrontal WM system can give rise to flexible computations beyond simple memory retrieval, and even less is understood about how the two systems relate to each other. Here we develop a mathematical theory relating the algorithms and representations of EM and WM by unveiling a duality between storing memories in synapses versus neural activity. In doing so, we develop a formal theory of the algorithms and representations of prefrontal WM in terms of structured, and controllable, neural subspaces (termed activity slots) that together can represent a dynamic cognitive map without any need for synaptic plasticity. By building models using this formalism, we elucidate the differences, similarities, and trade-offs between the hippocampal and prefrontal algorithms. Lastly, we show that several prefrontal representations in tasks ranging from list learning to cue dependent recall are unified as controllable activity slots. Our results unify frontal and temporal representations of memory, and offer a new basis for understanding dynamic prefrontal representations of WM.",
    "authors": [
        "James C. R. Whittington",
        "William Dorrell",
        "Tim E. J. Behrens",
        "Surya Ganguli",
        "Mohamady El-Gaby"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A mathematical theory relating the algorithms and representations of EM and WM is developed by unveiling a duality between storing memories in synapses versus neural activity, and several prefrontal representations in tasks ranging from list learning to cue dependent recall are unified as controllable activity slots."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}