{
    "acronym": "7351898febca53d01453283c9b1a541b662e1ed3",
    "title": "DenseMamba: State Space Models with Dense Hidden Connection for Efficient Large Language Models",
    "seed_ids": [
        "s4",
        "mamba",
        "retnet",
        "62b18cc55dcc7ffe52c28e1086aee893b7bc4334",
        "240103933ffe3dac2179cc160a2bd91299357a53",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "eaef083b9d661f42cc0d89d9d8156218f33a91d9",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "d5e999aae76d5270ef272076979c809817458212",
        "2fd10e095b146f99da8cdc6ff58720e2e8fca36d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "7351898febca53d01453283c9b1a541b662e1ed3",
    "abstract": "Large language models (LLMs) face a daunting challenge due to the excessive computational and memory requirements of the commonly used Transformer architecture. While state space model (SSM) is a new type of foundational network architecture offering lower computational complexity, their performance has yet to fully rival that of Transformers. This paper introduces DenseSSM, a novel approach to enhance the flow of hidden information between layers in SSMs. By selectively integrating shallowlayer hidden states into deeper layers, DenseSSM retains fine-grained information crucial for the final output. Dense connections enhanced DenseSSM still maintains the training parallelizability and inference efficiency. The proposed method can be widely applicable to various SSM types like RetNet and Mamba. With similar model size, DenseSSM achieves significant improvements, exemplified by DenseRetNet outperforming the original RetNet with up to 5% accuracy improvement on public benchmarks. code is avalaible at https://github.com/WailordHe/DenseSSM",
    "authors": [
        "Wei He",
        "Kai Han",
        "Yehui Tang",
        "Chengcheng Wang",
        "Yujie Yang",
        "Tianyu Guo",
        "Yunhe Wang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "DenseSSM is introduced, a novel approach to enhance the flow of hidden information between layers in SSMs by selectively integrating shallowlayer hidden states into deeper layers, and retains fine-grained information crucial for the final output."
    },
    "citationCount": 14,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}