{
    "acronym": "743dcf234cffd54c4e096a10a284dd81572b16ea",
    "title": "RelationPrompt: Leveraging Prompts to Generate Synthetic Data for Zero-Shot Relation Triplet Extraction",
    "seed_ids": [
        "gpt2",
        "23c265ba884b92ecbd9d18641078d964697e4590",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "743dcf234cffd54c4e096a10a284dd81572b16ea",
    "abstract": "Despite the importance of relation extraction in building and representing knowledge, less research is focused on generalizing to unseen relations types. We introduce the task setting of Zero-Shot Relation Triplet Extraction (ZeroRTE) to encourage further research in low-resource relation extraction methods. Given an input sentence, each extracted triplet consists of the head entity, relation label, and tail entity where the relation label is not seen at the training stage. To solve ZeroRTE, we propose to synthesize relation examples by prompting language models to generate structured texts. Concretely, we unify language model prompts and structured text approaches to design a structured prompt template for generating synthetic relation samples when conditioning on relation label prompts (RelationPrompt). To overcome the limitation for extracting multiple relation triplets in a sentence, we design a novel Triplet Search Decoding method. Experiments on FewRel and Wiki-ZSL datasets show the efficacy of RelationPrompt for the ZeroRTE task and zero-shot relation classification. Our code and data are available at github.com/declare-lab/RelationPrompt.",
    "authors": [
        "Yew Ken Chia",
        "Lidong Bing",
        "Soujanya Poria",
        "Luo Si"
    ],
    "venue": "Findings",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work unify language model prompts and structured text approaches to design a structured prompt template for generating synthetic relation samples when conditioning on relation label prompts (RelationPrompt), and designs a novel Triplet Search Decoding method."
    },
    "citationCount": 73,
    "influentialCitationCount": 11,
    "code": null,
    "description": null,
    "url": null
}