{
    "acronym": "7493c3c89710766f87d0af4e62e98aa31f34c83c",
    "title": "Machine Translation with Large Language Models: Prompt Engineering for Persian, English, and Russian Directions",
    "seed_ids": [
        "gpt3",
        "293499319bdd460cb3fca1f0f5eb330e64bf3ff9",
        "4161ad2d2495d8af1d62dc5e71882bde642cd1c1",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7493c3c89710766f87d0af4e62e98aa31f34c83c",
    "abstract": "Generative large language models (LLMs) have demonstrated exceptional proficiency in various natural language processing (NLP) tasks, including machine translation, question answering, text summarization, and natural language understanding. To further enhance the performance of LLMs in machine translation, we conducted an investigation into two popular prompting methods and their combination, focusing on cross-language combinations of Persian, English, and Russian. We employed n-shot feeding and tailored prompting frameworks. Our findings indicate that multilingual LLMs like PaLM exhibit human-like machine translation outputs, enabling superior fine-tuning of desired translation nuances in accordance with style guidelines and linguistic considerations. These models also excel in processing and applying prompts. However, the choice of language model, machine translation task, and the specific source and target languages necessitate certain considerations when adopting prompting frameworks and utilizing n-shot in-context learning. Furthermore, we identified errors and limitations inherent in popular LLMs as machine translation tools and categorized them based on various linguistic metrics. This typology of errors provides valuable insights for utilizing LLMs effectively and offers methods for designing prompts for in-context learning. Our report aims to contribute to the advancement of machine translation with LLMs by improving both the accuracy and reliability of evaluation metrics.",
    "authors": [
        "Nooshin Pourkamali",
        "Shler Ebrahim Sharifi"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This report conducted an investigation into two popular prompting methods and their combination, focusing on cross-language combinations of Persian, English, and Russian, and identified errors and limitations inherent in popular LLMs as machine translation tools and categorized them based on various linguistic metrics."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}