{
    "acronym": "7497405b0aef18b26fba4948d95cc4597ca4d6b7",
    "title": "Counteracts: Testing Stereotypical Representation in Pre-trained Language Models",
    "seed_ids": [
        "gpt2",
        "cd471b5ef162906ef3d9a84398b3f98e9ee4bf56",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7497405b0aef18b26fba4948d95cc4597ca4d6b7",
    "abstract": "Recently, language models have demonstrated strong performance on various natural language understanding tasks. Language models trained on large human-generated corpus encode not only a significant amount of human knowledge, but also the human stereotype. As more and more downstream tasks have integrated language models as part of the pipeline, it is necessary to understand the internal stereotypical representation in order to design the methods for mitigating the negative effects. In this paper, we use counterexamples to examine the internal stereotypical knowledge in pre-trained language models (PLMs) that can lead to stereotypical preference. We mainly focus on gender stereotypes, but the method can be extended to other types of stereotype. We evaluate 7 PLMs on 9 types of cloze-style prompt with different information and base knowledge. The results indicate that PLMs show a certain amount of robustness against unrelated information and preference of shallow linguistic cues, such as word position and syntactic structure, but a lack of interpreting information by meaning. Such findings shed light on how to interact with PLMs in a neutral approach for both finetuning and evaluation.",
    "authors": [
        "Damin Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results indicate that PLMs show a certain amount of robustness against unrelated information and preference of shallow linguistic cues, but a lack of interpreting information by meaning, which sheds light on how to interact with PLMs in a neutral approach for both finetuning and evaluation."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}