{
    "acronym": "749e78f16f1c7b84e2a3cd7b598f48ad30a0d354",
    "title": "Intellectual Property Protection Lost and Competition: An Examination Using Large Language Models",
    "seed_ids": [
        "longformer",
        "1e3e65e7773b7869d9bd7f5394b54199e48195e6",
        "85bb1317013141d5e5f41d18376cd7257c46264a",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "adc61e21eafecfbf6ebecc570f9f913659a2bfb2"
    ],
    "s2id": "749e78f16f1c7b84e2a3cd7b598f48ad30a0d354",
    "abstract": "We examine the impact of lost intellectual property protection on innovation, competition, acquisitions, lawsuits and employment agreements. We consider firms whose ability to protect intellectual property (IP) using patents is weakened following the Alice Corp. vs. CLS Bank International Supreme Court decision. This decision has impacted patents in multiple areas including business methods, software, and bioinformatics. We use state-of-the-art large language models (LLM) to identify firms’ existing patent portfolios’ potential exposure to the Alice decision. While all affected firms decrease patenting post-Alice, we find an unequal impact of decreased patent protection. Large affected firms benefit as their sales and market valuations increase, and their exposure to lawsuits decreases. They also acquire fewer firms post-Alice. Small affected firms lose as they face increased competition, product-market encroachment, and lower profits and valuations. They increase R&D and have their employees sign more nondisclosure agreements.",
    "authors": [
        "U. Acikalin",
        "Tolga Caskurlu",
        "Gerard Hoberg",
        "G. Phillips"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "While all affected firms decrease patenting post-Alice, it is found that large affected firms benefit as their sales and market valuations increase, and their exposure to lawsuits decreases, and small firms lose as they face increased competition, product-market encroachment, and lower profits and valuations."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}