{
    "acronym": "74c58985723a439df4736a1c7f885a68aec73c62",
    "title": "Text Fact Transfer",
    "seed_ids": [
        "longformer",
        "37b115139dbeff3ffbcb9927d5383084443c27e2",
        "76912f2d895788189c301286d486b31e5b99a33d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "d0086b86103a620a86bc918746df0aa642e2a8a3"
    ],
    "s2id": "74c58985723a439df4736a1c7f885a68aec73c62",
    "abstract": "Text style transfer is a prominent task that aims to control the style of text without inherently changing its factual content. To cover more text modification applications, such as adapting past news for current events and repurposing educational materials, we propose the task of text fact transfer, which seeks to transfer the factual content of a source text between topics without modifying its style. We find that existing language models struggle with text fact transfer, due to their inability to preserve the specificity and phrasing of the source text, and tendency to hallucinate errors. To address these issues, we design ModQGA, a framework that minimally modifies a source text with a novel combination of end-to-end question generation and specificity-aware question answering. Through experiments on four existing datasets adapted for text fact transfer, we show that ModQGA can accurately transfer factual content without sacrificing the style of the source text.",
    "authors": [
        "Nishant Balepur",
        "Jie Huang",
        "Kevin Chen-Chuan Chang"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "ModQGA, a framework that minimally modifies a source text with a novel combination of end-to-end question generation and specificity-aware question answering, is designed and it is shown that ModQGA can accurately transfer factual content without sacrificing the style of the source text."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}