{
    "acronym": "74f2f110ff83546a413c08b416b0444f329cd1fb",
    "title": "MetaCNN: A New Hybrid Deep Learning Image-based Approach for Vehicle Classification Using Transformer-like Framework",
    "seed_ids": [
        "metaformer"
    ],
    "s2id": "74f2f110ff83546a413c08b416b0444f329cd1fb",
    "abstract": "Abstract—With the development of vehicles and traffic system in the early 21st century, the need for a monitored traffic system and vehicle classification is enlarging. Together with the development of deep learning, computer vision realm has emerged versatile models that is able to fulfill the need of classification. Those popular models include CNN, Vision Trans- former, Metaformer and so on. However, these models handle the problem based on different data processing techniques, they either lacks efficiency or effectiveness. In particular, CNN is shortcoming in global data while ViT is lack of extraction of local information. Therefore, based on this research gap, we proposed a model called MetaCNN, which combines CNN and Poolformer – a specific metaformer structure, which takes the strength of the two models and compensate for both models’ deficiencies. Finally, in order to verify the feasibility of our model, we tested our model on a real-world remote sensing datasets of vehicle images in six different regions with different weather conditions. Our model MetaCNN has demonstrated better recognition performance compared to other baseline models. The results further prove that our model MetaCNN is adept at vehicle classification of remote sensing images though under complex scenarios",
    "authors": [
        "Juntian Chen",
        "Ruikang Luo"
    ],
    "venue": "International Conference on Computer Science and Software Engineering",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A model called MetaCNN is proposed, which combines CNN and Poolformer – a specific metaformer structure, which takes the strength of the two models and compensate for both models’ deficiencies, and has demonstrated better recognition performance compared to other baseline models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}