{
    "acronym": "75173d3be4ca20e92f1d365f256d4e578b659bd6",
    "title": "Exploring the role of AI in classifying, analyzing, and generating case reports on assisted suicide cases: feasibility and ethical implications",
    "seed_ids": [
        "bert",
        "94ce1d5924e05e8d75e43ce70044293ddcef850a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "75173d3be4ca20e92f1d365f256d4e578b659bd6",
    "abstract": "This paper presents a study on the use of AI models for the classification of case reports on assisted suicide procedures. The database of the five Dutch regional bioethics committees was scraped to collect the 72 case reports available in English. We trained several AI models for classification according to the categories defined by the Dutch Termination of Life on Request and Assisted Suicide (Review Procedures) Act. We also conducted a related project to fine-tune an OpenAI GPT-3.5-turbo large language model for generating new fictional but plausible cases. As AI is increasingly being used for judgement, it is possible to imagine an application in decision-making regarding assisted suicide. Here we explore two arising questions: feasibility and ethics, with the aim of contributing to a critical assessment of the potential role of AI in decision-making in highly sensitive areas.",
    "authors": [
        "Giovanni Spitale",
        "Gerold Schneider",
        "Federico Germani",
        "Nikola Biller-Andorno"
    ],
    "venue": "Frontiers Artif. Intell.",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A study on the use of AI models for the classification of case reports on assisted suicide procedures using the database of the five Dutch regional bioethics committees, with the aim of contributing to a critical assessment of the potential role of AI in decision-making in highly sensitive areas."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}