{
    "acronym": "75352cc69a29bd5fc411e0e79737cb96b6309161",
    "title": "Distilling Knowledge Learned in BERT for Text Generation",
    "seed_ids": [
        "lighdynconv",
        "80cf2a6af4200ecfca1c18fc89de16148f1cd4bf",
        "7a09101ac03b74db501648597fa54e992a0fc84f",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc"
    ],
    "s2id": "75352cc69a29bd5fc411e0e79737cb96b6309161",
    "abstract": "Large-scale pre-trained language model such as BERT has achieved great success in language understanding tasks. However, it remains an open question how to utilize BERT for language generation. In this paper, we present a novel approach, Conditional Masked Language Modeling (C-MLM), to enable the finetuning of BERT on target generation tasks. The finetuned BERT (teacher) is exploited as extra supervision to improve conventional Seq2Seq models (student) for better text generation performance. By leveraging BERT’s idiosyncratic bidirectional nature, distilling knowledge learned in BERT can encourage auto-regressive Seq2Seq models to plan ahead, imposing global sequence-level supervision for coherent text generation. Experiments show that the proposed approach significantly outperforms strong Transformer baselines on multiple language generation tasks such as machine translation and text summarization. Our proposed model also achieves new state of the art on IWSLT German-English and English-Vietnamese MT datasets.",
    "authors": [
        "Yen-Chun Chen",
        "Zhe Gan",
        "Yu Cheng",
        "Jingzhou Liu",
        "Jingjing Liu"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel approach, Conditional Masked Language Modeling (C-MLM), is presented to enable the finetuning of BERT on target generation tasks, which significantly outperforms strong Transformer baselines on multiple language generation tasks such as machine translation and text summarization."
    },
    "citationCount": 114,
    "influentialCitationCount": 12,
    "code": null,
    "description": null,
    "url": null
}