{
    "acronym": "759aeb70ea225f178657c06cd15cb8f465f6a296",
    "title": "Transformer Models for Acute Brain Dysfunction Prediction",
    "seed_ids": [
        "longformer",
        "transformerxl",
        "737a4a6da8c790bcc29f57182c601ebbcd5b59a6",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "759aeb70ea225f178657c06cd15cb8f465f6a296",
    "abstract": "Acute brain dysfunctions (ABD), which include coma and delirium, are prevalent in the ICU, especially among older patients. The current approach in manual assessment of ABD by care providers may be sporadic and subjective. Hence, there exists a need for a data-driven robust system automating the assessment and prediction of ABD. In this work, we develop a machine learning system for real-time prediction of ADB using Electronic Health Record (HER) data. Our data processing pipeline enables integration of static and temporal data, and extraction of features relevant to ABD. We train several state-of-the-art transformer models and baseline machine learning models including CatBoost and XGB on the data that was collected from patients admitted to the ICU at UF Shands Hospital. We demonstrate the efficacy of our system for tasks related to acute brain dysfunction including binary classification of brain acuity and multi-class classification (i.e., coma, delirium, death, or normal), achieving a mean AUROC of 0.953 on our Long-former implementation. Our system can then be deployed for real-time prediction of ADB in ICUs to reduce the number of incidents caused by ABD. Moreover, the real-time system has the potential to reduce costs, duration of patients stays in the ICU, and mortality among those afflicted.",
    "authors": [
        "B. Silva",
        "Miguel Contreras",
        "T. Ozrazgat-Baslanti",
        "Yuanfang Ren",
        "Ziyuan Guan",
        "Kia Khezeli",
        "A. Bihorac",
        "Parisa Rashidi"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work develops a machine learning system for real-time prediction of ADB using Electronic Health Record (HER) data and demonstrates the efficacy of the system for tasks related to acute brain dysfunction including binary classification of brain acuity and multi-class classification."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}