{
    "acronym": "75f1c7dadb4ed733fb4d3a4cc47b9cbde9ad98cc",
    "title": "Combining pre-trained language models and structured knowledge",
    "seed_ids": [
        "gpt",
        "f1957038e9ded19108d3c71340d7462152b70f25",
        "fc89687c64fb17f09f8dc0b0d18115b8c770f8b7",
        "5744f56d3253bd7c4341d36de40a93fceaa266b3",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "0ff7f557203d1489110b9d2f89a76245def7b530",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "75f1c7dadb4ed733fb4d3a4cc47b9cbde9ad98cc",
    "abstract": "In recent years, transformer-based language models have achieved state of the art performance in various NLP benchmarks. These models are able to extract mostly distributional information with some semantics from unstructured text, however it has proven challenging to integrate structured information, such as knowledge graphs into these models. We examine a variety of approaches to integrate structured knowledge into current language models and determine challenges, and possible opportunities to leverage both structured and unstructured information sources. From our survey, we find that there are still opportunities at exploiting adapter-based injections and that it may be possible to further combine various of the explored approaches into one system.",
    "authors": [
        "Pedro Colon-Hernandez",
        "Catherine Havasi",
        "Jason B. Alonso",
        "Matthew Huggins",
        "C. Breazeal"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "From a survey, it is found that there are still opportunities at exploiting adapter-based injections and that it may be possible to further combine various of the explored approaches into one system."
    },
    "citationCount": 43,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}