{
    "acronym": "75f314a98e30c8eb93618ecbb0a488a9a766bcd2",
    "title": "Model Surgery: Modulating LLM's Behavior Via Simple Parameter Editing",
    "seed_ids": [
        "gpt3",
        "edd1dc1e8d7989f36c0e54f69f4aeb5e597edc8b",
        "0f7308fbcae43d22813f70c334c2425df0b1cce1",
        "0b0debb710366cdff461938c80763eace1651af6",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c"
    ],
    "s2id": "75f314a98e30c8eb93618ecbb0a488a9a766bcd2",
    "abstract": "Large Language Models (LLMs) have demonstrated great potential as generalist assistants, showcasing powerful task understanding and problem-solving capabilities. To deploy LLMs as AI assistants, it is crucial that these models exhibit desirable behavioral traits, such as non-toxicity and resilience against jailbreak attempts. Current methods for detoxification or preventing jailbreaking usually involve Supervised Fine-Tuning (SFT) or Reinforcement Learning from Human Feedback (RLHF), which requires finetuning billions of parameters through gradient descent with substantial computation cost. Furthermore, models modified through SFT and RLHF may deviate from the pretrained models, potentially leading to a degradation in foundational LLM capabilities. In this paper, we observe that surprisingly, directly editing a small subset of parameters can effectively modulate specific behaviors of LLMs, such as detoxification and resistance to jailbreaking. Specifically, for a behavior that we aim to avoid, we employ a linear classifier, which we term the behavior probe, to classify binary behavior labels within the hidden state space of the LLM. Using this probe, we introduce an algorithm to identify a critical subset of LLM parameters that significantly influence this targeted behavior. Then we directly edit these selected parameters by shifting them towards the behavior probe. Such a direct parameter editing method necessitates only inference-level computational resources. Experiments demonstrate that in the representative detoxification task, our approach achieves reductions of up to 90.0\\% in toxicity on the RealToxicityPrompts dataset and 49.2\\% on ToxiGen, while maintaining the LLM's general capabilities in areas such as common sense, question answering, and mathematics. Our code is available at https://github.com/lucywang720/model-surgery.",
    "authors": [
        "Huanqian Wang",
        "Yang Yue",
        "Rui Lu",
        "Jingxin Shi",
        "Andrew Zhao",
        "Shenzhi Wang",
        "Shiji Song",
        "Gao Huang"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is observed that surprisingly, directly editing a small subset of parameters can effectively modulate specific behaviors of LLMs, such as detoxification and resistance to jailbreaking."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}