{
    "acronym": "7686dd5af047025a8badb2cfd91e3a2cab6a4b96",
    "title": "Saturn: Sample-efficient Generative Molecular Design using Memory Manipulation",
    "seed_ids": [
        "transformer",
        "gpt2",
        "mamba",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7686dd5af047025a8badb2cfd91e3a2cab6a4b96",
    "abstract": "Generative molecular design for drug discovery has very recently achieved a wave of experimental validation, with language-based backbones being the most common architectures employed. The most important factor for downstream success is whether an in silico oracle is well correlated with the desired end-point. To this end, current methods use cheaper proxy oracles with higher throughput before evaluating the most promising subset with high-fidelity oracles. The ability to directly optimize high-fidelity oracles would greatly enhance generative design and be expected to improve hit rates. However, current models are not efficient enough to consider such a prospect, exemplifying the sample efficiency problem. In this work, we introduce Saturn, which leverages the Augmented Memory algorithm and demonstrates the first application of the Mamba architecture for generative molecular design. We elucidate how experience replay with data augmentation improves sample efficiency and how Mamba synergistically exploits this mechanism. Saturn outperforms 22 models on multi-parameter optimization tasks relevant to drug discovery and may possess sufficient sample efficiency to consider the prospect of directly optimizing high-fidelity oracles.",
    "authors": [
        "Jeff Guo",
        "Philippe Schwaller"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Saturn is introduced, which leverages the Augmented Memory algorithm and demonstrates the first application of the Mamba architecture for generative molecular design, and it is elucidated how experience replay with data augmentation improves sample efficiency and how Mamba synergistically exploits this mechanism."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}