{
    "acronym": "76c0b2cd188eae0f1efcf7494982fd3e11d3d494",
    "title": "TrajSGAN: A Semantic-Guiding Adversarial Network for Urban Trajectory Generation",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "76c0b2cd188eae0f1efcf7494982fd3e11d3d494",
    "abstract": "Simulating human mobility contributes to city behavior discovery and decision-making. Although the sequence-based and image-based approaches have made impressive achievements, they still suffer from respective deficiencies such as omitting the depiction of spatial properties or ordinal dependency in trajectory. In this article, we take advantage of the above two paradigms and propose a semantic-guiding adversarial network (TrajSGAN) for generating human trajectories. Specifically, we first devise an attention-based generator to yield trajectory locations in a sequence-to-sequence manner. The encoded historical visits are queried with semantic knowledge (e.g., travel modes and trip purposes) and their important features are enhanced by the multihead attention mechanism. Then, we designate a rollout module to complete the unfinished trajectory sequence and transform it into an image that can depict its spatial structure. Finally, a convolutional neural network (CNN)-based discriminator signifies how “real” the trajectory image looks, and its output is regarded as a reward signal to update the generator by the policy gradient. Experimental results show that the proposed TrajSGAN model significantly outperforms the benchmarks under the MTL-Trajet mobility dataset, with the divergence of spatial-related metrics such as radius of gyration and travel distance reduced by 10%–27%. Furthermore, we apply the real and synthetic trajectories, respectively, to simulate the COVID-19 epidemic spreading under three preventive actions. The coefficient of determination metric between real and synthetic results achieves 91%–98%, indicating that the synthesized data from TrajSGAN can be leveraged to study the epidemic diffusion with an acceptable difference. All of these results verify the superiority and utility of our proposed method.",
    "authors": [
        "Gang Xiong",
        "Zhishuai Li",
        "Meihua Zhao",
        "Yu Zhang",
        "Q. Miao",
        "Yisheng Lv",
        "Fei Wang"
    ],
    "venue": "IEEE Transactions on Computational Social Systems",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Experimental results show that the proposed TrajSGAN model significantly outperforms the benchmarks under the MTL-Trajet mobility dataset, with the divergence of spatial-related metrics such as radius of gyration and travel distance reduced by 10%–27%."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}