{
    "acronym": "776322fc124c01e0ac3aba333264286074b1313d",
    "title": "Arabic text sentiment analysis and emotion classification using transformers",
    "seed_ids": [
        "bert",
        "7b49bcd9fd53158a57d158550461bcb72ac83fbc",
        "6f68e1bb253925d8431588555d3010419f322e04"
    ],
    "s2id": "776322fc124c01e0ac3aba333264286074b1313d",
    "abstract": "Sentiment analysis and emotion classification are two crucial components of natural language processing (NLP), which have been widely explored in recent years due to their broad applications. Sentiment analysis aims to identify the polarity of written texts, ranging from positive to negative. Meanwhile, emotion classification is focused on recognizing and categorizing the emotional states expressed in the text. To achieve a deeper understanding of sentiments and emotions, it's essential to utilize models like BERT transformers that can effectively interpret the context. The process begins with data preprocessing, including tokenization and noise removal, followed by fine-tuning techniques to adapt the BERT model to the proposed tasks. We employed the BERT model on four datasets obtained from various sources, including Twitter, news websites, and restaurant reviews, where each dataset represents a distinct Arabic dialect. Our proposed model outperforms commonly used techniques like LSTM and CNN, yielding superior results. Despite the progress made, there are still challenges to overcome, such as dealing with Arabic diacritics, the new Arabic Arabizi, which uses Latin characters, and handling Arabic idioms. Further research is required to address these challenges adequately.",
    "authors": [
        "Nada Mossad",
        "Youssef Mohamed",
        "A. Fares",
        "A. Zaky"
    ],
    "venue": "2023 11th International Japan-Africa Conference on Electronics, Communications, and Computations (JAC-ECC)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The BERT model is employed on four datasets obtained from various sources, including Twitter, news websites, and restaurant reviews, where each dataset represents a distinct Arabic dialect, yielding superior results."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}