{
    "acronym": "77b046c5d568b329a927cfc895ea2e6c8f43ff43",
    "title": "The Languini Kitchen: Enabling Language Modelling Research at Different Scales of Compute",
    "seed_ids": [
        "gpt2",
        "11cf88dce827bd67cbfa60400306318022e736d5",
        "2a38daf98d506477f8180806f503409d5036eaf4",
        "b069c32fcd77160f944ab3ba71ab6f0cfb782c68",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "68adb03744692247fb834406798894db9fe77010",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "6edccbd83a9aae204785d4821f97855677c33866",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "746a9b434d05b47beb1bd6a96f4d5c89d9d8bd0a",
        "736eb449526fe7128917954ec5532b59e318ec78",
        "4fd61f6b860acc9c5da8766b7c9064f0ec896301",
        "79b4ec1aaf67a04a9afa0d8138f84b7be66c00cb",
        "1a703f08da01cf737cce3fb9064259b3f4b44e9c",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "f51497f463566581874c941353dd9d80069c5b77",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "3694381e74445a8b9f8cb8d373e39626e47191b5",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "77b046c5d568b329a927cfc895ea2e6c8f43ff43",
    "abstract": "The Languini Kitchen serves as both a research collective and codebase designed to empower researchers with limited computational resources to contribute meaningfully to the field of language modelling. We introduce an experimental protocol that enables model comparisons based on equivalent compute, measured in accelerator hours. The number of tokens on which a model is trained is defined by the model's throughput and the chosen compute class. Notably, this approach avoids constraints on critical hyperparameters which affect total parameters or floating-point operations. For evaluation, we pre-process an existing large, diverse, and high-quality dataset of books that surpasses existing academic benchmarks in quality, diversity, and document length. On it, we compare methods based on their empirical scaling trends which are estimated through experiments at various levels of compute. This work also provides two baseline models: a feed-forward model derived from the GPT-2 architecture and a recurrent model in the form of a novel LSTM with ten-fold throughput. While the GPT baseline achieves better perplexity throughout all our levels of compute, our LSTM baseline exhibits a predictable and more favourable scaling law. This is due to the improved throughput and the need for fewer training tokens to achieve the same decrease in test perplexity. Extrapolating the scaling laws leads of both models results in an intersection at roughly 50,000 accelerator hours. We hope this work can serve as the foundation for meaningful and reproducible language modelling research.",
    "authors": [
        "Aleksandar Stanic",
        "Dylan R. Ashley",
        "Oleg Serikov",
        "Louis Kirsch",
        "Francesco Faccio",
        "J. Schmidhuber",
        "Thomas Hofmann",
        "Imanol Schlag"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An experimental protocol is introduced that enables model comparisons based on equivalent compute, measured in accelerator hours, and provides two baseline models: a feed-forward model derived from the GPT-2 architecture and a recurrent model in the form of a novel LSTM with ten-fold throughput."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}