{
    "acronym": "785650a805851c7e945523e495c5a523c60f72a4",
    "title": "Open-Ended Medical Visual Question Answering Through Prefix Tuning of Language Models",
    "seed_ids": [
        "gpt2",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "785650a805851c7e945523e495c5a523c60f72a4",
    "abstract": "Medical Visual Question Answering (VQA) is an important challenge, as it would lead to faster and more accurate diagnoses and treatment decisions. Most existing methods approach it as a multi-class classification problem, which restricts the outcome to a predefined closed-set of curated answers. We focus on open-ended VQA and motivated by the recent advances in language models consider it as a generative task. Leveraging pre-trained language models, we introduce a novel method particularly suited for small, domain-specific, medical datasets. To properly communicate the medical images to the language model, we develop a network that maps the extracted visual features to a set of learnable tokens. Then, alongside the question, these learnable tokens directly prompt the language model. We explore recent parameter-efficient fine-tuning strategies for language models, which allow for resource- and data-efficient fine-tuning. We evaluate our approach on the prime medical VQA benchmarks, namely, Slake, OVQA and PathVQA. The results demonstrate that our approach outperforms existing methods across various training settings while also being computationally efficient.",
    "authors": [
        "Tom van Sonsbeek",
        "Mohammad Mahdi Derakhshani",
        "Ivona Najdenkoska",
        "Cees G. M. Snoek",
        "M. Worring"
    ],
    "venue": "International Conference on Medical Image Computing and Computer-Assisted Intervention",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work focuses on open-ended VQA and motivated by the recent advances in language models consider it as a generative task, and introduces a novel method particularly suited for small, domain-specific, medical datasets."
    },
    "citationCount": 28,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}