{
    "acronym": "785edb37aff618b07418af2333a5023c7927c1d4",
    "title": "An Efficient and Uncertainty-Aware Decision Support System for Disaster Response Using Aerial Imagery",
    "seed_ids": [
        "fnet",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f"
    ],
    "s2id": "785edb37aff618b07418af2333a5023c7927c1d4",
    "abstract": "Efficient and robust search and rescue actions are always required when natural or technical disasters occur. Empowered by remote sensing techniques, building damage assessment can be achieved by fusing aerial images of pre- and post-disaster environments through computational models. Existing methods pay over-attention to assessment accuracy without considering model efficiency and uncertainty quantification in such a life-critical application. Thus, this article proposes an efficient and uncertain-aware decision support system (EUDSS) that evolves the recent computational models into an efficient decision support system, realizing the uncertainty during building damage assessment (BDA). Specifically, a new efficient and uncertain-aware BDA integrates the recent advances in computational models such as Fourier attention and Monte Carlo Dropout for uncertainty quantification efficiently. Meanwhile, a robust operation (RO) procedure is designed to invite experts for manual reviews if the uncertainty is high due to external factors such as cloud clutter and poor illumination. This procedure can prevent rescue teams from missing damaged houses during operations. The effectiveness of the proposed system is demonstrated on a public dataset from both quantitative and qualitative perspectives. The solution won the first place award in International Overhead Imagery Hackathon.",
    "authors": [
        "Junchi Bin",
        "Ran Zhang",
        "Rui Wang",
        "Yue Cao",
        "Yufeng Zheng",
        "E. Blasch",
        "Zheng Liu"
    ],
    "venue": "Italian National Conference on Sensors",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new efficient and uncertain-aware BDA integrates the recent advances in computational models such as Fourier attention and Monte Carlo Dropout for uncertainty quantification efficiently and is demonstrated on a public dataset from both quantitative and qualitative perspectives."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}