{
    "acronym": "78b21653ab9ee19daef71f7856bed8060c20c2b6",
    "title": "Deep Learning for Satellite Image Time Series Analysis: A Review",
    "seed_ids": [
        "transformer",
        "2b7b7eb96fc30089d53e92ad97ac2db0035dc3cb",
        "a8427ce5aee6d62800c725588e89940ed4910e0d"
    ],
    "s2id": "78b21653ab9ee19daef71f7856bed8060c20c2b6",
    "abstract": "Earth observation (EO) satellite missions have been providing detailed images about the state of the Earth and its land cover for over 50 years. Long term missions, such as NASA's Landsat, Terra, and Aqua satellites, and more recently, the ESA's Sentinel missions, record images of the entire world every few days. Although single images provide point-in-time data, repeated images of the same area, or satellite image time series (SITS) provide information about the changing state of vegetation and land use. These SITS are useful for modeling dynamic processes and seasonal changes such as plant phenology. They have potential benefits for many aspects of land and natural resource management, including applications in agricultural, forest, water, and disaster management, urban planning, and mining. However, the resulting satellite image time series (SITS) are complex, incorporating information from the temporal, spatial, and spectral dimensions. Therefore, deep learning methods are often deployed as they can analyze these complex relationships. This review presents a summary of the state-of-the-art methods of modelling environmental, agricultural, and other Earth observation variables from SITS data using deep learning methods. We aim to provide a resource for remote sensing experts interested in using deep learning techniques to enhance Earth observation models with temporal information.",
    "authors": [
        "Lynn Miller",
        "Charlotte Pelletier",
        "Geoffrey I. Webb"
    ],
    "venue": "IEEE Geoscience and Remote Sensing Magazine",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This review presents a summary of the state-of-the-art methods of modelling environmental, agricultural, and other Earth observation variables from SITS data using deep learning methods and aims to provide a resource for remote sensing experts interested in using deep learning techniques to enhance Earth observation models with temporal information."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}