{
    "acronym": "78ce73086823e68db4571364b0df146a1d3544ec",
    "title": "Natural Language Processing Methods for Symbolic Music Generation and Information Retrieval: a Survey",
    "seed_ids": [
        "gpt2",
        "bert",
        "493e1ba13e1ee7a67dbac53a8a0ff8aecde2e54f",
        "5bdca463873f4f2dfc6897b6c5fd51e799bd76c7",
        "c49c1a348637ebc5ee52cf5e6d38980a189048ee",
        "c4494280e557ae1a5d4c34c854c4350f4ea3c912",
        "f9fff0d57ea37ec2a3a47bdbb8ced605e43f6b87",
        "1306680402070eecd37da6bb0d531017166c5f80",
        "f07c5c540233b22f0ca154c80c713e2aed3c9606",
        "08ffdec40291a2ccb5f8a6cc048b01247fb34b96",
        "fda805c6e85a03d10549acdc5489420ca8f3d405",
        "eb0931c39904a40c6cb4aa35c9b21d5e3b7dc856",
        "4c64c35198453662882afd63d618a832c7d8c1b2",
        "ad4c63d617d89ac82ad3fd1dfa68a9f2afa84443",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "e092ecf56fcca38d0cd6fe9e1e6b11c380f6c286",
        "ce510c6cfeac703706460680e977c54554840830",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "24a70db0bbb5f486126477e32a6a44ab917a4b11",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "78ce73086823e68db4571364b0df146a1d3544ec",
    "abstract": "Several adaptations of Transformers models have been developed in various domains since its breakthrough in Natural Language Processing (NLP). This trend has spread into the field of Music Information Retrieval (MIR), including studies processing music data. However, the practice of leveraging NLP tools for symbolic music data is not novel in MIR. Music has been frequently compared to language, as they share several similarities, including sequential representations of text and music. These analogies are also reflected through similar tasks in MIR and NLP. This survey reviews NLP methods applied to symbolic music generation and information retrieval studies following two axes. We first propose an overview of representations of symbolic music adapted from natural language sequential representations. Such representations are designed by considering the specificities of symbolic music. These representations are then processed by models. Such models, possibly originally developed for text and adapted for symbolic music, are trained on various tasks. We describe these models, in particular deep learning models, through different prisms, highlighting music-specialized mechanisms. We finally present a discussion surrounding the effective use of NLP tools for symbolic music data. This includes technical issues regarding NLP methods and fundamental differences between text and music, which may open several doors for further research into more effectively adapting NLP tools to symbolic MIR.",
    "authors": [
        "Dinh-Viet-Toan Le",
        "Louis Bigo",
        "Mikaela Keller",
        "Dorien Herremans"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey reviews NLP methods applied to symbolic music generation and information retrieval studies following two axes and proposes an overview of representations of symbolic music adapted from natural language sequential representations."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}