{
    "acronym": "78d70680a91024b0485ddfa55753e9a0676df7be",
    "title": "SG-Net: Syntax Guided Transformer for Language Representation",
    "seed_ids": [
        "gpt",
        "5744f56d3253bd7c4341d36de40a93fceaa266b3",
        "67b1f8e48118bb1aa250f400d475425317bf4117",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "8f346de21a13dacf5b65e2de81e84d54226a5b9f"
    ],
    "s2id": "78d70680a91024b0485ddfa55753e9a0676df7be",
    "abstract": "Understanding human language is one of the key themes of artificial intelligence. For language representation, the capacity of effectively modeling the linguistic knowledge from the detail-riddled and lengthy texts and getting ride of the noises is essential to improve its performance. Traditional attentive models attend to all words without explicit constraint, which results in inaccurate concentration on some dispensable words. In this work, we propose using syntax to guide the text modeling by incorporating explicit syntactic constraints into attention mechanisms for better linguistically motivated word representations. In detail, for self-attention network (SAN) sponsored Transformer-based encoder, we introduce syntactic dependency of interest (SDOI) design into the SAN to form an SDOI-SAN with syntax-guided self-attention. Syntax-guided network (SG-Net) is then composed of this extra SDOI-SAN and the SAN from the original Transformer encoder through a dual contextual architecture for better linguistics inspired representation. The proposed SG-Net is applied to typical Transformer encoders. Extensive experiments on popular benchmark tasks, including machine reading comprehension, natural language inference, and neural machine translation show the effectiveness of the proposed SG-Net design.",
    "authors": [
        "Zhuosheng Zhang",
        "Yuwei Wu",
        "Junru Zhou",
        "Sufeng Duan",
        "Hai Zhao",
        "Rui Wang"
    ],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes using syntax to guide the text modeling by incorporating explicit syntactic constraints into attention mechanisms for better linguistically motivated word representations and shows the effectiveness of the proposed SG-Net design."
    },
    "citationCount": 30,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}