{
    "acronym": "78e54be73d00ab640248d2ec69ba59a243ff4810",
    "title": "MRL-Net: Multi-Scale Representation Learning Network for COVID-19 Lung CT Image Segmentation",
    "seed_ids": [
        "metaformer",
        "d1869155960e4b1b882b39171dbecd25a7eda3cd",
        "dd1139cfc609c2f3263d02e97176d5275caebc0a",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "78e54be73d00ab640248d2ec69ba59a243ff4810",
    "abstract": "Accuracy segmentation of COVID-19 lesions in lung CT images can aid patient screening and diagnosis. However, the blurred, inconsistent shape and location of the lesion area poses a great challenge to this vision task. To tackle this issue, we propose a multi-scale representation learning network (MRL-Net) that integrates CNN with Transformer via two bridge unit: Dual Multi-interaction Attention (DMA) and Dual Boundary Attention (DBA). First, to obtain multi-scale local detailed feature and global contextual information, we combine low-level geometric information and high-level semantic features extracted by CNN and Transformer, respectively. Secondly, for enhanced feature representation, DMA is proposed to fuse the local detailed feature of CNN and the global context information of Transformer. Finally, DBA makes our network focus on the boundary features of the lesion, further enhancing the representational learning. Amounts of experimental results show that MRL-Net is superior to current state-of-the-art methods and achieves better COVID-19 image segmentation performance.",
    "authors": [
        "Shangwang Liu",
        "Tongbo Cai",
        "X. Tang",
        "Changgeng Wang"
    ],
    "venue": "IEEE journal of biomedical and health informatics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A multi-scale representation learning network (MRL-Net) that integrates CNN with Transformer via two bridge unit: Dual Multi-interaction attention (DMA) and Dual Boundary Attention (DBA) that achieves better COVID-19 image segmentation performance."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}