{
    "acronym": "794b78f530f00c354f19016edc1dbd5a6c2b2884",
    "title": "The hybrid of BERT and deep learning models for Indonesian sentiment analysis",
    "seed_ids": [
        "bert"
    ],
    "s2id": "794b78f530f00c354f19016edc1dbd5a6c2b2884",
    "abstract": "Artificial intelligence (AI) is one example of how data science innovation has advanced quickly in recent years and has greatly improved human existence. Neural networks, which are a type of machine learning model, are a fundamental component of deep learning in the field of AI. Deep learning models can carry out feature extraction and classification tasks in a single design because of their numerous neural network layers. Modern machine learning algorithms have been shown to perform worse than this model on tasks including text classification, audio recognition, imaginary, and pattern recognition. Deep learning models have outperformed AI-based methods in sentiment analysis and other text categorization tasks. Text data can originate from a number of places, including social media. Sentiment analysis is the computational examination of textual expressions of ideas and feelings. This study employs the convolutional neural network (CNN), long-short term memory (LSTM), CNN-LSTM, and LSTM-CNN models in a deep learning framework using bidirectional encoder representations from transformers (BERT) data representation to assess the performance of machine learning. The implementation of the model utilises YouTube discussion data pertaining to political films associated with the Indonesian presidential election of 2024. Confusion metrics, including as accuracy, precision, and recall, are then used to analyse the model’s performance.",
    "authors": [
        "Dwi Guna Mandhasiya",
        "H. Murfi",
        "A. Bustamam"
    ],
    "venue": "Indonesian Journal of Electrical Engineering and Computer Science",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study employs the convolutional neural network (CNN), long-short term memory (LSTM), CNN-LSTM, and LSTM-CNN models in a deep learning framework using bidirectional encoder representations from transformers (BERT) data representation to assess the performance of machine learning."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}