{
    "acronym": "795b98c187957919b0d2c12043c4bdbb1be8493e",
    "title": "The Oscars of AI Theater: A Survey on Role-Playing with Language Models",
    "seed_ids": [
        "bert",
        "9cab8c423d9c13d4f35beb97a7f823c250e8f059",
        "17606dbe67df42d973015fdd35f2807b0cafc15b",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c65c96cfc8b448fe9fd6bbfe1aaaea727515f4f7",
        "200050c1f51e2c930e62b078c6ce20f2a6675468",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "791c3c30f2af10ac06f4fbc5b1e8960064aacbc7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "795b98c187957919b0d2c12043c4bdbb1be8493e",
    "abstract": "This survey explores the burgeoning field of role-playing with language models, focusing on their development from early persona-based models to advanced character-driven simulations facilitated by Large Language Models (LLMs). Initially confined to simple persona consistency due to limited model capabilities, role-playing tasks have now expanded to embrace complex character portrayals involving character consistency, behavioral alignment, and overall attractiveness. We provide a comprehensive taxonomy of the critical components in designing these systems, including data, models and alignment, agent architecture and evaluation. This survey not only outlines the current methodologies and challenges, such as managing dynamic personal profiles and achieving high-level persona consistency but also suggests avenues for future research in improving the depth and realism of role-playing applications. The goal is to guide future research by offering a structured overview of current methodologies and identifying potential areas for improvement. Related resources and papers are available at https://github.com/nuochenpku/Awesome-Role-Play-Papers.",
    "authors": [
        "Nuo Chen",
        "Yang Deng",
        "Jia Li"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A structured overview of current methodologies and challenges, such as managing dynamic personal profiles and achieving high-level persona consistency, are outlined and avenues for future research in improving the depth and realism of role-playing applications are suggested."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}