{
    "acronym": "798ecfbc7b5aa81a1d83a721ad1f9b4718fb1ff4",
    "title": "An Integrated Data Processing Framework for Pretraining Foundation Models",
    "seed_ids": [
        "gpt2",
        "117a9f9227ebe4acc67ff8a52eb9db2ab16390c8",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "798ecfbc7b5aa81a1d83a721ad1f9b4718fb1ff4",
    "abstract": "The ability of the foundation models heavily relies on large-scale, diverse, and high-quality pretraining data. In order to improve data quality, researchers and practitioners often have to manually curate datasets from difference sources and develop dedicated data cleansing pipeline for each data repository. Lacking a unified data processing framework, this process is repetitive and cumbersome. To mitigate this issue, we propose a data processing framework that integrates a Processing Module which consists of a series of operators at different granularity levels, and an Analyzing Module which supports probing and evaluation of the refined data. The proposed framework is easy to use and highly flexible. In this demo paper, we first introduce how to use this framework with some example use cases and then demonstrate its effectiveness in improving the data quality with an automated evaluation with ChatGPT and an end-to-end evaluation in pretraining the GPT-2 model. The code and demonstration videos are accessible on GitHub.",
    "authors": [
        "Yiding Sun",
        "Feng Wang",
        "Yutao Zhu",
        "Wayne Xin Zhao",
        "Jiaxin Mao"
    ],
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a data processing framework that integrates a Processing Module which consists of a series of operators at different granularity levels, and an Analyzing Module which supports probing and evaluation of the refined data."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}