{
    "acronym": "79b4ec1aaf67a04a9afa0d8138f84b7be66c00cb",
    "title": "Do Transformer Modifications Transfer Across Implementations and Applications?",
    "seed_ids": [
        "lighdynconv",
        "universaltrans",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "16c844fd4d97f3c6eb38b0d6527c87d184efedc3"
    ],
    "s2id": "79b4ec1aaf67a04a9afa0d8138f84b7be66c00cb",
    "abstract": "The research community has proposed copious modifications to the Transformer architecture since it was introduced over three years ago, relatively few of which have seen widespread adoption. In this paper, we comprehensively evaluate many of these modifications in a shared experimental setting that covers most of the common uses of the Transformer in natural language processing. Surprisingly, we find that most modifications do not meaningfully improve performance. Furthermore, most of the Transformer variants we found beneficial were either developed in the same codebase that we used or are relatively minor changes. We conjecture that performance improvements may strongly depend on implementation details and correspondingly make some recommendations for improving the generality of experimental results.",
    "authors": [
        "Sharan Narang",
        "Hyung Won Chung",
        "Yi Tay",
        "W. Fedus",
        "Thibault Févry",
        "Michael Matena",
        "Karishma Malkan",
        "Noah Fiedel",
        "Noam M. Shazeer",
        "Zhenzhong Lan",
        "Yanqi Zhou",
        "Wei Li",
        "Nan Ding",
        "Jake Marcus",
        "Adam Roberts",
        "Colin Raffel"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is found that most modifications to the Transformer architecture do not meaningfully improve performance, and conjecture that performance improvements may strongly depend on implementation details and correspondingly make some recommendations for improving the generality of experimental results."
    },
    "citationCount": 108,
    "influentialCitationCount": 7,
    "code": null,
    "description": null,
    "url": null
}