{
    "acronym": "79c70362100ad2004f917ec686fdb541f1e0b261",
    "title": "Bias in Opinion Summarisation from Pre-training to Adaptation: A Case Study in Political Bias",
    "seed_ids": [
        "gpt2",
        "5471114e37448bea2457b74894b1ecb92bbcfdf6",
        "b65b7f480a61d3dd31d8117b349cabc87c8ccf6c",
        "c6c7b86dec926578269ae45f83c0b0531923931d",
        "fa51076458b7bcf9a60f476d525755e47199a6d8",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "79c70362100ad2004f917ec686fdb541f1e0b261",
    "abstract": "Opinion summarisation aims to summarise the salient information and opinions presented in documents such as product reviews, discussion forums, and social media texts into short summaries that enable users to effectively understand the opinions therein.Generating biased summaries has the risk of potentially swaying public opinion. Previous studies focused on studying bias in opinion summarisation using extractive models, but limited research has paid attention to abstractive summarisation models. In this study, using political bias as a case study, we first establish a methodology to quantify bias in abstractive models, then trace it from the pre-trained models to the task of summarising social media opinions using different models and adaptation methods. We find that most models exhibit intrinsic bias. Using a social media text summarisation dataset and contrasting various adaptation methods, we find that tuning a smaller number of parameters is less biased compared to standard fine-tuning; however, the diversity of topics in training data used for fine-tuning is critical.",
    "authors": [
        "Nannan Huang",
        "Haytham Fayek",
        "Xiuzhen Zhang"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A methodology to quantify bias in abstractive models is established and it is found that tuning a smaller number of parameters is less biased compared to standard fine-tuning; however, the diversity of topics in training data used for fine-tuning is critical."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}