{
    "acronym": "79f09f72c8b881c7060bb9b1cdf03b929805b22f",
    "title": "A Dual Information Flow Model For Entity Relation Extraction",
    "seed_ids": [
        "bert",
        "2f291b0b59483e9c3c4a3391f34e6b29aff848a1"
    ],
    "s2id": "79f09f72c8b881c7060bb9b1cdf03b929805b22f",
    "abstract": "To leverage the vast amount of enterprise-related data on the Internet and construct an enterprise relation graph, entity relation extraction has received extensive attention. Currently, the research focus of joint entity relation extraction (JERE) models has shifted from the issue of overlapping to the problem of dependency between subtasks. Building upon previous work, this paper further explores the dependence between entity recognition and relation extraction tasks. Firstly, through experiments, this paper discovers the mutual dependency between entity recognition and relation extraction tasks. Then, this paper designs and implements the Dual Information Branch for JERE (DIB) model for joint entity relation extraction. The DIB model employs a dual-branch fusion structure on top of the encoding layer, learning the dependency between entity recognition and relation extraction tasks in both forward and backward propagation. Additionally, to extract enterprise relations and assist in constructing an enterprise relation knowledge graph, we manually annotate the Company dataset, which consists of 1000 prospectuses and 40,000 positive samples, with low overall noise. Finally, experimental results demonstrate that the DIB model achieves superior performance on both Company and NYT dataset.",
    "authors": [
        "Mengjun Du",
        "Qian Jin",
        "Li Ang",
        "Feng Xue",
        "Yang Yi"
    ],
    "venue": "International Conference on Information Science and Engineering",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Dual Information Branch for JERE (DIB) model is designed and implemented, which employs a dual-branch fusion structure on top of the encoding layer, learning the dependency between entity recognition and relation extraction tasks in both forward and backward propagation."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}