{
    "acronym": "7a1069dafaeb484e22f2473d5545f1e45ce30656",
    "title": "Compilable Neural Code Generation with Compiler Feedback",
    "seed_ids": [
        "gpt2",
        "0646bb09db4d1ba24150e69b71edcd4aff691b3c",
        "49cf6a22a5dac5bc98b653534af65ffa0bc0e76d",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "7a15950dc71079285a4eaf195de5aadd87c41b40",
        "40df572b0fbeae0f3db9b364be838c6467d189f2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7a1069dafaeb484e22f2473d5545f1e45ce30656",
    "abstract": "Automatically generating compilable programs with (or without) natural language descriptions has always been a touchstone problem for computational linguistics and automated software engineering. Existing deep-learning approaches model code generation as text generation, either constrained by grammar structures in decoder, or driven by pre-trained language models on large-scale code corpus (e.g., CodeGPT, PLBART, and CodeT5). However, few of them account for compilability of the generated programs. To improve compilability of the generated programs, this paper proposes COMPCODER, a three-stage pipeline utilizing compiler feedback for compilable code generation, including language model fine-tuning, compilability reinforcement, and compilability discrimination. Comprehensive experiments on two code generation tasks demonstrate the effectiveness of our proposed approach, improving the success rate of compilation from 44.18 to 89.18 in code completion on average and from 70.3 to 96.2 in text-to-code generation, respectively, when comparing with the state-of-the-art CodeGPT.",
    "authors": [
        "Xin Wang",
        "Yasheng Wang",
        "Yao Wan",
        "Fei Mi",
        "Yitong Li",
        "Pingyi Zhou",
        "Jin Liu",
        "Hao Wu",
        "Xin Jiang",
        "Qun Liu"
    ],
    "venue": "Findings",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "To improve compilability of the generated programs, this paper proposes COMPCODER, a three-stage pipeline utilizing compiler feedback for compilable code generation, including language model fine-tuning,Compilability reinforcement, and compilabilities discrimination."
    },
    "citationCount": 43,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}