{
    "acronym": "7a30650265477ebe0dc6fc6ce0b54be8644c5226",
    "title": "Origin Tracing and Detecting of LLMs",
    "seed_ids": [
        "gpt2",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "88dd119dba5ee747851ade8f5d517b381614d918",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7a30650265477ebe0dc6fc6ce0b54be8644c5226",
    "abstract": "The extraordinary performance of large language models (LLMs) heightens the importance of detecting whether the context is generated by an AI system. More importantly, while more and more companies and institutions release their LLMs, the origin can be hard to trace. Since LLMs are heading towards the time of AGI, similar to the origin tracing in anthropology, it is of great importance to trace the origin of LLMs. In this paper, we first raise the concern of the origin tracing of LLMs and propose an effective method to trace and detect AI-generated contexts. We introduce a novel algorithm that leverages the contrastive features between LLMs and extracts model-wise features to trace the text origins. Our proposed method works under both white-box and black-box settings therefore can be widely generalized to detect various LLMs.(e.g. can be generalized to detect GPT-3 models without the GPT-3 models). Also, our proposed method requires only limited data compared with the supervised learning methods and can be extended to trace new-coming model origins. We construct extensive experiments to examine whether we can trace the origins of given texts. We provide valuable observations based on the experimental results, such as the difficulty level of AI origin tracing, and the AI origin similarities, and call for ethical concerns of LLM providers. We are releasing all codes and data as a toolkit and benchmark for future AI origin tracing and detecting studies. \\footnote{We are releasing all available resource at \\url{https://github.com/OpenLMLab/}.}",
    "authors": [
        "Linyang Li",
        "Pengyu Wang",
        "Kerong Ren",
        "Tianxiang Sun",
        "Xipeng Qiu"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces a novel algorithm that leverages the contrastive features between LLMs and extracts model-wise features to trace the text origins and proposes an effective method to trace and detect AI-generated contexts."
    },
    "citationCount": 22,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}