{
    "acronym": "7a73cc4bc0ce80661b5acbb51bbde30ea5167280",
    "title": "Your Absorbing Discrete Diffusion Secretly Models the Conditional Distributions of Clean Data",
    "seed_ids": [
        "sedd",
        "d3pms",
        "1bed8c7541381b1f79027c240b64c9276573fc3c",
        "55f1cde49846c58b0bedebde15b8f7d939f39432",
        "ce806f8d32f6fb1eaa821248a1bc4fa2cd949fbb",
        "d9ffb44ee3c8ec0b6692df8a90451384c1edd89b",
        "6827e87642874d9bf69f0f1548d79a164aaa5e1e",
        "33433e9103b00aa0c42597cbfe13a429fbf5abdf",
        "a979742220a88b1d32e1fbe72c41e8ba3007053c",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "e9b9a47cd81c66603c827f0f2bc4fba0d9ae77c4",
        "7091030c831a81f5968285e91340b9fd5a107f6c",
        "599bc7cfe98c2b57ddbe111412203a636da57be0",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7a73cc4bc0ce80661b5acbb51bbde30ea5167280",
    "abstract": "Discrete diffusion models with absorbing processes have shown promise in language modeling. The key quantities to be estimated are the ratios between the marginal probabilities of two transitive states at all timesteps, called the concrete score. In this paper, we reveal that the concrete score in absorbing diffusion can be expressed as conditional probabilities of clean data, multiplied by a time-dependent scalar in an analytic form. Motivated by this finding, we propose reparameterized absorbing discrete diffusion (RADD), a dedicated diffusion model without time-condition that characterizes the time-independent conditional probabilities. Besides its simplicity, RADD can reduce the number of function evaluations (NFEs) by caching the output of the time-independent network when the noisy sample remains unchanged in a sampling interval. Empirically, RADD is up to 3.5 times faster while achieving similar performance with the strongest baseline. Built upon the new perspective of conditional distributions, we further unify absorbing discrete diffusion and any-order autoregressive models (AO-ARMs), showing that the upper bound on the negative log-likelihood for the diffusion model can be interpreted as an expected negative log-likelihood for AO-ARMs. Further, our RADD models achieve SOTA performance among diffusion models on 5 zero-shot language modeling benchmarks (measured by perplexity) at the GPT-2 scale. Our code is available at https://github.com/ML-GSAI/RADD.",
    "authors": [
        "Jingyang Ou",
        "Shen Nie",
        "Kaiwen Xue",
        "Fengqi Zhu",
        "Jiacheng Sun",
        "Zhenguo Li",
        "Chongxuan Li"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is revealed that the concrete score in absorbing diffusion can be expressed as conditional probabilities of clean data, multiplied by a time-dependent scalar in an analytic form, and reparameterized absorbing discrete diffusion (RADD) is proposed, a dedicated diffusion model without time-condition that characterizes the time-independent conditional probabilities."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}