{
    "acronym": "7a8a69d1ee140274dab4e63109cfd8513be127af",
    "title": "AdaZeta: Adaptive Zeroth-Order Tensor-Train Adaption for Memory-Efficient Large Language Models Fine-Tuning",
    "seed_ids": [
        "gpt3",
        "85a3a45f13c35ca460132db0f4ba713cb955ed1b",
        "21032d1669b7e6fc58ef3a272e6a2f1f4ba15f10",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "7a8a69d1ee140274dab4e63109cfd8513be127af",
    "abstract": "Fine-tuning large language models (LLMs) has achieved remarkable performance across various natural language processing tasks, yet it demands more and more memory as model sizes keep growing. To address this issue, the recently proposed Memory-efficient Zeroth-order (MeZO) methods attempt to fine-tune LLMs using only forward passes, thereby avoiding the need for a backpropagation graph. However, significant performance drops and a high risk of divergence have limited their widespread adoption. In this paper, we propose the Adaptive Zeroth-order Tensor-Train Adaption (AdaZeta) framework, specifically designed to improve the performance and convergence of the ZO methods. To enhance dimension-dependent ZO estimation accuracy, we introduce a fast-forward, low-parameter tensorized adapter. To tackle the frequently observed divergence issue in large-scale ZO fine-tuning tasks, we propose an adaptive query number schedule that guarantees convergence. Detailed theoretical analysis and extensive experimental results on Roberta-Large and Llama-2-7B models substantiate the efficacy of our AdaZeta framework in terms of accuracy, memory efficiency, and convergence speed.",
    "authors": [
        "Yifan Yang",
        "Kai Zhen",
        "Ershad Banijamal",
        "Athanasios Mouchtaris",
        "Zheng Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Adaptive Zeroth-order Tensor-Train Adaption (AdaZeta) framework is proposed, specifically designed to improve the performance and convergence of the ZO methods, and a fast-forward, low-parameter tensorized adapter is introduced to enhance dimension-dependent ZO estimation accuracy."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}