{
    "acronym": "7aa47e08e3b32f6e2089829737ec684cbf9b34ae",
    "title": "MindDial: Belief Dynamics Tracking with Theory-of-Mind Modeling for Situated Neural Dialogue Generation",
    "seed_ids": [
        "gpt2",
        "88a9924ba302f9c5c8065d9e38798e9506c5b171",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7aa47e08e3b32f6e2089829737ec684cbf9b34ae",
    "abstract": "Humans talk in free-form while negotiating the expressed meanings or common ground. Despite the impressive conversational abilities of the large generative language models, they do not consider the individual differences in contextual understanding in a shared situated environment. In this work, we propose MindDial, a novel conversational framework that can generate situated free-form responses to negotiate common ground. We design an explicit mind module that can track three-level beliefs – the speaker’s belief, the speaker’s prediction of the listener’s belief, and the common belief based on the gap between the ﬁrst two. Then the speaking act classiﬁcation head will decide to continue to talk, end this turn, or take task-related action. We augment a common ground alignment dataset MutualFriend [1] with belief dynamics annotation, of which the goal is to ﬁnd a single mutual friend based on the free chat between two agents. Experiments show that our model with mental state modeling can resemble human responses when",
    "authors": [
        "Shuwen Qiu",
        "Song-Chun Zhu",
        "Zilong Zheng"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "MindDial is proposed, a novel conversational framework that can generate situated free-form responses to negotiate common ground and whose model with mental state modeling can resemble human responses when."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}