{
    "acronym": "7aff3042f45c2c4d349c34509db166a8a7d70771",
    "title": "Analysing Utterances in LLM-Based User Simulation for Conversational Search",
    "seed_ids": [
        "gpt2",
        "gpt3",
        "cadab8d84c0195c752bc06d209c9b41b3fbe5f41",
        "ca545ceefe7c3535ffea0fbcc1cc86bddced3767",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7aff3042f45c2c4d349c34509db166a8a7d70771",
    "abstract": "Clarifying underlying user information needs by asking clarifying questions is an important feature of modern conversational search systems. However, evaluation of such systems through answering prompted clarifying questions requires significant human effort, which can be time-consuming and expensive. In our recent work, we proposed an approach to tackle these issues with a user simulator, USi. Given a description of an information need, USi is capable of automatically answering clarifying questions about the topic throughout the search session. However, while the answers generated by USi are both in line with the underlying information need and in natural language, a deeper understanding of such utterances is lacking. Thus, in this work, we explore utterance formulation of large language model (LLM)–based user simulators. To this end, we first analyze the differences between USi, based on GPT-2, and the next generation of generative LLMs, such as GPT-3. Then, to gain a deeper understanding of LLM-based utterance generation, we compare the generated answers to the recently proposed set of patterns of human-based query reformulations. Finally, we discuss potential applications as well as limitations of LLM-based user simulators and outline promising directions for future work on the topic.",
    "authors": [
        "Ivan Sekulić",
        "Mohammad Alinannejadi",
        "Fabio Crestani"
    ],
    "venue": "ACM Transactions on Intelligent Systems and Technology",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work explores utterance formulation of large language model (LLM)–based user simulators and analyzes the differences between USi, based on GPT-2, and the next generation of generative LLMs, such as GPT-3."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}