{
    "acronym": "7b396b30c19deae2173c23e67ff5cde8f7069874",
    "title": "A Comparative Analysis of Pretrained Language Models for Text-to-Speech",
    "seed_ids": [
        "funneltransformer",
        "7f84d56fb8feb4e50cd6c3da3e3fd4ff6c4772cf",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "e092ecf56fcca38d0cd6fe9e1e6b11c380f6c286",
        "b76e98a0a023d37c6534aa2ead09c8ff595f0bae",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7b396b30c19deae2173c23e67ff5cde8f7069874",
    "abstract": "State-of-the-art text-to-speech (TTS) systems have utilized pretrained language models (PLMs) to enhance prosody and create more natural-sounding speech. However, while PLMs have been extensively researched for natural language understanding (NLU), their impact on TTS has been overlooked. In this study, we aim to address this gap by conducting a comparative analysis of different PLMs for two TTS tasks: prosody prediction and pause prediction. Firstly, we trained a prosody prediction model using 15 different PLMs. Our findings revealed a logarithmic relationship between model size and quality, as well as significant performance differences between neutral and expressive prosody. Secondly, we employed PLMs for pause prediction and found that the task was less sensitive to small models. We also identified a strong correlation between our empirical results and the GLUE scores obtained for these language models. To the best of our knowledge, this is the first study of its kind to investigate the impact of different PLMs on TTS.",
    "authors": [
        "M. G. Moya",
        "Panagiota Karanasou",
        "S. Karlapati",
        "Bastian Schnell",
        "Nicole Peinelt",
        "A. Moinet",
        "Thomas Drugman"
    ],
    "venue": "Speech Synthesis Workshop",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A comparative analysis of different PLMs for two TTS tasks: prosody prediction and pause prediction revealed a logarithmic relationship between model size and quality, as well as significant performance differences between neutral and expressive prosody."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}