{
    "acronym": "7b49bcd9fd53158a57d158550461bcb72ac83fbc",
    "title": "Overview of the Transformer-based Models for NLP Tasks",
    "seed_ids": [
        "gpt",
        "069e0d896da7c79faeee4cf057548d5da7ce885e",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9f1c5777a193b2c3bb2b25e248a156348e5ba56d",
        "16c844fd4d97f3c6eb38b0d6527c87d184efedc3",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7b49bcd9fd53158a57d158550461bcb72ac83fbc",
    "abstract": "In 2017, Vaswani et al. proposed a new neural network architecture named Transformer. That modern architecture quickly revolutionized the natural language processing world. Models like GPT and BERT relying on this Transformer architecture have fully outperformed the previous state-of-theart networks. It surpassed the earlier approaches by such a wide margin that all the recent cutting edge models seem to rely on these Transformer-based architectures. In this paper, we provide an overview and explanations of the latest models. We cover the auto-regressive models such as GPT, GPT-2 and XLNET, as well as the auto-encoder architecture such as BERT and a lot of post-BERT models like RoBERTa, ALBERT, ERNIE 1.0/2.0.",
    "authors": [
        "Anthony Gillioz",
        "Jacky Casas",
        "E. Mugellini",
        "Omar Abou Khaled"
    ],
    "venue": "Conference on Computer Science and Information Systems",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper provides an overview and explanations of the latest auto-regressive models such as GPT, GPT-2 and XLNET, as well as the auto-encoder architecture such as BERT and a lot of post-BERT models like RoBERTa, ALBERT, ERNIE 1.0/2.0."
    },
    "citationCount": 164,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}