{
    "acronym": "7b4eaf7b6debc4f69aa747d4108681908862f00b",
    "title": "Structured Information Matters: Incorporating Abstract Meaning Representation into LLMs for Improved Open-Domain Dialogue Evaluation",
    "seed_ids": [
        "transformer",
        "9c5609baff6175b0a2e436bb69e89737c4be3cf4",
        "ea4fa9e7155cf064de19862e41a6e63738770012",
        "dd0c6a687c493ffdcba529282ebc6a9ef7335883",
        "4161ad2d2495d8af1d62dc5e71882bde642cd1c1",
        "d81f4f03913a0087e9b623f6d0dbd9f169b971f5"
    ],
    "s2id": "7b4eaf7b6debc4f69aa747d4108681908862f00b",
    "abstract": "Automatic open-domain dialogue evaluation has attracted increasing attention. Trainable evaluation metrics are commonly trained with true positive and randomly selected negative responses, resulting in a tendency for them to assign a higher score to the responses that share higher content similarity with a given context. However, adversarial negative responses possess high content similarity with the contexts whilst being semantically different. Therefore, existing evaluation metrics are not robust enough to evaluate such responses, resulting in low correlations with human judgments. While recent studies have shown some efficacy in utilizing Large Language Models (LLMs) for open-domain dialogue evaluation, they still encounter challenges in effectively handling adversarial negative examples. In this paper, we propose a simple yet effective framework for open-domain dialogue evaluation, which combines domain-specific language models (SLMs) with LLMs. The SLMs can explicitly incorporate Abstract Meaning Representation (AMR) graph information of the dialogue through a gating mechanism for enhanced semantic representation learning. The evaluation result of SLMs and AMR graph information are plugged into the prompt of LLM, for the enhanced in-context learning performance. Experimental results on open-domain dialogue evaluation tasks demonstrate the superiority of our method compared to a wide range of state-of-the-art baselines, especially in discriminating adversarial negative responses. Our code is available at https://github.com/Bernard-Yang/SIMAMR.",
    "authors": [
        "Bohao Yang",
        "Kun Zhao",
        "Chen Tang",
        "Liang Zhan",
        "Chenghua Lin"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Experimental results on open-domain dialogue evaluation tasks demonstrate the superiority of the proposed simple yet effective framework compared to a wide range of state-of-the-art baselines, especially in discriminating adversarial negative responses."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}