{
    "acronym": "7b72dab2d1a8a1d91b6b8ad5f9ddef71a0c29a0e",
    "title": "AlGhafa Evaluation Benchmark for Arabic Language Models",
    "seed_ids": [
        "gpt",
        "5c577988ccebfea96de86678d04fd94fad367d2e",
        "9e16d8cc6096ec0d2733a4ecf41ce09d9a4bd19c",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "15190e8b459bd85d546286f7d7da61b4f4f3f58a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7b72dab2d1a8a1d91b6b8ad5f9ddef71a0c29a0e",
    "abstract": "Recent advances in the space of Arabic large language models have opened up a wealth of potential practical applications. From optimal training strategies, large scale data acquisition and continuously increasing NLP resources, the Arabic LLM landscape has improved in a very short span of time, despite being plagued by training data scarcity and limited evaluation resources compared to English. In line with contributing towards this ever-growing field, we introduce AlGhafa, a new multiple-choice evaluation benchmark for Arabic LLMs. For showcasing purposes, we train a new suite of models, including a 14 billion parameter model, the largest monolingual Arabic decoder-only model to date. We use a collection of publicly available datasets, as well as a newly introduced HandMade dataset consisting of 8 billion tokens. Finally, we explore the quantitative and qualitative toxicity of several Arabic models, comparing our models to existing public Arabic LLMs.",
    "authors": [
        "Ebtesam Almazrouei",
        "Ruxandra-Aimée Cojocaru",
        "Michele Baldo",
        "Quentin Malartic",
        "Hamza Alobeidli",
        "Daniele Mazzotta",
        "Guilherme Penedo",
        "Giulia Campesan",
        "Mugariya Farooq",
        "Maitha Alhammadi",
        "Julien Launay",
        "Badreddine Noune"
    ],
    "venue": "ARABICNLP",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "AlGhafa, a new multiple-choice evaluation benchmark for Arabic LLMs, is introduced and a new suite of models are trained, including a 14 billion parameter model, the largest monolingual Arabic decoder-only model to date."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}