{
    "acronym": "7b7d4c4a4bd260fd57c7164c659b2149be2883db",
    "title": "BiRNA-BERT Allows Efficient RNA Language Modeling with Adaptive Tokenization",
    "seed_ids": [
        "bert",
        "b22934bb297d9db55259385bbb8cd8a0d29b4bd1",
        "c064c79e3026f81e5043cd5b0f4264b4d43336e6",
        "bfd2b76998a0521c12903ef5ced517adf70ad2ba",
        "0f4780f3f42dbe9755d54495ae17244cc88a7483",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a"
    ],
    "s2id": "7b7d4c4a4bd260fd57c7164c659b2149be2883db",
    "abstract": "Recent advancements in Transformer-based models have spurred interest in their use for biological sequence analysis. However, adapting models like BERT is challenging due to sequence length, often requiring truncation for proteomics and genomics tasks. Additionally, advanced tokenization and relative positional encoding techniques for long contexts in NLP are often not directly transferable to DNA/RNA sequences, which require nucleotide or character-level encodings for tasks such as 3D torsion angle prediction. To tackle these challenges, we propose an adaptive dual tokenization scheme for bioinformatics that utilizes both nucleotide-level (NUC) and efficient BPE tokenizations. Building on the dual tokenization, we introduce BiRNA-BERT, a 117M parameter Transformer encoder pretrained with our proposed tokenization on 36 million coding and non-coding RNA sequences. BiRNA-BERT achieves state-of-the-art results in long-sequence downstream tasks and achieves a performance comparable to 6× larger models in short-sequence tasks with 27× less pre-training compute. In addition, our empirical experiments and ablation studies demonstrate that NUC is often preferable over BPE for bioinformatics tasks, given sufficient VRAM availability. This further highlights the advantage of BiRNA-BERT, which can dynamically adjust its tokenization strategy based on sequence length, utilizing NUC for shorter sequences and switching to BPE for longer ones, thereby eliminating the need for truncation. 1",
    "authors": [
        "Md Toki Tahmid",
        "Haz Sameen Shahgir",
        "Sazan Mahbub",
        "Yue Dong",
        "Md. Shamsuzzoha Bayzid"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that NUC is often preferable over BPE for bioinformatics tasks, given sufficient VRAM availability, which further highlights the advantage of BiRNA-BERT, which can dynamically adjust its tokenization strategy based on sequence length, utilizing NUC for shorter sequences and switching to BPE for longer ones, thereby eliminating the need for truncation."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}