{
    "acronym": "7ba394be4d3c9ee921245c52a136c64e07c65637",
    "title": "Cardiac abnormality detection with a tiny diagonal state space model based on sequential liquid neural processing units",
    "seed_ids": [
        "s4d",
        "d6e9acd8232acefccb37b3a6990f659b7d4b54ed",
        "ca444821352a4bd91884413d8070446e2960715a",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51"
    ],
    "s2id": "7ba394be4d3c9ee921245c52a136c64e07c65637",
    "abstract": "This manuscript presents and studies the performance of the Diagonal State Space Sequence (S4D) model based on the Closed-form Continuous-time (CfC) network in order to achieve a high-performing cardiac abnormality detection method that is robust, generalizable, and tiny in size. Our S4D-CfC model is evaluated on 12- and 1-lead electrocardiogram (ECG) data from over 20,000 patients. The system exhibits validation results with strong average F1 score and average AUROC value of 0.88 and 98%, respectively. To demonstrate the tiny machine learning (tinyML) of our 242 KB size model, we deployed the system on relatively resource-constrained hardware to evaluate its training performance on the edge. Such on-device fine-tuning can enhance personalized solutions in this context, allowing the system to learn each patient's data features. A comparison with a structured 2D Convolutional LSTM (ConvLSTM2D) CfC model (ConvCfC) demonstrates the S4D-CfC model's superior performance. The size of the proposed model is also significantly small (25 KB) while maintaining reasonable performance on 2.5s data, 75% shorter than the original 10s data, making it suitable for resource-constrained hardware and reducing latency. In summary, the S4D-CfC model represents a groundbreaking advancement in cardiac abnormality detection, offering robustness, generalization, and practicality with the potential for efficient deployment on limited-resource platforms, revolutionizing healthcare technology.",
    "authors": [
        "Zhaojing Huang",
        "Wing Hang Leung",
        "Jiashuo Cui",
        "Leping Yu",
        "Luis Fernando Herbozo Contreras",
        "N. D. Truong",
        "A. Nikpour",
        "O. Kavehei"
    ],
    "venue": "medRxiv",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The S4D-CfC model represents a groundbreaking advancement in cardiac abnormality detection, offering robustness, generalization, and practicality with the potential for efficient deployment on limited-resource platforms, revolutionizing healthcare technology."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}