{
    "acronym": "7baef7beeeda52a330f3d1300b3900635b8e6419",
    "title": "MileCut: A Multi-view Truncation Framework for Legal Case Retrieval",
    "seed_ids": [
        "transformer",
        "1e3e65e7773b7869d9bd7f5394b54199e48195e6"
    ],
    "s2id": "7baef7beeeda52a330f3d1300b3900635b8e6419",
    "abstract": "In the search process, it is essential to strike a balance between effectiveness and efficiency to improve search experience. Thus, ranking list truncation has become increasingly crucial. Especially in the legal domain, irrelevant cases can severely increase search costs and even compromise the pursuit of legal justice. However, there are truncation challenges that mainly arise from the distinctive structure of legal case documents, where the elements such as fact, reasoning, and judgement in a case serve as different but multi-view texts, which could result in a bad performance if the multi-view texts cannot be well-modeled. Existing approaches are limited due to their inability to handle multi-view elements information and their neglect of semantic interconnections between cases in the ranking list. In this paper, we propose a multi-view truncation framework for legal case retrieval, named MileCut. MileCut employs a case elements extraction module to fully exploit the multi-view information of cases in the ranking list. Then, MileCut applies a multi-view truncation module to select the most informative view and make a more comprehensive cut-off decision, similar to how legal experts look over retrieval results. As a practical evaluation, MileCut is assessed across three datasets, including criminal and civil case retrieval scenarios, and the results show that MileCut outperforms other methods on F1, DCG, and OIE metrics.",
    "authors": [
        "Fuda Ye",
        "Shuangyin Li"
    ],
    "venue": "The Web Conference",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A multi-view truncation framework for legal case retrieval, named MileCut, which employs a case elements extraction module to fully exploit the multi-view information of cases in the ranking list and applies a multi-view truncation module to select the most informative view and make a more comprehensive cut-off decision."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}