{
    "acronym": "7bca28a11b7bd50dd378dd59e97f3556b16183f3",
    "title": "MindLLM: Pre-training Lightweight Large Language Model from Scratch, Evaluations and Domain Applications",
    "seed_ids": [
        "gpt3",
        "0b0debb710366cdff461938c80763eace1651af6",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "7bca28a11b7bd50dd378dd59e97f3556b16183f3",
    "abstract": "Large Language Models (LLMs) have demonstrated remarkable performance across various natural language tasks, marking significant strides towards general artificial intelligence. While general artificial intelligence is leveraged by developing increasingly large-scale models, there could be another branch to develop lightweight custom models that better serve certain domains, taking into account the high cost of training and deploying LLMs and the scarcity of resources. In this paper, we present MindLLM, a novel series of bilingual lightweight large language models, trained from scratch, alleviating such burdens by offering models with 1.3 billion and 3 billion parameters. A thorough account of experiences accrued during large model development is given, covering every step of the process, including data construction, model architecture, evaluation, and applications. Such insights are hopefully valuable for fellow academics and developers. MindLLM consistently matches or surpasses the performance of other open-source larger models on some public benchmarks. We also introduce an innovative instruction tuning framework tailored for smaller models to enhance their capabilities efficiently. Moreover, we explore the application of MindLLM in specific vertical domains such as law and finance, underscoring the agility and adaptability of our lightweight models.",
    "authors": [
        "Yizhe Yang",
        "Huashan Sun",
        "Jiawei Li",
        "Runheng Liu",
        "Yinghao Li",
        "Yuhang Liu",
        "Heyan Huang",
        "Yang Gao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "MindLLM is presented, a novel series of bilingual lightweight large language models, trained from scratch, alleviating such burdens by offering models with 1.3 billion and 3 billion parameters."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}