{
    "acronym": "7c23ce3547ae837ff633b14e457a93de6d270b37",
    "title": "What Are You Token About? Dense Retrieval as Distributions Over the Vocabulary",
    "seed_ids": [
        "gpt2",
        "270f3bea8ca801870a6cc56b4d36f7f2019c9ed0",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7c23ce3547ae837ff633b14e457a93de6d270b37",
    "abstract": "Dual encoders are now the dominant architecture for dense retrieval. Yet, we have little understanding of how they represent text, and why this leads to good performance. In this work, we shed light on this question via distributions over the vocabulary. We propose to interpret the vector representations produced by dual encoders by projecting them into the model’s vocabulary space. We show that the resulting projections contain rich semantic information, and draw connection between them and sparse retrieval. We find that this view can offer an explanation for some of the failure cases of dense retrievers. For example, we observe that the inability of models to handle tail entities is correlated with a tendency of the token distributions to forget some of the tokens of those entities. We leverage this insight and propose a simple way to enrich query and passage representations with lexical information at inference time, and show that this significantly improves performance compared to the original model in zero-shot settings, and specifically on the BEIR benchmark.",
    "authors": [
        "Ori Ram",
        "L. Bezalel",
        "Adi Zicher",
        "Yonatan Belinkov",
        "Jonathan Berant",
        "A. Globerson"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes to interpret the vector representations produced by dual encoders by projecting them into the model’s vocabulary space, and shows that the resulting projections contain rich semantic information, and draw connection between them and sparse retrieval."
    },
    "citationCount": 23,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}