{
    "acronym": "7c3a735c7567b5b54581ba09612db4d18a5dacac",
    "title": "M2D2: A Massively Multi-Domain Language Modeling Dataset",
    "seed_ids": [
        "gpt2",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7c3a735c7567b5b54581ba09612db4d18a5dacac",
    "abstract": "We present M2D2, a fine-grained, massively multi-domain corpus for studying domain adaptation in language models (LMs). M2D2 consists of 8.5B tokens and spans 145 domains extracted from Wikipedia and Semantic Scholar. Using ontologies derived from Wikipedia and ArXiv categories, we organize the domains in each data source into 22 groups. This two-level hierarchy enables the study of relationships between domains and their effects on in- and out-of-domain performance after adaptation. We also present a number of insights into the nature of effective domain adaptation in LMs, as examples of the new types of studies M2D2 enables. To improve in-domain performance, we show the benefits of adapting the LM along a domain hierarchy; adapting to smaller amounts of fine-grained domain-specific data can lead to larger in-domain performance gains than larger amounts of weakly relevant data. We further demonstrate a trade-off between in-domain specialization and out-of-domain generalization within and across ontologies, as well as a strong correlation between out-of-domain performance and lexical overlap between domains.",
    "authors": [
        "Machel Reid",
        "Victor Zhong",
        "Suchin Gururangan",
        "Luke Zettlemoyer"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "To improve in-domain performance, the benefits of adapting the LM along a domain hierarchy are shown; adapting to smaller amounts of fine-grained domain-specific data can lead to larger in- domain performance gains than larger amounts of weakly relevant data."
    },
    "citationCount": 14,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}