{
    "acronym": "7c3e240732b0232577f781240de4e60777c5c054",
    "title": "Moving beyond word lists: towards abstractive topic labels for human-like topics of scientific documents",
    "seed_ids": [
        "longformer",
        "d25121da56c9050137800c69520111b30201d1ed",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "75acc731bdd2b626edc74672a30da3bc51010ae8"
    ],
    "s2id": "7c3e240732b0232577f781240de4e60777c5c054",
    "abstract": "Topic models represent groups of documents as a list of words (the topic labels). This work asks whether an alternative approach to topic labeling can be developed that is closer to a natural language description of a topic than a word list. To this end, we present an approach to generating human-like topic labels using abstractive multi-document summarization (MDS). We investigate our approach with an exploratory case study. We model topics in citation sentences in order to understand what further research needs to be done to fully operationalize MDS for topic labeling. Our case study shows that in addition to more human-like topics there are additional advantages to evaluation by using clustering and summarization measures instead of topic model measures. However, we find that there are several developments needed before we can design a well-powered study to evaluate MDS for topic modeling fully. Namely, improving cluster cohesion, improving the factuality and faithfulness of MDS, and increasing the number of documents that might be supported by MDS. We present a number of ideas on how these can be tackled and conclude with some thoughts on how topic modeling can also be used to improve MDS in general.",
    "authors": [
        "Domenic Rosati"
    ],
    "venue": "WIESP",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An approach to generating human-like topic labels using abstractive multi-document summarization (MDS), and some thoughts on how topic modeling can also be used to improve MDS in general."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}