{
    "acronym": "7ca41cc5fc364b713aba5b573ae4ada801fd788a",
    "title": "Noise-Robust De-Duplication at Scale",
    "seed_ids": [
        "gpt2",
        "270f3bea8ca801870a6cc56b4d36f7f2019c9ed0",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7ca41cc5fc364b713aba5b573ae4ada801fd788a",
    "abstract": "Identifying near duplicates within large, noisy text corpora has a myriad of applications that range from de-duplicating training datasets, reducing privacy risk, and evaluating test set leakage, to identifying reproduced news articles and literature within large corpora. Across these diverse applications, the overwhelming majority of work relies on N-grams. Limited efforts have been made to evaluate how well N-gram methods perform, in part because it is unclear how one could create an unbiased evaluation dataset for a massive corpus. This study uses the unique timeliness of historical news wires to create a 27,210 document dataset, with 122,876 positive duplicate pairs, for studying noise-robust de-duplication. The time-sensitivity of news makes comprehensive hand labelling feasible - despite the massive overall size of the corpus - as duplicates occur within a narrow date range. The study then develops and evaluates a range of de-duplication methods: hashing and N-gram overlap (which predominate in the literature), a contrastively trained bi-encoder, and a re-rank style approach combining a bi- and cross-encoder. The neural approaches significantly outperform hashing and N-gram overlap. We show that the bi-encoder scales well, de-duplicating a 10 million article corpus on a single GPU card in a matter of hours. We also apply our pre-trained model to the RealNews and patent portions of C4 (Colossal Clean Crawled Corpus), illustrating that a neural approach can identify many near duplicates missed by hashing, in the presence of various types of noise. The public release of our NEWS-COPY de-duplication dataset, codebase, and the pre-trained models will facilitate further research and applications.",
    "authors": [
        "Emily Silcock",
        "Luca D'Amico-Wong",
        "Jinglin Yang",
        "Melissa Dell"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study uses the unique timeliness of historical news wires to create a 27,210 document dataset, with 122,876 positive duplicate pairs, for studying noise-robust de-duplication, and develops and evaluates a range of de-duplication methods, demonstrating that a neural approach can identify many near duplicates missed by hashing, in the presence of various types of noise."
    },
    "citationCount": 13,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}