{
    "acronym": "7d083d654f66f763302d8a5f0678beb753f6507b",
    "title": "Unleashing the potential of prompt engineering in Large Language Models: a comprehensive review",
    "seed_ids": [
        "gpt3",
        "7b6a8c6d44e0f77bf930484e438d77b7465a69fb",
        "aade40af0d85b0b4fe15c97f6222d5c2e4d6d9b3",
        "4d17732d90440682b0500f4e209c6cc4fac20e0e",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "b6c4a96e09b9f11e7c70e7f1fbe3f3971b92762d",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7d083d654f66f763302d8a5f0678beb753f6507b",
    "abstract": "This paper delves into the pivotal role of prompt engineering in unleashing the capabilities of Large Language Models (LLMs). Prompt engineering is the process of structuring input text for LLMs and is a technique integral to optimizing the efficacy of LLMs. This survey elucidates foundational principles of prompt engineering, such as role-prompting, one-shot, and few-shot prompting, as well as more advanced methodologies such as the chain-of-thought and tree-of-thoughts prompting. The paper sheds light on how external assistance in the form of plugins can assist in this task, and reduce machine hallucination by retrieving external knowledge. We subsequently delineate prospective directions in prompt engineering research, emphasizing the need for a deeper understanding of structures and the role of agents in Artificial Intelligence-Generated Content (AIGC) tools. We discuss how to assess the efficacy of prompt methods from different perspectives and using different methods. Finally, we gather information about the application of prompt engineering in such fields as education and programming, showing its transformative potential. This comprehensive survey aims to serve as a friendly guide for anyone venturing through the big world of LLMs and prompt engineering.",
    "authors": [
        "Banghao Chen",
        "Zhaofeng Zhang",
        "Nicolas Langren'e",
        "Shengxin Zhu"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey elucidates foundational principles of prompt engineering, such as role-prompting, one-shot, and few-shot prompting, as well as more advanced methodologies such as the chain-of-thought and tree-of-thoughts prompting."
    },
    "citationCount": 63,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}