{
    "acronym": "7d9b662031fa785b493ed8255cd6ad19d2d8ea1e",
    "title": "Can Large Language Models Design Accurate Label Functions?",
    "seed_ids": [
        "gpt3",
        "83edcfbb206ddad38a971d605da09390604248ea",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "7d9b662031fa785b493ed8255cd6ad19d2d8ea1e",
    "abstract": "Programmatic weak supervision methodologies facilitate the expedited labeling of extensive datasets through the use of label functions (LFs) that encapsulate heuristic data sources. Nonetheless, the creation of precise LFs necessitates domain expertise and substantial endeavors. Recent advances in pre-trained language models (PLMs) have exhibited substantial potential across diverse tasks. However, the capacity of PLMs to autonomously formulate accurate LFs remains an underexplored domain. In this research, we address this gap by introducing DataSculpt, an interactive framework that harnesses PLMs for the automated generation of LFs. Within DataSculpt, we incorporate an array of prompting techniques, instance selection strategies, and LF filtration methods to explore the expansive design landscape. Ultimately, we conduct a thorough assessment of DataSculpt's performance on 12 real-world datasets, encompassing a range of tasks. This evaluation unveils both the strengths and limitations of contemporary PLMs in LF design.",
    "authors": [
        "Naiqing Guan",
        "Kaiwen Chen",
        "Nick Koudas"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This research introduces DataSculpt, an interactive framework that harnesses PLMs for the automated generation of LFs and incorporates an array of prompting techniques, instance selection strategies, and LF filtration methods to explore the expansive design landscape."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}