{
    "acronym": "7e48d5ccd845a5aa42f32ed52b16efe2050ebba7",
    "title": "Revisiting the Temporal Modeling in Spatio-Temporal Predictive Learning under A Unified View",
    "seed_ids": [
        "mega",
        "240103933ffe3dac2179cc160a2bd91299357a53",
        "89a8d24658d98370403d2775721dcc972bb06ed0",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "70e91e16eb321067d9402710e14a40cf28311f73"
    ],
    "s2id": "7e48d5ccd845a5aa42f32ed52b16efe2050ebba7",
    "abstract": "Spatio-temporal predictive learning plays a crucial role in self-supervised learning, with wide-ranging applications across a diverse range of fields. Previous approaches for temporal modeling fall into two categories: recurrent-based and recurrent-free methods. The former, while meticulously processing frames one by one, neglect short-term spatio-temporal information redundancies, leading to inefficiencies. The latter naively stack frames sequentially, overlooking the inherent temporal dependencies. In this paper, we re-examine the two dominant temporal modeling approaches within the realm of spatio-temporal predictive learning, offering a unified perspective. Building upon this analysis, we introduce USTEP (Unified Spatio-TEmporal Predictive learning), an innovative framework that reconciles the recurrent-based and recurrent-free methods by integrating both micro-temporal and macro-temporal scales. Extensive experiments on a wide range of spatio-temporal predictive learning demonstrate that USTEP achieves significant improvements over existing temporal modeling approaches, thereby establishing it as a robust solution for a wide range of spatio-temporal applications.",
    "authors": [
        "Cheng Tan",
        "Jue Wang",
        "Zhangyang Gao",
        "Siyuan Li",
        "Lirong Wu",
        "Jun Xia",
        "Stan Z. Li"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work re-examines the two dominant temporal modeling approaches within the realm of spatio-temporal predictive learning and introduces USTEP (Unified Spatio-TEmporal Predictive learning), an innovative framework that reconciles the recurrent-based and recurrent-free methods by integrating both micro-Temporal and macro-tem temporal scales."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}