{
    "acronym": "7e5ddb01ac11bd32770e81baede3c96a4ca7dde1",
    "title": "Exploiting Latent Features of Text and Graphs",
    "seed_ids": [
        "gpt",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7e5ddb01ac11bd32770e81baede3c96a4ca7dde1",
    "abstract": "As the size and scope of online data continues to grow, new machine learning techniques become necessary to best capitalize on the wealth of available information. However, the models that help convert data into knowledge require nontrivial processes to make sense of large collections of text and massive online graphs. In both scenarios, modern machine learning pipelines produce embeddings — semantically rich vectors of latent features — to convert human constructs for machine understanding. In this dissertation we focus on information available within biomedical science, including human-written abstracts of scientific papers, as well as machinegenerated graphs of biomedical entity relationships. We present the Moliere system, and our method for identifying new discoveries through the use of natural language processing and graph mining algorithms. We propose heuristically-based ranking criteria to augment Moliere, and leverage this ranking to identify a new gene-treatment target for HIV-associated Neurodegenerative Disorders. We additionally focus on the latent features of graphs, and propose a new bipartite graph embedding technique. Using our graph embedding, we advance the state-of-the-art in hypergraph partitioning quality. Having newfound intuition of graph embeddings, we present Agatha, a deep-learning approach to hypothesis generation. This system learns a data-driven ranking criteria derived from the embeddings of our large proposed biomedical semantic graph. To produce human-readable results, we additionally propose CBAG,",
    "authors": [
        "Justin Sybrandt"
    ],
    "venue": "",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This dissertation focuses on information available within biomedical science, including human-written abstracts of scientific papers, as well as machinegenerated graphs of biomedical entity relationships, and presents the Moliere system, and a deep-learning approach to hypothesis generation."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}