{
    "acronym": "7f3aba54fec3b9fac2363ddbb9b69d8aff1cc1a4",
    "title": "Similarity Makes Difference: SSHTN for Generalized Zero-Shot Industrial Fault Diagnosis by Leveraging Auxiliary Set",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "7f3aba54fec3b9fac2363ddbb9b69d8aff1cc1a4",
    "abstract": "The generalized zero-shot diagnosis (GZSD) has attracted rising attention from researchers, but faces a major bottleneck: the domain shift problem (DSP), which causes most unseen faults to be misclassified as seen. In this study, we propose a novel method termed semisupervised hybrid triplet network (SSHTN) with high resistance toward DSP to achieve GZSD by first introducing auxiliary set. To leverage the unlabeled data of auxiliary set, which is different from known faults (both seen and unseen), SSHTN defines relative boundaries of seen and unseen faults in the similarity space and comprises two branches: the data–data branch (DDB) and the data–semantic branch (DSB). For DDB, it constructs homogeneous and heterogeneous data pairs to learn data–data similarity. With the support of auxiliary set, the semisupervised similarity learning mechanism is constructed. Specifically, DDB analyzes differences between data pairs mixed by seen and auxiliary fault data to narrow down the decision boundaries of seen faults. Meanwhile, similarities between data pairs formed by disturbing auxiliary set data are learned to improve the generalization of DDB. For DSB, it learns data–semantic similarity by matching fault data with corresponding descriptions and extends SSHTN discriminative ability toward unseen faults. The SSHTN obtained from the comprehensive learning of similarity by the two branches could determine the boundaries of seen and unseen faults more accurately, thereby alleviating the effect of DSP. Experiments are implemented on the Tennessee Eastman process and a real thermal power plant process, and results show the superior performance of SSHTN over state-of-the-art ZSD methods.",
    "authors": [
        "Jiaqi Yue",
        "Jiancheng Zhao",
        "Chunhui Zhao"
    ],
    "venue": "IEEE Transactions on Industrial Informatics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel method termed semisupervised hybrid triplet network (SSHTN) with high resistance toward DSP to achieve GZSD by first introducing auxiliary set, which could determine the boundaries of seen and unseen faults more accurately, thereby alleviating the effect of DSP."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}