{
    "acronym": "7f6568c5ce838df3176118a9856471f91971b76c",
    "title": "Adapter-TST: A Parameter Efficient Method for Multiple-Attribute Text Style Transfer",
    "seed_ids": [
        "gpt2",
        "a283af2f729c71470d83b07ddebbb6e8011f383d",
        "f1957038e9ded19108d3c71340d7462152b70f25",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "7f6568c5ce838df3176118a9856471f91971b76c",
    "abstract": "Adapting a large language model for multiple-attribute text style transfer via fine-tuning can be challenging due to the significant amount of computational resources and labeled data required for the specific task. In this paper, we address this challenge by introducing AdapterTST, a framework that freezes the pre-trained model's original parameters and enables the development of a multiple-attribute text style transfer model. Using BART as the backbone model, Adapter-TST utilizes different neural adapters to capture different attribute information, like a plug-in connected to BART. Our method allows control over multiple attributes, like sentiment, tense, voice, etc., and configures the adapters' architecture to generate multiple outputs respected to attributes or compositional editing on the same sentence. We evaluate the proposed model on both traditional sentiment transfer and multiple-attribute transfer tasks. The experiment results demonstrate that Adapter-TST outperforms all the state-of-the-art baselines with significantly lesser computational resources. We have also empirically shown that each adapter is able to capture specific stylistic attributes effectively and can be configured to perform compositional editing.",
    "authors": [
        "Zhiqiang Hu",
        "R. Lee",
        "Nancy F. Chen"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces AdapterTST, a framework that freezes the pre-trained model's original parameters and enables the development of a multiple-attribute text style transfer model and empirically shows that each adapter is able to capture specific stylistic attributes effectively and can be configured to perform compositional editing."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}