{
    "acronym": "802c74851cfd607fde830932f4b46d58f2b79e85",
    "title": "Algorithmic Bias, Generalist Models, and Clinical Medicine",
    "seed_ids": [
        "gpt2",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "fd1b829261ba04bb92e0ab60c4f6e7cea0d99fbf",
        "46b83fc7c83c2f399ad64b1904798afd03d9a3ab",
        "e092ecf56fcca38d0cd6fe9e1e6b11c380f6c286",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "802c74851cfd607fde830932f4b46d58f2b79e85",
    "abstract": "The technical landscape of clinical machine learning is shifting in ways that destabilize pervasive assumptions about the nature and causes of algorithmic bias. On one hand, the dominant paradigm in clinical machine learning is narrow in the sense that models are trained on biomedical datasets for particular clinical tasks such as diagnosis and treatment recommendation. On the other hand, the emerging paradigm is generalist in the sense that general-purpose language models such as Google's BERT and PaLM are increasingly being adapted for clinical use cases via prompting or fine-tuning on biomedical datasets. Many of these next-generation models provide substantial performance gains over prior clinical models, but at the same time introduce novel kinds of algorithmic bias and complicate the explanatory relationship between algorithmic biases and biases in training data. This paper articulates how and in what respects biases in generalist models differ from biases in prior clinical models, and draws out practical recommendations for algorithmic bias mitigation.",
    "authors": [
        "G. Keeling"
    ],
    "venue": "AI and Ethics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper articulates how and in what respects biases in generalist models differ from biases in prior clinical models, and draws out practical recommendations for algorithmic bias mitigation."
    },
    "citationCount": 5,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}