{
    "acronym": "804d1f10a366f5e2a2018bd2b900b687d39e276e",
    "title": "ACM - Attribute Conditioning for Abstractive Multi Document Summarization",
    "seed_ids": [
        "memcompress",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "804d1f10a366f5e2a2018bd2b900b687d39e276e",
    "abstract": "Abstractive multi document summarization has evolved as a task through the basic sequence to sequence approaches to transformer and graph based techniques. Each of these approaches has primarily focused on the issues of multi document information synthe-sis and attention based approaches to extract salient information. A challenge that arises with multi document summarization which is not prevalent in single document summarization is the need to effectively summarize multiple documents that might have conﬂicting polarity, sentiment or subjective information about a given topic. In this paper we propose ACM, attribute conditioned multi document summarization,a model that incorporates attribute conditioning modules in order to decouple conﬂicting information by conditioning for a certain attribute in the output summary. This approach shows strong gains in ROUGE score over baseline multi document summarization approaches and shows gains in ﬂuency, informativeness and reduction in repetitiveness as shown through a human annotation analysis study.",
    "authors": [
        "Aiswarya Sankar",
        "Ankit R. Chadha"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes ACM, attribute conditioned multi document summarization, a model that incorporates attribute conditioning modules in order to decouple conﬂicting information by conditioning for a certain attribute in the output summary."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}