{
    "acronym": "80cbbed8994cd89b02b923dd2e0e22d3e8aeca14",
    "title": "Aligning Large Language Models with Recommendation Knowledge",
    "seed_ids": [
        "bert",
        "cbf3bf8f541f5b446c59c8deacbcc18527768c75",
        "df602516e28a9ef0ef665ed0aef551984d8d770d",
        "690edf44e8739fd80bdfb76f40c9a4a222f3bba8"
    ],
    "s2id": "80cbbed8994cd89b02b923dd2e0e22d3e8aeca14",
    "abstract": "Large language models (LLMs) have recently been used as backbones for recommender systems. However, their performance often lags behind conventional methods in standard tasks like retrieval. We attribute this to a mismatch between LLMs' knowledge and the knowledge crucial for effective recommendations. While LLMs excel at natural language reasoning, they cannot model complex user-item interactions inherent in recommendation tasks. We propose bridging the knowledge gap and equipping LLMs with recommendation-specific knowledge to address this. Operations such as Masked Item Modeling (MIM) and Bayesian Personalized Ranking (BPR) have found success in conventional recommender systems. Inspired by this, we simulate these operations through natural language to generate auxiliary-task data samples that encode item correlations and user preferences. Fine-tuning LLMs on such auxiliary-task data samples and incorporating more informative recommendation-task data samples facilitates the injection of recommendation-specific knowledge into LLMs. Extensive experiments across retrieval, ranking, and rating prediction tasks on LLMs such as FLAN-T5-Base and FLAN-T5-XL show the effectiveness of our technique in domains such as Amazon Toys&Games, Beauty, and Sports&Outdoors. Notably, our method outperforms conventional and LLM-based baselines, including the current SOTA, by significant margins in retrieval, showcasing its potential for enhancing recommendation quality.",
    "authors": [
        "Yuwei Cao",
        "Nikhil Mehta",
        "Xinyang Yi",
        "Raghunandan H. Keshavan",
        "L. Heldt",
        "Lichan Hong",
        "Ed H. Chi",
        "M. Sathiamoorthy"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes bridging the knowledge gap and equipping large language models (LLMs) with recommendation-specific knowledge to address a mismatch between LLMs' knowledge and the knowledge crucial for effective recommendations."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}