{
    "acronym": "810c971f8ebbe8786dcf3d846661f084bda77f12",
    "title": "SMCD: High Realism Motion Style Transfer via Mamba-based Diffusion",
    "seed_ids": [
        "mamba",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "810c971f8ebbe8786dcf3d846661f084bda77f12",
    "abstract": "Motion style transfer is a significant research direction in multimedia applications. It enables the rapid switching of different styles of the same motion for virtual digital humans, thus vastly increasing the diversity and realism of movements. It is widely applied in multimedia scenarios such as movies, games, and the Metaverse. However, most of the current work in this field adopts the GAN, which may lead to instability and convergence issues, making the final generated motion sequence somewhat chaotic and unable to reflect a highly realistic and natural style. To address these problems, we consider style motion as a condition and propose the Style Motion Conditioned Diffusion (SMCD) framework for the first time, which can more comprehensively learn the style features of motion. Moreover, we apply Mamba model for the first time in the motion style transfer field, introducing the Motion Style Mamba (MSM) module to handle longer motion sequences. Thirdly, aiming at the SMCD framework, we propose Diffusion-based Content Consistency Loss and Content Consistency Loss to assist the overall framework's training. Finally, we conduct extensive experiments. The results reveal that our method surpasses state-of-the-art methods in both qualitative and quantitative comparisons, capable of generating more realistic motion sequences.",
    "authors": [
        "Ziyun Qian",
        "Zeyu Xiao",
        "Zhenyi Wu",
        "Dingkang Yang",
        "Mingcheng Li",
        "Shunli Wang",
        "Shuai Wang",
        "Dongliang Kou",
        "Lihua Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Style Motion Conditioned Diffusion (SMCD) framework is proposed for the first time for the first time, and surpasses state-of-the-art methods in both qualitative and quantitative comparisons, capable of generating more realistic motion sequences."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}