{
    "acronym": "812867453701f0929579e481bd15dfb0ebee1d7e",
    "title": "Toward Fairness in Text Generation via Mutual Information Minimization based on Importance Sampling",
    "seed_ids": [
        "gpt2",
        "682ee9c06f3eff3e3708b4d0419dc85ecf9c6c87",
        "3c759e2f16bfde8d31189631e4893d3ac8ff05f2",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "812867453701f0929579e481bd15dfb0ebee1d7e",
    "abstract": "Pretrained language models (PLMs), such as GPT2, have achieved remarkable empirical performance in text generation tasks. However, pretrained on large-scale natural language corpora, the generated text from PLMs may exhibit social bias against disadvantaged demographic groups. To improve the fairness of PLMs in text generation, we propose to minimize the mutual information between the semantics in the generated text sentences and their demographic polarity, i.e., the demographic group to which the sentence is referring. In this way, the mentioning of a demographic group (e.g., male or female) is encouraged to be independent from how it is described in the generated text, thus effectively alleviating the social bias. Moreover, we propose to efficiently estimate the upper bound of the above mutual information via importance sampling, leveraging a natural language corpus. We also propose a distillation mechanism that preserves the language modeling ability of the PLMs after debiasing. Empirical results on real-world benchmarks demonstrate that the proposed method yields superior performance in term of both fairness and language modeling ability.",
    "authors": [
        "Rui Wang",
        "Pengyu Cheng",
        "Ricardo Henao"
    ],
    "venue": "International Conference on Artificial Intelligence and Statistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes to minimize the mutual information between the semantics in the generated text sentences and their demographic polarity, i.e., the demographic group to which the sentence is referring, thus effectively alleviating the social bias of PLMs in text generation."
    },
    "citationCount": 9,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}