{
    "acronym": "81c34355f585f40e827f79acaccbcc885ed133a0",
    "title": "Depicting Beyond Scores: Advancing Image Quality Assessment through Multi-modal Language Models",
    "seed_ids": [
        "bert",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "81c34355f585f40e827f79acaccbcc885ed133a0",
    "abstract": "We introduce a Depicted image Quality Assessment method (DepictQA), overcoming the constraints of traditional score-based methods. DepictQA allows for detailed, language-based, human-like evaluation of image quality by leveraging Multi-modal Large Language Models (MLLMs). Unlike conventional Image Quality Assessment (IQA) methods relying on scores, DepictQA interprets image content and distortions descriptively and comparatively, aligning closely with humans' reasoning process. To build the DepictQA model, we establish a hierarchical task framework, and collect a multi-modal IQA training dataset. To tackle the challenges of limited training data and multi-image processing, we propose to use multi-source training data and specialized image tags. These designs result in a better performance of DepictQA than score-based approaches on multiple benchmarks. Moreover, compared with general MLLMs, DepictQA can generate more accurate reasoning descriptive languages. We also demonstrate that our full-reference dataset can be extended to non-reference applications. These results showcase the research potential of multi-modal IQA methods. Codes and datasets are available in https://depictqa.github.io.",
    "authors": [
        "Zhiyuan You",
        "Zheyuan Li",
        "Jinjin Gu",
        "Zhenfei Yin",
        "Tianfan Xue",
        "Chao Dong"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a Depicted image Quality Assessment method (DepictQA), overcoming the constraints of traditional score-based methods and proposing to use multi-source training data and specialized image tags to tackle the challenges of limited training data and multi-image processing."
    },
    "citationCount": 10,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}