{
    "acronym": "81ca0c918448670a77d8aebb5384167bb4b0c789",
    "title": "CNN with large memory layers",
    "seed_ids": [
        "productkeymem",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "81ca0c918448670a77d8aebb5384167bb4b0c789",
    "abstract": "This work is centred around the recently proposed product key memory structure [46], implemented for a number of computer vision applications. The memory structure can be regarded as a simple computation primitive suitable to be augmented to nearly all neural network architectures. The memory block allows implementing sparse access to memory with square root complexity scaling with respect to the memory capacity. The latter scaling is possible due to the incorporation of Cartesian product space decomposition of the key space for the nearest neighbour search. We have tested the memory layer on the classification, image reconstruction and relocalization problems and found that for some of those, the memory layers can provide significant speed/accuracy improvement with the high utilization of the key-value elements, while others require more careful fine-tuning and suffer from dying keys. To tackle the later problem we have introduced a simple technique of memory re-initialization which helps us to eliminate unused key-value pairs from the memory and engage them in training again. We have conducted various experiments and got improvements in speed and accuracy for classification and PoseNet relocalization models. We showed that the re-initialization has a huge impact on a toy example of randomly labeled data and observed some gains in performance on the image classification task. We have also demonstrated the generalization property perseverance of the large memory layers on the relocalization problem, while observing the spatial correlations between the images and the selected memory cells. Thesis Supervisor: Victor Lempitsky Title: Associate Professor, PhD",
    "authors": [
        "R. Karimov",
        "V. Lempitsky"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A simple technique of memory re-initialization is introduced which helps to eliminate unused key-value pairs from the memory and engage them in training again, and demonstrates the generalization property perseverance of the large memory layers on the relocalization problem, while observing the spatial correlations between the images and the selected memory cells."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}