{
    "acronym": "81e1ab8f0bc160286d156c7cd8efc87ad15f6f57",
    "title": "Lorentz-Equivariant Geometric Algebra Transformers for High-Energy Physics",
    "seed_ids": [
        "transformer",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a"
    ],
    "s2id": "81e1ab8f0bc160286d156c7cd8efc87ad15f6f57",
    "abstract": "Extracting scientific understanding from particle-physics experiments requires solving diverse learning problems with high precision and good data efficiency. We propose the Lorentz Geometric Algebra Transformer (L-GATr), a new multi-purpose architecture for high-energy physics. L-GATr represents high-energy data in a geometric algebra over four-dimensional space-time and is equivariant under Lorentz transformations, the symmetry group of relativistic kinematics. At the same time, the architecture is a Transformer, which makes it versatile and scalable to large systems. L-GATr is first demonstrated on regression and classification tasks from particle physics. We then construct the first Lorentz-equivariant generative model: a continuous normalizing flow based on an L-GATr network, trained with Riemannian flow matching. Across our experiments, L-GATr is on par with or outperforms strong domain-specific baselines.",
    "authors": [
        "Jonas Spinner",
        "Victor Bres'o",
        "P. D. Haan",
        "Tilman Plehn",
        "Jesse Thaler",
        "Johann Brehmer"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Lorentz Geometric Algebra Transformer (L-GATr), a new multi-purpose architecture for high-energy physics, which represents high-energy data in a geometric algebra over four-dimensional space-time and is equivariant under Lorentz transformations, the symmetry group of relativistic kinematics."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}