{
    "acronym": "82618a81a76d36ea0c188e468dad1c88d944bddb",
    "title": "Language-Based Depth Hints for Monocular Depth Estimation",
    "seed_ids": [
        "bert",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "682ee9c06f3eff3e3708b4d0419dc85ecf9c6c87",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "5e9c85235210b59a16bdd84b444a904ae271f7e7",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "82618a81a76d36ea0c188e468dad1c88d944bddb",
    "abstract": "Monocular depth estimation (MDE) is inherently ambiguous, as a given image may result from many different 3D scenes and vice versa. To resolve this ambiguity, an MDE system must make assumptions about the most likely 3D scenes for a given input. These assumptions can be either explicit or implicit. In this work, we demonstrate the use of natural language as a source of an explicit prior about the structure of the world. The assumption is made that human language encodes the likely distribution in depth-space of various objects. We first show that a language model encodes this implicit bias during training, and that it can be extracted using a very simple learned approach. We then show that this prediction can be provided as an explicit source of assumption to an MDE system, using an off-the-shelf instance segmentation model that provides the labels used as the input to the language model. We demonstrate the performance of our method on the NYUD2 dataset, showing improvement compared to the baseline and to random controls.",
    "authors": [
        "Dylan Auty",
        "K. Mikolajczyk"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work demonstrates the use of natural language as a source of an explicit prior about the structure of the world using an off-the-shelf instance segmentation model that provides the labels used as the input to the language model."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}