{
    "acronym": "828e27fd4fcd5e8982032b903950947b12afb6bb",
    "title": "Diffusion Model is an Effective Planner and Data Synthesizer for Multi-Task Reinforcement Learning",
    "seed_ids": [
        "gpt2",
        "6827e87642874d9bf69f0f1548d79a164aaa5e1e",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "828e27fd4fcd5e8982032b903950947b12afb6bb",
    "abstract": "Diffusion models have demonstrated highly-expressive generative capabilities in vision and NLP. Recent studies in reinforcement learning (RL) have shown that diffusion models are also powerful in modeling complex policies or trajectories in offline datasets. However, these works have been limited to single-task settings where a generalist agent capable of addressing multi-task predicaments is absent. In this paper, we aim to investigate the effectiveness of a single diffusion model in modeling large-scale multi-task offline data, which can be challenging due to diverse and multimodal data distribution. Specifically, we propose Multi-Task Diffusion Model (\\textsc{MTDiff}), a diffusion-based method that incorporates Transformer backbones and prompt learning for generative planning and data synthesis in multi-task offline settings. \\textsc{MTDiff} leverages vast amounts of knowledge available in multi-task data and performs implicit knowledge sharing among tasks. For generative planning, we find \\textsc{MTDiff} outperforms state-of-the-art algorithms across 50 tasks on Meta-World and 8 maps on Maze2D. For data synthesis, \\textsc{MTDiff} generates high-quality data for testing tasks given a single demonstration as a prompt, which enhances the low-quality datasets for even unseen tasks.",
    "authors": [
        "Haoran He",
        "Chenjia Bai",
        "Kang Xu",
        "Zhuoran Yang",
        "Weinan Zhang",
        "Dong Wang",
        "Bingyan Zhao",
        "Xuelong Li"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes Multi-Task Diffusion Model, a diffusion-based method that incorporates Transformer backbones and prompt learning for generative planning and data synthesis in multi-task offline settings and finds it outperforms state-of-the-art algorithms across 50 tasks on Meta-World and 8 maps on Maze2D."
    },
    "citationCount": 33,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}