{
    "acronym": "82a8b19b00992baea0b7b84053e6de5b5e132630",
    "title": "ARVideo: Autoregressive Pretraining for Self-Supervised Video Representation Learning",
    "seed_ids": [
        "gpt",
        "0448656a78e26b9a2899cf85447f800deda8f5f3",
        "4990f7542f0600e0501a7e7a931b32eb7cb804d5",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "78a0fb70b79116eb8d42c5951ced4f9efba513f0",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "82a8b19b00992baea0b7b84053e6de5b5e132630",
    "abstract": "This paper presents a new self-supervised video representation learning framework, ARVideo, which autoregressively predicts the next video token in a tailored sequence order. Two key designs are included. First, we organize autoregressive video tokens into clusters that span both spatially and temporally, thereby enabling a richer aggregation of contextual information compared to the standard spatial-only or temporal-only clusters. Second, we adopt a randomized spatiotemporal prediction order to facilitate learning from multi-dimensional data, addressing the limitations of a handcrafted spatial-first or temporal-first sequence order. Extensive experiments establish ARVideo as an effective paradigm for self-supervised video representation learning. For example, when trained with the ViT-B backbone, ARVideo competitively attains 81.2% on Kinetics-400 and 70.9% on Something-Something V2, which are on par with the strong benchmark set by VideoMAE. Importantly, ARVideo also demonstrates higher training efficiency, i.e., it trains 14% faster and requires 58% less GPU memory compared to VideoMAE.",
    "authors": [
        "Sucheng Ren",
        "Hongru Zhu",
        "Chen Wei",
        "Yijiang Li",
        "Alan L. Yuille",
        "Cihang Xie"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new self-supervised video representation learning framework, ARVideo, which autoregressively predicts the next video token in a tailored sequence order, and adopts a randomized spatiotemporal prediction order to facilitate learning from multi-dimensional data."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}