{
    "acronym": "82de481ebb5cf401b215178c20b058c7c1a4f9cd",
    "title": "Recent advances in text embedding: A Comprehensive Review of Top-Performing Methods on the MTEB Benchmark",
    "seed_ids": [
        "bert",
        "a3c4047f82d7120e2bbc600dbe79b930e1dc4e41",
        "2b8439f319dfa73df62ca8957ff6d0c1f3c7a73c",
        "5fc1a3a49e8f1d106118b69d1d6be3b6caa23da0",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "e092ecf56fcca38d0cd6fe9e1e6b11c380f6c286"
    ],
    "s2id": "82de481ebb5cf401b215178c20b058c7c1a4f9cd",
    "abstract": "Text embedding methods have become increasingly popular in both industrial and academic fields due to their critical role in a variety of natural language processing tasks. The significance of universal text embeddings has been further highlighted with the rise of Large Language Models (LLMs) applications such as Retrieval-Augmented Systems (RAGs). While previous models have attempted to be general-purpose, they often struggle to generalize across tasks and domains. However, recent advancements in training data quantity, quality and diversity; synthetic data generation from LLMs as well as using LLMs as backbones encourage great improvements in pursuing universal text embeddings. In this paper, we provide an overview of the recent advances in universal text embedding models with a focus on the top performing text embeddings on Massive Text Embedding Benchmark (MTEB). Through detailed comparison and analysis, we highlight the key contributions and limitations in this area, and propose potentially inspiring future research directions.",
    "authors": [
        "Hongliu Cao"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An overview of the recent advances in universal text embedding models with a focus on the top performing text embeddings on Massive Text Embedding Benchmark (MTEB), and highlights the key contributions and limitations in this area."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}