{
    "acronym": "82ec4a03a945f18bae23f8c5224d6495ec6cd1b0",
    "title": "Deep Transformer Q-Networks for Partially Observable Reinforcement Learning",
    "seed_ids": [
        "gpt",
        "transformerxl",
        "56bc06be82c087348e638506174fa99956ef666c",
        "4889ba5a8ae8b2169dd44d1d3a605bf9820bae8d",
        "59a916cdc943f0282908e6f3fa0360f4c5fb78d0",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "82ec4a03a945f18bae23f8c5224d6495ec6cd1b0",
    "abstract": "Real-world reinforcement learning tasks often involve some form of partial observability where the observations only give a partial or noisy view of the true state of the world. Such tasks typically require some form of memory, where the agent has access to multiple past observations, in order to perform well. One popular way to incorporate memory is by using a recurrent neural network to access the agent's history. However, recurrent neural networks in reinforcement learning are often fragile and difficult to train, susceptible to catastrophic forgetting and sometimes fail completely as a result. In this work, we propose Deep Transformer Q-Networks (DTQN), a novel architecture utilizing transformers and self-attention to encode an agent's history. DTQN is designed modularly, and we compare results against several modifications to our base model. Our experiments demonstrate the transformer can solve partially observable tasks faster and more stably than previous recurrent approaches.",
    "authors": [
        "Kevin Esslinger",
        "Robert W. Platt",
        "Chris Amato"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes Deep Transformer Q-Networks (DTQN), a novel architecture utilizing transformers and self-attention to encode an agent's history, and demonstrates the transformer can solve partially observable tasks faster and more stably than previous recurrent approaches."
    },
    "citationCount": 18,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}