{
    "acronym": "8324186571ac538302e8d1c66acca05aa575fb1e",
    "title": "Enhanced Automated Code Vulnerability Repair using Large Language Models",
    "seed_ids": [
        "gpt3",
        "0b0debb710366cdff461938c80763eace1651af6",
        "b21670e8061a06ab97e7d6052c9345a326e84ff8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8324186571ac538302e8d1c66acca05aa575fb1e",
    "abstract": "This research addresses the complex challenge of automated repair of code vulnerabilities, vital for enhancing digital security in an increasingly technology-driven world. The study introduces a novel and efficient format for the representation of code modification, using advanced Large Language Models (LLMs) such as Code Llama and Mistral. These models, fine-tuned on datasets featuring C code vulnerabilities, significantly improve the accuracy and adaptability of automated code repair techniques. A key finding is the enhanced repair accuracy of these models when compared to previous methods such as VulRepair, which underscores their practical utility and efficiency. The research also offers a critical assessment of current evaluation metrics, such as perfect predictions, and their limitations in reflecting the true capabilities of automated repair models in real-world scenarios. Following this, it underscores the importance of using test datasets devoid of train samples, emphasizing the need for dataset integrity to enhance the effectiveness of LLMs in code repair tasks. The significance of this work is its contribution to digital security, setting new standards for automated code vulnerability repair and paving the way for future advancements in the fields of cybersecurity and artificial intelligence. The study does not only highlight the potential of LLMs in enhancing code security but also fosters further exploration and research in these crucial areas.",
    "authors": [
        "David de-Fitero-Dominguez",
        "Eva García-López",
        "Antonio Garcia-Cabot",
        "J. Martínez-Herráiz"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The study introduces a novel and efficient format for the representation of code modification, using advanced Large Language Models (LLMs) such as Code Llama and Mistral, which significantly improve the accuracy and adaptability of automated code repair techniques."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}