{
    "acronym": "834192cf3f0c0dfe28b7c6ba33893eaeb760c6dc",
    "title": "CORWA: A Citation-Oriented Related Work Annotation Dataset",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "834192cf3f0c0dfe28b7c6ba33893eaeb760c6dc",
    "abstract": "Academic research is an exploratory activity to discover new solutions to problems. By this nature, academic research works perform literature reviews to distinguish their novelties from prior work. In natural language processing, this literature review is usually conducted under the “Related Work” section. The task of related work generation aims to automatically generate the related work section given the rest of the research paper and a list of papers to cite. Prior work on this task has focused on the sentence as the basic unit of generation, neglecting the fact that related work sections consist of variable length text fragments derived from different information sources. As a first step toward a linguistically-motivated related work generation framework, we present a Citation Oriented Related Work Annotation (CORWA) dataset that labels different types of citation text fragments from different information sources. We train a strong baseline model that automatically tags the CORWA labels on massive unlabeled related work section texts. We further suggest a novel framework for human-in-the-loop, iterative, abstractive related work generation.",
    "authors": [
        "Xiangci Li",
        "Biswadip Mandal",
        "Jessica Ouyang"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Citation Oriented Related Work Annotation (CORWA) dataset that labels different types of citation text fragments from different information sources is presented and a novel framework for human-in-the-loop, iterative, abstractive related work generation is suggested."
    },
    "citationCount": 11,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}