{
    "acronym": "835dcf0ba3402d6a8a8f237ad2020ff3055c9b33",
    "title": "B'MOJO: Hybrid State Space Realizations of Foundation Models with Eidetic and Fading Memory",
    "seed_ids": [
        "griffin",
        "mamba",
        "gla",
        "based",
        "jamba",
        "e9484cf633985ccef70b0ce46866ce232a81ca4b",
        "cbaf689fd9ea9bc939510019d90535d6249b3367",
        "05c1dc502ed51162580ccd320d5668d2fec94a7a",
        "d53fe76bd2795a19ddf52d012917782f6f6f2c1e",
        "62b18cc55dcc7ffe52c28e1086aee893b7bc4334",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "60b35c6d68acced19b0c66edcfc0ee0a2c11efed",
        "412e266cddfd87c79087a88ba1e4d11b89a45a13",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "835dcf0ba3402d6a8a8f237ad2020ff3055c9b33",
    "abstract": "We describe a family of architectures to support transductive inference by allowing memory to grow to a finite but a-priori unknown bound while making efficient use of finite resources for inference. Current architectures use such resources to represent data either eidetically over a finite span (\"context\"in Transformers), or fading over an infinite span (in State Space Models, or SSMs). Recent hybrid architectures have combined eidetic and fading memory, but with limitations that do not allow the designer or the learning process to seamlessly modulate the two, nor to extend the eidetic memory span. We leverage ideas from Stochastic Realization Theory to develop a class of models called B'MOJO to seamlessly combine eidetic and fading memory within an elementary composable module. The overall architecture can be used to implement models that can access short-term eidetic memory\"in-context,\"permanent structural memory\"in-weights,\"fading memory\"in-state,\"and long-term eidetic memory\"in-storage\"by natively incorporating retrieval from an asynchronously updated memory. We show that Transformers, existing SSMs such as Mamba, and hybrid architectures such as Jamba are special cases of B'MOJO and describe a basic implementation, to be open sourced, that can be stacked and scaled efficiently in hardware. We test B'MOJO on transductive inference tasks, such as associative recall, where it outperforms existing SSMs and Hybrid models; as a baseline, we test ordinary language modeling where B'MOJO achieves perplexity comparable to similarly-sized Transformers and SSMs up to 1.4B parameters, while being up to 10% faster to train. Finally, we show that B'MOJO's ability to modulate eidetic and fading memory results in better inference on longer sequences tested up to 32K tokens, four-fold the length of the longest sequences seen during training.",
    "authors": [
        "L. Zancato",
        "Arjun Seshadri",
        "Yonatan Dukler",
        "Aditya Golatkar",
        "Yantao Shen",
        "Benjamin Bowman",
        "Matthew Trager",
        "A. Achille",
        "S. Soatto"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}