{
    "acronym": "83716e05b18365e521ea62388c1c115a80abce94",
    "title": "A Temporal Kolmogorov-Arnold Transformer for Time Series Forecasting",
    "seed_ids": [
        "transformer",
        "14fdab35cc6288083a38a92392af3f1da0b95a90",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "d6b414487787d0b6efd735a3236a690ad13aae70",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "16c844fd4d97f3c6eb38b0d6527c87d184efedc3"
    ],
    "s2id": "83716e05b18365e521ea62388c1c115a80abce94",
    "abstract": "Capturing complex temporal patterns and relationships within multivariate data streams is a difficult task. We propose the Temporal Kolmogorov-Arnold Transformer (TKAT), a novel attention-based architecture designed to address this task using Temporal Kolmogorov-Arnold Networks (TKANs). Inspired by the Temporal Fusion Transformer (TFT), TKAT emerges as a powerful encoder-decoder model tailored to handle tasks in which the observed part of the features is more important than the a priori known part. This new architecture combined the theoretical foundation of the Kolmogorov-Arnold representation with the power of transformers. TKAT aims to simplify the complex dependencies inherent in time series, making them more\"interpretable\". The use of transformer architecture in this framework allows us to capture long-range dependencies through self-attention mechanisms.",
    "authors": [
        "Remi Genet",
        "Hugo Inzirillo"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Temporal Kolmogorov-Arnold Transformer (TKAT) is proposed, a novel attention-based architecture designed to address this task using Temporal Kolmogorov-Arnold Networks (TKANs), inspired by the Temporal Fusion Transformer."
    },
    "citationCount": 8,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}