{
    "acronym": "837ac4ed6825502f0460caec45e12e734c85b113",
    "title": "Dynamic Neural Networks: A Survey",
    "seed_ids": [
        "universaltrans",
        "e2f2662f0734e2edc2b4b36a734de111c7f8d54d",
        "cec7872b194aadf54140578b9be52939eb1112e9",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "33172567ab1dff9ca32c8d995d88bbff466f3236",
        "18d41e3bd94cf38736e37580912c3b4ba56f08d5",
        "a8427ce5aee6d62800c725588e89940ed4910e0d"
    ],
    "s2id": "837ac4ed6825502f0460caec45e12e734c85b113",
    "abstract": "Dynamic neural network is an emerging research topic in deep learning. Compared to static models which have fixed computational graphs and parameters at the inference stage, dynamic networks can adapt their structures or parameters to different inputs, leading to notable advantages in terms of accuracy, computational efficiency, adaptiveness, etc. In this survey, we comprehensively review this rapidly developing area by dividing dynamic networks into three main categories: 1) sample-wise dynamic models that process each sample with data-dependent architectures or parameters; 2) spatial-wise dynamic networks that conduct adaptive computation with respect to different spatial locations of image data; and 3) temporal-wise dynamic models that perform adaptive inference along the temporal dimension for sequential data such as videos and texts. The important research problems of dynamic networks, e.g., architecture design, decision making scheme, optimization technique and applications, are reviewed systematically. Finally, we discuss the open problems in this field together with interesting future research directions.",
    "authors": [
        "Yizeng Han",
        "Gao Huang",
        "Shiji Song",
        "Le Yang",
        "Honghui Wang",
        "Yulin Wang"
    ],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey comprehensively review this rapidly developing area of dynamic networks by dividing dynamic networks into three main categories: sample-wise dynamic models that process each sample with data-dependent architectures or parameters; spatial-wiseynamic networks that conduct adaptive computation with respect to different spatial locations of image data; and temporal-wise Dynamic networks that perform adaptive inference along the temporal dimension for sequential data."
    },
    "citationCount": 465,
    "influentialCitationCount": 22,
    "code": null,
    "description": null,
    "url": null
}