{
    "acronym": "837a1678c7ea20215626e1a8b7dc1e374f4650e5",
    "title": "Exploring Pathogen Presence Prediction in Pastured Poultry Farms through Transformer-Based Models and Attention Mechanism Explainability",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "837a1678c7ea20215626e1a8b7dc1e374f4650e5",
    "abstract": "In this study, we explore how transformer models, which are known for their attention mechanisms, can improve pathogen prediction in pastured poultry farming. By combining farm management practices with microbiome data, our model outperforms traditional prediction methods in terms of the F1 score—an evaluation metric for model performance—thus fulfilling an essential need in predictive microbiology. Additionally, the emphasis is on making our model’s predictions explainable. We introduce a novel approach for identifying feature importance using the model’s attention matrix and the PageRank algorithm, offering insights that enhance our comprehension of established techniques such as DeepLIFT. Our results showcase the efficacy of transformer models in pathogen prediction for food safety and mark a noteworthy contribution to the progress of explainable AI within the biomedical sciences. This study sheds light on the impact of effective farm management practices and highlights the importance of technological advancements in ensuring food safety.",
    "authors": [
        "Athish Ram Das",
        "N. Pillai",
        "B. Nanduri",
        "Michael J. Rothrock",
        "Mahalingam Ramkumar"
    ],
    "venue": "Microorganisms",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study explores how transformer models, which are known for their attention mechanisms, can improve pathogen prediction in pastured poultry farming by combining farm management practices with microbiome data, and introduces a novel approach for identifying feature importance using the model’s attention matrix and the PageRank algorithm."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}