{
    "acronym": "8381303a3b19cd55dd2d7d356b824940382029d0",
    "title": "ConText at WASSA 2024 Empathy and Personality Shared Task: History-Dependent Embedding Utterance Representations for Empathy and Emotion Prediction in Conversations",
    "seed_ids": [
        "bert",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "8381303a3b19cd55dd2d7d356b824940382029d0",
    "abstract": "Empathy and emotion prediction are key components in the development of effective and empathetic agents, amongst several other applications. The WASSA shared task on empathy and emotion prediction in interactions presents an opportunity to benchmark approaches to these tasks. Appropriately selecting and representing the historical context is crucial in the modelling of empathy and emotion in conversations. In our submissions, we model empathy, emotion polarity and emotion intensity of each utterance in a conversation by feeding the utterance to be classified together with its conversational context, i.e., a certain number of previous conversational turns, as input to an encoder Pre-trained Language Model, to which we append a regression head for prediction. We also model perceived counterparty empathy of each interlocutor by feeding all utterances from the conversation and a token identifying the interlocutor for which we are predicting the empathy. Our system officially ranked $1^{st}$ at the CONV-turn track and $2^{nd}$ at the CONV-dialog track.",
    "authors": [
        "Patrícia Pereira",
        "Helena Moniz",
        "Joao Paulo Carvalho"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "In these submissions, empathy, emotion polarity and emotion intensity of each utterance in a conversation is model by feeding the utterance to be classified together with its conversational context as input to an encoder Pre-trained Language Model, to which a regression head for prediction is added."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}