{
    "acronym": "8393069626f6df8bfe69639ad2700ff8834f83f7",
    "title": "360$^\\circ$REA: Towards A Reusable Experience Accumulation with 360{\\deg} Assessment for Multi-Agent System",
    "seed_ids": [
        "gpt3",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2"
    ],
    "s2id": "8393069626f6df8bfe69639ad2700ff8834f83f7",
    "abstract": "Large language model agents have demonstrated remarkable advancements across various complex tasks. Recent works focus on optimizing the agent team or employing self-reflection to iteratively solve complex tasks. Since these agents are all based on the same LLM, only conducting self-evaluation or removing underperforming agents does not substantively enhance the capability of the agents. We argue that a comprehensive evaluation and accumulating experience from evaluation feedback is an effective approach to improving system performance. In this paper, we propose Reusable Experience Accumulation with 360$^\\circ$ Assessment (360$^\\circ$REA), a hierarchical multi-agent framework inspired by corporate organizational practices. The framework employs a novel 360$^\\circ$ performance assessment method for multi-perspective performance evaluation with fine-grained assessment. To enhance the capability of agents in addressing complex tasks, we introduce dual-level experience pool for agents to accumulate experience through fine-grained assessment. Extensive experiments on complex task datasets demonstrate the effectiveness of 360$^\\circ$REA.",
    "authors": [
        "Shen Gao",
        "Hao Li",
        "Chengrui Huang",
        "Quan Tu",
        "Zhiliang Tian",
        "Minlie Huang",
        "Shuo Shang"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper argues that a comprehensive evaluation and accumulating experience from evaluation feedback is an effective approach to improving system performance and proposes Reusable Experience Accumulation with 360$^\\circ$ Assessment (360$^\\circ$REA), a hierarchical multi-agent framework inspired by corporate organizational practices."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}