{
    "acronym": "83cce7cb03b23adb956c8614f356f9cc2d1ee44e",
    "title": "M2UNet: MetaFormer Multi-Scale Upsampling Network for Polyp Segmentation",
    "seed_ids": [
        "metaformer"
    ],
    "s2id": "83cce7cb03b23adb956c8614f356f9cc2d1ee44e",
    "abstract": "Polyp segmentation has recently garnered significant attention, and multiple methods have been formulated to achieve commendable outcomes. However, these techniques often confront difficulty when working with the complex polyp foreground and their surrounding regions because of the nature of convolution operation. Besides, most existing methods forget to exploit the potential information from multiple decoder stages. To address this challenge, we suggest combining MetaFormer, introduced as a baseline for integrating CNN and Transformer, with UNet framework and incorporating our Multi-scale Upsampling block (MU). This simple module makes it possible to combine multi-level information by exploring multiple receptive field paths of the shallow decoder stage and then adding with the higher stage to aggregate better feature representation, which is essential in medical image segmentation. Taken all together, we propose MetaFormer Multi-scale Upsampling Network $\\overline{(}\\mathrm{M}^{2}\\text{UNet})$ for the polyp segmentation task. Extensive experiments on five benchmark datasets demonstrate that our method achieved competitive performance compared with several previous methods.",
    "authors": [
        "Quoc-Huy Trinh",
        "Nhat-Tan Bui",
        "Trong-Hieu Nguyen Mau",
        "Minh Le Nguyen",
        "H. Phan",
        "M. Tran",
        "Hai-Dang Nguyen"
    ],
    "venue": "European Signal Processing Conference",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "MetaFormer, introduced as a baseline for integrating CNN and Transformer, with UNet framework and incorporating the Multi-scale Upsampling block (MU) is proposed, which makes it possible to combine multi-level information by exploring multiple receptive field paths of the shallow decoder stage and then adding with the higher stage to aggregate better feature representation, which is essential in medical image segmentation."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}