{
    "acronym": "83d201d503b863fec7d1225f00a141e722e03f17",
    "title": "Using Left and Right Brains Together: Towards Vision and Language Planning",
    "seed_ids": [
        "gpt3",
        "1206b05eae5a06ba662ae79fb291b50e359c4f42",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "83d201d503b863fec7d1225f00a141e722e03f17",
    "abstract": "Large Language Models (LLMs) and Large Multi-modality Models (LMMs) have demonstrated remarkable decision masking capabilities on a variety of tasks. However, they inherently operate planning within the language space, lacking the vision and spatial imagination ability. In contrast, humans utilize both left and right hemispheres of the brain for language and visual planning during the thinking process. Therefore, we introduce a novel vision-language planning framework in this work to perform concurrent visual and language planning for tasks with inputs of any form. Our framework incorporates visual planning to capture intricate environmental details, while language planning enhances the logical coherence of the overall system. We evaluate the effectiveness of our framework across vision-language tasks, vision-only tasks, and language-only tasks. The results demonstrate the superior performance of our approach, indicating that the integration of visual and language planning yields better contextually aware task execution.",
    "authors": [
        "Jun Cen",
        "Chenfei Wu",
        "Xiao Liu",
        "Sheng-Siang Yin",
        "Yixuan Pei",
        "Jinglong Yang",
        "Qifeng Chen",
        "Nan Duan",
        "Jianguo Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a novel vision-language planning framework to perform concurrent visual and language planning for tasks with inputs of any form, and demonstrates the superior performance of this approach."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}