{
    "acronym": "840ccc871924c5bd0d51f79618a80084a7f53b09",
    "title": "Understand the Dynamic World: An End-to-End Knowledge Informed Framework for Open Domain Entity State Tracking",
    "seed_ids": [
        "gpt2",
        "fc92ed618ded1d1463f7ec736093f420b05827db",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "840ccc871924c5bd0d51f79618a80084a7f53b09",
    "abstract": "Open domain entity state tracking aims to predict reasonable state changes of entities (i.e., [attribute] of [entity] was [before_state] and [after_state] afterwards) given the action descriptions. It's important to many reasoning tasks to support human everyday activities. However, it's challenging as the model needs to predict an arbitrary number of entity state changes caused by the action while most of the entities are implicitly relevant to the actions and their attributes as well as states are from open vocabularies. To tackle these challenges, we propose a novel end-to-end Knowledge Informed framework for open domain Entity State Tracking, namely KIEST, which explicitly retrieves the relevant entities and attributes from external knowledge graph (i.e., ConceptNet) and incorporates them to autoregressively generate all the entity state changes with a novel dynamic knowledge grained encoder-decoder framework. To enforce the logical coherence among the predicted entities, attributes, and states, we design a new constraint decoding strategy and employ a coherence reward to improve the decoding process. Experimental results show that our proposed KIEST framework significantly outperforms the strong baselines on the public benchmark dataset - OpenPI",
    "authors": [
        "Mingchen Li",
        "Lifu Huang"
    ],
    "venue": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel end-to-end Knowledge Informed framework for open domain Entity State Tracking, namely KIEST, which explicitly retrieves the relevant entities and attributes from external knowledge graph and incorporates them to autoregressively generate all the entity state changes with a novel dynamic knowledge grained encoder-decoder framework is proposed."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}