{
    "acronym": "841e8f35a078416719d77bfba5f9992043f1dbc2",
    "title": "Localizing Moments of Actions in Untrimmed Videos of Infants with Autism Spectrum Disorder",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "841e8f35a078416719d77bfba5f9992043f1dbc2",
    "abstract": "Autism Spectrum Disorder (ASD) presents significant challenges in early diagnosis and intervention, impacting children and their families. With prevalence rates rising, there is a critical need for accessible and efficient screening tools. Leveraging machine learning (ML) techniques, in particular Temporal Action Localization (TAL), holds promise for automating ASD screening. This paper introduces a self-attention based TAL model designed to identify ASD-related behaviors in infant videos. Unlike existing methods, our approach simplifies complex modeling and emphasizes efficiency, which is essential for practical deployment in real-world scenarios. Importantly, this work underscores the importance of developing computer vision methods capable of operating in naturilistic environments with little equipment control, addressing key challenges in ASD screening. This study is the first to conduct end-to-end temporal action localization in untrimmed videos of infants with ASD, offering promising avenues for early intervention and support. We report baseline results of behavior detection using our TAL model. We achieve 70% accuracy for look face, 79% accuracy for look object, 72% for smile and 65% for vocalization.",
    "authors": [
        "H. Helvaci",
        "S. Cheung",
        "Chen-Nee Chuah",
        "Sally Ozonoff"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study is the first to conduct end-to-end temporal action localization in untrimmed videos of infants with ASD, offering promising avenues for early intervention and support and underscores the importance of developing computer vision methods capable of operating in naturilistic environments with little equipment control."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}