{
    "acronym": "84725855d10b531eb8cbe54935dda0440c2fc750",
    "title": "Don't Make Your LLM an Evaluation Benchmark Cheater",
    "seed_ids": [
        "gpt3",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "84725855d10b531eb8cbe54935dda0440c2fc750",
    "abstract": "Large language models~(LLMs) have greatly advanced the frontiers of artificial intelligence, attaining remarkable improvement in model capacity. To assess the model performance, a typical approach is to construct evaluation benchmarks for measuring the ability level of LLMs in different aspects. Despite that a number of high-quality benchmarks have been released, the concerns about the appropriate use of these benchmarks and the fair comparison of different models are increasingly growing. Considering these concerns, in this paper, we discuss the potential risk and impact of inappropriately using evaluation benchmarks and misleadingly interpreting the evaluation results. Specially, we focus on a special issue that would lead to inappropriate evaluation, \\ie \\emph{benchmark leakage}, referring that the data related to evaluation sets is occasionally used for model training. This phenomenon now becomes more common since pre-training data is often prepared ahead of model test. We conduct extensive experiments to study the effect of benchmark leverage, and find that it can dramatically boost the evaluation results, which would finally lead to an unreliable assessment of model performance. To improve the use of existing evaluation benchmarks, we finally present several guidelines for both LLM developers and benchmark maintainers. We hope this work can draw attention to appropriate training and evaluation of LLMs.",
    "authors": [
        "Kun Zhou",
        "Yutao Zhu",
        "Zhipeng Chen",
        "Wentong Chen",
        "Wayne Xin Zhao",
        "Xu Chen",
        "Yankai Lin",
        "Ji-Rong Wen",
        "Jiawei Han"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper discusses the potential risk and impact of inappropriately using evaluation benchmarks and misleadingly interpreting the evaluation results, and presents several guidelines for both LLM developers and benchmark maintainers to improve the use of existing evaluation benchmarks."
    },
    "citationCount": 87,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}