{
    "acronym": "84b99762e1ef5739672ca6ddc071936d94b610bf",
    "title": "EnzChemRED, a rich enzyme chemistry relation extraction dataset",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "84b99762e1ef5739672ca6ddc071936d94b610bf",
    "abstract": "Expert curation is essential to capture knowledge of enzyme functions from the scientific literature in FAIR open knowledgebases but cannot keep pace with the rate of new discoveries and new publications. In this work we present EnzChemRED, for Enzyme Chemistry Relation Extraction Dataset, a new training and benchmarking dataset to support the development of Natural Language Processing (NLP) methods such as (large) language models that can assist enzyme curation. EnzChemRED consists of 1,210 expert curated PubMed abstracts in which enzymes and the chemical reactions they catalyze are annotated using identifiers from the UniProt Knowledgebase (UniProtKB) and the ontology of Chemical Entities of Biological Interest (ChEBI). We show that fine-tuning pre-trained language models with EnzChemRED can significantly boost their ability to identify mentions of proteins and chemicals in text (Named Entity Recognition, or NER) and to extract the chemical conversions in which they participate (Relation Extraction, or RE), with average F1 score of 86.30% for NER, 86.66% for RE for chemical conversion pairs, and 83.79% for RE for chemical conversion pairs and linked enzymes. We combine the best performing methods after fine-tuning using EnzChemRED to create an end-to-end pipeline for knowledge extraction from text and apply this to abstracts at PubMed scale to create a draft map of enzyme functions in literature to guide curation efforts in UniProtKB and the reaction knowledgebase Rhea. The EnzChemRED corpus is freely available at https://ftp.expasy.org/databases/rhea/nlp/.",
    "authors": [
        "Po-Ting Lai",
        "E. Coudert",
        "L. Aimo",
        "K. Axelsen",
        "L. Breuza",
        "E. D. Castro",
        "M. Feuermann",
        "A. Morgat",
        "L. Pourcel",
        "I. Pedruzzi",
        "S. Poux",
        "Nicole Redaschi",
        "C. Rivoire",
        "Anastasia Sveshnikova",
        "Chih-Hsuan Wei",
        "Robert Leaman",
        "Ling Luo",
        "Zhiyong Lu",
        "Alan Bridge"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that fine-tuning pre-trained language models with EnzChemRED can significantly boost their ability to identify mentions of proteins and chemicals in text and to extract the chemical conversions in which they participate (Relation Extraction, or RE), with average F1 score of 86.30%."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}