{
    "acronym": "84c86e775f2ca4b2e49d18c25ea8fe6f025d32ce",
    "title": "NusaBERT: Teaching IndoBERT to be Multilingual and Multicultural",
    "seed_ids": [
        "bert",
        "1ebcf1884390c28f24b3adaf5a7aba5b9453b48b",
        "34c2939d3147946b2ac218e7857e1bc4c8902679",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "84c86e775f2ca4b2e49d18c25ea8fe6f025d32ce",
    "abstract": "Indonesia's linguistic landscape is remarkably diverse, encompassing over 700 languages and dialects, making it one of the world's most linguistically rich nations. This diversity, coupled with the widespread practice of code-switching and the presence of low-resource regional languages, presents unique challenges for modern pre-trained language models. In response to these challenges, we developed NusaBERT, building upon IndoBERT by incorporating vocabulary expansion and leveraging a diverse multilingual corpus that includes regional languages and dialects. Through rigorous evaluation across a range of benchmarks, NusaBERT demonstrates state-of-the-art performance in tasks involving multiple languages of Indonesia, paving the way for future natural language understanding research for under-represented languages.",
    "authors": [
        "Wilson Wongso",
        "David Samuel Setiawan",
        "Steven Limcorn",
        "Ananto Joyoadikusumo"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Through rigorous evaluation across a range of benchmarks, NusaBERT demonstrates state-of-the-art performance in tasks involving multiple languages of Indonesia, paving the way for future natural language understanding research for under-represented languages."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}