{
    "acronym": "84cd9279669c056fa3c38fe90a06265ec7852e03",
    "title": "A framework for conditional diffusion modelling with applications in motif scaffolding for protein design",
    "seed_ids": [
        "classfreediffu",
        "37232ccce1cfafbe9b9918557f0b6cdf80e5b83a",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "84cd9279669c056fa3c38fe90a06265ec7852e03",
    "abstract": "Many protein design applications, such as binder or enzyme design, require scaffolding a structural motif with high precision. Generative modelling paradigms based on denoising diffusion processes emerged as a leading candidate to address this motif scaffolding problem and have shown early experimental success in some cases. In the diffusion paradigm, motif scaffolding is treated as a conditional generation task, and several conditional generation protocols were proposed or imported from the Computer Vision literature. However, most of these protocols are motivated heuristically, e.g. via analogies to Langevin dynamics, and lack a unifying framework, obscuring connections between the different approaches. In this work, we unify conditional training and conditional sampling procedures under one common framework based on the mathematically well-understood Doob's h-transform. This new perspective allows us to draw connections between existing methods and propose a new variation on existing conditional training protocols. We illustrate the effectiveness of this new protocol in both, image outpainting and motif scaffolding and find that it outperforms standard methods.",
    "authors": [
        "Kieran Didi",
        "Francisco Vargas",
        "Simon V. Mathis",
        "Vincent Dutordoir",
        "Emile Mathieu",
        "U. J. Komorowska",
        "Pietro Liò"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work unify conditional training and conditional sampling procedures under one common framework based on the mathematically well-understood Doob's h-transform, which allows to draw connections between existing methods and propose a new variation on existing conditional training protocols."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}