{
    "acronym": "8572ec8d5e36a16d0e6c28b0b9618337e0906ce0",
    "title": "MatText: Do Language Models Need More than Text & Scale for Materials Modeling?",
    "seed_ids": [
        "bert",
        "49c45d2a2773c537804c38d69cde67e00fbad6fe",
        "1ec3a3ff77cb4b424499b3805ecc90182ecd8f8b",
        "70ffc32ecb69740bd508a7863a2d303d4eb4f208",
        "d62c4d00b277e948956b6610ce2644e88fe1577b",
        "822f41fdb57c57db614a27936474644daf12b715",
        "2db3eb03b0a9fedde37066673532804d3e224a4a",
        "b92628d13e8d090d042232fe6ae0b8998634b893"
    ],
    "s2id": "8572ec8d5e36a16d0e6c28b0b9618337e0906ce0",
    "abstract": "Effectively representing materials as text has the potential to leverage the vast advancements of large language models (LLMs) for discovering new materials. While LLMs have shown remarkable success in various domains, their application to materials science remains underexplored. A fundamental challenge is the lack of understanding of how to best utilize text-based representations for materials modeling. This challenge is further compounded by the absence of a comprehensive benchmark to rigorously evaluate the capabilities and limitations of these text representations in capturing the complexity of material systems. To address this gap, we propose MatText, a suite of benchmarking tools and datasets designed to systematically evaluate the performance of language models in modeling materials. MatText encompasses nine distinct text-based representations for material systems, including several novel representations. Each representation incorporates unique inductive biases that capture relevant information and integrate prior physical knowledge about materials. Additionally, MatText provides essential tools for training and benchmarking the performance of language models in the context of materials science. These tools include standardized dataset splits for each representation, probes for evaluating sensitivity to geometric factors, and tools for seamlessly converting crystal structures into text. Using MatText, we conduct an extensive analysis of the capabilities of language models in modeling materials. Our findings reveal that current language models consistently struggle to capture the geometric information crucial for materials modeling across all representations. Instead, these models tend to leverage local information, which is emphasized in some of our novel representations. Our analysis underscores MatText's ability to reveal shortcomings of text-based methods for materials design.",
    "authors": [
        "Nawaf Alampara",
        "Santiago Miret",
        "K. Jablonka"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": null,
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}