{
    "acronym": "860523e59ba2fdd1b9288415e5d801551c54ccef",
    "title": "TextMachina: Seamless Generation of Machine-Generated Text Datasets",
    "seed_ids": [
        "gpt3",
        "02f0d5faa1cd88ea0afe48b756bfbf9adfefba28",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "492a655a67e6ec7423a968cedb70eec0cdbc8e98",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1"
    ],
    "s2id": "860523e59ba2fdd1b9288415e5d801551c54ccef",
    "abstract": "Recent advancements in Large Language Models (LLMs) have led to high-quality Machine-Generated Text (MGT), giving rise to countless new use cases and applications. However, easy access to LLMs is posing new challenges due to misuse. To address malicious usage, researchers have released datasets to effectively train models on MGT-related tasks. Similar strategies are used to compile these datasets, but no tool currently unifies them. In this scenario, we introduce TextMachina, a modular and extensible Python framework, designed to aid in the creation of high-quality, unbiased datasets to build robust models for MGT-related tasks such as detection, attribution, mixcase, or boundary detection. It provides a user-friendly pipeline that abstracts away the inherent intricacies of building MGT datasets, such as LLM integrations, prompt templating, and bias mitigation. The quality of the datasets generated by TextMachina has been assessed in previous works, including shared tasks where more than one hundred teams trained robust MGT detectors.",
    "authors": [
        "A. Sarvazyan",
        "Jos'e A. Gonz'alez",
        "Marc Franco-Salvador"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "TextMachina is introduced, a modular and extensible Python framework, designed to aid in the creation of high-quality, unbiased datasets to build robust models for MGT-related tasks such as detection, attribution, mixcase, or boundary detection."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}