{
    "acronym": "863effe28eb019f86917c100003d5a84e3702c7f",
    "title": "The Role of Preprocessing for Word Representation Learning in Affective Tasks",
    "seed_ids": [
        "bert",
        "9b10c49575c5aa07b5076d2f5b27c67b68b09c9b",
        "b76e98a0a023d37c6534aa2ead09c8ff595f0bae"
    ],
    "s2id": "863effe28eb019f86917c100003d5a84e3702c7f",
    "abstract": "Affective tasks, including sentiment analysis, emotion classification, and sarcasm detection have drawn a lot of attention in recent years due to a broad range of useful applications in various domains. The main goal of affect detection tasks is to recognize states such as mood, sentiment, and emotions from textual data (e.g., news articles or product reviews). Despite the importance of utilizing preprocessing steps in different stages (i.e., word representation learning and building a classification model) of affect detection tasks, this topic has not been studied well. To that end, we explore whether applying various preprocessing methods (stemming, lemmatization, stopword removal, punctuation removal and so on) and their combinations in different stages of the affect detection pipeline can improve the model performance. The are many preprocessing approaches that can be utilized in affect detection tasks. However, their influence on the final performance depends on the type of preprocessing and the stages that they are applied. Moreover, the preprocessing impacts vary across different affective tasks. Our analysis provides thorough insights into how preprocessing steps can be applied in building an effect detection pipeline and their respective influence on performance.",
    "authors": [
        "Nastaran Babanejad",
        "Heidar Davoudi",
        "Ameeta Agrawal",
        "Aijun An",
        "M. Papagelis"
    ],
    "venue": "IEEE Transactions on Affective Computing",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work explores whether applying various preprocessing methods and their combinations in different stages of the affect detection pipeline can improve the model performance and provides thorough insights into how preprocessing steps can be applied in building an effect detection pipeline and their respective influence on performance."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}