{
    "acronym": "86552c4a5ee38ecbad1b2d41b8031b01b92237ea",
    "title": "Couplformer: Rethinking Vision Transformer with Coupling Attention",
    "seed_ids": [
        "performer",
        "linformer",
        "reformer",
        "6fa1cfc4f97f03a8485692418c7aa1a06c574a85",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "2cf3bd0cc1382f35384e259d99e4f9744eeaed28",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "86552c4a5ee38ecbad1b2d41b8031b01b92237ea",
    "abstract": "With the development of the self-attention mechanism, the Transformer model has demonstrated its outstanding performance in the computer vision domain. However, the massive computation brought from the full attention mechanism became a heavy burden for memory consumption. Sequentially, the limitation of memory consumption hinders the deployment of the Transformer model on the embedded system where the computing resources are limited. To remedy this problem, we propose a novel memory economy attention mechanism named Couplformer, which decouples the attention map into two sub-matrices and generates the alignment scores from spatial information. Our method enables the Transformer model to improve time and memory efficiency while maintaining expressive power. A series of different scale image classification tasks are applied to evaluate the effectiveness of our model. The result of experiments shows that on the ImageNet-1K classification task, the Couplformer can significantly decrease 42% memory consumption compared with the regular Transformer. Meanwhile, it accesses sufficient accuracy requirements, which outperforms 0.56% on Top-1 accuracy and occupies the same memory footprint. Besides, the Couplformer achieves state-of-art performance in MS COCO 2017 object detection and instance segmentation tasks. As a result, the Couplformer can serve as an efficient backbone in visual tasks and provide a novel perspective on deploying attention mechanisms for researchers.",
    "authors": [
        "Hai Lan",
        "Xihao Wang",
        "Hao Shen",
        "Peidong Liang",
        "Xian Wei"
    ],
    "venue": "IEEE Workshop/Winter Conference on Applications of Computer Vision",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel memory economy attention mechanism named Couplformer is proposed, which decouples the attention map into two sub-matrices and generates the alignment scores from spatial information and can serve as an efficient backbone in visual tasks and provide a novel perspective on deploying attention mechanisms for researchers."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}