{
    "acronym": "868d4d9c9d8afee78f21a0113cff762ff5eb4961",
    "title": "Translational Equivariance in Kernelizable Attention",
    "seed_ids": [
        "performer",
        "routingtransformer",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "657329c633709dd1ac34a30d57341b186b1a47c2"
    ],
    "s2id": "868d4d9c9d8afee78f21a0113cff762ff5eb4961",
    "abstract": "While Transformer architectures have show remarkable success, they are bound to the computation of all pairwise interactions of input element and thus suffer from limited scalability. Recent work has been successful by avoiding the computation of the complete attention matrix, yet leads to problems down the line. The absence of an explicit attention matrix makes the inclusion of inductive biases relying on relative interactions between elements more challenging. An extremely powerful inductive bias is translational equivariance, which has been conjectured to be responsible for much of the success of Convolutional Neural Networks on image recognition tasks. In this work we show how translational equivariance can be implemented in efficient Transformers based on kernelizable attention - Performers. Our experiments highlight that the devised approach significantly improves robustness of Performers to shifts of input images compared to their naive application. This represents an important step on the path of replacing Convolutional Neural Networks with more expressive Transformer architectures and will help to improve sample efficiency and robustness in this realm.",
    "authors": [
        "Max Horn",
        "K. Shridhar",
        "Elrich Groenewald",
        "Philipp F. M. Baumann"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work shows how translational equivariance can be implemented in efficient Transformers based on kernelizable attention - Performers and highlights that the devised approach significantly improves robustness of Performers to shifts of input images compared to their naive application."
    },
    "citationCount": 6,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}