{
    "acronym": "86dac3ff83a0022ed10350690b970b7415e654d6",
    "title": "Curriculum Prompt Learning with Self-Training for Abstractive Dialogue Summarization",
    "seed_ids": [
        "longformer",
        "fa51076458b7bcf9a60f476d525755e47199a6d8",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "86dac3ff83a0022ed10350690b970b7415e654d6",
    "abstract": "Succinctly summarizing dialogue is a task of growing interest, but inherent challenges, such as insufficient training data and low information density impede our ability to train abstractive models. In this work, we propose a novel curriculum-based prompt learning method with self-training to address these problems. Specifically, prompts are learned using a curriculum learning strategy that gradually increases the degree of prompt perturbation, thereby improving the dialogue understanding and modeling capabilities of our model. Unlabeled dialogue is incorporated by means of self-training so as to reduce the dependency on labeled data. We further investigate topic-aware prompts to better plan for the generation of summaries. Experiments confirm that our model substantially outperforms strong baselines and achieves new state-of-the-art results on the AMI and ICSI datasets. Human evaluations also show the superiority of our model with regard to the summary generation quality.",
    "authors": [
        "Changqun Li",
        "Linlin Wang",
        "Xin Lin",
        "Gerard de Melo",
        "Liang He"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel curriculum-based prompt learning method with self-training that substantially outperforms strong baselines and achieves new state-of-the-art results on the AMI and ICSI datasets is proposed."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}