{
    "acronym": "87c635e6a6ddd69d4c66891ec479a8a39bab0749",
    "title": "Diffusion Augmentation for Sequential Recommendation",
    "seed_ids": [
        "classfreediffu",
        "5fa10872ef8037853ff7c8baf5f77fb55a918eca",
        "a979742220a88b1d32e1fbe72c41e8ba3007053c",
        "beec9c8657d370efdb1b259cc27fcbf5697282c9",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "690edf44e8739fd80bdfb76f40c9a4a222f3bba8"
    ],
    "s2id": "87c635e6a6ddd69d4c66891ec479a8a39bab0749",
    "abstract": "Sequential recommendation (SRS) has become the technical foundation in many applications recently, which aims to recommend the next item based on the user's historical interactions. However, sequential recommendation often faces the problem of data sparsity, which widely exists in recommender systems. Besides, most users only interact with a few items, but existing SRS models often underperform these users. Such a problem, named the long-tail user problem, is still to be resolved. Data augmentation is a distinct way to alleviate these two problems, but they often need fabricated training strategies or are hindered by poor-quality generated interactions. To address these problems, we propose a Diffusion Augmentation for Sequential Recommendation (DiffuASR) for a higher quality generation. The augmented dataset by DiffuASR can be used to train the sequential recommendation models directly, free from complex training procedures. To make the best of the generation ability of the diffusion model, we first propose a diffusion-based pseudo sequence generation framework to fill the gap between image and sequence generation. Then, a sequential U-Net is designed to adapt the diffusion noise prediction model U-Net to the discrete sequence generation task. At last, we develop two guide strategies to assimilate the preference between generated and origin sequences. To validate the proposed DiffuASR, we conduct extensive experiments on three real-world datasets with three sequential recommendation models. The experimental results illustrate the effectiveness of DiffuASR. As far as we know, DiffuASR is one pioneer that introduce the diffusion model to the recommendation.The implementation code is available online.",
    "authors": [
        "Qidong Liu",
        "Fan Yan",
        "Xiangyu Zhao",
        "Zhaochen Du",
        "Huifeng Guo",
        "Ruiming Tang",
        "Feng Tian"
    ],
    "venue": "International Conference on Information and Knowledge Management",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Diffusion Augmentation for Sequential Recommendation (DiffuASR) for a higher quality generation of sequential recommendation models using a diffusion-based pseudo sequence generation framework to fill the gap between image and sequence generation."
    },
    "citationCount": 9,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}