{
    "acronym": "8827b7b7e6dbba853c7e647fd06aa92e42b5f273",
    "title": "Prompt-Based Bias Calibration for Better Zero/Few-Shot Learning of Language Models",
    "seed_ids": [
        "bert",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "5d22b241836e30d5b0d852b463951ab7e3245ea4",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8827b7b7e6dbba853c7e647fd06aa92e42b5f273",
    "abstract": "Prompt learning is susceptible to intrinsic bias present in pre-trained language models (LMs), resulting in sub-optimal performance of prompt-based zero/few-shot learning. In this work, we propose a null-input prompting method to calibrate intrinsic bias encoded in pre-trained LMs. Different from prior efforts that address intrinsic bias primarily for social fairness and often involve excessive computational cost, our objective is to explore enhancing LMs' performance in downstream zero/few-shot learning while emphasizing the efficiency of intrinsic bias calibration. Specifically, we leverage a diverse set of auto-selected null-meaning inputs generated from GPT-4 to prompt pre-trained LMs for intrinsic bias probing. Utilizing the bias-reflected probability distribution, we formulate a distribution disparity loss for bias calibration, where we exclusively update bias parameters ($0.1\\%$ of total parameters) of LMs towards equal probability distribution. Experimental results show that the calibration promotes an equitable starting point for LMs while preserving language modeling abilities. Across a wide range of datasets, including sentiment analysis and topic classification, our method significantly improves zero/few-shot learning performance of LMs for both in-context learning and prompt-based fine-tuning (on average $9\\%$ and $2\\%$, respectively).",
    "authors": [
        "Kang He",
        "Yinghan Long",
        "Kaushik Roy"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a null-input prompting method to calibrate intrinsic bias encoded in pre-trained LMs to improve zero/few-shot learning performance of LMs for both in-context learning and prompt-based fine-tuning."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}