{
    "acronym": "884ca2feb4ffb14390e98daf95d1efbdca7a9b11",
    "title": "XL3M: A Training-free Framework for LLM Length Extension Based on Segment-wise Inference",
    "seed_ids": [
        "yarn",
        "pcw",
        "3fd5bc3077d04965eaa3498372c39bbdd09d55e4",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "5e0cb1c4b91a7486e1c2b15a44a0be56bd74bdc0",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "2dfb9171e180dcb0af23d305e024d43d311708ab",
        "ca31b8584b6c022ef15ddfe994fe361e002b7729",
        "b069c32fcd77160f944ab3ba71ab6f0cfb782c68",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "6f6e2e0311589a9af045f6acd00b7dee6d19fce4",
        "dbc368bc8b49347dd27679894524fa62f88492c9",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "2c5460afa19ad6fc2568b7e210115acacc14a40c",
        "980e55d9226cac302d0fae7732da4e67b8bc952c",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "0e802c0739771acf70e60d59c2df51cd7e8c50c0",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "e3aa232577bb427b1f3a34acbdef84bd85734042"
    ],
    "s2id": "884ca2feb4ffb14390e98daf95d1efbdca7a9b11",
    "abstract": "Length generalization failure problem, namely the large language model (LLM) fails to generalize to texts longer than its maximum training length, greatly restricts the application of LLM in the scenarios with streaming long inputs. To address this problem, the existing methods either require substantial costs or introduce precision loss. In this paper, we empirically find that the accuracy of the LLM's prediction is highly correlated to its certainty. Based on this, we propose an efficient training free framework, named XL3M (it means extra-long large language model), which enables the LLMs trained on short sequences to reason extremely long sequence without any further training or fine-tuning. Under the XL3M framework, the input context will be firstly decomposed into multiple short sub-contexts, where each sub-context contains an independent segment and a common ``question'' which is a few tokens from the end of the original context. Then XL3M gives a method to measure the relevance between each segment and the ``question'', and constructs a concise key context by splicing all the relevant segments in chronological order. The key context is further used instead of the original context to complete the inference task. Evaluations on comprehensive benchmarks show the superiority of XL3M. Using our framework, a Llama2-7B model is able to reason 20M long sequences on an 8-card Huawei Ascend 910B NPU machine with 64GB memory per card.",
    "authors": [
        "Shengnan Wang",
        "Youhui Bai",
        "Lin Zhang",
        "Pingyi Zhou",
        "Shixiong Zhao",
        "Gong Zhang",
        "Sen Wang",
        "Renhai Chen",
        "Hua Xu",
        "Hongwei Sun"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An efficient training free framework, named XL3M (it means extra-long large language model), is proposed, which enables the LLMs trained on short sequences to reason extremely long sequence without any further training or fine-tuning."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}