{
    "acronym": "8853bb8820cc91be5b6b46efbdfca7dc9b0665aa",
    "title": "Convolution Driven Vision Transformer for the Prediction of Mild Cognitive Impairment to Alzheimer’s disease Progression",
    "seed_ids": [
        "bert",
        "35a9749df07a2ab97c51af4d260b095b00da7676"
    ],
    "s2id": "8853bb8820cc91be5b6b46efbdfca7dc9b0665aa",
    "abstract": "Alzheimer’s disease (AD) poses a significant challenge to global health, affecting over 50 million individuals worldwide with no current cure. Early identification and treatment are vital to mitigate its impact on memory, language, and actions. Recent strides in artificial intelligence (AI) and neural networks, particularly Vision Transformers (ViT), show promise in enhancing early AD diagnosis through advanced medical image analysis. ViT, surpassing conventional Convolutional Neural Networks (CNNs), proves adept at discerning subtle changes in brain structure and function, crucial for early AD detection. However, ViT models face challenges like iterative attention biases hindering effective target class focus. Our proposed solution incorporates an augmenting method and convolution patch embedding, addressing these limitations, and improving patch extraction efficiency while preserving original dimensions. Utilizing the Alzheimer’s Disease Neuroimaging Initiative (ADNI) dataset, our comprehensive study focuses on stable and convertible mild cognitive impairment (MCIs and MCIc) to AD progression. The proposed method achieves a diagnostic accuracy of 91.35%, sensitivity of 91.09%, and specificity of 91.63%, surpassing existing methodologies. This highlights the practical viability and effectiveness of our approach in AD diagnosis. In conclusion, early and accurate AD detection is crucial for patient outcomes. Our innovative methods showcase the potential of ViT in brain image analysis, paving the way for future advancements in medical imaging research.",
    "authors": [
        "Uttam Khatri",
        "Seokjoo Shin",
        "Goo-Rak Kwon"
    ],
    "venue": "IEEE International Conference on Consumer Electronics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed solution incorporates an augmenting method and convolution patch embedding, addressing these limitations, and improving patch extraction efficiency while preserving original dimensions, surpassing existing methodologies in AD diagnosis."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}