{
    "acronym": "88d1ba44e41db0f4b13b1ebc552f873acc1fac98",
    "title": "Dateformer: Time-modeling Transformer for Longer-term Series Forecasting",
    "seed_ids": [
        "reformer",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "30dcc0e191a376fea0e7a46f94c53872c029efc9"
    ],
    "s2id": "88d1ba44e41db0f4b13b1ebc552f873acc1fac98",
    "abstract": "Transformers have demonstrated impressive strength in long-term series forecasting. Existing prediction research mostly focused on mapping past short sub-series (lookback window) to future series (forecast window). The longer training dataset time series will be discarded, once training is completed. Models can merely rely on lookback window information for inference, which impedes models from analyzing time series from a global perspective. And these windows used by Transformers are quite narrow because they must model each time-step therein. Under this point-wise processing style, broadening windows will rapidly exhaust their model capacity. This, for fine-grained time series, leads to a bottleneck in information input and prediction output, which is mortal to long-term series forecasting. To overcome the barrier, we propose a brand-new methodology to utilize Transformer for time series forecasting. Specifically, we split time series into patches by day and reform point-wise to patch-wise processing, which considerably enhances the information input and output of Transformers. To further help models leverage the whole training set's global information during inference, we distill the information, store it in time representations, and replace series with time representations as the main modeling entities. Our designed time-modeling Transformer -- Dateformer yields state-of-the-art accuracy on 7 real-world datasets with a 33.6\\% relative improvement and extends the maximum forecast range to half-year.",
    "authors": [
        "Julong Young",
        "Junhui Chen",
        "Feihu Huang",
        "Jian Peng"
    ],
    "venue": "",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The designed time-modeling Transformer -- Dateformer yields state-of-the-art accuracy on 7 real-world datasets with a 33.6\\% relative improvement and extends the maximum forecast range to half-year."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}