{
    "acronym": "88dd119dba5ee747851ade8f5d517b381614d918",
    "title": "Fengshenbang 1.0: Being the Foundation of Chinese Cognitive Intelligence",
    "seed_ids": [
        "gpt2",
        "longformer",
        "04b40daa1ca74bdbb578beb314bf662538ecd18e",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "88dd119dba5ee747851ade8f5d517b381614d918",
    "abstract": "Nowadays, foundation models become one of fundamental infrastructures in artificial intelligence, paving ways to the general intelligence. However, the reality presents two urgent challenges: existing foundation models are dominated by the English-language community; users are often given limited resources and thus cannot always use foundation models. To support the development of the Chinese-language community, we introduce an open-source project, called Fengshenbang, which leads by the research center for Cognitive Computing and Natural Language (CCNL). Our project has comprehensive capabilities, including large pre-trained models, user-friendly APIs, benchmarks, datasets, and others. We wrap all these in three sub-projects: the Fengshenbang Model, the Fengshen Framework, and the Fengshen Benchmark. An open-source roadmap, Fengshenbang, aims to re-evaluate the open-source community of Chinese pre-trained large-scale models, prompting the development of the entire Chinese large-scale model community. We also want to build a user-centered open-source ecosystem to allow individuals to access the desired models to match their computing resources. Furthermore, we invite companies, colleges, and research institutions to collaborate with us to build the large-scale open-source model-based ecosystem. We hope that this project will be the foundation of Chinese cognitive intelligence.",
    "authors": [
        "Junjie Wang",
        "Yuxiang Zhang",
        "Lin Zhang",
        "Ping Yang",
        "Xinyu Gao",
        "Ziwei Wu",
        "Xiaoqun Dong",
        "Junqing He",
        "Jianheng Zhuo",
        "Qi Yang",
        "Yongfeng Huang",
        "Xiayu Li",
        "Yan-Ze Wu",
        "Junyu Lu",
        "Xinyu Zhu",
        "Weifeng Chen",
        "Ting-Ting Han",
        "Kunhao Pan",
        "Rui Wang",
        "Hao Wang",
        "Xiaojun Wu",
        "Zhong Zeng",
        "Chong-An Chen",
        "Ruyi Gan",
        "Jiaxing Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An open-source project, called Fengshenbang, which aims to re-evaluate the open- source community of Chinese pre-trained large-scale models, prompting the development of the entire Chinese large- scale model community, and to build a user-centeredopen-source ecosystem to allow individuals to access the desired models to match their computing resources."
    },
    "citationCount": 76,
    "influentialCitationCount": 9,
    "code": null,
    "description": null,
    "url": null
}