{
    "acronym": "891c67d4b0d729fc15046caf9713ce8fcc528f4f",
    "title": "Multimodal Video Summarization using Attention based Transformers (MVSAT)",
    "seed_ids": [
        "transformer",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "891c67d4b0d729fc15046caf9713ce8fcc528f4f",
    "abstract": "With the sharp increase in consumption and creation of content in the format of videos it has become a necessity to have mechanisms to analyze and extract most vital information delivered in a shorter format. This research tends to delve deeper into enhancing video summarization using attention-based transformers by embedding present state-of-the-art models in the feature extraction phases. This paper demonstrates the effective utilization of video frames to extract visual features and also generate captions that serve as the second source of modality. These captions tend to overcome the absence of transcripts and audio portions needed for summarization and at the same time present an effective way to extract textual features. The extracted features are then handled by an effective transformer model to select the keyframes needed for summarization. The resultant methodology delivers a better F1 score compared to other supervised and unsupervised models and the mechanisms considering a single modality. The method presented also goes on to provide a full-fledged summarized video generated from the selected keyframes thus making it an end-to-end process for video summarization. SumMe and TVSum datasets have been extensively used for training and testing purposes throughout this research and the proposed model has achieved an F1 score of 54.91 on SumMe and 63.34 on TVSum dataset.",
    "authors": [
        "Kushagra Singh",
        "P. R",
        "Pavan Kumar Nuthi",
        "Nikhil Raju Mohite",
        "Mamatha H R"
    ],
    "venue": "2024 IEEE International Conference on Interdisciplinary Approaches in Technology and Management for Social Innovation (IATMSI)",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The effective utilization of video frames to extract visual features and also generate captions that serve as the second source of modality to provide a full-fledged summarized video generated from the selected keyframes thus making it an end-to-end process for video summarization."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}