{
    "acronym": "893cfebd92d58c75e59a9cff84cc2b1f79afd1d4",
    "title": "ResBit: Residual Bit Vector for Categorical Values",
    "seed_ids": [
        "analogbits",
        "1889ae7c47137d7c8c39cc82022558c13a46f0b8",
        "25d3a4e048d0020ba9cffc6442ebd4e7bb548a55",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "893cfebd92d58c75e59a9cff84cc2b1f79afd1d4",
    "abstract": "One-hot vectors, a method for representing discrete/categorical data, are commonly used in machine learning due to their simplicity and intuitiveness. However, the one-hot vectors suffer from a linear increase in dimensionality, posing computational and memory challenges, especially when dealing with datasets containing numerous categories. To address this issue, we propose Residual Bit Vectors (ResBit), a technique for densely representing categorical data. While Analog Bits presents a similar approach, it faces challenges in categorical data generation tasks. ResBit overcomes these limitations, offering a more versatile solution. In our experiments, we focus on tabular data generation, examining the performance across scenarios with varying amounts of categorical data. We verify the acceleration and ensure the maintenance or improvement of performance.",
    "authors": [
        "Masane Fuchi",
        "Amar Zanashir",
        "Hiroto Minami",
        "Tomohiro Takagi"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed Residual Bit Vectors (ResBit), a technique for densely representing categorical data, faces challenges in categorical data generation tasks, and overcomes these limitations, offering a more versatile solution."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}