{
    "acronym": "8950f2aa21a519d39fe8a7bcd7f02d0cb2ab1000",
    "title": "PCoQA: Persian Conversational Question Answering Dataset",
    "seed_ids": [
        "bert"
    ],
    "s2id": "8950f2aa21a519d39fe8a7bcd7f02d0cb2ab1000",
    "abstract": "Humans seek information regarding a specific topic through performing a conversation containing a series of questions and answers. In the pursuit of conversational question answering research, we introduce the PCoQA, the first \\textbf{P}ersian \\textbf{Co}nversational \\textbf{Q}uestion \\textbf{A}nswering dataset, a resource comprising information-seeking dialogs encompassing a total of 9,026 contextually-driven questions. Each dialog involves a questioner, a responder, and a document from the Wikipedia; The questioner asks several inter-connected questions from the text and the responder provides a span of the document as the answer for each question. PCoQA is designed to present novel challenges compared to previous question answering datasets including having more open-ended non-factual answers, longer answers, and fewer lexical overlaps. This paper not only presents the comprehensive PCoQA dataset but also reports the performance of various benchmark models. Our models include baseline models and pre-trained models, which are leveraged to boost the performance of the model. The dataset and benchmarks are available at our Github page.",
    "authors": [
        "Hamed Hematian Hemati",
        "Atousa Toghyani",
        "Atena Souri",
        "Sayed Hesam Alavian",
        "Hossein Sameti",
        "Hamid Beigy"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The PCoQA is designed to present novel challenges compared to previous question answering datasets including having more open-ended non-factual answers, longer answers, and fewer lexical overlaps."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}