{
    "acronym": "8973ad5fc1264594a1fda3bd9e04258074cea9cc",
    "title": "Neural Architecture Search: Insights from 1000 Papers",
    "seed_ids": [
        "gpt2",
        "a68c3412e60560290400d2707596f82a914b7c00",
        "16c844fd4d97f3c6eb38b0d6527c87d184efedc3",
        "290ef971d936b9b727dc36dbf4f38be6c8d915c5",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8973ad5fc1264594a1fda3bd9e04258074cea9cc",
    "abstract": "In the past decade, advances in deep learning have resulted in breakthroughs in a variety of areas, including computer vision, natural language understanding, speech recognition, and reinforcement learning. Specialized, high-performing neural architectures are crucial to the success of deep learning in these areas. Neural architecture search (NAS), the process of automating the design of neural architectures for a given task, is an inevitable next step in automating machine learning and has already outpaced the best human-designed architectures on many tasks. In the past few years, research in NAS has been progressing rapidly, with over 1000 papers released since 2020 (Deng and Lindauer, 2021). In this survey, we provide an organized and comprehensive guide to neural architecture search. We give a taxonomy of search spaces, algorithms, and speedup techniques, and we discuss resources such as benchmarks, best practices, other surveys, and open-source libraries.",
    "authors": [
        "Colin White",
        "Mahmoud Safari",
        "R. Sukthanker",
        "Binxin Ru",
        "T. Elsken",
        "Arber Zela",
        "Debadeepta Dey",
        "F. Hutter"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey provides an organized and comprehensive guide to neural architecture search, giving a taxonomy of search spaces, algorithms, and speedup techniques, and discusses resources such as benchmarks, best practices, other surveys, and open-source libraries."
    },
    "citationCount": 71,
    "influentialCitationCount": 8,
    "code": null,
    "description": null,
    "url": null
}