{
    "acronym": "8a16740aec48eb80bf0e7cff0e83455181bb8759",
    "title": "DP-OPT: Make Large Language Model Your Privacy-Preserving Prompt Engineer",
    "seed_ids": [
        "gpt",
        "0e3d1457a66e442fae46c8f96886dc76aef3b085",
        "d1101476c85ae324142440e9f568ecbf41625be5",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "8a16740aec48eb80bf0e7cff0e83455181bb8759",
    "abstract": "Large Language Models (LLMs) have emerged as dominant tools for various tasks, particularly when tailored for a specific target by prompt tuning. Nevertheless, concerns surrounding data privacy present obstacles due to the tuned prompts' dependency on sensitive private information. A practical solution is to host a local LLM and optimize a soft prompt privately using data. Yet, hosting a local model becomes problematic when model ownership is protected. Alternative methods, like sending data to the model's provider for training, intensify these privacy issues facing an untrusted provider. In this paper, we present a novel solution called Differentially-Private Offsite Prompt Tuning (DP-OPT) to address this challenge. Our approach involves tuning a discrete prompt on the client side and then applying it to the desired cloud models. We demonstrate that prompts suggested by LLMs themselves can be transferred without compromising performance significantly. To ensure that the prompts do not leak private information, we introduce the first private prompt generation mechanism, by a differentially-private (DP) ensemble of in-context learning with private demonstrations. With DP-OPT, generating privacy-preserving prompts by Vicuna-7b can yield competitive performance compared to non-private in-context learning on GPT3.5 or local private prompt tuning. Codes are available at https://github.com/VITA-Group/DP-OPT .",
    "authors": [
        "Junyuan Hong",
        "Jiachen T. Wang",
        "Chenhui Zhang",
        "Zhangheng Li",
        "Bo Li",
        "Zhangyang Wang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces the first private prompt generation mechanism, by a differentially-private (DP) ensemble of in-context learning with private demonstrations, and demonstrates that prompts suggested by LLMs themselves can be transferred without compromising performance significantly."
    },
    "citationCount": 11,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}