{
    "acronym": "8a3882fd35847d78997a8491f06ebbb3019d8775",
    "title": "Generating Music Transition by Using a Transformer-Based Model",
    "seed_ids": [
        "transformerxl",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "ce510c6cfeac703706460680e977c54554840830",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "fb507ada871d1e8c29e376dbf7b7879689aa89f9"
    ],
    "s2id": "8a3882fd35847d78997a8491f06ebbb3019d8775",
    "abstract": "With the prevalence of online video-sharing platforms increasing in recent years, many people have started to create their own videos and upload them onto the Internet. In filmmaking, background music is also one of the major elements besides the footage. With matching background music, a video can not only convey information, but also immerse the viewers in the setting of a story. There is often not only one piece of background music, but several, which is why audio editing and music production software are required. However, music editing is a professional expertise, and it can be hard for amateur creators to compose ideal pieces for the video. At the same time, there are some online audio libraries and music archives for sharing audio/music samples. For beginners, one possible way to compose background music for a video is “arranging and integrating samples”, rather than making music from scratch. As a result, this leads to a problem. There might be some gaps between samples, in which we have to generate transitions to fill the gaps. In our research, we build a transformer-based model for generating a music transition to bridge two prepared music clips. We design and perform experiments to demonstrate that our results are promising. The results are also analysed by using a questionnaire to reveal a positive response from listeners, supporting that our generated transitions conform to background music.",
    "authors": [
        "Jia-Lien Hsu",
        "Shuh-Jiun Chang"
    ],
    "venue": "Electronics",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This research builds a transformer-based model for generating a music transition to bridge two prepared music clips and analyses a positive response from listeners, supporting that the generated transitions conform to background music."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}