{
    "acronym": "8a5044ecdd26f3d8510d8705e442ca8498a87c70",
    "title": "A Complete Process of Text Classification System Using State-of-the-Art NLP Models",
    "seed_ids": [
        "transformerxl",
        "adc61e21eafecfbf6ebecc570f9f913659a2bfb2",
        "2e14e84ccec924ed770b58108ad1d9de6f0ca295"
    ],
    "s2id": "8a5044ecdd26f3d8510d8705e442ca8498a87c70",
    "abstract": "With the rapid advancement of information technology, online information has been exponentially growing day by day, especially in the form of text documents such as news events, company reports, reviews on products, stocks-related reports, medical reports, tweets, and so on. Due to this, online monitoring and text mining has become a prominent task. During the past decade, significant efforts have been made on mining text documents using machine and deep learning models such as supervised, semisupervised, and unsupervised. Our area of the discussion covers state-of-the-art learning models for text mining or solving various challenging NLP (natural language processing) problems using the classification of texts. This paper summarizes several machine learning and deep learning algorithms used in text classification with their advantages and shortcomings. This paper would also help the readers understand various subtasks, along with old and recent literature, required during the process of text classification. We believe that readers would be able to find scope for further improvements in the area of text classification or to propose new techniques of text classification applicable in any domain of their interest.",
    "authors": [
        "Varun Dogra",
        "Sahil Verma",
        "Kavita",
        "Pushpita Chatterjee",
        "Jana Shafi",
        "Jaeyoung Choi",
        "M. Ijaz"
    ],
    "venue": "Computational Intelligence and Neuroscience",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Several machine learning and deep learning algorithms used in text classification with their advantages and shortcomings are summarized to help the readers understand various subtasks, along with old and recent literature, required during the process of text classification."
    },
    "citationCount": 53,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}