{
    "acronym": "8a7df164c4687e3c402b1cbf0ab404de49cfb75e",
    "title": "Rissanen Data Analysis: Examining Dataset Characteristics via Description Length",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8a7df164c4687e3c402b1cbf0ab404de49cfb75e",
    "abstract": "We introduce a method to determine if a certain capability helps to achieve an accurate model of given data. We view labels as being generated from the inputs by a program composed of subroutines with different capabilities, and we posit that a subroutine is useful if and only if the minimal program that invokes it is shorter than the one that does not. Since minimum program length is uncomputable, we instead estimate the labels' minimum description length (MDL) as a proxy, giving us a theoretically-grounded method for analyzing dataset characteristics. We call the method Rissanen Data Analysis (RDA) after the father of MDL, and we showcase its applicability on a wide variety of settings in NLP, ranging from evaluating the utility of generating subquestions before answering a question, to analyzing the value of rationales and explanations, to investigating the importance of different parts of speech, and uncovering dataset gender bias.",
    "authors": [
        "Ethan Perez",
        "Douwe Kiela",
        "Kyunghyun Cho"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The method is called Rissanen Data Analysis (RDA) after the father of MDL, and its applicability on a wide variety of settings in NLP is showcased, ranging from evaluating the utility of generating subquestions before answering a question, to analyzing the value of rationales and explanations, and investigating the importance of different parts of speech."
    },
    "citationCount": 21,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}