{
    "acronym": "8aa2c70563bb2c03e17297d8d726890da3d5f001",
    "title": "Attribution and Obfuscation of Neural Text Authorship: A Data Mining Perspective",
    "seed_ids": [
        "gpt",
        "a279d7d05ce4cf849879e6948c34613b2dade858",
        "4e644dd3bd1faf77ad3a063a49b7d0bca8c80e9f",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "a1f5611e39da6323443be03d1398adb9f3115c2d",
        "d972c9bccc5ccef16d71b450dd3ab4c77f67224a",
        "7845bfb55f5ce573b87d77bb76d4d38829b37620",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8aa2c70563bb2c03e17297d8d726890da3d5f001",
    "abstract": "Two interlocking research questions of growing interest and importance in privacy research are Authorship Attribution (AA) and Authorship Obfuscation (AO). Given an artifact, especially a text t in question, an AA solution aims to accurately attribute t to its true author out of many candidate authors while an AO solution aims to modify t to hide its true authorship. Traditionally, the notion of authorship and its accompanying privacy concern is only toward human authors. However, in recent years, due to the explosive advancements in Neural Text Generation (NTG) techniques in NLP, capable of synthesizing human-quality openended texts (so-called \"neural texts\"), one has to now consider authorships by humans, machines, or their combination. Due to the implications and potential threats of neural texts when used maliciously, it has become critical to understand the limitations of traditional AA/AO solutions and develop novel AA/AO solutions in dealing with neural texts. In this survey, therefore, we make a comprehensive review of recent literature on the attribution and obfuscation of neural text authorship from a Data Mining perspective, and share our view on their limitations and promising research directions.",
    "authors": [
        "Adaku Uchendu",
        "Thai Le",
        "Dongwon Lee"
    ],
    "venue": "SIGKDD Explorations",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A comprehensive review of recent literature on the attribution and obfuscation of neural text authorship from a Data Mining perspective is made, and the view on their limitations and promising research directions is shared."
    },
    "citationCount": 29,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}