{
    "acronym": "8abbfb4bd1321eb35c85d0fb48b98aa2612617ec",
    "title": "AfriWOZ: Corpus for Exploiting Cross-Lingual Transferability for Generation of Dialogues in Low-Resource, African Languages",
    "seed_ids": [
        "gpt2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8abbfb4bd1321eb35c85d0fb48b98aa2612617ec",
    "abstract": "Dialogue generation is an important NLP task fraught with many challenges. The challenges become more daunting for low-resource African languages. To enable the creation of dialogue agents for African languages, we contribute the first high-quality dialogue datasets for 6 African languages: Swahili, Wolof, Hausa, Nigerian Pidgin English, Kinyarwanda&Yor\\`ub\\'a. These datasets consist of 1,500 turns each, which we translate from a portion of the English multi-domain MultiWOZ dataset. Subsequently, we investigate&analyze the effectiveness of modelling through transfer learning by utilziing state-of-the-art (SoTA) deep monolingual models: DialoGPT and BlenderBot. We compare the models with a simple seq2seq baseline using perplexity. Besides this, we conduct human evaluation of single-turn conversations by using majority votes and measure inter-annotator agreement (IAA). We find that the hypothesis that deep monolingual models learn some abstractions that generalize across languages holds. We observe human-like conversations, to different degrees, in 5 out of the 6 languages. The language with the most transferable properties is the Nigerian Pidgin English, with a human-likeness score of 78.1%, of which 34.4% are unanimous. We freely provide the datasets and host the model checkpoints/demos on the HuggingFace hub for public access.",
    "authors": [
        "Tosin P. Adewumi",
        "Mofetoluwa Adeyemi",
        "Aremu Anuoluwapo",
        "Bukola Peters",
        "Happy Buzaaba",
        "Oyerinde Samuel",
        "Amina Mardiyyah Rufai",
        "Benjamin Ayoade Ajibade",
        "Tajudeen Gwadabe",
        "M. Traore",
        "T. Ajayi",
        "Shamsuddeen Hassan Muhammad",
        "Ahmed Baruwa",
        "Paul Owoicho",
        "Tolúlopé Ògúnrèmí",
        "Phylis Ngigi",
        "Orevaoghene Ahia",
        "Ruqayya Nasir",
        "F. Liwicki",
        "M. Liwicki"
    ],
    "venue": "",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is found that the hypothesis that deep monolingual models learn some abstractions that generalize across languages holds, and the first high-quality dialogue datasets for 6 African languages are contributed."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}