{
    "acronym": "8ae0e509a20f08b4e64b45ec901670d74577a06f",
    "title": "Transfer Learning Enhanced Single-choice Decision for Multi-choice Question Answering",
    "seed_ids": [
        "bert",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "6ff68b34a5f78bdd14437fe5a79aebbc42c26467"
    ],
    "s2id": "8ae0e509a20f08b4e64b45ec901670d74577a06f",
    "abstract": "Multi-choice Machine Reading Comprehension (MMRC) aims to select the correct answer from a set of options based on a given passage and question. The existing methods employ the pre-trained language model as the encoder, share and transfer knowledge through fine-tuning.These methods mainly focus on the design of exquisite mechanisms to effectively capture the relationships among the triplet of passage, question and answers. It is non-trivial but ignored to transfer knowledge from other MRC tasks such as SQuAD due to task specific of MMRC.In this paper, we reconstruct multi-choice to single-choice by training a binary classification to distinguish whether a certain answer is correct. Then select the option with the highest confidence score as the final answer. Our proposed method gets rid of the multi-choice framework and can leverage resources of other tasks. We construct our model based on the ALBERT-xxlarge model and evaluate it on the RACE and DREAM datasets. Experimental results show that our model performs better than multi-choice methods. In addition, by transferring knowledge from other kinds of MRC tasks, our model achieves state-of-the-art results in both single and ensemble settings.",
    "authors": [
        "Chenhao Cui",
        "Yufan Jiang",
        "Shuangzhi Wu",
        "Zhoujun Li"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper reconstructs multi-choice to single-choice by training a binary classification to distinguish whether a certain answer is correct and gets rid of the multi-choice framework and can leverage resources of other tasks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}