{
    "acronym": "8ba7df085abb5c8071beb667d292fe4cb71a8bc0",
    "title": "Measuring Five Accountable Talk Moves to Improve Instruction at Scale",
    "seed_ids": [
        "gpt3"
    ],
    "s2id": "8ba7df085abb5c8071beb667d292fe4cb71a8bc0",
    "abstract": "Providing consistent, individualized feedback to teachers on their instruction can improve student learning outcomes. Such feedback can especially benefit novice instructors who teach on online platforms and have limited access to instructional training. To build scalable measures of instruction, we fine-tune RoBERTa and GPT models to identify five instructional talk moves inspired by accountable talk theory: adding on, connecting, eliciting, probing and revoicing students' ideas. We fine-tune these models on a newly annotated dataset of 2500 instructor utterances derived from transcripts of small group instruction in an online computer science course, Code in Place. Although we find that GPT-3 consistently outperforms RoBERTa in terms of precision, its recall varies significantly. We correlate the instructors' use of each talk move with indicators of student engagement and satisfaction, including students' section attendance, section ratings, and assignment completion rates. We find that using talk moves generally correlates positively with student outcomes, and connecting student ideas has the largest positive impact. These results corroborate previous research on the effectiveness of accountable talk moves and provide exciting avenues for using these models to provide instructors with useful, scalable feedback.",
    "authors": [
        "Ashlee Kupor",
        "Candice Morgan",
        "Dorottya Demszky"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is found that using talk moves generally correlates positively with student outcomes, and connecting student ideas has the largest positive impact."
    },
    "citationCount": 2,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}