{
    "acronym": "8bd042ae4648ea2d58c7495da37e3caca2af539a",
    "title": "ARGH!: Automated Rumor Generation Hub",
    "seed_ids": [
        "gpt",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c",
        "791c3c30f2af10ac06f4fbc5b1e8960064aacbc7",
        "83b56c3c7a61767bd88d85796aa5dbc4976912c3",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8bd042ae4648ea2d58c7495da37e3caca2af539a",
    "abstract": "It is still challenging to effectively identify rumors due to rapid changes in people's interests and perceptions. To enhance rumor detectors, we first need to better understand which rumors are effective (in terms of bypassing detection) and their characteristics. In this paper, we introduce ARGH, a novel framework to automatically generate rumors using recent advancements in natural language processing, customized to target and generate specific topics. To show the effectiveness of ARGH, we conducted a user study with 212 participants and analyzed how well humans can detect the rumors generated by ARGH, and we also tested its performance against the state-of-the-art rumor detection model PLAN [17]. Surprisingly, the experimental results demonstrate that the generated rumors are significantly harder to identify as rumors than hand-written rumors, degrading the detection accuracy by both humans and machines by 18.87% and 17.62%, respectively. We believe that ARGH will be a useful tool to obtain high quality and evasive rumor datasets quickly, which is often a tedious and time consuming task. Further, our analysis results provide valuable insight into how to characterize evasive rumors and how they can be generated, which will help to enhance the existing rumor detection techniques.",
    "authors": [
        "Larry Huynh",
        "T. Nguyen",
        "J. Goh",
        "Hyoungshick Kim",
        "Jin B. Hong"
    ],
    "venue": "International Conference on Information and Knowledge Management",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Surprisingly, the experimental results demonstrate that the generated rumors are significantly harder to identify as rumors than hand-written rumors, degrading the detection accuracy by both humans and machines by 18.87% and 17.62%, respectively."
    },
    "citationCount": 4,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}