{
    "acronym": "8ca981a132ffb21099c8dd1c6bf2e0a5d1babb40",
    "title": "Code Vulnerability Detection Based on Deep Sequence and Graph Models: A Survey",
    "seed_ids": [
        "gpt2",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8ca981a132ffb21099c8dd1c6bf2e0a5d1babb40",
    "abstract": "With the flourishing of the open-source software community, the problem of software vulnerabilities is becoming more and more serious. Hence, it is urgent to come up with an effective and efficient code vulnerability detection method. Source code vulnerability detection techniques used in practice today like symbolic execution and fuzz testing suffer from high false positives and low code coverage, respectively. Traditional machine-learning-based solutions fail to cope with the diversity of vulnerabilities. To overcome these drawbacks, a large number of deep-learning-based code vulnerability detection works have emerged, aiming at building powerful neural network models to fully learn code semantics and vulnerability patterns. In this survey, we mainly focus on code vulnerability detection approaches based on deep sequence modeling and graph modeling technologies. Our goal is to investigate how these two methods are applied to facilitate code vulnerability detection. We also go over current prevailing datasets that are used to evaluate detection models. At last, we identify the current challenges in this field and share our views on future work.",
    "authors": [
        "Bolun Wu",
        "Futai Zou"
    ],
    "venue": "Security and Communication Networks",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey focuses on code vulnerability detection approaches based on deep sequence modeling and graph modeling technologies, and investigates how these two methods are applied to facilitate codeulnerability detection."
    },
    "citationCount": 8,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}