{
    "acronym": "8cf819f6ee33909484ece40d79944c9c37f01a89",
    "title": "A Brief Overview of ChatGPT: The History, Status Quo and Potential Future Development",
    "seed_ids": [
        "gpt",
        "db4ab91d5675c37795e719e997a2827d3d83cd45",
        "e342165a614588878ad0f4bc9bacf3905df34d08",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "80cf2a6af4200ecfca1c18fc89de16148f1cd4bf",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8cf819f6ee33909484ece40d79944c9c37f01a89",
    "abstract": "ChatGPT, an artificial intelligence generated content (AIGC) model developed by OpenAI, has attracted world-wide attention for its capability of dealing with challenging language understanding and generation tasks in the form of conversations. This paper briefly provides an overview on the history, status quo and potential future development of ChatGPT, helping to provide an entry point to think about ChatGPT. Specifically, from the limited open-accessed resources, we conclude the core techniques of ChatGPT, mainly including large-scale language models, in-context learning, reinforcement learning from human feedback and the key technical steps for developing Chat-GPT. We further analyze the pros and cons of ChatGPT and we rethink the duality of ChatGPT in various fields. Although it has been widely acknowledged that ChatGPT brings plenty of opportunities for various fields, mankind should still treat and use ChatGPT properly to avoid the potential threat, e.g., academic integrity and safety challenge. Finally, we discuss several open problems as the potential development of ChatGPT.",
    "authors": [
        "Tianyu Wu",
        "Shizhu He",
        "Jingping Liu",
        "Siqi Sun",
        "Kang Liu",
        "Qing‐Long Han",
        "Yang Tang"
    ],
    "venue": "IEEE/CAA Journal of Automatica Sinica",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The core techniques of ChatGPT are concluded, mainly including large-scale language models, in-context learning, reinforcement learning from human feedback and the key technical steps for developing Chat-GPT."
    },
    "citationCount": 283,
    "influentialCitationCount": 14,
    "code": null,
    "description": null,
    "url": null
}