{
    "acronym": "8d20e6949ea6670c80ec371588222ee020be7218",
    "title": "Efficient Vision-and-Language Pre-training with Text-Relevant Image Patch Selection",
    "seed_ids": [
        "bert",
        "5e00596fa946670d894b1bdaeff5a98e3867ef13",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "1c8aea2bfb61f4661b6907018a5a8bca390900dd"
    ],
    "s2id": "8d20e6949ea6670c80ec371588222ee020be7218",
    "abstract": "Vision Transformers (ViTs) have become increasingly popular in large-scale Vision and Language Pre-training (VLP) models. Although previous VLP research has demonstrated the efficacy of ViTs, these efforts still struggle with computational inefficiencies caused by lengthy visual sequences. To address this challenge, we introduce an efficient VLP approach called TRIPS, which stands for Text-Relevant Image Patch Selection. TRIPS progressively reduces the visual sequence using a text-guided patch-selection layer in the visual backbone, thereby accelerating both training and inference processes. This patch-selection layer dynamically computes text-dependent visual attention, enabling it to identify attentive image tokens with text guidance and fuse inattentive ones in an end-to-end fashion. Importantly, TRIPS does not add any extra parameters and generalizes to most ViT-based VLP models. We incorporate TRIPS into three representative VLP models covering single-stream, dual-stream, and generative paradigms, and conduct extensive experiments on five widely-used multi-modal benchmark datasets. Our experimental results reveal that TRIPS delivers a 40% speedup, while maintaining competitive or superior performance on downstream tasks.",
    "authors": [
        "Wei Ye",
        "Chaoya Jiang",
        "Haiyang Xu",
        "Chenhao Ye",
        "Chenliang Li",
        "Mingshi Yan",
        "Shikun Zhang",
        "Songhang Huang",
        "Fei Huang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces an efficient VLP approach called TRIPS, which stands for Text-Relevant Image Patch Selection, which progressively reduces the visual sequence using a text-guided patch-selection layer in the visual backbone, thereby accelerating both training and inference processes."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}