{
    "acronym": "8d2709ed1788a67e64425fb410bb49f3ee49e088",
    "title": "Large Language Models Illuminate a Progressive Pathway to Artificial Healthcare Assistant: A Review",
    "seed_ids": [
        "gpt3",
        "94ce1d5924e05e8d75e43ce70044293ddcef850a",
        "848909fbae167f21589bfc7a54fbf27e306b883c",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "2029349c55c1dba3493c5b3bd25152f18ba21ae2",
        "db4ab91d5675c37795e719e997a2827d3d83cd45",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8d2709ed1788a67e64425fb410bb49f3ee49e088",
    "abstract": "With the rapid development of artificial intelligence, large language models (LLMs) have shown promising capabilities in mimicking human-level language comprehension and reasoning. This has sparked significant interest in applying LLMs to enhance various aspects of healthcare, ranging from medical education to clinical decision support. However, medicine involves multifaceted data modalities and nuanced reasoning skills, presenting challenges for integrating LLMs. This paper provides a comprehensive review on the applications and implications of LLMs in medicine. It begins by examining the fundamental applications of general-purpose and specialized LLMs, demonstrating their utilities in knowledge retrieval, research support, clinical workflow automation, and diagnostic assistance. Recognizing the inherent multimodality of medicine, the review then focuses on multimodal LLMs, investigating their ability to process diverse data types like medical imaging and EHRs to augment diagnostic accuracy. To address LLMs' limitations regarding personalization and complex clinical reasoning, the paper explores the emerging development of LLM-powered autonomous agents for healthcare. Furthermore, it summarizes the evaluation methodologies for assessing LLMs' reliability and safety in medical contexts. Overall, this review offers an extensive analysis on the transformative potential of LLMs in modern medicine. It also highlights the pivotal need for continuous optimizations and ethical oversight before these models can be effectively integrated into clinical practice. Visit https://github.com/mingze-yuan/Awesome-LLM-Healthcare for an accompanying GitHub repository containing latest papers.",
    "authors": [
        "Mingze Yuan",
        "Peng Bao",
        "Jiajia Yuan",
        "Yunhao Shen",
        "Zi Chen",
        "Yi Xie",
        "Jie Zhao",
        "Yang Chen",
        "Li Zhang",
        "Lin Shen",
        "Bin Dong"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This review offers an extensive analysis on the transformative potential of LLMs in modern medicine and highlights the pivotal need for continuous optimizations and ethical oversight before these models can be effectively integrated into clinical practice."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}