{
    "acronym": "8d8cf95485db26fd1ec9c370a4bf4fda47014f60",
    "title": "LTRDetector: Exploring Long-Term Relationship for Advanced Persistent Threats Detection",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "8d8cf95485db26fd1ec9c370a4bf4fda47014f60",
    "abstract": "Advanced Persistent Threat (APT) is challenging to detect due to prolonged duration, infrequent occurrence, and adept concealment techniques. Existing approaches primarily concentrate on the observable traits of attack behaviors, neglecting the intricate relationships formed throughout the persistent attack lifecycle. Thus, we present an innovative APT detection framework named LTRDetector, implementing an end-to-end holistic operation. LTRDetector employs an innovative graph embedding technique to retain comprehensive contextual information, then derives long-term features from these embedded provenance graphs. During the process, we compress the data of the system provenance graph for effective feature learning. Furthermore, in order to detect attacks conducted by using zero-day exploits, we captured the system's regular behavior and detects abnormal activities without relying on predefined attack signatures. We also conducted extensive evaluations using five prominent datasets, the efficacy evaluation of which underscores the superiority of LTRDetector compared to existing state-of-the-art techniques.",
    "authors": [
        "Xiaoxiao Liu",
        "Fan Xu",
        "Nan Wang",
        "Qinxin Zhao",
        "Dalin Zhang",
        "Xibin Zhao",
        "Jiqiang Liu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An innovative APT detection framework named LTRDetector is presented, implementing an end-to-end holistic operation that employs an innovative graph embedding technique to retain comprehensive contextual information, then derives long-term features from these embedded provenance graphs."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}