{
    "acronym": "8dbd0e063f9ee22b43c77dc3162e49b7853a2423",
    "title": "Autonomous Prompt Engineering in Large Language Models",
    "seed_ids": [
        "gpt",
        "7d083d654f66f763302d8a5f0678beb753f6507b",
        "ca31b8584b6c022ef15ddfe994fe361e002b7729",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d9f6ada77448664b71128bb19df15765336974a6"
    ],
    "s2id": "8dbd0e063f9ee22b43c77dc3162e49b7853a2423",
    "abstract": "Prompt engineering is a crucial yet challenging task for optimizing the performance of large language models (LLMs) on customized tasks. This pioneering research introduces the Automatic Prompt Engineering Toolbox (APET), which enables GPT-4 to autonomously apply prompt engineering techniques. By leveraging sophisticated strategies such as Expert Prompting, Chain of Thought, and Tree of Thoughts, APET empowers GPT-4 to dynamically optimize prompts, resulting in substantial improvements in tasks like Word Sorting (4.4% increase) and Geometric Shapes (6.8% increase). Despite encountering challenges in complex tasks such as Checkmate in One (-14.8%), these findings demonstrate the transformative potential of APET in automating complex prompt optimization processes without the use of external data. Overall, this research represents a significant leap in AI development, presenting a robust framework for future innovations in autonomous AI systems and highlighting the ability of GPT-4 to bring prompt engineering theory to practice. It establishes a foundation for enhancing performance in complex task performance and broadening the practical applications of these techniques in real-world scenarios.",
    "authors": [
        "Daan Kepel",
        "Konstantina Valogianni"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This pioneering research introduces the Automatic Prompt Engineering Toolbox (APET), which enables GPT-4 to autonomously apply prompt engineering techniques, resulting in substantial improvements in tasks like Word Sorting and Geometric Shapes."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}