{
    "acronym": "8e3b715d8ba39dcaad768635d25ead67daef0b92",
    "title": "Accelerated Device Placement Optimization with Contrastive Learning",
    "seed_ids": [
        "transformerxl",
        "b4a4e6fe63426b9fb4393c939792da8e7c4a1a59"
    ],
    "s2id": "8e3b715d8ba39dcaad768635d25ead67daef0b92",
    "abstract": "With the ever-increasing size and complexity of deep neural network models, it is difficult to fit and train a complete copy of the model on a single computational device with limited capability. Therefore, large neural networks are usually trained on a mixture of devices, including multiple CPUs and GPUs, of which the computational speed and efficiency are drastically affected by how these models are partitioned and placed on the devices. In this paper, we propose Mars, a novel design to find efficient placements for large models. Mars leverages a self-supervised graph neural network pre-training framework to generate node representations for operations, which is able to capture the topological properties of the computational graph. Then, a sequence-to-sequence neural network is applied to split large models into small segments so that Mars can predict the placements sequentially. Novel optimizations have been applied in the placer design to achieve the best possible performance in terms of the time needed to complete training the agent for placing models with very large sizes. We deployed and evaluated Mars on benchmarks involving Inception-V3, GNMT, and BERT models. Extensive experimental results show that Mars can achieve up to 27.2% and 2.7% speedup of per-step training time than the state-of-the-art for GNMT and BERT models, respectively. We also show that with self-supervised graph neural network pre-training, our design achieves the fastest speed in discovering the optimal placement for Inception-V3.",
    "authors": [
        "Hao Lan",
        "Li Chen",
        "Baochun Li"
    ],
    "venue": "International Conference on Parallel Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Mars is a novel design to find efficient placements for large models that leverages a self-supervised graph neural network pre-training framework to generate node representations for operations, which is able to capture the topological properties of the computational graph."
    },
    "citationCount": 10,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}