{
    "acronym": "8e7205580fb510bfea8c1665788679fea87d09f5",
    "title": "Financial Sentiment Analysis: Techniques and Applications",
    "seed_ids": [
        "gpt2",
        "bert",
        "83edcfbb206ddad38a971d605da09390604248ea",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8e7205580fb510bfea8c1665788679fea87d09f5",
    "abstract": "Financial Sentiment Analysis (FSA) is an important domain application of sentiment analysis that has gained increasing attention in the past decade. FSA research falls into two main streams. The first stream focuses on defining tasks and developing techniques for FSA, and its main objective is to improve the performances of various FSA tasks by advancing methods and using/curating human-annotated datasets. The second stream of research focuses on using financial sentiment, implicitly or explicitly, for downstream applications on financial markets, which has received more research efforts. The main objective is to discover appropriate market applications for existing techniques. More specifically, the application of FSA mainly includes hypothesis testing and predictive modeling in financial markets. This survey conducts a comprehensive review of FSA research in both the technique and application areas and proposes several frameworks to help understand the two areas’ interactive relationship. This article defines a clearer scope for FSA studies and conceptualizes the FSA-investor sentiment-market sentiment relationship. Major findings, challenges, and future research directions for both FSA techniques and applications have also been summarized and discussed.",
    "authors": [
        "Kelvin Du",
        "Frank Xing",
        "Rui Mao",
        "Erik Cambria"
    ],
    "venue": "ACM Computing Surveys",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A clearer scope for FSA studies is defined and the FSA-investor sentiment-market sentiment relationship is conceptualized, which defines a clearer scope for FSA studies and conceptualizes the FSA-investor sentiment-market sentiment relationship."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}