{
    "acronym": "8e8a63ec5d517c64b8fc44843fe169f549fd3f57",
    "title": "Character-Level Chinese Backpack Language Models",
    "seed_ids": [
        "flashattn",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "11ed7f038bd7efd1491f3957959e1e30bc120c38",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8e8a63ec5d517c64b8fc44843fe169f549fd3f57",
    "abstract": "The Backpack is a Transformer alternative shown to improve interpretability in English language modeling by decomposing predictions into a weighted sum of token sense components. However, Backpacks’ reliance on token-defined meaning raises questions as to their potential for languages other than English, a language for which subword tokenization provides a reasonable approximation for lexical items. In this work, we train, evaluate, interpret, and control Backpack language models in character-tokenized Chinese, in which words are often composed of many characters. We find that our (134M parameter) Chinese Backpack language model performs comparably to a (104M parameter) Transformer, and learns rich character-level meanings that log-additively compose to form word meanings. In SimLex-style lexical semantic evaluations, simple averages of Backpack character senses outperform input embeddings from a Transformer. We find that complex multi-character meanings are often formed by using the same per-character sense weights consistently across context. Exploring interpretability-through control, we show that we can localize a source of gender bias in our Backpacks to specific character senses and intervene to reduce the bias.",
    "authors": [
        "Hao Sun",
        "John Hewitt"
    ],
    "venue": "BlackboxNLP Workshop on Analyzing and Interpreting Neural Networks for NLP",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work trains, evaluates, interpret, and control Backpack language models in character-tokenized Chinese, and finds that complex multi-character meanings are often formed by using the same per-character sense weights consistently across context."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}