{
    "acronym": "8ede99f3049c062b1cb465f2aa1085064af96896",
    "title": "The Box is in the Pen: Evaluating Commonsense Reasoning in Neural Machine Translation",
    "seed_ids": [
        "gpt",
        "01f2b214962997260020279bd1fd1f8f372249d4",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "9405cc0d6169988371b2755e573cc28650d14dfe",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "8ede99f3049c062b1cb465f2aa1085064af96896",
    "abstract": "Does neural machine translation yield translations that are congenial with common sense? In this paper, we present a test suite to evaluate the commonsense reasoning capability of neural machine translation. The test suite consists of three test sets, covering lexical and contextless/contextual syntactic ambiguity that requires commonsense knowledge to resolve. We manually create 1,200 triples, each of which contain a source sentence and two contrastive translations, involving 7 different common sense types. Language models pretrained on large-scale corpora, such as BERT, GPT-2, achieve a commonsense reasoning accuracy of lower than 72% on target translations of this test suite. We conduct extensive experiments on the test suite to evaluate commonsense reasoning in neural machine translation and investigate factors that have impact on this capability. Our experiments and analyses demonstrate that neural machine translation performs poorly on commonsense reasoning of the three ambiguity types in terms of both reasoning accuracy ( 6 60.1%) and reasoning consistency (6 31%). We will release our test suite as a machine translation commonsense reasoning testbed to promote future work in this direction.",
    "authors": [
        "Jie He",
        "Tao Wang",
        "Deyi Xiong",
        "Qun Liu"
    ],
    "venue": "Findings",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that neural machine translation performs poorly on commonsense reasoning of the three ambiguity types in terms of both reasoning accuracy and reasoning consistency."
    },
    "citationCount": 16,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}