{
    "acronym": "8f3625dcb33f055be88c5542b8308b910b7dae31",
    "title": "Towards a Persona Aware Conversational Agent",
    "seed_ids": [
        "gpt",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "8f3625dcb33f055be88c5542b8308b910b7dae31",
    "abstract": "Dialog systems have been at the center of Natural Language Processing (NLP) since its inception. With a wide range of applications, this type of system is particularly interesting as a user interface, creating the possibility of a more natu-ral and convenient user experience. In the context of Customer Support, goal-oriented dialog systems are now widely used, helping users carry out specific tasks. Traditionally, these systems were created by employing knowledge-based architectures. However, the growth of Deep Learning and the increase in data availability facilitated the development of neural dialog systems, which can be trained end-to-end. A well-known example of such a system is the “Transformer”, a self-attentional model that has achieved state-of-the-art re-sults in multiple NLP tasks. Notwithstanding, these systems still present some shortcomings, particularly in terms of scalability. The need for large amounts of data and considerable computing power can be an impediment, especially in situations where multiple entities must be represented. In Goal-Oriented Dialog Systems, this becomes evident when considering multi-brand Customer Support, since each brand must communicate differently with its users, meaning one model must be developed and maintained for each brand. In Open-Domain System, an analogous problem arises when considering settings where multiple characters must be impersonated. In this work, we explore how we can create conversational agents that tackle this issue, in both settings. To this end, we adapt and experiment with multiple state-of-the-art architectures together with recent datasets.",
    "authors": [
        "Goncalo de Melo"
    ],
    "venue": "",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work adapt and experiment with multiple state-of-the-art architectures together with recent datasets to create conversational agents that tackle conversational agents that tackle impersonated characters in Open-Domain System and Goal-Oriented Dialog Systems."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}