{
    "acronym": "8f5c73857f5d8d77740aa47ed36a11ec3e2784e4",
    "title": "Constructing Boundary-identical Microstructures by Guided Diffusion for Fast Multiscale Designs",
    "seed_ids": [
        "analogbits",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74"
    ],
    "s2id": "8f5c73857f5d8d77740aa47ed36a11ec3e2784e4",
    "abstract": "We propose a novel method to construct large-scale boundary-identical microstructure datasets with high attribute coverage for highly efficient multiscale design. Central to our technique is using a deep generative model to generate microstructures under the two conditions, including the specified boundary and homogenized elastic tensor. We achieve the desired dataset by alternately adding microstructures with diverse attributes constructed by the deep generative model into the dataset and retraining the deep generative model. Sixteen compatible metamaterial datasets with high attribute coverage are constructed by our method. We demonstrate the effectiveness and practicability of the obtained datasets over various multiscale design examples. Specifically, in the design of a mechanical cloak, we utilize macrostructures with $30 \\times 30$ elements and microstructures filled with $256 \\times 256$ elements. The entire reverse design process is completed within one minute, significantly enhancing the efficiency of the multiscale optimization.",
    "authors": [
        "Jingxuan Feng",
        "Lili Wang",
        "Xiaoya Zhai",
        "Kai Chen",
        "Wenming Wu",
        "Ligang Liu",
        "Xiao-Ming Fu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel method to construct large-scale boundary-identical microstructure datasets with high attribute coverage for highly efficient multiscale design by using a deep generative model to generate microstructures under the two conditions, including the specified boundary and homogenized elastic tensor."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}