{
    "acronym": "8fd0b70cfd6bbdaef9fbe1073afb3920cb61f80b",
    "title": "BERT-EMD: Many-to-Many Layer Mapping for BERT Compression with Earth Mover’s Distance",
    "seed_ids": [
        "gpt",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "c6c734e16f66fbfcefac7625cc64599e83292c1e",
        "83b8108014e3db4f46354a28ae68193f143c4e7e",
        "c1957e25155d713e7599b9d7e1e318c03cd2631a",
        "80cf2a6af4200ecfca1c18fc89de16148f1cd4bf",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "8fd0b70cfd6bbdaef9fbe1073afb3920cb61f80b",
    "abstract": "Pre-trained language models (e.g., BERT) have achieved significant success in various natural language processing (NLP) tasks. However, high storage and computational costs obstruct pre-trained language models to be effectively deployed on resource-constrained devices. In this paper, we propose a novel BERT distillation method based on many-to-many layer mapping, which allows each intermediate student layer to learn from any intermediate teacher layers. In this way, our model can learn from different teacher layers adaptively for various NLP tasks. %motivated by the intuition that different NLP tasks require different levels of linguistic knowledge contained in the intermediate layers of BERT. In addition, we leverage Earth Mover's Distance (EMD) to compute the minimum cumulative cost that must be paid to transform knowledge from teacher network to student network. EMD enables the effective matching for many-to-many layer mapping. %EMD can be applied to network layers with different sizes and effectively measures semantic distance between the teacher network and student network. Furthermore, we propose a cost attention mechanism to learn the layer weights used in EMD automatically, which is supposed to further improve the model's performance and accelerate convergence time. Extensive experiments on GLUE benchmark demonstrate that our model achieves competitive performance compared to strong competitors in terms of both accuracy and model compression.",
    "authors": [
        "Jianquan Li",
        "Xiaokang Liu",
        "Honghong Zhao",
        "Ruifeng Xu",
        "Min Yang",
        "Yaohong Jin"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel BERT distillation method based on many-to-many layer mapping, which allows each intermediate student layer to learn from any intermediate teacher layers adaptively for various NLP tasks, is proposed."
    },
    "citationCount": 49,
    "influentialCitationCount": 7,
    "code": null,
    "description": null,
    "url": null
}