{
    "acronym": "8ff71f2f766e92c5829188e017573433dd2b5fb3",
    "title": "Synchronizing Vision and Language: Bidirectional Token-Masking AutoEncoder for Referring Image Segmentation",
    "seed_ids": [
        "bert",
        "55cd2d0a8f26c4dc458303f937af2b6fb8f8b693",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "8ff71f2f766e92c5829188e017573433dd2b5fb3",
    "abstract": "Referring Image Segmentation (RIS) aims to segment target objects expressed in natural language within a scene at the pixel level. Various recent RIS models have achieved state-of-the-art performance by generating contextual tokens to model multimodal features from pretrained encoders and effectively fusing them using transformer-based cross-modal attention. While these methods match language features with image features to effectively identify likely target objects, they often struggle to correctly understand contextual information in complex and ambiguous sentences and scenes. To address this issue, we propose a novel bidirectional token-masking autoencoder (BTMAE) inspired by the masked autoencoder (MAE). The proposed model learns the context of image-to-language and language-to-image by reconstructing missing features in both image and language features at the token level. In other words, this approach involves mutually complementing across the features of images and language, with a focus on enabling the network to understand interconnected deep contextual information between the two modalities. This learning method enhances the robustness of RIS performance in complex sentences and scenes. Our BTMAE achieves state-of-the-art performance on three popular datasets, and we demonstrate the effectiveness of the proposed method through various ablation studies.",
    "authors": [
        "Minhyeok Lee",
        "Dogyoon Lee",
        "Jungho Lee",
        "Suhwan Cho",
        "Heeseung Choi",
        "Ig-Jae Kim",
        "Sangyoun Lee"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel bidirectional token-masking autoencoder (BTMAE), which learns the context of image-to-language and language- to-image by reconstructing missing features in both image and language features at the token level to enhance the robustness of RIS performance in complex sentences and scenes."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}