{
    "acronym": "905c886090f1943da1e44ab2ece7e7659cf5a35c",
    "title": "The Turing Deception",
    "seed_ids": [
        "gpt2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "905c886090f1943da1e44ab2ece7e7659cf5a35c",
    "abstract": "This research revisits the classic Turing test and compares recent large language models such as ChatGPT for their abilities to reproduce human-level comprehension and compelling text generation. Two task challenges- summary and question answering- prompt ChatGPT to produce original content (98-99%) from a single text entry and sequential questions initially posed by Turing in 1950. We score the original and generated content against the OpenAI GPT2 Output Detector from 2019, and establish multiple cases where the generated content proves original and undetectable (98%). The question of a machine fooling a human judge recedes in this work relative to the question of \"how would one prove it?\" The original contribution of the work presents a metric and simple grammatical set for understanding the writing mechanics of chatbots in evaluating their readability and statistical clarity, engagement, delivery, overall quality, and plagiarism risks. While Turing's original prose scores at least 14% below the machine-generated output, whether an algorithm displays hints of Turing's true initial thoughts (the \"Lovelace 2.0\" test) remains unanswerable.",
    "authors": [
        "David A. Noever",
        "Matt Ciolino"
    ],
    "venue": "International Journal on Cybernetics &amp; Informatics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This research revisits the classic Turing test and compares recent large language models such as ChatGPT for their abilities to reproduce human-level comprehension and compelling text generation and establishes multiple cases where the generated content proves original and undetectable."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}