{
    "acronym": "90b21dbad8969b74d704eed15a3d98722a88e464",
    "title": "Pixelated Butterfly: Simple and Efficient Sparse training for Neural Network Models",
    "seed_ids": [
        "scatterbrain",
        "bigbird",
        "butterfly",
        "5f895e84c1fea75de07b4f90da518273c2e57291",
        "6fa1cfc4f97f03a8485692418c7aa1a06c574a85",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "a68c3412e60560290400d2707596f82a914b7c00",
        "8af925f4edf45131b5b6fed8aa655089d58692fa",
        "b1ac64438608aac1a8dfd0adf8fec8c6220f6bfd",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "90b21dbad8969b74d704eed15a3d98722a88e464",
    "abstract": "Overparameterized neural networks generalize well but are expensive to train. Ideally, one would like to reduce their computational cost while retaining their generalization benefits. Sparse model training is a simple and promising approach to achieve this, but there remain challenges as existing methods struggle with accuracy loss, slow training runtime, or difficulty in sparsifying all model components. The core problem is that searching for a sparsity mask over a discrete set of sparse matrices is difficult and expensive. To address this, our main insight is to optimize over a continuous superset of sparse matrices with a fixed structure known as products of butterfly matrices. As butterfly matrices are not hardware efficient, we propose simple variants of butterfly (block and flat) to take advantage of modern hardware. Our method (Pixelated Butterfly) uses a simple fixed sparsity pattern based on flat block butterfly and low-rank matrices to sparsify most network layers (e.g., attention, MLP). We empirically validate that Pixelated Butterfly is 3x faster than butterfly and speeds up training to achieve favorable accuracy--efficiency tradeoffs. On the ImageNet classification and WikiText-103 language modeling tasks, our sparse models train up to 2.5x faster than the dense MLP-Mixer, Vision Transformer, and GPT-2 medium with no drop in accuracy.",
    "authors": [
        "Beidi Chen",
        "Tri Dao",
        "Kaizhao Liang",
        "Jiaming Yang",
        "Zhao Song",
        "A. Rudra",
        "C. Ré"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work uses a simple fixed sparsity pattern based on flat block butterfly and low-rank matrices to sparsify most network layers and empirically validate that Pixelated Butterfly is 3x faster than butterfly and speeds up training to achieve favorable accuracy--efficiency tradeoffs."
    },
    "citationCount": 63,
    "influentialCitationCount": 13,
    "code": null,
    "description": null,
    "url": null
}