{
    "acronym": "90fe81e0c94e111482741c4c0251c3be673f8c24",
    "title": "Latent Spaces Enable Transformer-Based Dose Prediction in Complex Radiotherapy Plans",
    "seed_ids": [
        "transformer",
        "2d9ae4c167510ed78803735fc57ea67c3cc55a35"
    ],
    "s2id": "90fe81e0c94e111482741c4c0251c3be673f8c24",
    "abstract": "Evidence is accumulating in favour of using stereotactic ablative body radiotherapy (SABR) to treat multiple cancer lesions in the lung. Multi-lesion lung SABR plans are complex and require significant resources to create. In this work, we propose a novel two-stage latent transformer framework (LDFormer) for dose prediction of lung SABR plans with varying numbers of lesions. In the first stage, patient anatomical information and the dose distribution are encoded into a latent space. In the second stage, a transformer learns to predict the dose latent from the anatomical latents. Causal attention is modified to adapt to different numbers of lesions. LDFormer outperforms a state-of-the-art generative adversarial network on dose conformality in and around lesions, and the performance gap widens when considering overlapping lesions. LDFormer generates predictions of 3-D dose distributions in under 30s on consumer hardware, and has the potential to assist physicians with clinical decision making, reduce resource costs, and accelerate treatment planning.",
    "authors": [
        "E. Wang",
        "Ryan Au",
        "Pencilla Lang",
        "Sarah Mattonen"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel two-stage latent transformer framework (LDFormer) for dose prediction of lung SABR plans with varying numbers of lesions, which outperforms a state-of-the-art generative adversarial network on dose conformality in and around lesions, and the performance gap widens when considering overlapping lesions."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}