{
    "acronym": "91066db6fb6109bcdc5b74a6be36fb5b2a2a682d",
    "title": "Automatically Solving Elementary Science Questions: A Survey",
    "seed_ids": [
        "gpt",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "8f346de21a13dacf5b65e2de81e84d54226a5b9f",
        "9405cc0d6169988371b2755e573cc28650d14dfe",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47"
    ],
    "s2id": "91066db6fb6109bcdc5b74a6be36fb5b2a2a682d",
    "abstract": "Traditionally, Question Answering (QA) has been an important task in the field of Artificial Intelligence (AI) and a substantial amount of research has been done in the past proposing several methods to answer questions in an automated way. The process of QA has been viewed differently by different researchers in the past. Till date, the current / existing systems cannot answer elementary science questions which are obvious and easy to answer even for a primary school student. This paper documents various methodologies proposed in the research area of QA specifically for elementary science domain and includes the discussion of each technique used by various methodologies. We briefly present the overview of three components of generalized QA system and discuss various metrics used for evaluating the QA systems. The paper also presents an exhaustive review of various datasets used for the purpose with their respective description and details. We conclude the paper by identifying the limitations of the methodologies used till date and pointing out some future directions for research in the arena of science QA.",
    "authors": [
        "Swati Nagdev",
        "M. Radke",
        "Maya Ramanath"
    ],
    "venue": "IETE Technical Review",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Various methodologies proposed in the research area of QA specifically for elementary science domain are documents and the discussion of each technique used by various methodologies are included."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}