{
    "acronym": "914254fac74a2da051cccf6ca16afcaad416a079",
    "title": "AlexaTM 20B: Few-Shot Learning Using a Large-Scale Multilingual Seq2Seq Model",
    "seed_ids": [
        "gpt",
        "2811559b89a32fdf9facf24f4847f1d37393d158",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "15190e8b459bd85d546286f7d7da61b4f4f3f58a",
        "3c759e2f16bfde8d31189631e4893d3ac8ff05f2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "76a786b1acd6d1aca56e12a8a1db34569fdf9f3a",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "914254fac74a2da051cccf6ca16afcaad416a079",
    "abstract": "In this work, we demonstrate that multilingual large-scale sequence-to-sequence (seq2seq) models, pre-trained on a mixture of denoising and Causal Language Modeling (CLM) tasks, are more efficient few-shot learners than decoder-only models on various tasks. In particular, we train a 20 billion parameter multilingual seq2seq model called Alexa Teacher Model (AlexaTM 20B) and show that it achieves state-of-the-art (SOTA) performance on 1-shot summarization tasks, outperforming a much larger 540B PaLM decoder model. AlexaTM 20B also achieves SOTA in 1-shot machine translation, especially for low-resource languages, across almost all language pairs supported by the model (Arabic, English, French, German, Hindi, Italian, Japanese, Marathi, Portuguese, Spanish, Tamil, and Telugu) on Flores-101 dataset. We also show in zero-shot setting, AlexaTM 20B outperforms GPT3 (175B) on SuperGLUE and SQuADv2 datasets and provides SOTA performance on multilingual tasks such as XNLI, XCOPA, Paws-X, and XWinograd. Overall, our results present a compelling case for seq2seq models as a powerful alternative to decoder-only models for Large-scale Language Model (LLM) training.",
    "authors": [
        "Saleh Soltan",
        "Shankar Ananthakrishnan",
        "Jack G. M. FitzGerald",
        "Rahul Gupta",
        "Wael Hamza",
        "Haidar Khan",
        "Charith Peris",
        "Stephen Rawls",
        "Andrew Rosenbaum",
        "Anna Rumshisky",
        "Chandan Prakash",
        "Mukund Sridhar",
        "Fabian Triefenbach",
        "Apurv Verma",
        "Gokhan Tur",
        "Premkumar Natarajan"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that multilingual large-scale sequence-to-sequence (seq2seq) models, pre-trained on a mixture of denoising and Causal Language Modeling tasks, are more efficient few-shot learners than decoder-only models on various tasks."
    },
    "citationCount": 70,
    "influentialCitationCount": 12,
    "code": null,
    "description": null,
    "url": null
}