{
    "acronym": "9146d8bcf9377f149466a7a3b0e730c7aeae9b08",
    "title": "Manufacturing Sentiment: Forecasting Industrial Production with Text Analysis",
    "seed_ids": [
        "bert",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9146d8bcf9377f149466a7a3b0e730c7aeae9b08",
    "abstract": "This paper examines the link between industrial production and the sentiment expressed in natural language survey responses from U.S. manufacturing firms. We compare several natural language processing (NLP) techniques for classifying sentiment, ranging from dictionary-based methods to modern deep learning methods. Using a manually labeled sample as ground truth, we find that deep learning models partially trained on a human-labeled sample of our data outperform other methods for classifying the sentiment of survey responses. Further, we capitalize on the panel nature of the data to train models which predict firm-level production using lagged firm-level text. This allows us to leverage a large sample of \"naturally occurring\" labels with no manual input. We then assess the extent to which each sentiment measure, aggregated to monthly time series, can serve as a useful statistical indicator and forecast industrial production. Our results suggest that the text responses provide information beyond the available numerical data from the same survey and improve out-of-sample forecasting; deep learning methods and the use of naturally occurring labels seem especially useful for forecasting. We also explore what drives the predictions made by the deep learning models, and find that a relatively small number of words associated with very positive/negative sentiment account for much of the variation in the aggregatesentiment index.",
    "authors": [
        "Tomaz Cajner",
        "Leland D. Crane",
        "Christopher Kurz",
        "Norman Morin",
        "Paul E. Soto",
        "Betsy Vrankovich"
    ],
    "venue": "Finance and Economics Discussion Series",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results suggest that the text responses provided in natural language survey responses provide information beyond the available numerical data from the same survey and improve out-of-sample forecasting; deep learning methods and the use of naturally occurring labels seem especially useful for forecasting."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}