{
    "acronym": "915b10732f264bebd952c806db93692bf2cf8b08",
    "title": "SpaceByte: Towards Deleting Tokenization from Large Language Modeling",
    "seed_ids": [
        "mambabyte",
        "megabyte",
        "a6e2dca754f3dc625a9da5f10f9b7a57079bfd27",
        "a401510c434b2274b299e9444085df0b18808aaa",
        "f5789596531fad358c3166fdb5bd72d8e661c32c",
        "17fbffb05fa14e21d1c506fd5f0f568b955fe983",
        "412e266cddfd87c79087a88ba1e4d11b89a45a13",
        "5e52d654fd31f04c1bd884cd5480e6af8c95ad50",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "231e768f0cd280faa0f725bb353262cb4fed08d1",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "837ac4ed6825502f0460caec45e12e734c85b113",
        "0822f8d7e6a72a65e65f147d3a8d8fccd485da40",
        "f2fc9ef411846dd577c26225ce93f50bb1fa760b",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "915b10732f264bebd952c806db93692bf2cf8b08",
    "abstract": "Tokenization is widely used in large language models because it significantly improves performance. However, tokenization imposes several disadvantages, such as performance biases, increased adversarial vulnerability, decreased character-level modeling performance, and increased modeling complexity. To address these disadvantages without sacrificing performance, we propose SpaceByte, a novel byte-level decoder architecture that closes the performance gap between byte-level and subword autoregressive language modeling. SpaceByte consists of a byte-level Transformer model, but with extra larger transformer blocks inserted in the middle of the layers. We find that performance is significantly improved by applying these larger blocks only after certain bytes, such as space characters, which typically denote word boundaries. Our experiments show that for a fixed training and inference compute budget, SpaceByte outperforms other byte-level architectures and roughly matches the performance of tokenized Transformer architectures.",
    "authors": [
        "Kevin Slagle"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "SpaceByte is a novel byte-level decoder architecture that closes the performance gap between byte-level and subword autoregressive language modeling and outperforms other byte-level architectures and roughly matches the performance of tokenized Transformer architectures."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}