{
    "acronym": "917c2b6f4d78c3e2c61b9979dc0636bf44de63a8",
    "title": "ProtoDiffusion: Classifier-Free Diffusion Guidance with Prototype Learning",
    "seed_ids": [
        "classfreediffu",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "33f3f31f871070f19b0c3e967a24e322bfc178f2"
    ],
    "s2id": "917c2b6f4d78c3e2c61b9979dc0636bf44de63a8",
    "abstract": "Diffusion models are generative models that have shown significant advantages compared to other generative models in terms of higher generation quality and more stable training. However, the computational need for training diffusion models is considerably increased. In this work, we incorporate prototype learning into diffusion models to achieve high generation quality faster than the original diffusion model. Instead of randomly initialized class embeddings, we use separately learned class prototypes as the conditioning information to guide the diffusion process. We observe that our method, called ProtoDiffusion, achieves better performance in the early stages of training compared to the baseline method, signifying that using the learned prototypes shortens the training time. We demonstrate the performance of ProtoDiffusion using various datasets and experimental settings, achieving the best performance in shorter times across all settings.",
    "authors": [
        "Gulcin Baykal",
        "Halil Faruk Karagoz",
        "T. Binhuraib",
        "Gozde Unal"
    ],
    "venue": "Asian Conference on Machine Learning",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work incorporates prototype learning into diffusion models to achieve high generation quality faster than the original diffusion model, using separately learned class prototypes as the conditioning information to guide the diffusion process."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}