{
    "acronym": "920b52629a95f7b7326fa18b84d547b8014d33e5",
    "title": "Fine Tuning Auto Regressive LLMs for Long Document Abstractive Summarization",
    "seed_ids": [
        "longt5",
        "3c5f7e7ee0ab7413ba3bf8ad3400810da542d617",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "920b52629a95f7b7326fa18b84d547b8014d33e5",
    "abstract": "Generating a short summary from a long document is a challenging task, for which new language models are still being designed and trained based on the available data. Since deep learning models are used for NLP and NLG applications, it requires high computational power to train these models. Further, fine-tuning the weights based on a given context is an important task that needs additional computation space and time. In this paper, we have used Cerebras’ wafer-scale cluster that aims at providing an efficient software and hardware infrastructure that enhances the capabilities of pre-existing models and empowers them to handle lengthy documents well. In addition to analyzing common models along with their pros and cons, other factors such as the context lengths and model sizes have also been analyzed to accommodate lengthy documents as much as possible.",
    "authors": [
        "M. Rath",
        "Shobhan Banerjee",
        "Tanmaya Swain"
    ],
    "venue": "2023 IEEE 2nd International Conference on Industrial Electronics: Developments & Applications (ICIDeA)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Cerebras’ wafer-scale cluster is used to provide an efficient software and hardware infrastructure that enhances the capabilities of pre-existing models and empowers them to handle lengthy documents well and to accommodate lengthy documents as much as possible."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}