{
    "acronym": "92171cd100b5d61b77dedf69150931eff30fea85",
    "title": "Combining Knowledge Graphs and Large Language Models",
    "seed_ids": [
        "bert",
        "374664a1f5704c7451975e3f231a29f439aeaecd",
        "d60bc65862c9aca2b4c18595cc1d0f34cadaf4cf"
    ],
    "s2id": "92171cd100b5d61b77dedf69150931eff30fea85",
    "abstract": "In recent years, Natural Language Processing (NLP) has played a significant role in various Artificial Intelligence (AI) applications such as chatbots, text generation, and language translation. The emergence of large language models (LLMs) has greatly improved the performance of these applications, showing astonishing results in language understanding and generation. However, they still show some disadvantages, such as hallucinations and lack of domain-specific knowledge, that affect their performance in real-world tasks. These issues can be effectively mitigated by incorporating knowledge graphs (KGs), which organise information in structured formats that capture relationships between entities in a versatile and interpretable fashion. Likewise, the construction and validation of KGs present challenges that LLMs can help resolve. The complementary relationship between LLMs and KGs has led to a trend that combines these technologies to achieve trustworthy results. This work collected 28 papers outlining methods for KG-powered LLMs, LLM-based KGs, and LLM-KG hybrid approaches. We systematically analysed and compared these approaches to provide a comprehensive overview highlighting key trends, innovative techniques, and common challenges. This synthesis will benefit researchers new to the field and those seeking to deepen their understanding of how KGs and LLMs can be effectively combined to enhance AI applications capabilities.",
    "authors": [
        "Amanda Kau",
        "Xuzeng He",
        "Aishwarya Nambissan",
        "Aland Astudillo",
        "Hui Yin",
        "Amir Aryani"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work collected 28 papers outlining methods for KG-powered LLMs, LLM-based KGs, and LLM-KG hybrid approaches and systematically analysed and compared these approaches to provide a comprehensive overview highlighting key trends, innovative techniques, and common challenges."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}