{
    "acronym": "925ad2897d1b5decbea320d07e99afa9110e09b2",
    "title": "Longformer: The Long-Document Transformer",
    "seed_ids": [
        "transformerxl",
        "bptrans",
        "63857190aaf5aab1d94b54bb257b7b03b8cb5a50",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "f51497f463566581874c941353dd9d80069c5b77",
        "2e14e84ccec924ed770b58108ad1d9de6f0ca295",
        "2cf3bd0cc1382f35384e259d99e4f9744eeaed28",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "f4238bd2385a52413ccbacfd9e409a650235bd13",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "925ad2897d1b5decbea320d07e99afa9110e09b2",
    "abstract": "Transformer-based models are unable to process long sequences due to their self-attention operation, which scales quadratically with the sequence length. To address this limitation, we introduce the Longformer with an attention mechanism that scales linearly with sequence length, making it easy to process documents of thousands of tokens or longer. Longformer's attention mechanism is a drop-in replacement for the standard self-attention and combines a local windowed attention with a task motivated global attention. Following prior work on long-sequence transformers, we evaluate Longformer on character-level language modeling and achieve state-of-the-art results on text8 and enwik8. In contrast to most prior work, we also pretrain Longformer and finetune it on a variety of downstream tasks. Our pretrained Longformer consistently outperforms RoBERTa on long document tasks and sets new state-of-the-art results on WikiHop and TriviaQA. We finally introduce the Longformer-Encoder-Decoder (LED), a Longformer variant for supporting long document generative sequence-to-sequence tasks, and demonstrate its effectiveness on the arXiv summarization dataset.",
    "authors": [
        "Iz Beltagy",
        "Matthew E. Peters",
        "Arman Cohan"
    ],
    "venue": "arXiv.org",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Following prior work on long-sequence transformers, the Longformer is evaluated on character-level language modeling and achieves state-of-the-art results on text8 and enwik8 and pretrain Longformer and finetune it on a variety of downstream tasks."
    },
    "citationCount": 3075,
    "influentialCitationCount": 568,
    "code": null,
    "description": null,
    "url": null
}