{
    "acronym": "928361f6306940deaebd5c15ce12dfc394276b6a",
    "title": "SHViT: Single-Head Vision Transformer with Memory Efficient Macro Design",
    "seed_ids": [
        "metaformer",
        "9a83aeadc8db65fb6da39ec977360541cddaff5c",
        "f35016b3180808fa97d59acbdecf47d6e2ed2819",
        "066c143b427571fb5568f2c581ea9066478d2e55",
        "dd1139cfc609c2f3263d02e97176d5275caebc0a",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "bf6ce546c589fa8054b3972b266532664914bd21",
        "fa717a2e31f0cef4e26921f3b147a98644d2e64c",
        "5d032bd2632b6f5847767f39ce247098c6bbc563",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "928361f6306940deaebd5c15ce12dfc394276b6a",
    "abstract": "Recently, efficient Vision Transformers have shown great performance with low latency on resource-constrained devices. Conventionally, they use 4x4 patch embeddings and a 4-stage structure at the macro level, while utilizing sophisticated attention with multi-head configuration at the micro level. This paper aims to address computational redundancy at all design levels in a memory-efficient manner. We discover that using larger-stride patchify stem not only reduces memory access costs but also achieves competitive performance by leveraging token representations with reduced spatial redundancy from the early stages. Furthermore, our preliminary analyses suggest that attention layers in the early stages can be substituted with convolutions, and several attention heads in the latter stages are computationally redundant. To handle this, we introduce a single-head attention module that inherently prevents head redundancy and simultaneously boosts accuracy by parallelly combining global and local information. Building upon our solutions, we introduce SHViT, a Single-Head Vision Transformer that obtains the state-of-the-art speed-accuracy tradeoff. For example, on ImageNet-1k, our SHViT-S4 is 3.3x, 8.1x, and 2.4x faster than MobileViTv2 x1.0 on GPU, CPU, and iPhone12 mobile device, respectively, while being 1.3% more accurate. For object detection and instance segmentation on MS COCO using Mask-RCNN head, our model achieves performance comparable to FastViT-SA12 while exhibiting 3.8x and 2.0x lower backbone latency on GPU and mobile device, respectively.",
    "authors": [
        "Seokju Yun",
        "Youngmin Ro"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces SHViT, a Single-Head Vision Transformer that obtains the state-of-the-art speed-accuracy tradeoff and introduces a single-head attention module that inherently prevents head redundancy and simultaneously boosts accuracy by parallelly combining global and local information."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}