{
    "acronym": "9297502c3b1eaa528e8a8fb85a83842d0577fdc6",
    "title": "Frequency-domain MLPs are More Effective Learners in Time Series Forecasting",
    "seed_ids": [
        "reformer",
        "defecf3dc299214f4cb76a093c6eed2297eaa46f",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676"
    ],
    "s2id": "9297502c3b1eaa528e8a8fb85a83842d0577fdc6",
    "abstract": "Time series forecasting has played the key role in different industrial, including finance, traffic, energy, and healthcare domains. While existing literatures have designed many sophisticated architectures based on RNNs, GNNs, or Transformers, another kind of approaches based on multi-layer perceptrons (MLPs) are proposed with simple structure, low complexity, and {superior performance}. However, most MLP-based forecasting methods suffer from the point-wise mappings and information bottleneck, which largely hinders the forecasting performance. To overcome this problem, we explore a novel direction of applying MLPs in the frequency domain for time series forecasting. We investigate the learned patterns of frequency-domain MLPs and discover their two inherent characteristic benefiting forecasting, (i) global view: frequency spectrum makes MLPs own a complete view for signals and learn global dependencies more easily, and (ii) energy compaction: frequency-domain MLPs concentrate on smaller key part of frequency components with compact signal energy. Then, we propose FreTS, a simple yet effective architecture built upon Frequency-domain MLPs for Time Series forecasting. FreTS mainly involves two stages, (i) Domain Conversion, that transforms time-domain signals into complex numbers of frequency domain; (ii) Frequency Learning, that performs our redesigned MLPs for the learning of real and imaginary part of frequency components. The above stages operated on both inter-series and intra-series scales further contribute to channel-wise and time-wise dependency learning. Extensive experiments on 13 real-world benchmarks (including 7 benchmarks for short-term forecasting and 6 benchmarks for long-term forecasting) demonstrate our consistent superiority over state-of-the-art methods.",
    "authors": [
        "Kun Yi",
        "Qi Zhang",
        "Wei Fan",
        "Shoujin Wang",
        "Pengyang Wang",
        "Hui He",
        "Defu Lian",
        "Ning An",
        "Longbin Cao",
        "Zhendong Niu"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work explores a novel direction of applying MLPs in the frequency domain for time series forecasting, and proposes FreTS, a simple yet effective architecture built upon Frequency-domain MLPs for Time Series forecasting."
    },
    "citationCount": 37,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}