{
    "acronym": "92a236a1ca049e186ca53c9ce12219ebca315ba1",
    "title": "Causal Prompting: Debiasing Large Language Model Prompting based on Front-Door Adjustment",
    "seed_ids": [
        "bert",
        "8fe851f26a929d4c46911067e6ffc62eeac3fdd2",
        "aade40af0d85b0b4fe15c97f6222d5c2e4d6d9b3",
        "0a94fbb5e1c93513523f00e75d672ef4553861f9",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "92173d081b15824d22a9ef070e118744ceee8052",
        "ec307b17f193b14292206b65a1bcc95bfd8f02ed"
    ],
    "s2id": "92a236a1ca049e186ca53c9ce12219ebca315ba1",
    "abstract": "Despite the notable advancements of existing prompting methods, such as In-Context Learning and Chain-of-Thought for Large Language Models (LLMs), they still face challenges related to various biases. Traditional debiasing methods primarily focus on the model training stage, including approaches based on data augmentation and reweighting, yet they struggle with the complex biases inherent in LLMs. To address such limitations, the causal relationship behind the prompting methods is uncovered using a structural causal model, and a novel causal prompting method based on front-door adjustment is proposed to effectively mitigate LLMs biases. In specific, causal intervention is achieved by designing the prompts without accessing the parameters and logits of LLMs. The chain-of-thought generated by LLM is employed as the mediator variable and the causal effect between input prompts and output answers is calculated through front-door adjustment to mitigate model biases. Moreover, to accurately represent the chain-of-thoughts and estimate the causal effects, contrastive learning is used to fine-tune the encoder of chain-of-thought by aligning its space with that of the LLM. Experimental results show that the proposed causal prompting approach achieves excellent performance across seven natural language processing datasets on both open-source and closed-source LLMs.",
    "authors": [
        "Congzhi Zhang",
        "Linhai Zhang",
        "Deyu Zhou",
        "Guoqiang Xu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The causal relationship behind the prompting methods is uncovered using a structural causal model, and a novel causal prompting method based on front-door adjustment is proposed to effectively mitigate LLMs biases."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}