{
    "acronym": "92bc69500c16fce47bcfd06ada14ffc4a7e8ddca",
    "title": "PAGnol: An Extra-Large French Generative Model",
    "seed_ids": [
        "gpt",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "069e0d896da7c79faeee4cf057548d5da7ce885e",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "92bc69500c16fce47bcfd06ada14ffc4a7e8ddca",
    "abstract": "Access to large pre-trained models of varied architectures, in many different languages, is central to the democratization of NLP. We introduce PAGnol, a collection of French GPT models. Using scaling laws, we efficiently train PAGnol-XL (1.5B parameters) with the same computational budget as CamemBERT, a model 13 times smaller. PAGnol-XL is the largest model trained from scratch for the French language. We plan to train increasingly large and performing versions of PAGnol, exploring the capabilities of French extreme-scale models. For this first release, we focus on the pre-training and scaling calculations underlining PAGnol. We fit a scaling law for compute for the French language, and compare it with its English counterpart. We find the pre-training dataset significantly conditions the quality of the outputs, with common datasets such as OSCAR leading to low-quality offensive text. We evaluate our models on discriminative and generative tasks in French, comparing to other state-of-the-art French and multilingual models, and reaching the state of the art in the abstract summarization task. Our research was conducted on the public GENCI Jean Zay supercomputer, and our models up to the Large are made publicly available.",
    "authors": [
        "Julien Launay",
        "E. L. Tommasone",
        "B. Pannier",
        "Franccois Boniface",
        "A. Chatelain",
        "Alessandro Cappelli",
        "Iacopo Poli",
        "Djamé Seddah"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The pre-training dataset significantly conditions the quality of the outputs, with common datasets such as OSCAR leading to low-quality offensive text, and a scaling law for compute for the French language is fit, and it is compared with its English counterpart."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}