{
    "acronym": "92e4dcad90b27a9778206da598b81ce2c4612625",
    "title": "EnhancerNet: a model for enhancer selection in dense regulatory networks recapitulates the dynamics of cell type acquisition",
    "seed_ids": [
        "hopfield"
    ],
    "s2id": "92e4dcad90b27a9778206da598b81ce2c4612625",
    "abstract": "Understanding how cell identity is encoded in the genome and acquired during differentiation is a central challenge in cell biology. We derive a theoretical framework called “EnhancerNet” that models dense feedback networks involving transcription factors and enhancers, which can be parameterized from terminal cell identities without fitting unobserved variables. EnhancerNet recapitulates the dynamics of enhancer selection and cell type specification via two distinct pathways: direct reprogramming or differentiation through transient, multipotent progenitor states. These pathways capture the hallmarks of their respective counterparts in animal cells, with the model reproducing known reprogramming recipes and the complex hematopoietic differentiation hierarchy. Using EnhancerNet, we show that hierarchical progenitors emerge as transient states during differentiation and propose a method to predict their identity from terminal states. The model explains how new cell types could evolve and highlights the functional importance of distal regulatory elements with dynamic chromatin in multicellular evolution.",
    "authors": [
        "Omer Karin"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that hierarchical progenitors emerge as transient states during differentiation and a method to predict their identity from terminal states is proposed, which explains how new cell types could evolve and highlights the functional importance of distal regulatory elements with dynamic chromatin in multicellular evolution."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}