{
    "acronym": "92f9ca9a0190880890884431b6d0791cdf598672",
    "title": "Prototypical Transformer as Unified Motion Learners",
    "seed_ids": [
        "transformer",
        "131ba9932572c92155874db93626cf299659254e",
        "72862e6e858c44ebd94d6ba90dc420963d9d0f39",
        "7bffc157b3b3626a3912a3b0ef74ce5904630fce",
        "1a883522f3c0051d70be1f8cbdb8989a77395006",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "92f9ca9a0190880890884431b6d0791cdf598672",
    "abstract": "In this work, we introduce the Prototypical Transformer (ProtoFormer), a general and unified framework that approaches various motion tasks from a prototype perspective. ProtoFormer seamlessly integrates prototype learning with Transformer by thoughtfully considering motion dynamics, introducing two innovative designs. First, Cross-Attention Prototyping discovers prototypes based on signature motion patterns, providing transparency in understanding motion scenes. Second, Latent Synchronization guides feature representation learning via prototypes, effectively mitigating the problem of motion uncertainty. Empirical results demonstrate that our approach achieves competitive performance on popular motion tasks such as optical flow and scene depth. Furthermore, it exhibits generality across various downstream tasks, including object tracking and video stabilization.",
    "authors": [
        "Cheng Han",
        "Yawen Lu",
        "Guohao Sun",
        "James Liang",
        "Zhiwen Cao",
        "Qifan Wang",
        "Qiang Guan",
        "S. Dianat",
        "Raghuveer M. Rao",
        "Tong Geng",
        "Zhiqiang Tao",
        "Dongfang Liu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Prototypical Transformer (ProtoFormer), a general and unified framework that approaches various motion tasks from a prototype perspective, seamlessly integrates prototype learning with Transformer by thoughtfully considering motion dynamics, introducing two innovative designs."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}