{
    "acronym": "9355c9d9ffd4d6dea960f2dfd9f5d3000fde60ca",
    "title": "Birdsong sequence exhibits long context dependency comparable to human language syntax",
    "seed_ids": [
        "transformerxl"
    ],
    "s2id": "9355c9d9ffd4d6dea960f2dfd9f5d3000fde60ca",
    "abstract": "Context dependency is a key feature in sequential structures of human language, which requires reference between words far apart in produced sequence. Assessing how long the past context has effect on the current status provides crucial information to understand the mechanism for complex sequential behaviors. Birdsongs serve as a representative model for studying the context dependency in sequential signals produced by non-human animals, while previous reports were upper bounded by methodological limitations. Here we show that birdsongs have a long context dependency comparable to grammatical structure in human language. We newly estimated the context dependency in birdsongs in a scalable way using a neural-network-based language model whose accessible context length is sufficiently long. Quantitative comparison with the parallel analysis of English sentences revealed that the context dependency in the birdsong was much shorter than that in the sentence, but was comparable to the grammatical structure when semantic factors were removed. Our findings are in accordance with the previous generalization in comparative studies that birdsong is more homologous to human language syntax than the entirety of human language including semantics.",
    "authors": [
        "Takashi Morita",
        "H. Koda",
        "K. Okanoya",
        "Ryosuke O. Tachibana"
    ],
    "venue": "bioRxiv",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that birdsongs have a long context dependency comparable to grammatical structure in human language, which is in accordance with the previous generalization in comparative studies that birdsong is more homologous to human language syntax than the entirety of human language including semantics."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}