{
    "acronym": "9382bcbbc9995d13cbcf4e00a1175188d2e60018",
    "title": "MDERank: A Masked Document Embedding Rank Approach for Unsupervised Keyphrase Extraction",
    "seed_ids": [
        "bigbird",
        "da454295392cf4caaa39cc465734237ffe55392f",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "4e3c7891b643acb0849983eb506ae70bf126bc00",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "a022bda79947d1f656a1164003c1b3ae9a843df9"
    ],
    "s2id": "9382bcbbc9995d13cbcf4e00a1175188d2e60018",
    "abstract": "Keyphrase extraction (KPE) automatically extracts phrases in a document that provide a concise summary of the core content, which benefits downstream information retrieval and NLP tasks. Previous state-of-the-art methods select candidate keyphrases based on the similarity between learned representations of the candidates and the document. They suffer performance degradation on long documents due to discrepancy between sequence lengths which causes mismatch between representations of keyphrase candidates and the document. In this work, we propose a novel unsupervised embedding-based KPE approach, Masked Document Embedding Rank (MDERank), to address this problem by leveraging a mask strategy and ranking candidates by the similarity between embeddings of the source document and the masked document. We further develop a KPE-oriented BERT (KPEBERT) model by proposing a novel self-supervised contrastive learning method, which is more compatible to MDERank than vanilla BERT. Comprehensive evaluations on six KPE benchmarks demonstrate that the proposed MDERank outperforms state-of-the-art unsupervised KPE approach by average 1.80 F1@15 improvement. MDERank further benefits from KPEBERT and overall achieves average 3.53 F1@15 improvement over SIFRank.",
    "authors": [
        "Linhan Zhang",
        "Qian Chen",
        "Wen Wang",
        "Chong Deng",
        "Shiliang Zhang",
        "Bing Li",
        "Wei Wang",
        "Xin Cao"
    ],
    "venue": "Findings",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel unsupervised embedding-based KPE approach, Masked Document Embedding Rank (MDERank), is proposed to address the problem of performance degradation on long documents by leveraging a mask strategy and ranking candidates by the similarity between embeddings of the source document and the masked document."
    },
    "citationCount": 37,
    "influentialCitationCount": 8,
    "code": null,
    "description": null,
    "url": null
}