{
    "acronym": "93e58491830abe1eb965ab37ec64fa97263f6048",
    "title": "HyperAttention: Long-context Attention in Near-Linear Time",
    "seed_ids": [
        "scatterbrain",
        "reformer",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "14c44df22b0d5361b61181fbf2ec0977ad189abf",
        "9b069ba5259d229bfd4fe3ac3768148e2d1092f8",
        "90b21dbad8969b74d704eed15a3d98722a88e464",
        "5f895e84c1fea75de07b4f90da518273c2e57291",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "c0f709acf38eb27702b0fbce1215db0ebaa2de2b",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "e3aa232577bb427b1f3a34acbdef84bd85734042",
        "4b56eef2862f7f553686f1dd190c56017122a6a0",
        "c49c292e1fb1d215c88828a52134b7ccfa52be44"
    ],
    "s2id": "93e58491830abe1eb965ab37ec64fa97263f6048",
    "abstract": "We present an approximate attention mechanism named HyperAttention to address the computational challenges posed by the growing complexity of long contexts used in Large Language Models (LLMs). Recent work suggests that in the worst-case scenario, quadratic time is necessary unless the entries of the attention matrix are bounded or the matrix has low stable rank. We introduce two parameters which measure: (1) the max column norm in the normalized attention matrix, and (2) the ratio of row norms in the unnormalized attention matrix after detecting and removing large entries. We use these fine-grained parameters to capture the hardness of the problem. Despite previous lower bounds, we are able to achieve a linear time sampling algorithm even when the matrix has unbounded entries or a large stable rank, provided the above parameters are small. HyperAttention features a modular design that easily accommodates integration of other fast low-level implementations, particularly FlashAttention. Empirically, employing Locality Sensitive Hashing (LSH) to identify large entries, HyperAttention outperforms existing methods, giving significant speed improvements compared to state-of-the-art solutions like FlashAttention. We validate the empirical performance of HyperAttention on a variety of different long-context length datasets. For example, HyperAttention makes the inference time of ChatGLM2 50\\% faster on 32k context length while perplexity increases from 5.6 to 6.3. On larger context length, e.g., 131k, with causal masking, HyperAttention offers 5-fold speedup on a single attention layer.",
    "authors": [
        "Insu Han",
        "Rajesh Jayaram",
        "Amin Karbasi",
        "V. Mirrokni",
        "David P. Woodruff",
        "A. Zandieh"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An approximate attention mechanism named HyperAttention is presented to address the computational challenges posed by the growing complexity of long contexts used in Large Language Models, and is able to achieve a linear time sampling algorithm even when the matrix has unbounded entries or a large stable rank."
    },
    "citationCount": 29,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}