{
    "acronym": "93e6b3ea9af26737ec0e4e8a056b497f4dca5354",
    "title": "Generative Models for Complex Logical Reasoning over Knowledge Graphs",
    "seed_ids": [
        "bert",
        "diffuseq",
        "fb78f578f50868ea77e170c6a23b864c8f539dde",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2"
    ],
    "s2id": "93e6b3ea9af26737ec0e4e8a056b497f4dca5354",
    "abstract": "Answering complex logical queries over knowledge graphs (KGs) is a fundamental yet challenging task. Recently, query representation has been a mainstream approach to complex logical reasoning, making the target answer and query closer in the embedding space. However, there are still two limitations. First, prior methods model the query as a fixed vector, but ignore the uncertainty of relations on KGs. In fact, different relations may contain different semantic distributions. Second, traditional representation frameworks fail to capture the joint distribution of queries and answers, which can be learned by generative models that have the potential to produce more coherent answers. To alleviate these limitations, we propose a novel generative model, named DiffCLR, which exploits the diffusion model for complex logical reasoning to approximate query distributions. Specifically, we first devise a query transformation to convert logical queries into input sequences by dynamically constructing contextual subgraphs. Then, we integrate them into the diffusion model to execute a multi-step generative process, and a structure-enhanced self-attention is further designed for incorporating the structural features embodied in KGs. Experimental results on two benchmark datasets show our model effectively outperforms state-of-the-art methods, particularly in multi-hop chain queries with significant improvement.",
    "authors": [
        "Yu Liu",
        "Yanan Cao",
        "Shi Wang",
        "Qingyue Wang",
        "Guanqun Bi"
    ],
    "venue": "Web Search and Data Mining",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel generative model is proposed, named DiffCLR, which exploits the diffusion model for complex logical reasoning to approximate query distributions and effectively outperforms state-of-the-art methods, particularly in multi-hop chain queries with significant improvement."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}