{
    "acronym": "93f118e4f583c0ee6a97b39ef8b6bc23565229bb",
    "title": "Sequential Cross-Document Coreference Resolution",
    "seed_ids": [
        "longformer",
        "6aaec722a90eee0185d4bbfebbcd4f228ed1577f",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "7cc730da554003dda77796d2cb4f06da5dfd5592"
    ],
    "s2id": "93f118e4f583c0ee6a97b39ef8b6bc23565229bb",
    "abstract": "Relating entities and events in text is a key component of natural language understanding. Cross-document coreference resolution, in particular, is important for the growing interest in multi-document analysis tasks. In this work we propose a new model that extends the efficient sequential prediction paradigm for coreference resolution to cross-document settings and achieves competitive results for both entity and event coreference while providing strong evidence of the efficacy of both sequential models and higher-order inference in cross-document settings. Our model incrementally composes mentions into cluster representations and predicts links between a mention and the already constructed clusters, approximating a higher-order model. In addition, we conduct extensive ablation studies that provide new insights into the importance of various inputs and representation types in coreference.",
    "authors": [
        "Emily Allaway",
        "Shuai Wang",
        "Miguel Ballesteros"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new model is proposed that extends the efficient sequential prediction paradigm for coreference resolution to cross- document settings and achieves competitive results for both entity and event coreference while providing strong evidence of the efficacy of both sequential models and higher-order inference in cross-document settings."
    },
    "citationCount": 14,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}