{
    "acronym": "9406aa108296d5c1985950f02b4a24dfd9b0a4ec",
    "title": "JIANG: Chinese Open Foundation Language Model",
    "seed_ids": [
        "roformer",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4"
    ],
    "s2id": "9406aa108296d5c1985950f02b4a24dfd9b0a4ec",
    "abstract": "With the advancements in large language model technology, it has showcased capabilities that come close to those of human beings across various tasks. This achievement has garnered significant interest from companies and scientific research institutions, leading to substantial investments in the research and development of these models. While numerous large models have emerged during this period, the majority of them have been trained primarily on English data. Although they exhibit decent performance in other languages, such as Chinese, their potential remains limited due to factors like vocabulary design and training corpus. Consequently, their ability to fully express their capabilities in Chinese falls short. To address this issue, we introduce the model named JIANG (Chinese pinyin of ginger) specifically designed for the Chinese language. We have gathered a substantial amount of Chinese corpus to train the model and have also optimized its structure. The extensive experimental results demonstrate the excellent performance of our model.",
    "authors": [
        "Qinhua Duan",
        "Wenchao Gu",
        "Yujia Chen",
        "Wenxin Mao",
        "Zewen Tian",
        "Huibing Cao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a model named JIANG (Chinese pinyin of ginger) specifically designed for the Chinese language, and gathers a substantial amount of Chinese corpus to train the model and optimized its structure."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}