{
    "acronym": "9426a6bb6c5257ae62a47f4124af6cc757bef018",
    "title": "SERI: Generative Chatbot Framework for Cybergrooming Prevention",
    "seed_ids": [
        "gpt",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9426a6bb6c5257ae62a47f4124af6cc757bef018",
    "abstract": "Cybergrooming refers to a crime to lure potential victims, particularly youth, by establishing personal trust relationships with them for sexual abuse or exploitation. Although cyber-grooming is recognized as one of the serious social issues, there has been a lack of proactive programs to protect the youth. In this paper, we present a generative chatbot framework, called SERI (Stop cybERgroomIng), that can generate authentic conversations be-tween a perpetrator chatbot and a potential victim chatbot. The SERI is designed to provide a safe and authentic environment for enhancing youth’s sensitivity and awareness of subtle cues of cybergrooming without exposing unnecessary ethical issues caused by potentially offensive or upsetting languages. The SERI is developed as a pre-stage before the perpe-trator chatbot is deployed to chatting with an actual human youth user to observe how the youth user can respond to a stranger or ac-quaintance asking for sensitive or private information. Hence, to evaluate the quality of the conversations generated by the SERI, we use open-source, referenced, and unreferenced metrics to assess the generated conversations automatically. In addition, we evaluated the quality of the conversation based on the human evaluation method. Our results show that the SERI can generate authentic conversations be-tween the two chatbots compared to the original conversations from the used dataset in per-plexity and MaUde scores.",
    "authors": [
        "Pei Wang",
        "Zhen Guo",
        "Lifu Huang",
        "Jin-Hee Cho"
    ],
    "venue": "",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A generative chatbot framework that can generate authentic conversations be-tween a perpetrator chatbot and a potential victim chatbot and the results show that the SERI can generate authentic conversations be-tween the two chatbots compared to the original conversations from the used dataset in per-plexity and MaUde scores."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}