{
    "acronym": "944d20fd0fac67452ea7a1c9a2666f05bfa59d4e",
    "title": "From Text Segmentation to Smart Chaptering: A Novel Benchmark for Structuring Video Transcriptions",
    "seed_ids": [
        "bert",
        "3bcea238b0c323d8f891829714bbe6e8a3de894c",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "c6c734e16f66fbfcefac7625cc64599e83292c1e",
        "ef57ad148ec2eeef5eb3467f3e37e30042b2c7bd",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "944d20fd0fac67452ea7a1c9a2666f05bfa59d4e",
    "abstract": "Text segmentation is a fundamental task in natural language processing, where documents are split into contiguous sections. However, prior research in this area has been constrained by limited datasets, which are either small in scale, synthesized, or only contain well-structured documents. In this paper, we address these limitations by introducing a novel benchmark YTSeg focusing on spoken content that is inherently more unstructured and both topically and structurally diverse. As part of this work, we introduce an efficient hierarchical segmentation model MiniSeg, that outperforms state-of-the-art baselines. Lastly, we expand the notion of text segmentation to a more practical “smart chaptering” task that involves the segmentation of unstructured content, the generation of meaningful segment titles, and a potential real-time application of the models.",
    "authors": [
        "Fabian Retkowski",
        "Alexander Waibel"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An efficient hierarchical segmentation model MiniSeg is introduced, that outperforms state-of-the-art baselines and is expanded to a more practical “smart chaptering” task that involves the segmentation of unstructured content, the generation of meaningful segment titles, and a potential real-time application of the models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}