{
    "acronym": "946cdff6b0b1aeafbdf21adee0ea41c555cbc50f",
    "title": "Enhancing Context Models for Point Cloud Geometry Compression With Context Feature Residuals and Multi-Loss",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "946cdff6b0b1aeafbdf21adee0ea41c555cbc50f",
    "abstract": "In point cloud geometry compression, context models usually use the one-hot encoding of node occupancy as the label, and the cross-entropy between the one-hot encoding and the probability distribution predicted by the context model as the loss function. However, this approach has two main weaknesses. First, the differences between contexts of different nodes are not significant, making it difficult for the context model to accurately predict the probability distribution of node occupancy. Second, as the one-hot encoding is not the actual probability distribution of node occupancy, the cross-entropy loss function is inaccurate. To address these problems, we propose a general structure that can enhance existing context models. We introduce the context feature residuals into the context model to amplify the differences between contexts. We also add a multi-layer perception branch, that uses the mean squared error between its output and node occupancy as a loss function to provide accurate gradients in backpropagation. We validate our method by showing that it can improve the performance of an octree-based model (OctAttention) and a voxel-based model (VoxelDNN) on the object point cloud datasets MPEG 8i and MVUB, as well as the LiDAR point cloud dataset SemanticKITTI.",
    "authors": [
        "Chang Sun",
        "Hui Yuan",
        "Shuai Li",
        "Xin Lu",
        "R. Hamzaoui"
    ],
    "venue": "IEEE Journal on Emerging and Selected Topics in Circuits and Systems",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces the context feature residuals into the context model to amplify the differences between contexts and adds a multi-layer perception branch, that uses the mean squared error between its output and node occupancy as a loss function to provide accurate gradients in backpropagation."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}