{
    "acronym": "94846f838853539e2ddf9440c09342cdb5b7a2c9",
    "title": "Summarize, Outline, and Elaborate: Long-Text Generation via Hierarchical Supervision from Extractive Summaries",
    "seed_ids": [
        "transformerxl",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "016a3ba7adcae71f5a23ed2663d8062ae1da63e6",
        "25db56fc85fe15625c3375064a35e908ba6dfd2a",
        "2e14e84ccec924ed770b58108ad1d9de6f0ca295",
        "f6390beca54411b06f3bde424fb983a451789733",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "7cc730da554003dda77796d2cb4f06da5dfd5592",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "f4238bd2385a52413ccbacfd9e409a650235bd13",
        "2a31319e73d4486716168b65cdf7559baeda18ce",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "94846f838853539e2ddf9440c09342cdb5b7a2c9",
    "abstract": "The difficulty of generating coherent long texts lies in the fact that existing models overwhelmingly focus on the tasks of local word prediction, and cannot make high level plans on what to generate or capture the high-level discourse dependencies between chunks of texts. Inspired by how humans write, where a list of bullet points or a catalog is first outlined, and then each bullet point is expanded to form the whole article, we propose SOE, a pipelined system that involves of summarizing, outlining and elaborating for long text generation: the model first outlines the summaries for different segments of long texts, and then elaborates on each bullet point to generate the corresponding segment. To avoid the labor-intensive process of summary soliciting, we propose the reconstruction strategy, which extracts segment summaries in an unsupervised manner by selecting its most informative part to reconstruct the segment. The proposed generation system comes with the following merits: (1) the summary provides high-level guidance for text generation and avoids the local minimum of individual word predictions; (2) the high-level discourse dependencies are captured in the conditional dependencies between summaries and are preserved during the summary expansion process and (3) additionally, we are able to consider significantly more contexts by representing contexts as concise summaries. Extensive experiments demonstrate that SOE produces long texts with significantly better quality, along with faster convergence speed.",
    "authors": [
        "Xiaofei Sun",
        "Chun Fan",
        "Zijun Sun",
        "Yuxian Meng",
        "Fei Wu",
        "Jiwei Li"
    ],
    "venue": "International Conference on Computational Linguistics",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "SOE, a pipelined system that involves of summarizing, outlining and elaborating for long text generation, and the reconstruction strategy, which extracts segment summaries in an unsupervised manner by selecting its most informative part to reconstruct the segment."
    },
    "citationCount": 14,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}