{
    "acronym": "94dc4085a42b626680175d52c9a26ced55c29630",
    "title": "CycleMLP: A MLP-Like Architecture for Dense Visual Predictions",
    "seed_ids": [
        "gmlp",
        "fbf68eb0cf8237cef59ebdb301569c79b9676ff9",
        "730a34374384f8abb886e464758b1a145edef938",
        "899a4e362cdaf6c98af59aa3a267c7e0abf01c98",
        "1ec58a9f1958f1c2540baadfa8f9809388788ab4",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "485c08025157973bb52a935c6aa3bee74f990c01",
        "71363797140647ebb3f540584de0a8758d2f7aa2",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "94dc4085a42b626680175d52c9a26ced55c29630",
    "abstract": "This article presents a simple yet effective multilayer perceptron (MLP) architecture, namely CycleMLP, which is a versatile neural backbone network capable of solving various tasks of dense visual predictions such as object detection, segmentation, and human pose estimation. Compared to recent advanced MLP architectures such as MLP-Mixer (Tolstikhin et al. 2021), ResMLP (Touvron et al. 2021), and gMLP (Liu et al. 2021), whose architectures are sensitive to image size and are infeasible in dense prediction tasks, CycleMLP has two appealing advantages: 1) CycleMLP can cope with various spatial sizes of images; 2) CycleMLP achieves linear computational complexity with respect to the image size by using local windows. In contrast, previous MLPs have <inline-formula><tex-math notation=\"LaTeX\">$O(N^{2})$</tex-math><alternatives><mml:math><mml:mrow><mml:mi>O</mml:mi><mml:mo>(</mml:mo><mml:msup><mml:mi>N</mml:mi><mml:mn>2</mml:mn></mml:msup><mml:mo>)</mml:mo></mml:mrow></mml:math><inline-graphic xlink:href=\"chen-ieq1-3303397.gif\"/></alternatives></inline-formula> computational complexity due to their full connections in space. 3) The relationship between convolution, multi-head self-attention in Transformer, and CycleMLP are discussed through an intuitive theoretical analysis. We build a family of models that can surpass state-of-the-art MLP and Transformer models e.g., Swin Transformer (Liu et al. 2021), while using fewer parameters and FLOPs. CycleMLP expands the MLP-like models’ applicability, making them versatile backbone networks that achieve competitive results on dense prediction tasks For example, CycleMLP-Tiny outperforms Swin-Tiny by 1.3% mIoU on ADE20 K dataset with fewer FLOPs. Moreover, CycleMLP also shows excellent zero-shot robustness on ImageNet-C dataset.",
    "authors": [
        "Shoufa Chen",
        "Enze Xie",
        "Chongjian Ge",
        "Runjian Chen",
        "Ding Liang",
        "P. Luo"
    ],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 14,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}