{
    "acronym": "95065df309d6228cea478911d9b8a227f53bd06c",
    "title": "Centralized Feature Pyramid for Object Detection",
    "seed_ids": [
        "metaformer",
        "e3b56d3515b5fa19c3bd4764400754079932f718",
        "71363797140647ebb3f540584de0a8758d2f7aa2",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "95065df309d6228cea478911d9b8a227f53bd06c",
    "abstract": "The visual feature pyramid has shown its superiority in both effectiveness and efficiency in a variety of applications. However, current methods overly focus on inter-layer feature interactions while disregarding the importance of intra-layer feature regulation. Despite some attempts to learn a compact intra-layer feature representation with the use of attention mechanisms or vision transformers, they overlook the crucial corner regions that are essential for dense prediction tasks. To address this problem, we propose a Centralized Feature Pyramid (CFP) network for object detection, which is based on a globally explicit centralized feature regulation. Specifically, we first propose a spatial explicit visual center scheme, where a lightweight MLP is used to capture the globally long-range dependencies, and a parallel learnable visual center mechanism is used to capture the local corner regions of the input images. Based on this, we then propose a globally centralized regulation for the commonly-used feature pyramid in a top-down fashion, where the explicit visual center information obtained from the deepest intra-layer feature is used to regulate frontal shallow features. Compared to the existing feature pyramids, CFP not only has the ability to capture the global long-range dependencies but also efficiently obtain an all-round yet discriminative feature representation. Experimental results on the challenging MS-COCO validate that our proposed CFP can achieve consistent performance gains on the state-of-the-art YOLOv5 and YOLOX object detection baselines.",
    "authors": [
        "Yu Quan",
        "Dong Zhang",
        "Liyan Zhang",
        "Jinhui Tang"
    ],
    "venue": "IEEE Transactions on Image Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Centralized Feature Pyramid (CFP) network for object detection, which is based on a globally explicit centralized feature regulation, which not only has the ability to capture the global long-range dependencies but also efficiently obtain an all-round yet discriminative feature representation."
    },
    "citationCount": 57,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}