{
    "acronym": "950a9ee1bdd8910219af14f614e3518bec8bf221",
    "title": "Reducing Memory Requirements for the IPU using Butterfly Factorizations",
    "seed_ids": [
        "butterfly",
        "90b21dbad8969b74d704eed15a3d98722a88e464"
    ],
    "s2id": "950a9ee1bdd8910219af14f614e3518bec8bf221",
    "abstract": "High Performance Computing (HPC) benefits from different improvements during last decades, specially in terms of hardware platforms to provide more processing power while maintaining the power consumption at a reasonable level. The Intelligence Processing Unit (IPU) is a new type of massively parallel processor, designed to speedup parallel computations with huge number of processing cores and on-chip memory components connected with high-speed fabrics. IPUs mainly target machine learning applications, however, due to the architectural differences between GPUs and IPUs, especially significantly less memory capacity on an IPU, methods for reducing model size by sparsification have to be considered. Butterfly factorizations are well-known replacements for fully-connected and convolutional layers. In this paper, we examine how butterfly structures can be implemented on an IPU and study their behavior and performance compared to a GPU. Experimental results indicate that these methods can provide 98.5% compression ratio to decrease the immense need for memory, the IPU implementation can benefit from 1.3x and 1.6x performance improvement for butterfly and pixelated butterfly, respectively. We also reach to 1.62x training time speedup on a real-word dataset such as CIFAR10.",
    "authors": [
        "S. Shekofteh",
        "Christian Alles",
        "Holger Fröning"
    ],
    "venue": "SC Workshops",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Experimental results indicate that these methods can provide 98.5% compression ratio to decrease the immense need for memory, and the IPU implementation can benefit from 1.3x and 1.6x performance improvement for butterfly and pixelated butterfly, respectively."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}