{
    "acronym": "95198b78eab2693b289d6eb28025423ca337397c",
    "title": "About ? Extreme Summarization with Topic-Aware Convolutional Neural Networks",
    "seed_ids": [
        "memcompress",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "0bd5beed98675a63f9207851674d478009549900",
        "145b8b5d99a2beba6029418ca043585b90138d12"
    ],
    "s2id": "95198b78eab2693b289d6eb28025423ca337397c",
    "abstract": "We introduce extreme summarization, a new single-document summarization task which aims at creating a short, one-sentence news summary answering the question “What is the article about?”. We argue that extreme summarization, by nature, is not amenable to extractive strategies and requires an abstractive modeling approach. In the hope of driving research on this task further: (a) we collect a real-world, large scale dataset by harvesting online articles from the British Broadcasting Corporation (BBC); and (b) propose a novel abstractive model which is conditioned on the article’s topics and based entirely on convolutional neural networks. We demonstrate experimentally that this architecture captures long-range dependencies in a document and recognizes pertinent content, outperforming an oracle extractive system and state-of-the-art abstractive approaches when evaluated automatically and by humans on the extreme summarization dataset.",
    "authors": [
        "Shashi Narayan"
    ],
    "venue": "",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces extreme summarization, a new single-document summarization task which aims at creating a short, one-sentence news summary answering the question “What is the article about?” and proposes a novel abstractive model which is conditioned on the article’s topics and based entirely on convolutional neural networks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}