{
    "acronym": "95b4be099405394d936281413d5d83e9e3dde837",
    "title": "A Review of Modern Recommender Systems Using Generative Models (Gen-RecSys)",
    "seed_ids": [
        "transformer",
        "7529f2be24aacc7d65f5d8f654560d144f076906",
        "87c635e6a6ddd69d4c66891ec479a8a39bab0749",
        "55c517ef19ab2ff2148b68581a632191fa6fd073",
        "ca7bd64d372e3bcb3f4633ca4a20291ff57de3c3",
        "11628f656257e75e46447ac21cdaa86c4b340a0a",
        "d6db74a36301fdbb4859b5f7ff302337666b93ce",
        "cbf3bf8f541f5b446c59c8deacbcc18527768c75",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "df602516e28a9ef0ef665ed0aef551984d8d770d",
        "8498daeeb893870524ffaa63086f8528795003d4",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "9bbdcc03d872987eef9165f4a63c3878a5b05189",
        "690edf44e8739fd80bdfb76f40c9a4a222f3bba8"
    ],
    "s2id": "95b4be099405394d936281413d5d83e9e3dde837",
    "abstract": "Traditional recommender systems (RS) typically use user-item rating histories as their main data source. However, deep generative models now have the capability to model and sample from complex data distributions, including user-item interactions, text, images, and videos, enabling novel recommendation tasks. This comprehensive, multidisciplinary survey connects key advancements in RS using Generative Models (Gen-RecSys), covering: interaction-driven generative models; the use of large language models (LLM) and textual data for natural language recommendation; and the integration of multimodal models for generating and processing images/videos in RS. Our work highlights necessary paradigms for evaluating the impact and harm of Gen-RecSys and identifies open challenges. This survey accompanies a tutorial presented at ACM KDD'24, with supporting materials provided at: https://encr.pw/vDhLq.",
    "authors": [
        "Yashar Deldjoo",
        "Zhankui He",
        "Julian McAuley",
        "A. Korikov",
        "Scott Sanner",
        "Arnau Ramisa",
        "Ren'e Vidal",
        "M. Sathiamoorthy",
        "Atoosa Kasirzadeh",
        "Silvia Milano"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This comprehensive, multidisciplinary survey connects key advancements in RS using Generative Models (Gen-RecSys), covering: interaction-driven generative models; the use of large language models (LLM) and textual data for natural language recommendation; and the integration of multimodal models for generating and processing images/videos in RS."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}