{
    "acronym": "963e858923c1a23f2823b7a737e12b38ac03f116",
    "title": "Streaming Attention-Based Models with Augmented Memory for End-To-End Speech Recognition",
    "seed_ids": [
        "transformerxl",
        "768e5f9b019c27babbfaf817a5bb20316b9df113",
        "09e2c7adbed37440d4a339852cfa34e5b660f768",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280"
    ],
    "s2id": "963e858923c1a23f2823b7a737e12b38ac03f116",
    "abstract": "Attention-based models have been gaining popularity recently for their strong performance demonstrated in fields such as machine translation [1] and automatic speech recognition [2]. One major challenge of attention-based models is the need of access to the full sequence and the quadratically growing computational cost concerning the sequence length. These characteristics pose challenges, especially for low-latency scenarios, where the system is often required to be streaming. In this paper, we build a compact and streaming speech recognition system on top of the end-to-end neural transducer architecture [3] with attention-based modules augmented with convolution [2]. The proposed system equips the end-to-end models with the streaming capability and reduces the large footprint from the streaming attention-based model using augmented memory [4], [5]. On the LibriSpeech [6] dataset, our proposed system achieves word error rates 2.7% on test-clean and 5.8% on test-other, to our best knowledge the lowest among streaming approaches reported so far.",
    "authors": [
        "Ching-feng Yeh",
        "Yongqiang Wang",
        "Yangyang Shi",
        "Chunyang Wu",
        "Frank Zhang",
        "Julian Chan",
        "M. Seltzer"
    ],
    "venue": "Spoken Language Technology Workshop",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper builds a compact and streaming speech recognition system on top of the end-to-end neural transducer architecture with attention-based modules augmented with convolution with the aim of achieving the lowest word error rates among streaming approaches reported so far."
    },
    "citationCount": 8,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}