{
    "acronym": "964313ebfe878f874cf4957573d5debfd5b998bd",
    "title": "DEGAP: Dual Event-Guided Adaptive Prefixes for Templated-Based Event Argument Extraction with Slot Querying",
    "seed_ids": [
        "gpt3",
        "9cab8c423d9c13d4f35beb97a7f823c250e8f059",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "4cd1eacb7d0e3657ac01a4f687638832546cd072"
    ],
    "s2id": "964313ebfe878f874cf4957573d5debfd5b998bd",
    "abstract": "Recent advancements in event argument extraction (EAE) involve incorporating useful auxiliary information into models during training and inference, such as retrieved instances and event templates. These methods face two challenges: (1) the retrieval results may be irrelevant and (2) templates are developed independently for each event without considering their possible relationship. In this work, we propose DEGAP to address these challenges through a simple yet effective components: dual prefixes, i.e. learnable prompt vectors, where the instance-oriented prefix and template-oriented prefix are trained to learn information from different event instances and templates. Additionally, we propose an event-guided adaptive gating mechanism, which can adaptively leverage possible connections between different events and thus capture relevant information from the prefix. Finally, these event-guided prefixes provide relevant information as cues to EAE model without retrieval. Extensive experiments demonstrate that our method achieves new state-of-the-art performance on four datasets (ACE05, RAMS, WIKIEVENTS, and MLEE). Further analysis shows the impact of different components.",
    "authors": [
        "Guanghui Wang",
        "Dexi Liu",
        "Jian-Yun Nie",
        "Qizhi Wan",
        "Rong Hu",
        "Xiping Liu",
        "Wanlong Liu",
        "Jiaming Liu"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes dual prefixes, i.e. learnable prompt vectors, where the instance-oriented prefix and template-oriented prefix are trained to learn information from different event instances and templates, and an event-guided adaptive gating mechanism, which can adaptively leverage possible connections between different events and thus capture relevant information from the prefix."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}