{
    "acronym": "96512c53f6121e49c2f679af1928060819573cb5",
    "title": "AXCF: Aspect‐based collaborative filtering for explainable recommendations",
    "seed_ids": [
        "bert"
    ],
    "s2id": "96512c53f6121e49c2f679af1928060819573cb5",
    "abstract": "With the rapid growth of the e‐commerce market facilitated, users are often overwhelmed by the excessive online information, making item selection challenging. While recommendation services have significantly enhanced user experience and sales, these traditional models often overlook the complexity of user‐item interactions and user preferences based on various item aspects. The proposed AXCF framework innovatively combines graph‐based collaborative filtering (CF), which captures high‐order connectivity between users and items, with aspect‐based sentiment analysis (ABSA) to extract detailed user preferences from online reviews. This approach addresses the limitations of linear relationships in traditional CF models by incorporating deep neural networks and introduces a method to overcome the cold‐start problem using online reviews as auxiliary information. By focusing on main aspects such as food, ambiance, and service derived from restaurant reviews, AXCF provides personalized recommendations with improved accuracy and explanatory power, demonstrating its superiority over existing models through experimental results. This study not only presents a significant advancement in recommender systems but also highlights the importance of high‐order connectivity and aspect‐based preferences in understanding and catering to user needs in the e‐commerce platform.",
    "authors": [
        "Dongeon Kim",
        "Qinglong Li",
        "Dongsoo Jang",
        "Jaekyeong Kim"
    ],
    "venue": "Expert Syst. J. Knowl. Eng.",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This approach addresses the limitations of linear relationships in traditional CF models by incorporating deep neural networks and introduces a method to overcome the cold‐start problem using online reviews as auxiliary information."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}