{
    "acronym": "9668af6b4c770a84cfcc30b94ecd10fb9acda796",
    "title": "An Audio Fingerprinting Based Indoor Localization System: From Audio to Image",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "9668af6b4c770a84cfcc30b94ecd10fb9acda796",
    "abstract": "Audio signal has emerged as a localization source in the popular indoor fingerprinting positioning (FPP) field in recent years, thanks to its rich time-frequency domain features. However, the numerical role of signals is usually considered and the temporal context of the relative time-of-arrival (ToA) of signals is ignored, which leads to a low device and non-line-of-sight (NLoS) adaptability for consumer applications. In this work, a chirp signals group is designed to strengthen the signal spatial correlation. The energy density map (EDM) of the received signal is generated and analyzed as a whole. First, the signal response domain range is narrowed by a global normalization to reduce the device differences. Second, a simple yet effective audio-chirp-attention network (ACANet) is constructed to fuse the edge detection map with a normalized EDM, strengthening the attention to the relative ToA and associating the fingerprint dataset with the corresponding spatial position for real-time coordinates estimations. Last, evaluations of three smartphones are carried out over three typical scenes under both soft- and hard-NLoS. These evaluations show that the proposed system achieves an average localization root-mean-square error (RMSE) of 1.69 m in the scenes of 1–3 anchor NLoS with different smartphones and motion postures. The ACANet trained with the normalized EDM data is proved to reduce the device difference by 43.7% when using the same model, as well as decrease the absolute error by 63.7% compared to using the raw EDM data.",
    "authors": [
        "Shihao Xu",
        "Ruizhi Chen",
        "G. Guo",
        "Lixiong Huang",
        "Zheng Li",
        "L. Qian",
        "F. Ye",
        "Liang Chen"
    ],
    "venue": "IEEE Sensors Journal",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A simple yet effective audio-chirp-attention network (ACANet) is constructed to fuse the edge detection map with a normalized EDM, strengthening the attention to the relative ToA and associating the fingerprint dataset with the corresponding spatial position for real-time coordinates estimations."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}