{
    "acronym": "967188c252c9afb3129aa39c942dd622ff2aa552",
    "title": "Massive Multi-Document Summarization of Product Reviews with Weak Supervision",
    "seed_ids": [
        "memcompress"
    ],
    "s2id": "967188c252c9afb3129aa39c942dd622ff2aa552",
    "abstract": "Product reviews summarization is a type of Multi-Document Summarization (MDS) task in which the summarized document sets are often far larger than in traditional MDS (up to tens of thousands of reviews). We highlight this difference and coin the term \"Massive Multi-Document Summarization\" (MMDS) to denote an MDS task that involves hundreds of documents or more. Prior work on product reviews summarization considered small samples of the reviews, mainly due to the difficulty of handling massive document sets. We show that summarizing small samples can result in loss of important information and provide misleading evaluation results. We propose a schema for summarizing a massive set of reviews on top of a standard summarization algorithm. Since writing large volumes of reference summaries needed for advanced neural network models is impractical, our solution relies on weak supervision. Finally, we propose an evaluation scheme that is based on multiple crowdsourced reference summaries and aims to capture the massive review collection. We show that an initial implementation of our schema significantly improves over several baselines in ROUGE scores, and exhibits strong coherence in a manual linguistic quality assessment.",
    "authors": [
        "Ori Shapira",
        "Ran Levy"
    ],
    "venue": "arXiv.org",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a schema for summarizing a massive set of reviews on top of a standard summarization algorithm and shows that an initial implementation of the schema significantly improves over several baselines in ROUGE scores, and exhibits strong coherence in a manual linguistic quality assessment."
    },
    "citationCount": 11,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}