{
    "acronym": "967c46bde282c493df79bbe9fe390ff344aee0f4",
    "title": "ABSTRACTIVE-BASED AUTOMATIC TEXT SUMMARIZATION ON INDONESIAN NEWS USING GPT-2",
    "seed_ids": [
        "gpt2",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "967c46bde282c493df79bbe9fe390ff344aee0f4",
    "abstract": "Automatic text summarization is challenging research in natural language processing, aims to obtain important information quickly and precisely. There are two main approach techniques for text summary: abstractive and extractive summary. Abstractive Summarization generates new and more natural words, but the difficulty level is higher and more challenging. In previous studies, RNN and its variants are among the most popular Seq2Seq models in text summarization. However, there are still weaknesses in saving memory; gradients are lost in long sentences so resulting in a decrease in lengthy text summaries. This research proposes a Transformer model with an Attention mechanism that can fetch important information, solve parallelization problems, and summarize long texts. The Transformer model we propose is GPT-2. GPT-2 uses decoders to predict the next word using the pre-trained model from w11wo/indo-gpt2-small, implemented on the Indosum Indonesian dataset. Evaluation assessment of the model performance using ROUGE evaluation. The study's results get an average result recall for R-1, R-2, and R-L were 0.61, 0.51, and 0.57, respectively. The summary results can paraphrase sentences, but some still use the original words from the text. Future work increase the amount of data from the dataset to improve the result of more new sentence paraphrases.",
    "authors": [
        "Aini Nur Khasanah",
        "Mardhiya Hayaty"
    ],
    "venue": "JURTEKSI (Jurnal Teknologi dan Sistem Informasi)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This research proposes a Transformer model with an Attention mechanism that can fetch important information, solve parallelization problems, and summarize long texts using GPT-2, implemented on the Indosum Indonesian dataset."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}