{
    "acronym": "9699910e7fa8a5cc14ad3f2bb84273f017a99cb1",
    "title": "Does Collaborative Human-LM Dialogue Generation Help Information Extraction from Human Dialogues?",
    "seed_ids": [
        "longt5",
        "f78fe02f681a0a9a6867b007bd39e3884de64a91",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de"
    ],
    "s2id": "9699910e7fa8a5cc14ad3f2bb84273f017a99cb1",
    "abstract": "The capabilities of pretrained language models have opened opportunities to explore new application areas, but applications involving human-human interaction are limited by the fact that most data is protected from public release for privacy reasons. Problem-solving human dialogues in real applications can be much more complex than existing Wizard-of-Oz collections, preventing successful domain transfer. To support information extraction (IE) for a private call center dataset, we introduce a human-in-the-loop dialogue generation framework capable of synthesizing realistic dialogues. In IE experiments with auto insurance call center dialogues, we observe 25\\% relative improvement in $F_1$ after augmenting a small set of real human conversations with synthetic data. We release code and our synthetic dataset to illustrate the complexity of real-world call center conversations and encourage development of complex dialogue datasets that are more representative of natural data.",
    "authors": [
        "Bo-Ru Lu",
        "Nikita Haduong",
        "Chia-Hsuan Lee",
        "Zeqiu Wu",
        "Hao Cheng",
        "Paul Koester",
        "J. Utke",
        "Tao Yu",
        "Noah A. Smith",
        "Mari Ostendorf"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a human-in-the-loop dialogue generation framework capable of synthesizing realistic dialogues and releases code and a synthetic dataset to illustrate the complexity of real-world call center conversations and encourage development of complex dialogue datasets that are more representative of natural data."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}