{
    "acronym": "96a7b0fe722e6d2d5167ef25a6aff714a20233a0",
    "title": "Exploring the Limits of ChatGPT in Software Security Applications",
    "seed_ids": [
        "gpt",
        "7b6a8c6d44e0f77bf930484e438d77b7465a69fb",
        "bb58f2f63888456a3e04a56a18996ab8dacdb257",
        "470754e17de89081f63dde4719922fe9b63251d5",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "06e36261b21af2943e464a562c92c09dac292a82",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "96a7b0fe722e6d2d5167ef25a6aff714a20233a0",
    "abstract": "Large language models (LLMs) have undergone rapid evolution and achieved remarkable results in recent times. OpenAI's ChatGPT, backed by GPT-3.5 or GPT-4, has gained instant popularity due to its strong capability across a wide range of tasks, including natural language tasks, coding, mathematics, and engaging conversations. However, the impacts and limits of such LLMs in system security domain are less explored. In this paper, we delve into the limits of LLMs (i.e., ChatGPT) in seven software security applications including vulnerability detection/repair, debugging, debloating, decompilation, patching, root cause analysis, symbolic execution, and fuzzing. Our exploration reveals that ChatGPT not only excels at generating code, which is the conventional application of language models, but also demonstrates strong capability in understanding user-provided commands in natural languages, reasoning about control and data flows within programs, generating complex data structures, and even decompiling assembly code. Notably, GPT-4 showcases significant improvements over GPT-3.5 in most security tasks. Also, certain limitations of ChatGPT in security-related tasks are identified, such as its constrained ability to process long code contexts.",
    "authors": [
        "Fangzhou Wu",
        "Qingzhao Zhang",
        "Ati Priya Bajaj",
        "Tiffany Bao",
        "Ning Zhang",
        "Ruoyu Wang",
        "Chaowei Xiao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The exploration reveals that ChatGPT not only excels at generating code, which is the conventional application of language models, but also demonstrates strong capability in understanding user-provided commands in natural languages, reasoning about control and data flows within programs, generating complex data structures, and even decompiling assembly code."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}