{
    "acronym": "96f5cf8d3501a7871d125f0aedade45c42e950e9",
    "title": "ControlVAR: Exploring Controllable Visual Autoregressive Modeling",
    "seed_ids": [
        "classfreediffu",
        "76e8218f657c77c38da44daaed5bb54ab727a8fc",
        "65e8a4cca1a80f517bab8b4c3a39cc63d7527e66",
        "13925d7d5952b1ba5960dfe2c44d977be109b636",
        "f30bb09dbd95845d792bdac217a9a652635ee8a5",
        "c97df0846d6973602c18ec8049f9b026e491c088",
        "5a3a04af4935302f0871bf14a4b573d477ce96be",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "96f5cf8d3501a7871d125f0aedade45c42e950e9",
    "abstract": "Conditional visual generation has witnessed remarkable progress with the advent of diffusion models (DMs), especially in tasks like control-to-image generation. However, challenges such as expensive computational cost, high inference latency, and difficulties of integration with large language models (LLMs) have necessitated exploring alternatives to DMs. This paper introduces ControlVAR, a novel framework that explores pixel-level controls in visual autoregressive (VAR) modeling for flexible and efficient conditional generation. In contrast to traditional conditional models that learn the conditional distribution, ControlVAR jointly models the distribution of image and pixel-level conditions during training and imposes conditional controls during testing. To enhance the joint modeling, we adopt the next-scale AR prediction paradigm and unify control and image representations. A teacher-forcing guidance strategy is proposed to further facilitate controllable generation with joint modeling. Extensive experiments demonstrate the superior efficacy and flexibility of ControlVAR across various conditional generation tasks against popular conditional DMs, \\eg, ControlNet and T2I-Adaptor.",
    "authors": [
        "Xiang Li",
        "Kai Qiu",
        "Hao Chen",
        "Jason Kuen",
        "Zhe Lin",
        "Rita Singh",
        "Bhiksha Raj"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "ControlVAR is introduced, a novel framework that explores pixel-level controls in visual autoregressive (VAR) modeling for flexible and efficient conditional generation and adopts the next-scale AR prediction paradigm and unify control and image representations."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}