{
    "acronym": "97388c71be60282e149c2c3d00db7c0eb2c946e4",
    "title": "MambaTalk: Efficient Holistic Gesture Synthesis with Selective State Space Models",
    "seed_ids": [
        "s4",
        "mamba",
        "mega",
        "gssm",
        "b24e899ec0f77eef2fc87a9b8e50516367aa1f97",
        "3985b81334ab90fbcbb30bbb3cc2840d00d509ba",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "70e91e16eb321067d9402710e14a40cf28311f73",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "eaef083b9d661f42cc0d89d9d8156218f33a91d9",
        "ca444821352a4bd91884413d8070446e2960715a",
        "dd23991294bf53c6301ab79fa49752e6458d2eab",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4"
    ],
    "s2id": "97388c71be60282e149c2c3d00db7c0eb2c946e4",
    "abstract": "Gesture synthesis is a vital realm of human-computer interaction, with wide-ranging applications across various fields like film, robotics, and virtual reality. Recent advancements have utilized the diffusion model and attention mechanisms to improve gesture synthesis. However, due to the high computational complexity of these techniques, generating long and diverse sequences with low latency remains a challenge. We explore the potential of state space models (SSMs) to address the challenge, implementing a two-stage modeling strategy with discrete motion priors to enhance the quality of gestures. Leveraging the foundational Mamba block, we introduce MambaTalk, enhancing gesture diversity and rhythm through multimodal integration. Extensive experiments demonstrate that our method matches or exceeds the performance of state-of-the-art models.",
    "authors": [
        "Zunnan Xu",
        "Yukang Lin",
        "Haonan Han",
        "Sicheng Yang",
        "Ronghui Li",
        "Yachao Zhang",
        "Xiu Li"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Leveraging the foundational Mamba block, MambaTalk is introduced, enhancing gesture diversity and rhythm through multimodal integration, and matches or exceeds the performance of state-of-the-art models."
    },
    "citationCount": 6,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}