{
    "acronym": "97833e2aa0da5240e62436373b58af988a4ab6ab",
    "title": "The Curious Case of Absolute Position Embeddings",
    "seed_ids": [
        "gpt2",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "a2fc77f075f666b462d9350e7576f0ba9845c61b",
        "ed535e93d5b5a8b689e861e9c6083a806d1535c2",
        "49e65b12d8d11f2ccb5ddd7be72a8f746b2d1bc2",
        "0822f8d7e6a72a65e65f147d3a8d8fccd485da40",
        "4889ba5a8ae8b2169dd44d1d3a605bf9820bae8d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "5a2263092f49540fd0e049050a96882ff29b00c3",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "dc35daba3fb34b2e6a5b12530badb7b799262bbf",
        "9405cc0d6169988371b2755e573cc28650d14dfe",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "97833e2aa0da5240e62436373b58af988a4ab6ab",
    "abstract": "Transformer language models encode the notion of word order using positional information. Most commonly, this positional information is represented by absolute position embeddings (APEs), that are learned from the pretraining data. However, in natural language, it is not absolute position that matters, but relative position, and the extent to which APEs can capture this type of information has not been investigated. In this work, we observe that models trained with APE over-rely on positional information to the point that they break-down when subjected to sentences with shifted position information. Specifically, when models are subjected to sentences starting from a non-zero position (excluding the effect of priming), they exhibit noticeably degraded performance on zero to full-shot tasks, across a range of model families and model sizes. Our findings raise questions about the efficacy of APEs to model the relativity of position information, and invite further introspection on the sentence and word order processing strategies employed by these models.",
    "authors": [
        "Koustuv Sinha",
        "Amirhossein Kazemnejad",
        "Siva Reddy",
        "J. Pineau",
        "Dieuwke Hupkes",
        "Adina Williams"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is observed that models trained with APE over-rely on positional information to the point that they break-down when subjected to sentences with shifted position information, which raises questions about the efficacy of APEs to model the relativity of position information."
    },
    "citationCount": 9,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}