{
    "acronym": "9799c17fd287bb9e8d231fe032c6dbf9c0c9d675",
    "title": "Overview of Robust and Multilingual Automatic Evaluation Metrics\n\nfor Open-Domain Dialogue Systems at DSTC 11 Track 4",
    "seed_ids": [
        "gpt",
        "ba2a423d8c7ae6cfa3424fb13bdbe3a35e5f2273",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9799c17fd287bb9e8d231fe032c6dbf9c0c9d675",
    "abstract": "The advent and fast development of neural networks have revolutionized the research on dialogue systems and subsequently have triggered various challenges regarding their automatic evaluation. Automatic evaluation of open-domain dialogue systems as an open challenge has been the center of the attention of many researchers. Despite the consistent efforts to improve automatic metrics’ correlations with human evaluation, there have been very few attempts to assess their robustness over multiple domains and dimensions. Also, their focus is mainly on the English language. All of these challenges prompt the development of automatic evaluation metrics that are reliable in various domains, dimensions, and languages. This track in the 11th Dialogue System Technology Challenge (DSTC11) is part of the ongoing effort to promote robust and multilingual automatic evaluation metrics. This article describes the datasets and baselines provided to participants and discusses the submission and result details of the two proposed subtasks.",
    "authors": [
        "Mario Rodr'iguez-Cantelar",
        "Chen Zhang",
        "Chengguang Tang",
        "Ke Shi",
        "Sarik Ghazarian",
        "João Sedoc",
        "L. F. D’Haro",
        "Alexander I. Rudnicky"
    ],
    "venue": "DSTC",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The datasets and baselines provided to participants are described and the submission and result details of the two proposed subtasks are discussed, which promote robust and multilingual automatic evaluation metrics."
    },
    "citationCount": 6,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}