{
    "acronym": "97a531f96a8d9a4c1d379637daf7dcc714db1b35",
    "title": "Probabilistic Predictions of People Perusing: Evaluating Metrics of Language Model Performance for Psycholinguistic Modeling",
    "seed_ids": [
        "transformerxl",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "97a531f96a8d9a4c1d379637daf7dcc714db1b35",
    "abstract": "By positing a relationship between naturalistic reading times and information-theoretic surprisal, surprisal theory (Hale, 2001; Levy, 2008) provides a natural interface between language models and psycholinguistic models. This paper re-evaluates a claim due to Goodkind and Bicknell (2018) that a language model’s ability to model reading times is a linear function of its perplexity. By extending Goodkind and Bicknell’s analysis to modern neural architectures, we show that the proposed relation does not always hold for Long Short-Term Memory networks, Transformers, and pre-trained models. We introduce an alternate measure of language modeling performance called predictability norm correlation based on Cloze probabilities measured from human subjects. Our new metric yields a more robust relationship between language model quality and psycholinguistic modeling performance that allows for comparison between models with different training configurations.",
    "authors": [
        "Sophie Hao",
        "S. Mendelsohn",
        "Rachel Sterneck",
        "Randi Martinez",
        "R. Frank"
    ],
    "venue": "Workshop on Cognitive Modeling and Computational Linguistics",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper re-evaluates a claim due to Goodkind and Bicknell (2018) that a language model’s ability to model reading times is a linear function of its perplexity and introduces an alternate measure of language modeling performance called predictability norm correlation based on Cloze probabilities measured from human subjects."
    },
    "citationCount": 37,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}