{
    "acronym": "97a868f12c123d637f667eb99633591db189b2d9",
    "title": "Diversifying Knowledge Enhancement of Biomedical Language Models using Adapter Modules and Knowledge Graphs",
    "seed_ids": [
        "bert",
        "75f1c7dadb4ed733fb4d3a4cc47b9cbde9ad98cc",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "97a868f12c123d637f667eb99633591db189b2d9",
    "abstract": "Recent advances in natural language processing (NLP) owe their success to pre-training language models on large amounts of unstructured data. Still, there is an increasing effort to combine the unstructured nature of LMs with structured knowledge and reasoning. Particularly in the rapidly evolving field of biomedical NLP, knowledge-enhanced language models (KELMs) have emerged as promising tools to bridge the gap between large language models and domain-specific knowledge, considering the available biomedical knowledge graphs (KGs) curated by experts over the decades. In this paper, we develop an approach that uses lightweight adapter modules to inject structured biomedical knowledge into pre-trained language models (PLMs). We use two large KGs, the biomedical knowledge system UMLS and the novel biochemical ontology OntoChem, with two prominent biomedical PLMs, PubMedBERT and BioLinkBERT. The approach includes partitioning knowledge graphs into smaller subgraphs, fine-tuning adapter modules for each subgraph, and combining the knowledge in a fusion layer. We test the performance on three downstream tasks: document classification,question answering, and natural language inference. We show that our methodology leads to performance improvements in several instances while keeping requirements in computing power low. Finally, we provide a detailed interpretation of the results and report valuable insights for future work.",
    "authors": [
        "Juraj Vladika",
        "Alexander Fichtl",
        "Florian Matthes"
    ],
    "venue": "International Conference on Agents and Artificial Intelligence",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper develops an approach that uses lightweight adapter modules to inject structured biomedical knowledge into pre-trained language models (PLMs) and shows that the methodology leads to performance improvements in several instances while keeping requirements in computing power low."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}