{
    "acronym": "97ac9e07c00fc2edc2fb41fa8d3fa0fbe8f9849c",
    "title": "Minusformer: Improving Time Series Forecasting by Progressively Learning Residuals",
    "seed_ids": [
        "reformer",
        "afeeb8f5018eebb1a1d334b94dbbfc48d167efef",
        "624b2604cd644f895454b794e0689578dd72f410",
        "016e99ccef0afb7011f3ea3b1b932611c8fb957b",
        "8064d3873c646dc9ff949d72c54c634a906fc092",
        "9b61adb6f0d1e8831ab2f5481a12e2125b13c50a",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676"
    ],
    "s2id": "97ac9e07c00fc2edc2fb41fa8d3fa0fbe8f9849c",
    "abstract": "In this paper, we find that ubiquitous time series (TS) forecasting models are prone to severe overfitting. To cope with this problem, we embrace a de-redundancy approach to progressively reinstate the intrinsic values of TS for future intervals. Specifically, we introduce a dual-stream and subtraction mechanism, which is a deep Boosting ensemble learning method. And the vanilla Transformer is renovated by reorienting the information aggregation mechanism from addition to subtraction. Then, we incorporate an auxiliary output branch into each block of the original model to construct a highway leading to the ultimate prediction. The output of subsequent modules in this branch will subtract the previously learned results, enabling the model to learn the residuals of the supervision signal, layer by layer. This designing facilitates the learning-driven implicit progressive decomposition of the input and output streams, empowering the model with heightened versatility, interpretability, and resilience against overfitting. Since all aggregations in the model are minus signs, which is called Minusformer. Extensive experiments demonstrate the proposed method outperform existing state-of-the-art methods, yielding an average performance improvement of 11.9% across various datasets.The code has been released at https://github.com/Anoise/Minusformer.",
    "authors": [
        "Daojun Liang",
        "Haixia Zhang",
        "Dongfeng Yuan",
        "Bingzheng Zhang",
        "Minggao Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces a dual-stream and subtraction mechanism, which is a deep Boosting ensemble learning method, which facilitates the learning-driven implicit progressive decomposition of the input and output streams, empowering the model with heightened versatility, interpretability, and resilience against overfitting."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}