{
    "acronym": "980e55d9226cac302d0fae7732da4e67b8bc952c",
    "title": "Parallel Context Windows for Large Language Models",
    "seed_ids": [
        "gpt2",
        "732e3faec4e5be4d144256f2c379b9dc49f0b227",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "980e55d9226cac302d0fae7732da4e67b8bc952c",
    "abstract": "When applied to processing long text, Large Language Models (LLMs) are limited by their context window. Existing efforts to address this limitation involve training specialized architectures, and cannot be easily applied to off- the-shelf LLMs. We present Parallel Context Windows (PCW), a method that alleviates the context window restriction for any off-the-shelf LLM without further training. The key to the approach is to carve a long context into chunks (“windows”), restrict the attention mechanism to apply only within each window, and re-use the positional embeddings across the windows. Our main results test the PCW approach on in-context learning with models that range in size between 750 million and 178 billion parameters, and show substantial improvements for tasks with diverse input and output spaces. We show additional benefits in other settings where long context windows may be beneficial: multi-hop questions and retrieval-augmented question answering with multiple retrieved documents. Our results highlight Parallel Context Windows as a promising method for applying off-the-shelf LLMs in a range of settings that require long text sequences. We make our code publicly available at https://github.com/ ai21labs/parallel-context-windows.",
    "authors": [
        "Nir Ratner",
        "Yoav Levine",
        "Yonatan Belinkov",
        "Ori Ram",
        "Inbal Magar",
        "Omri Abend",
        "Ehud D. Karpas",
        "A. Shashua",
        "Kevin Leyton-Brown",
        "Y. Shoham"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents Parallel Context Windows (PCW), a method that alleviates the context window restriction for any off-the-shelf LLM without further training, to carve a long context into chunks (“windows”), restrict the attention mechanism to apply only within each window, and re-use the positional embeddings across the windows."
    },
    "citationCount": 43,
    "influentialCitationCount": 6,
    "code": null,
    "description": null,
    "url": null
}