{
    "acronym": "9823dc14f81155b78d54ed5a3e263ec17400cd62",
    "title": "The comparison of general tips for mathematical problem solving generated by generative AI with those generated by human teachers",
    "seed_ids": [
        "gpt3",
        "aade40af0d85b0b4fe15c97f6222d5c2e4d6d9b3",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c"
    ],
    "s2id": "9823dc14f81155b78d54ed5a3e263ec17400cd62",
    "abstract": "ABSTRACT In designing an intelligent tutoring system, a core area of the application of AI in education, tips from the system or virtual tutors are crucial in helping students solve difficult questions in disciplines like mathematics. Traditionally, the manual design of general tips by teachers is time-consuming and error-prone. Generative AI, like ChatGPT, presents a new channel for designing general tips. This study utilized prompt engineering and Chain of Thought to summarize general tips for given mathematical problems (one geometry problem and one algebra problem) and their solutions. A Turing test was conducted to compare ChatGPT-generated general tips with human-designed ones. Results from 121 human evaluators, each assessing 6 ChatGPT-generated and 6 human-designed general tips for each of two mathematical problems, showed that the average score for ChatGPT-generated tips is less than that of human-designed tips at a statistically significant level (p < 0.05), and Zero-Shot CoT achieved the best score. However, no evaluator could distinguish the tip types exactly. The average precision, recall and F-value of all ChatGPT-generated tips are less than 40%. AI-generated general tips can serve as a valuable reference for teachers to enhance efficiency and students’ mathematical learning.",
    "authors": [
        "Jiyou Jia",
        "Tianrui Wang",
        "Yuyue Zhang",
        "Guangdi Wang"
    ],
    "venue": "Asia Pacific Journal of Education",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "AI-generated general tips can serve as a valuable reference for teachers to enhance efficiency and students’ mathematical learning."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}