{
    "acronym": "982cbf7fcee4f3964dd1d411fdeadad6e6f1d465",
    "title": "Controllable Generation from Pre-trained Language Models via Inverse Prompting",
    "seed_ids": [
        "gpt",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "982cbf7fcee4f3964dd1d411fdeadad6e6f1d465",
    "abstract": "Large-scale pre-trained language models have demonstrated strong capabilities of generating realistic texts. However, it remains challenging to control the generation results. Previous approaches such as prompting are far from sufficient, and lack of controllability limits the usage of language models. To tackle this challenge, we propose an innovative method, inverse prompting, to better control text generation. The core idea of inverse prompting is to use generated text to inversely predict the prompt during beam search, which enhances the relevance between the prompt and the generated text and thus improves controllability. Empirically, we pre-train a large-scale Chinese language model to perform a systematic study using human evaluation on the tasks of open-domain poem generation and open-domain long-form question answering. Results demonstrate that our proposed method substantially outperforms the baselines and that our generation quality is close to human performance on some of the tasks.",
    "authors": [
        "Xu Zou",
        "Da Yin",
        "Qingyang Zhong",
        "Hongxia Yang",
        "Zhilin Yang",
        "Jie Tang"
    ],
    "venue": "Knowledge Discovery and Data Mining",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The core idea of inverse prompting is to use generated text to inversely predict the prompt during beam search, which enhances the relevance between the prompt and the generated text and thus improves controllability."
    },
    "citationCount": 49,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}