{
    "acronym": "982f645562629c71298f83d913d18afc8bac4af4",
    "title": "Understanding College Students’ Satisfaction With ChatGPT: An Exploratory And Predictive Machine Learning Approach Using Feature Engineering",
    "seed_ids": [
        "gpt3",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "982f645562629c71298f83d913d18afc8bac4af4",
    "abstract": "\n\n\nArtificial Intelligence (AI) technologies are continually improving and becoming more pervasive in many facets of our lives. ChatGPT is one such cutting-edge artificial intelligence application, and it has received a lot of worldwide media attention, specifically from educationists, technologists, and learners. It is imperative to understand and evaluate the impact of ChatGPT on computer science students as it directly and holistically influences them. A quantitative instrumental case study explores ChatGPT’s impact on early adopters in education. A survey of undergraduate computer science students at a state university of Delhi was conducted to get insight into their opinion on adopting this revolutionising technology for their education, career, and overall satisfaction. An end-to-end data science approach is applied to encompass exploratory and predictive modelling with feature engineering solutions. Results reveal the most influential features contributing to students’ satisfaction in adopting ChatGPT for their day-to-day chores concerning their social life, education, and career. The Linear Support Vector classifier, a machine learning algorithm for predicting the satisfaction or dissatisfaction in students’ shows an accuracy score of 72.73% and 97.72%, respectively. The AUC for this multiclass prediction model is convincing and is 0.74, 0.71, and 0.96 for satisfied, neutral, and dissatisfied classes, respectively.\n\n\n",
    "authors": [
        "Kavita Pabreja",
        "Nishtha Pabreja"
    ],
    "venue": "MIER journal of educational studies, trends and practices",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A quantitative instrumental case study explores ChatGPT’s impact on early adopters in education and reveals the most influential features contributing to students’ satisfaction in adopting ChatGPT for their day-to-day chores concerning their social life, education, and career."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}