{
    "acronym": "989254f702db9bdc6f2424803ce1ba5a99949fab",
    "title": "NAT4AT: Using Non-Autoregressive Translation Makes Autoregressive Translation Faster and Better",
    "seed_ids": [
        "transformer",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280"
    ],
    "s2id": "989254f702db9bdc6f2424803ce1ba5a99949fab",
    "abstract": "With the increasing number of web documents, the demand for translation has increased dramatically. Non-autoregressive translation (NAT) models can significantly reduce decoding latency to meet the growing translation needs, but they sacrifice translation quality. And there is still an irreparable performance gap between NAT models and strong autoregressive translation (AT) models at the corpus level. However, more fine-grained comparative experiments on AT and NAT are currently lacking. Therefore, in this paper, we first conducted analysis experiments at the sentence level and found complementarity and high similarity between the translations generated by AT and NAT. Then, based on this observation, we propose a general and effective method called NAT4AT, which can not only use NAT to speed up the inference speed of AT significantly but also improve its final translation quality. Specifically, NAT4AT first uses a NAT model to generate an original translation in parallel and then uses an AT model as a correction model to revise errors in the original translation. In this way, the AT model no longer needs to predict the entire translation but only needs to predict a small number of error parts in the NAT result. Extensive experimental results on major WMT benchmarks verify the generality and effectiveness of our method, whose translation quality is superior to the strong AT model and achieves a 5.0x speedup.",
    "authors": [
        "Huanran Zheng",
        "Wei Zhu",
        "Xiaoling Wang"
    ],
    "venue": "The Web Conference",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A general and effective method called NAT4AT, which can not only use NAT to speed up the inference speed of AT significantly but also improve its final translation quality, whose translation quality is superior to the strong AT model and achieves a 5.0x speedup."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}