{
    "acronym": "98ce5d3c6b20acc5fe228397f0ae92b8d72004ed",
    "title": "LegalLens: Leveraging LLMs for Legal Violation Identification in Unstructured Text",
    "seed_ids": [
        "gpt3",
        "bert",
        "80cee5037d01470edc7fbd20c564f2e1fc2c6b85",
        "156a66da569b68ea776c5db38e033aadb4755971",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "a022bda79947d1f656a1164003c1b3ae9a843df9",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "98ce5d3c6b20acc5fe228397f0ae92b8d72004ed",
    "abstract": "In this study, we focus on two main tasks, the first for detecting legal violations within unstructured textual data, and the second for associating these violations with potentially affected individuals. We constructed two datasets using Large Language Models (LLMs) which were subsequently validated by domain expert annotators. Both tasks were designed specifically for the context of class-action cases. The experimental design incorporated fine-tuning models from the BERT family and open-source LLMs, and conducting few-shot experiments using closed-source LLMs. Our results, with an F1-score of 62.69% (violation identification) and 81.02% (associating victims), show that our datasets and setups can be used for both tasks. Finally, we publicly release the datasets and the code used for the experiments in order to advance further research in the area of legal natural language processing (NLP).",
    "authors": [
        "Dor Bernsohn",
        "Gil Semo",
        "Yaron Vazana",
        "Gila Hayat",
        "Ben Hagag",
        "Joel Niklaus",
        "Rohit Saha",
        "Kyryl Truskovskyi"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study constructed two datasets using Large Language Models (LLMs) which were subsequently validated by domain expert annotators and designed specifically for the context of class-action cases, and shows that these datasets and setups can be used for both tasks."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}