{
    "acronym": "98d39b110e172c0a06a2d18b04f959b3a743bea9",
    "title": "AI-Driven Spectral Decomposition: Predicting the Most Probable Protein Compositions from Surface Enhanced Raman Spectroscopy Spectra of Amino Acids",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "98d39b110e172c0a06a2d18b04f959b3a743bea9",
    "abstract": "Surface-enhanced Raman spectroscopy (SERS) is a powerful tool for elucidating the molecular makeup of materials. It possesses the unique characteristics of single-molecule sensitivity and extremely high specificity. However, the true potential of SERS, particularly in capturing the biochemical content of particles, remains underexplored. In this study, we harnessed transformer neural networks to interpret SERS spectra, aiming to discern the amino acid profiles within proteins. By training the network on the SERS profiles of 20 amino acids of human proteins, we explore the feasibility of predicting the predominant proteins within the µL-scale detection volume of SERS. Our results highlight a consistent alignment between the model’s predictions and the protein’s known amino acid compositions, deepening our understanding of the inherent information contained within SERS spectra. For instance, the model achieved low root mean square error (RMSE) scores and minimal deviation in the prediction of amino acid compositions for proteins such as Bovine Serum Albumin (BSA), ACE2 protein, and CD63 antigen. This novel methodology offers a robust avenue not only for protein analytics but also sets a precedent for the broader realm of spectral analyses across diverse material categories. It represents a solid step forward to establishing SERS-based proteomics.",
    "authors": [
        "Siddharth Srivastava",
        "Nehmat Sandhu",
        "Jun Liu",
        "Yanrong Xie"
    ],
    "venue": "Bioengineering",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}