{
    "acronym": "990fa81a193a52bee0007bc68e4cf41d54fb902f",
    "title": "SPSQL: Step-by-step Parsing Based Framework for Text-to-SQL Generation",
    "seed_ids": [
        "gpt",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "990fa81a193a52bee0007bc68e4cf41d54fb902f",
    "abstract": "Converting text into the structured query language (Text2SQL) is a research hotspot in the field of natural language processing (NLP), which has broad application prospects. In the era of big data, the use of databases has penetrated all walks of life, in which the collected data is large in scale, diverse in variety, and wide in scope, making the data query cumbersome and inefficient, and putting forward higher requirements for the Text2SQL model. In practical applications, the current mainstream end-to-end Text2SQL model is not only difficult to build due to its complex structure and high requirements for training data, but also difficult to adjust due to massive parameters. In addition, the accuracy of the model is hard to achieve the desired result. Based on this, this paper proposes a pipelined Text2SQL method: SPSQL. This method disassembles the Text2SQL task into four subtasks——table selection, column selection, SQL generation, and value filling, which can be converted into a text classification problem, a sequence labeling problem, and two text generation problems, respectively. Then, we construct data formats of different subtasks based on existing data and improve the accuracy of the overall model by improving the accuracy of each submodel. We also use the named entity recognition module and data augmentation to optimize the overall model. We construct the dataset based on the marketing business data of the State Grid Corporation of China. Experiments demonstrate our proposed method achieves the best performance compared with the end-to-end method and other pipeline methods.",
    "authors": [
        "Ran Shen",
        "Gang Sun",
        "Hao Shen",
        "Yiling Li",
        "Liangfeng Jin",
        "Han Jiang"
    ],
    "venue": "2023 7th International Conference on Machine Vision and Information Technology (CMVIT)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a pipelined Text2 SQL method: SPSQL, which disassembles the Text2SQL task into four subtasks, and uses the named entity recognition module and data augmentation to optimize the overall model."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}