{
    "acronym": "99388222489dd3375e8ede0225160e6a3a0812e4",
    "title": "ScaleLong: Towards More Stable Training of Diffusion Model via Scaling Network Long Skip Connection",
    "seed_ids": [
        "d3pms",
        "classfreediffu",
        "6827e87642874d9bf69f0f1548d79a164aaa5e1e",
        "f5324c908e840995f681ac677c40d5d6b1555622",
        "b8c236dc5963dac36b0d8e419beb5876e3a18f96",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a"
    ],
    "s2id": "99388222489dd3375e8ede0225160e6a3a0812e4",
    "abstract": "In diffusion models, UNet is the most popular network backbone, since its long skip connects (LSCs) to connect distant network blocks can aggregate long-distant information and alleviate vanishing gradient. Unfortunately, UNet often suffers from unstable training in diffusion models which can be alleviated by scaling its LSC coefficients smaller. However, theoretical understandings of the instability of UNet in diffusion models and also the performance improvement of LSC scaling remain absent yet. To solve this issue, we theoretically show that the coefficients of LSCs in UNet have big effects on the stableness of the forward and backward propagation and robustness of UNet. Specifically, the hidden feature and gradient of UNet at any layer can oscillate and their oscillation ranges are actually large which explains the instability of UNet training. Moreover, UNet is also provably sensitive to perturbed input, and predicts an output distant from the desired output, yielding oscillatory loss and thus oscillatory gradient. Besides, we also observe the theoretical benefits of the LSC coefficient scaling of UNet in the stableness of hidden features and gradient and also robustness. Finally, inspired by our theory, we propose an effective coefficient scaling framework ScaleLong that scales the coefficients of LSC in UNet and better improves the training stability of UNet. Experimental results on four famous datasets show that our methods are superior to stabilize training and yield about 1.5x training acceleration on different diffusion models with UNet or UViT backbones. Code: https://github.com/sail-sg/ScaleLong",
    "authors": [
        "Zhongzhan Huang",
        "Pan Zhou",
        "Shuicheng Yan",
        "Liang Lin"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An effective coefficient scaling framework ScaleLong is proposed that scales the coefficients of LSC in UNet and better improves the training stability of UNet."
    },
    "citationCount": 11,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}