{
    "acronym": "99b0c3a18050889c591e1db6d51ca01298638437",
    "title": "Transformers in Reinforcement Learning: A Survey",
    "seed_ids": [
        "gpt",
        "0f3d7b2bb0b3bd3bad87a39c545d93ddfd383362",
        "ac2e15fbfe3ea338725f5d33d17a5a687609c431",
        "235303a8bc1e4892efd525a38ead657422d8a519",
        "82ec4a03a945f18bae23f8c5224d6495ec6cd1b0",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "29e3ff317a1a053939af736abd158cdd91577e4e",
        "2e644c67a697073d561da4f4dad35e5ad5316cfd",
        "5d032bd2632b6f5847767f39ce247098c6bbc563",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "59a916cdc943f0282908e6f3fa0360f4c5fb78d0",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06"
    ],
    "s2id": "99b0c3a18050889c591e1db6d51ca01298638437",
    "abstract": "Transformers have significantly impacted domains like natural language processing, computer vision, and robotics, where they improve performance compared to other neural networks. This survey explores how transformers are used in reinforcement learning (RL), where they are seen as a promising solution for addressing challenges such as unstable training, credit assignment, lack of interpretability, and partial observability. We begin by providing a brief domain overview of RL, followed by a discussion on the challenges of classical RL algorithms. Next, we delve into the properties of the transformer and its variants and discuss the characteristics that make them well-suited to address the challenges inherent in RL. We examine the application of transformers to various aspects of RL, including representation learning, transition and reward function modeling, and policy optimization. We also discuss recent research that aims to enhance the interpretability and efficiency of transformers in RL, using visualization techniques and efficient training strategies. Often, the transformer architecture must be tailored to the specific needs of a given application. We present a broad overview of how transformers have been adapted for several applications, including robotics, medicine, language modeling, cloud computing, and combinatorial optimization. We conclude by discussing the limitations of using transformers in RL and assess their potential for catalyzing future breakthroughs in this field.",
    "authors": [
        "Pranav Agarwal",
        "A. Rahman",
        "P. St-Charles",
        "Simon J. D. Prince",
        "Samira Ebrahimi Kahou"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey explores how transformers are used in reinforcement learning (RL), where they are seen as a promising solution for addressing challenges such as unstable training, credit assignment, lack of interpretability, and partial observability."
    },
    "citationCount": 12,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}