{
    "acronym": "99f6ae9245eb0e91344a79822108db213380cabc",
    "title": "Advances of Deep Learning in Protein Science: A Comprehensive Survey",
    "seed_ids": [
        "bert",
        "7bcdfc0759561118cd79667379c5d174e2a747f2",
        "d53fe76bd2795a19ddf52d012917782f6f6f2c1e",
        "c064c79e3026f81e5043cd5b0f4264b4d43336e6",
        "f3570e639e2acda861ea6efe02a4fcb321d76c40",
        "7b14cef8a08519d7ea33800d52aba8410f48a3f7",
        "dc0102a51a9d33e104a4a3808a18cf17f057228c",
        "b15469d0ab3dc3a9dec037d761817b3fe546bed6",
        "bc519f58ae61afbf6318d6e4239d2d565c7ba467",
        "e36dfa8078c211ca9420f86b0dff2480150d5374",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "99f6ae9245eb0e91344a79822108db213380cabc",
    "abstract": "Protein representation learning plays a crucial role in understanding the structure and function of proteins, which are essential biomolecules involved in various biological processes. In recent years, deep learning has emerged as a powerful tool for protein modeling due to its ability to learn complex patterns and representations from large-scale protein data. This comprehensive survey aims to provide an overview of the recent advances in deep learning techniques applied to protein science. The survey begins by introducing the developments of deep learning based protein models and emphasizes the importance of protein representation learning in drug discovery, protein engineering, and function annotation. It then delves into the fundamentals of deep learning, including convolutional neural networks, recurrent neural networks, attention models, and graph neural networks in modeling protein sequences, structures, and functions, and explores how these techniques can be used to extract meaningful features and capture intricate relationships within protein data. Next, the survey presents various applications of deep learning in the field of proteins, including protein structure prediction, protein-protein interaction prediction, protein function prediction, etc. Furthermore, it highlights the challenges and limitations of these deep learning techniques and also discusses potential solutions and future directions for overcoming these challenges. This comprehensive survey provides a valuable resource for researchers and practitioners in the field of proteins who are interested in harnessing the power of deep learning techniques. By consolidating the latest advancements and discussing potential avenues for improvement, this review contributes to the ongoing progress in protein research and paves the way for future breakthroughs in the field.",
    "authors": [
        "Bozhen Hu",
        "Cheng Tan",
        "Lirong Wu",
        "Jiangbin Zheng",
        "Jun Xia",
        "Zhangyang Gao",
        "Zicheng Liu",
        "Fandi Wu",
        "Guijun Zhang",
        "Stan Z. Li"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This comprehensive survey aims to provide an overview of the recent advances in deep learning techniques applied to protein science and highlights the challenges and limitations of these deep learning techniques and also discusses potential solutions and future directions for overcoming these challenges."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}