{
    "acronym": "9a4a3f8ef868d01c785693634d1ade55b3174dc6",
    "title": "Retrieval-Enhanced Machine Learning: Synthesis and Opportunities",
    "seed_ids": [
        "productkeymem",
        "8a2c9d1d1fa54d33a638743b6fcc3c4383fc4f43",
        "dbc368bc8b49347dd27679894524fa62f88492c9",
        "465471bb5bf1a945549d6291c2d23367966b4957",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "4e3935ef7da6bcbb202ec7f8b285c313cadcd044",
        "46c585ee9abf76779ea4b863d2da4358efd0d1d3",
        "67ee20536c30a225b86902af2f091e28e5e19b40",
        "168fc3525f7b97695a97b04e257ee9bd1e832acb",
        "f51497f463566581874c941353dd9d80069c5b77"
    ],
    "s2id": "9a4a3f8ef868d01c785693634d1ade55b3174dc6",
    "abstract": "In the field of language modeling, models augmented with retrieval components have emerged as a promising solution to address several challenges faced in the natural language processing (NLP) field, including knowledge grounding, interpretability, and scalability. Despite the primary focus on NLP, we posit that the paradigm of retrieval-enhancement can be extended to a broader spectrum of machine learning (ML) such as computer vision, time series prediction, and computational biology. Therefore, this work introduces a formal framework of this paradigm, Retrieval-Enhanced Machine Learning (REML), by synthesizing the literature in various domains in ML with consistent notations which is missing from the current literature. Also, we found that while a number of studies employ retrieval components to augment their models, there is a lack of integration with foundational Information Retrieval (IR) research. We bridge this gap between the seminal IR research and contemporary REML studies by investigating each component that comprises the REML framework. Ultimately, the goal of this work is to equip researchers across various disciplines with a comprehensive, formally structured framework of retrieval-enhanced models, thereby fostering interdisciplinary future research.",
    "authors": [
        "To Eun Kim",
        "Alireza Salemi",
        "Andrew Drozdov",
        "Fernando Diaz",
        "Hamed Zamani"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A formal framework of this paradigm of retrieval-enhancement can be extended to a broader spectrum of machine learning (ML) such as computer vision, time series prediction, and computational biology by synthesizing the literature in various domains in ML with consistent notations, missing from the current literature."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}