{
    "acronym": "9a4f08419c7e49a44396766cdddaaf60c6eca344",
    "title": "The MABe22 Benchmarks for Representation Learning of Multi-Agent Behavior",
    "seed_ids": [
        "perceiverio"
    ],
    "s2id": "9a4f08419c7e49a44396766cdddaaf60c6eca344",
    "abstract": "Real-world behavior is often shaped by complex interactions between multiple agents. To scalably study multi-agent behavior, advances in unsupervised and self-supervised learning have enabled a variety of different behavioral representations to be learned from trajectory data. To date, there does not exist a uniﬁed set of benchmarks that can enable comparing methods quantitatively and systematically across a broad set of behavior analysis settings. We aim to address this by introducing a large-scale, multi-agent trajectory dataset from real-world behavioral neuroscience experiments that covers a range of behavior analysis tasks. Our dataset consists of trajectory data from common model organisms, with 9.6 million frames of mouse data and 4.4 million frames of ﬂy data, in a variety of experimental settings, such as different strains, lengths of interaction, and optogenetic stimulation. A subset of the frames also consist of expert-annotated behavior labels. Improvements on our dataset corresponds to behavioral representations that work across multiple organisms and is able to capture differences for common behavior analysis tasks.",
    "authors": [
        "Jennifer J. Sun",
        "Andrew Ulmer",
        "Dipam Chakraborty",
        "Brian Geuther",
        "Edward Hayes",
        "Heng Jia",
        "Vivek Kumar",
        "Zachary Partridge",
        "A. Robie",
        "Catherine E. Schretter",
        "Chao Sun",
        "Keith S. Sheppard",
        "Param Uttarwar",
        "P. Perona",
        "Yisong Yue",
        "K. Branson",
        "A. Kennedy"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a large-scale, multi-agent trajectory dataset from real-world behavioral neuroscience experiments that covers a range of behavior analysis tasks and corresponds to behavioral representations that work across multiple organisms and is able to capture differences for common behavior analysis tasks."
    },
    "citationCount": 6,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}