{
    "acronym": "9aaa71d9311b44e2228eac213c24c37bb9ca64d1",
    "title": "Honey, I Shrunk the Language: Language Model Behavior at Reduced Scale",
    "seed_ids": [
        "gpt2",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "9405cc0d6169988371b2755e573cc28650d14dfe",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "9aaa71d9311b44e2228eac213c24c37bb9ca64d1",
    "abstract": "In recent years, language models have drastically grown in size, and the abilities of these models have been shown to improve with scale. The majority of recent scaling laws studies focused on high-compute high-parameter count settings, leaving the question of when these abilities begin to emerge largely unanswered. In this paper, we investigate whether the effects of pre-training can be observed when the problem size is reduced, modeling a smaller, reduced-vocabulary language. We show the benefits of pre-training with masked language modeling (MLM) objective in models as small as 1.25M parameters, and establish a strong correlation between pre-training perplexity and downstream performance (GLUE benchmark). We examine downscaling effects, extending scaling laws to models as small as ~1M parameters. At this scale, we observe a break of the power law for compute-optimal models and show that the MLM loss does not scale smoothly with compute-cost (FLOPs) below $2.2 \\times 10^{15}$ FLOPs. We also find that adding layers does not always benefit downstream performance.",
    "authors": [
        "Vijeta Deshpande",
        "Dan Pechi",
        "Shree Thatte",
        "Vladislav Lialin",
        "Anna Rumshisky"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper shows the benefits of pre-training with masked language modeling (MLM) objective in models as small as 1.25M parameters, and establishes a strong correlation between pre- training perplexity and downstream performance (GLUE benchmark), and examines downscaling effects."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}