{
    "acronym": "9aacdbc8b04fa63e6fe93f62a737a11c613f08fb",
    "title": "Recent Advances in Neural Text Generation: A Task-Agnostic Survey",
    "seed_ids": [
        "gpt2",
        "58b8da3821affc426895a85dbac5556322e6e2a9",
        "56765a17295370c70cbc510329c082ec60ed3c62",
        "a23f58609e7caecb68ec16d7a175b24e482b515d",
        "0646bb09db4d1ba24150e69b71edcd4aff691b3c",
        "7072db6eddb85ecd2c117365d91bd694760f726e",
        "e7c698bdace380f7183dedbe657686f1885f615c",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "25db56fc85fe15625c3375064a35e908ba6dfd2a",
        "75352cc69a29bd5fc411e0e79737cb96b6309161",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "d81f4f03913a0087e9b623f6d0dbd9f169b971f5",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9aacdbc8b04fa63e6fe93f62a737a11c613f08fb",
    "abstract": "In recent years, considerable research has been dedicated to the application of neural models in the field of natural language generation (NLG). The primary objective is to generate text that is both linguistically natural and human-like, while also exerting control over the generation process. This paper offers a comprehensive and task-agnostic survey of the recent advancements in neural text generation. These advancements have been facilitated through a multitude of developments, which we categorize into four key areas: data construction, neural frameworks, training and inference strategies, and evaluation metrics. By examining these different aspects, we aim to provide a holistic overview of the progress made in the field. Furthermore, we explore the future directions for the advancement of neural text generation, which encompass the utilization of neural pipelines and the incorporation of background knowledge. These avenues present promising opportunities to further enhance the capabilities of NLG systems. Overall, this survey serves to consolidate the current state of the art in neural text generation and highlights potential avenues for future research and development in this dynamic field.",
    "authors": [
        "Chen Tang",
        "Frank Guerin",
        "Yucheng Li",
        "Chenghua Lin"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A comprehensive and task-agnostic survey of the recent advancements in neural text generation, which encompasses the utilization of neural pipelines and the incorporation of background knowledge to highlight potential avenues for future research and development in this dynamic field."
    },
    "citationCount": 17,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}