{
    "acronym": "9ab5c6644082b6fdbd6a2b0e6ae3527668244424",
    "title": "Machine-Generated Text: A Comprehensive Survey of Threat Models and Detection Methods",
    "seed_ids": [
        "gpt2",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "f582d7ed1cf4bda84d6075e948630940f8445cfa",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d972c9bccc5ccef16d71b450dd3ab4c77f67224a",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "7845bfb55f5ce573b87d77bb76d4d38829b37620",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9ab5c6644082b6fdbd6a2b0e6ae3527668244424",
    "abstract": "Machine-generated text is increasingly difficult to distinguish from text authored by humans. Powerful open-source models are freely available, and user-friendly tools that democratize access to generative models are proliferating. ChatGPT, which was released shortly after the first edition of this survey, epitomizes these trends. The great potential of state-of-the-art natural language generation (NLG) systems is tempered by the multitude of avenues for abuse. Detection of machine-generated text is a key countermeasure for reducing the abuse of NLG models, and presents significant technical challenges and numerous open problems. We provide a survey that includes 1) an extensive analysis of threat models posed by contemporary NLG systems and 2) the most complete review of machine-generated text detection methods to date. This survey places machine-generated text within its cybersecurity and social context, and provides strong guidance for future work addressing the most critical threat models. While doing so, we highlight the importance that detection systems themselves demonstrate trustworthiness through fairness, robustness, and accountability.",
    "authors": [
        "Evan Crothers",
        "N. Japkowicz",
        "H. Viktor"
    ],
    "venue": "IEEE Access",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey provides an extensive analysis of threat models posed by contemporary NLG systems and the most complete review of machine-generated text detection methods to date, and provides strong guidance for future work addressing the most critical threat models."
    },
    "citationCount": 67,
    "influentialCitationCount": 7,
    "code": null,
    "description": null,
    "url": null
}