{
    "acronym": "9b2df9a5d91db2154a41d6e1887d335c5a62e3fe",
    "title": "PRO-LDM: Protein Sequence Generation with a Conditional Latent Diffusion Model",
    "seed_ids": [
        "classfreediffu",
        "f0f0b680ac74960922634e3da5cf1e6f6883c840",
        "5fa10872ef8037853ff7c8baf5f77fb55a918eca",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9b2df9a5d91db2154a41d6e1887d335c5a62e3fe",
    "abstract": "Deep learning-driven protein design holds enormous potential despite the complexities in sequences and structures. Recent developments in diffusion models yielded success in structure design, but awaits progress in sequence design and are computationally demanding. Here we present PRO-LDM: an efficient framework combining design fidelity and computational efficiency, utilizing the diffusion model in latent space to design proteins with property tuning. The model employs a joint autoencoder to capture latent variable distributions and generate meaningful embeddings from sequences. PRO-LDM (1) learns representations from biological features in natural proteins at both amino-acid and sequence level; (2) generates native-like new sequences with enhanced diversity; and (3) conditionally designs new proteins with tailored properties or functions. The out-of-distribution design enables sampling notably different sequences by adjusting classifier guidance strength. Our model presents a feasible pathway and an integratable tool to extract physicochemical and evolutionary information embedded within primary sequences, for protein design and optimization.",
    "authors": [
        "Sitao Zhang",
        "Zixuan Jiang",
        "Rundong Huang",
        "Shaoxun Mo",
        "Letao Zhu",
        "Peiheng Li",
        "Ziyi Zhang",
        "Emily Pan",
        "Xi Chen",
        "Yunfei Long",
        "Qi Liang",
        "Jin Tang",
        "Renjing Xu",
        "Rui Qing"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "PRO-LDM is an efficient framework combining design fidelity and computational efficiency, utilizing the diffusion model in latent space to design proteins with property tuning, utilizing a joint autoencoder to capture latent variable distributions and generate meaningful embeddings from sequences."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}