{
    "acronym": "9b5a11d9bb3790dbbb02725231b290f67579469a",
    "title": "A Survey of Self-Supervised Learning from Multiple Perspectives: Algorithms, Theory, Applications and Future Trends",
    "seed_ids": [
        "gpt",
        "4990f7542f0600e0501a7e7a931b32eb7cb804d5",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "36b9d0f8610a82fd25854889d9327a04da4ff8fd",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9b5a11d9bb3790dbbb02725231b290f67579469a",
    "abstract": "—Deep supervised learning algorithms generally require large numbers of labeled examples to attain satisfactory performance. To avoid the expensive cost incurred by collecting and labeling too many examples, as a subset of unsupervised learning, self-supervised learning (SSL) was proposed to learn good features from many unlabeled examples without any human-annotated labels. SSL has recently become a hot research topic, and many related algorithms have been proposed. However, few comprehensive studies have explained the connections among different SSL variants and how they have evolved. In this paper, we attempt to provide a review of the various SSL methods from the perspectives of algorithms, theory, applications, three main trends, and open questions. First, the motivations of most SSL algorithms are introduced in detail, and their commonalities and differences are compared. Second, the theoretical issues associated with SSL are investigated. Third, typical applications of SSL in areas such as image processing and computer vision (CV), as well as natural language processing (NLP), are discussed. Finally, the three main trends of SSL and the open research questions are discussed. A collection of useful materials is available at https://github.com/guijiejie/SSL.",
    "authors": [
        "Jie Gui",
        "Tuo Chen",
        "Qiong Cao",
        "Zhe Sun",
        "Haowen Luo",
        "Dacheng Tao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper attempts to provide a review of the various SSL methods from the perspectives of algorithms, theory, applications, three main trends, and open questions."
    },
    "citationCount": 28,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}