{
    "acronym": "9be0487d107ec8bc7863f0a6263977b6fd3f4557",
    "title": "Restore-RWKV: Efficient and Effective Medical Image Restoration with RWKV",
    "seed_ids": [
        "transformer",
        "rwkv4",
        "rwkv6",
        "ff72bf4782793d026b979e11de812f5d14bfe0bf",
        "1e8b76a27cc57793c09fff0be151532070f800e7",
        "157ed5647da39a7f5d33a84a90414b2a9e97e301",
        "4d84441e7f296d42d6493bb5a7b16d36e479b354",
        "51f38bd957fa863022feb5878fa1ba3bea6657cf",
        "e730beb44042499763d36214c0498434e470dfd5",
        "b24e899ec0f77eef2fc87a9b8e50516367aa1f97",
        "38c48a1cd296d16dc9c56717495d6e44cc354444",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "3074f2f3a7dbaec548e00d8c2f6522059cbe729c"
    ],
    "s2id": "9be0487d107ec8bc7863f0a6263977b6fd3f4557",
    "abstract": "Transformers have revolutionized medical image restoration, but the quadratic complexity still poses limitations for their application to high-resolution medical images. The recent advent of RWKV in the NLP field has attracted much attention as it can process long sequences efficiently. To leverage its advanced design, we propose Restore-RWKV, the first RWKV-based model for medical image restoration. Since the original RWKV model is designed for 1D sequences, we make two necessary modifications for modeling spatial relations in 2D images. First, we present a recurrent WKV (Re-WKV) attention mechanism that captures global dependencies with linear computational complexity. Re-WKV incorporates bidirectional attention as basic for a global receptive field and recurrent attention to effectively model 2D dependencies from various scan directions. Second, we develop an omnidirectional token shift (Omni-Shift) layer that enhances local dependencies by shifting tokens from all directions and across a wide context range. These adaptations make the proposed Restore-RWKV an efficient and effective model for medical image restoration. Extensive experiments demonstrate that Restore-RWKV achieves superior performance across various medical image restoration tasks, including MRI image super-resolution, CT image denoising, PET image synthesis, and all-in-one medical image restoration. Code is available at: \\href{https://github.com/Yaziwel/Restore-RWKV.git}{https://github.com/Yaziwel/Restore-RWKV}.",
    "authors": [
        "Zhiwen Yang",
        "Hui Zhang",
        "Dan Zhao",
        "Bingzheng Wei",
        "Yan Xu"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed Restore-RWKV is the first RWKV-based model for medical image restoration that achieves superior performance across various medical image restoration tasks, including MRI image super-resolution, CT image denoising, PET image synthesis, and all-in-one medical image restoration."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}