{
    "acronym": "9c12702ab3b4434e703d1a1086d3b636675c23d4",
    "title": "Towards Attribute-Entangled Controllable Text Generation: A Pilot Study of Blessing Generation",
    "seed_ids": [
        "gpt2",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9c12702ab3b4434e703d1a1086d3b636675c23d4",
    "abstract": "Controllable Text Generation (CTG) has obtained great success due to its fine-grained generation ability obtained by focusing on multiple attributes. However, most existing CTG researches overlook how to utilize the attribute entanglement to enhance the diversity of the controlled generated texts. Facing this dilemma, we focus on a novel CTG scenario, i.e., blessing generation which is challenging because high-quality blessing texts require CTG models to comprehensively consider the entanglement between multiple attributes (e.g., objects and occasions). To promote the research on blessing generation, we present EBleT, a large-scale Entangled Blessing Text dataset containing 293K English sentences annotated with multiple attributes. Furthermore, we propose novel evaluation metrics to measure the quality of the blessing texts generated by the baseline models we designed. Our study opens a new research direction for controllable text generation and enables the development of attribute-entangled CTG models.",
    "authors": [
        "Shulin Huang",
        "Shirong Ma",
        "Yinghui Li",
        "Y. Li",
        "Shiyang Lin",
        "Haitao Zheng",
        "Ying Shen"
    ],
    "venue": "IEEE Games Entertainment Media Conference",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study presents EBleT, a large-scale Entangled Blessing Text dataset containing 293K English sentences annotated with multiple attributes and proposes novel evaluation metrics to measure the quality of the blessing texts generated by the baseline models the authors designed."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}