{
    "acronym": "9c2a1dd5c46c6c1415b61bf865901b096e4c4339",
    "title": "Phyloformer: Fast, accurate and versatile phylogenetic reconstruction with deep neural networks",
    "seed_ids": [
        "transformer",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06"
    ],
    "s2id": "9c2a1dd5c46c6c1415b61bf865901b096e4c4339",
    "abstract": "Phylogenetic inference aims at reconstructing the tree describing the evolution of a set of sequences descending from a common ancestor. The high computational cost of state-of-the-art Maximum likelihood and Bayesian inference methods limits their usability under realistic evolutionary models. Harnessing recent advances in likelihood-free inference and geometric deep learning, we introduce Phyloformer, a fast and accurate method for evolutionary distance estimation and phylogenetic reconstruction. Sampling many trees and sequences under an evolutionary model, we train the network to learn a function that enables predicting the former from the latter. Under a commonly used model of protein sequence evolution and exploiting GPU acceleration, it outpaces fast distance methods while matching maximum likelihood accuracy on simulated and empirical data. Under more complex models, some of which include dependencies between sites, it outperforms other methods. Our results pave the way for the adoption of sophisticated realistic models for phylogenetic inference.",
    "authors": [
        "Luca Nesterenko",
        "Luc Blassel",
        "Philippe Veber",
        "B. Boussau",
        "Laurent Jacob"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Sampling many trees and sequences under an evolutionary model, Phyloformer is introduced, a fast and accurate method for evolutionary distance estimation and phylogenetic reconstruction that outpaces fast distance methods while matching maximum likelihood accuracy on simulated and empirical data."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}