{
    "acronym": "9c3c71ef2162302a5db3f24b4e3b1eaa90b504c9",
    "title": "Improved MLP Point Cloud Processing with High-Dimensional Positional Encoding",
    "seed_ids": [
        "transformer",
        "1ec58a9f1958f1c2540baadfa8f9809388788ab4",
        "71363797140647ebb3f540584de0a8758d2f7aa2",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "9c3c71ef2162302a5db3f24b4e3b1eaa90b504c9",
    "abstract": "Multi-Layer Perceptron (MLP) models are the bedrock of contemporary point cloud processing. However, their complex network architectures obscure the source of their strength. We first develop an “abstraction and refinement” (ABS-REF) view for the neural modeling of point clouds. This view elucidates that whereas the early models focused on the ABS stage, the more recent techniques devise sophisticated REF stages to attain performance advantage in point cloud processing. We then borrow the concept of “positional encoding” from transformer literature, and propose a High-dimensional Positional Encoding (HPE) module, which can be readily deployed to MLP based architectures. We leverage our module to develop a suite of HPENet, which are MLP networks that follow ABS-REF paradigm, albeit with a sophisticated HPE based REF stage. The developed technique is extensively evaluated for 3D object classification, object part segmentation, semantic segmentation and object detection. We establish new state-of-the-art results of 87.6 mAcc on ScanObjectNN for object classification, and 85.5 class mIoU on ShapeNetPart for object part segmentation, and 72.7 and 78.7 mIoU on Area-5 and 6-fold experiments with S3DIS for semantic segmentation. The source code for this work is available at https://github.com/zouyanmei/HPENet.",
    "authors": [
        "Yanmei Zou",
        "Hongshan Yu",
        "Zhengeng Yang",
        "Zechuan Li",
        "Naveed Akhtar"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work develops an “abstraction and refinement” (ABS-REF) view for the neural modeling of point clouds, and proposes a High-dimensional Positional Encoding (HPE) module, which can be readily deployed to MLP based architectures."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}