{
    "acronym": "9c6358c7bd02f5a8538f7f17c19dba1c95a1dda8",
    "title": "Composition, Attention, or Both?",
    "seed_ids": [
        "gpt",
        "gpt2",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "97a531f96a8d9a4c1d379637daf7dcc714db1b35",
        "5a2263092f49540fd0e049050a96882ff29b00c3",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9c6358c7bd02f5a8538f7f17c19dba1c95a1dda8",
    "abstract": "In this paper, we propose a novel architecture called Composition Attention Grammars (CAGs) that recursively compose subtrees into a single vector representation with a composition function, and selectively attend to previous structural information with a self-attention mechanism. We investigate whether these components -- the composition function and the self-attention mechanism -- can both induce human-like syntactic generalization. Specifically, we train language models (LMs) with and without these two components with the model sizes carefully controlled, and evaluate their syntactic generalization performance against six test circuits on the SyntaxGym benchmark. The results demonstrated that the composition function and the self-attention mechanism both play an important role to make LMs more human-like, and closer inspection of linguistic phenomenon implied that the composition function allowed syntactic features, but not semantic features, to percolate into subtree representations.",
    "authors": [
        "Ryosuke Yoshida",
        "Yohei Oseki"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results demonstrated that the composition function and the self-attention mechanism both play an important role to make LMs more human-like, and closer inspection of linguistic phenomenon implied that the composition function allowed syntactic features, but not semantic features, to percolate into subtree representations."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}