{
    "acronym": "9c84ec7c97170d78a3805dfcb387b82c2543adb9",
    "title": "Interpreting Song Lyrics with an Audio-Informed Pre-trained Language Model",
    "seed_ids": [
        "gpt",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "145b8b5d99a2beba6029418ca043585b90138d12"
    ],
    "s2id": "9c84ec7c97170d78a3805dfcb387b82c2543adb9",
    "abstract": "Lyric interpretations can help people understand songs and their lyrics quickly, and can also make it easier to manage, retrieve and discover songs efficiently from the growing mass of music archives. In this paper we propose BART-fusion, a novel model for generating lyric interpretations from lyrics and music audio that combines a large-scale pre-trained language model with an audio encoder. We employ a cross-modal attention module to incorporate the audio representation into the lyrics representation to help the pre-trained language model understand the song from an audio perspective, while preserving the language model's original generative performance. We also release the Song Interpretation Dataset, a new large-scale dataset for training and evaluating our model. Experimental results show that the additional audio information helps our model to understand words and music better, and to generate precise and fluent interpretations. An additional experiment on cross-modal music retrieval shows that interpretations generated by BART-fusion can also help people retrieve music more accurately than with the original BART.",
    "authors": [
        "Yixiao Zhang",
        "Junyan Jiang",
        "Gus G. Xia",
        "S. Dixon"
    ],
    "venue": "International Society for Music Information Retrieval Conference",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel model for generating lyric interpretations from lyrics and music audio that combines a large-scale pre-trained language model with an audio encoder is proposed, which employs a cross-modal attention module to incorporate the audio representation into the lyrics representation."
    },
    "citationCount": 6,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}