{
    "acronym": "9c977c86331070fbfa20da1494ac6e0c6360026f",
    "title": "CrossHAR: Generalizing Cross-dataset Human Activity Recognition via Hierarchical Self-Supervised Pretraining",
    "seed_ids": [
        "bert",
        "5b7f5488c380cf5085a5dd93e993ad293b225eee",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b"
    ],
    "s2id": "9c977c86331070fbfa20da1494ac6e0c6360026f",
    "abstract": "The increasing availability of low-cost wearable devices and smartphones has significantly advanced the field of sensor-based human activity recognition (HAR), attracting considerable research interest. One of the major challenges in HAR is the domain shift problem in cross-dataset activity recognition, which occurs due to variations in users, device types, and sensor placements between the source dataset and the target dataset. Although domain adaptation methods have shown promise, they typically require access to the target dataset during the training process, which might not be practical in some scenarios. To address these issues, we introduce CrossHAR, a new HAR model designed to improve model performance on unseen target datasets. CrossHAR involves three main steps: (i) CrossHAR explores the sensor data generation principle to diversify the data distribution and augment the raw sensor data. (ii) CrossHAR then employs a hierarchical self-supervised pretraining approach with the augmented data to develop a generalizable representation. (iii) Finally, CrossHAR fine-tunes the pretrained model with a small set of labeled data in the source dataset, enhancing its performance in cross-dataset HAR. Our extensive experiments across multiple real-world HAR datasets demonstrate that CrossHAR outperforms current state-of-the-art methods by 10.83% in accuracy, demonstrating its effectiveness in generalizing to unseen target datasets.",
    "authors": [
        "Zhiqing Hong",
        "Zelong Li",
        "Shuxin Zhong",
        "Wenjun Lyu",
        "Haotian Wang",
        "Yi Ding",
        "Tian He",
        "Desheng Zhang"
    ],
    "venue": "Proceedings of the ACM on Interactive Mobile Wearable and Ubiquitous Technologies",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "CrossHAR is introduced, a new HAR model designed to improve model performance on unseen target datasets and outperforms current state-of-the-art methods by 10.83% in accuracy, demonstrating its effectiveness in generalizing to unseen target datasets."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}