{
    "acronym": "9ccad0208b50042d8378b77700146a98bd22ea3f",
    "title": "The SIGMORPHON 2022 Shared Task on Morpheme Segmentation",
    "seed_ids": [
        "gpt2",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9ccad0208b50042d8378b77700146a98bd22ea3f",
    "abstract": "The SIGMORPHON 2022 shared task on morpheme segmentation challenged systems to decompose a word into a sequence of morphemes and covered most types of morphology: compounds, derivations, and inflections. Subtask 1, word-level morpheme segmentation, covered 5 million words in 9 languages (Czech, English, Spanish, Hungarian, French, Italian, Russian, Latin, Mongolian) and received 13 system submissions from 7 teams and the best system averaged 97.29% F1 score across all languages, ranging English (93.84%) to Latin (99.38%). Subtask 2, sentence-level morpheme segmentation, covered 18,735 sentences in 3 languages (Czech, English, Mongolian), received 10 system submissions from 3 teams, and the best systems outperformed all three state-of-the-art subword tokenization methods (BPE, ULM, Morfessor2) by 30.71% absolute. To facilitate error analysis and support any type of future studies, we released all system predictions, the evaluation script, and all gold standard datasets.",
    "authors": [
        "Khuyagbaatar Batsuren",
        "Gábor Bella",
        "Aryaman Arora",
        "Viktor Martinovi'c",
        "Kyle Gorman",
        "Zdenvek vZabokrtsk'y",
        "Amarsanaa Ganbold",
        "vS'arka Dohnalov'a",
        "Magda vSevvc'ikov'a",
        "Katevrina Pelegrinov'a",
        "Fausto Giunchiglia",
        "Ryan Cotterell",
        "Ekaterina Vylomova"
    ],
    "venue": "Special Interest Group on Computational Morphology and Phonology Workshop",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "To facilitate error analysis and support any type of future studies, the SIGMORPHON 2022 shared task on morpheme segmentation released all system predictions, the evaluation script, and all gold standard datasets."
    },
    "citationCount": 31,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}