{
    "acronym": "9cccf796f574b996a1bc464f8596513b9ae38397",
    "title": "Conditional Text Generation for Harmonious Human-Machine Interaction",
    "seed_ids": [
        "gpt",
        "75352cc69a29bd5fc411e0e79737cb96b6309161",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9cccf796f574b996a1bc464f8596513b9ae38397",
    "abstract": "In recent years, with the development of deep learning, text-generation technology has undergone great changes and provided many kinds of services for human beings, such as restaurant reservation and daily communication. The automatically generated text is becoming more and more fluent so researchers begin to consider more anthropomorphic text-generation technology, that is, the conditional text generation, including emotional text generation, personalized text generation, and so on. Conditional Text Generation (CTG) has thus become a research hotspot. As a promising research field, we find that much attention has been paid to exploring it. Therefore, we aim to give a comprehensive review of the new research trends of CTG. We first summarize several key techniques and illustrate the technical evolution route in the field of neural text generation, based on the concept model of CTG. We further make an investigation of existing CTG fields and propose several general learning models for CTG. Finally, we discuss the open issues and promising research directions of CTG.",
    "authors": [
        "Bin Guo",
        "Hao Wang",
        "Yasan Ding",
        "Wei Wu",
        "Shaoyang Hao",
        "Yueqi Sun",
        "Zhiwen Yu"
    ],
    "venue": "ACM Transactions on Intelligent Systems and Technology",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work summarizes several key techniques and illustrates the technical evolution route in the field of neural text generation, based on the concept model of CTG, and makes an investigation of existing CTG fields and proposes several general learning models for CTG."
    },
    "citationCount": 19,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}