{
    "acronym": "9ce50dd95b868bee76d7f0916726b495a8141265",
    "title": "Singularformer: Learning to Decompose Self-Attention to Linearize the Complexity of Transformer",
    "seed_ids": [
        "linformer",
        "70e91e16eb321067d9402710e14a40cf28311f73",
        "dc0102a51a9d33e104a4a3808a18cf17f057228c",
        "1a883522f3c0051d70be1f8cbdb8989a77395006",
        "6fa1cfc4f97f03a8485692418c7aa1a06c574a85",
        "6914a7997ff4be207fa7b3472a9c5879abaec646",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "9ce50dd95b868bee76d7f0916726b495a8141265",
    "abstract": "Transformers achieve excellent performance in a variety of domains since they can capture long-distance dependencies through the self-attention mechanism. However, self-attention is computationally costly due to its quadratic complexity and high memory consumption. In this paper, we propose a novel Transformer variant (Singularformer) that uses neural networks to learn the singular value decomposition process of the attention matrix to design a linear-complexity and memory-efficient global self-attention mechanism. Specifically, we decompose the attention matrix into the product of three matrix factors based on singular value decomposition and design neural networks to learn these matrix factors, then the associative law of matrix multiplication is used to linearize the calculation of self-attention. The above procedure allows us to compute self-attention as two-dimensional reduction processes in the first and second token dimensional spaces, followed by a multi-head self-attention computational process on the first dimensional reduced token features. Experimental results on 8 real-world datasets demonstrate that Singularformer performs favorably against the other Transformer variants with lower time and space complexity. Our source code is publicly available at https://github.com/CSUBioGroup/Singularformer.",
    "authors": [
        "Yifan Wu",
        "Shichao Kan",
        "Min Zeng",
        "Min Li"
    ],
    "venue": "International Joint Conference on Artificial Intelligence",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel Transformer variant (Singularformer) that uses neural networks to learn the singular value decomposition process of the attention matrix to design a linear-complexity and memory-efficient global self-attention mechanism."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}