{
    "acronym": "9d14f3f41948f74bb731e1248d0b231e935e091b",
    "title": "Whole Genome Transformer for Gene Interaction Effects in Microbiome Habitat Specificity",
    "seed_ids": [
        "transformer",
        "374664a1f5704c7451975e3f231a29f439aeaecd",
        "bfd2b76998a0521c12903ef5ced517adf70ad2ba",
        "0f4780f3f42dbe9755d54495ae17244cc88a7483",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "f4238bd2385a52413ccbacfd9e409a650235bd13",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "9d14f3f41948f74bb731e1248d0b231e935e091b",
    "abstract": "Leveraging the vast genetic diversity within microbiomes offers unparalleled insights into complex phenotypes, yet the task of accurately predicting and understanding such traits from genomic data remains challenging. We propose a framework taking advantage of existing large models for gene vectorization to predict habitat specificity from entire microbial genome sequences. Based on our model, we develop attribution techniques to elucidate gene interaction effects that drive microbial adaptation to diverse environments. We train and validate our approach on a large dataset of high quality microbiome genomes from different habitats. We not only demonstrate solid predictive performance, but also how sequence-level information of entire genomes allows us to identify gene associations underlying complex phenotypes. Our attribution recovers known important interaction networks and proposes new candidates for experimental follow up.",
    "authors": [
        "Zhufeng Li",
        "S. S. Cranganore",
        "Nicholas D. Youngblut",
        "Niki Kilbertus"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A framework taking advantage of existing large models for gene vectorization to predict habitat specificity from entire microbial genome sequences is proposed and attribution techniques to elucidate gene interaction effects that drive microbial adaptation to diverse environments are developed."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}