{
    "acronym": "9d4292f60a1935812054f7d655e3586a0016d45a",
    "title": "DreamStory: Open-Domain Story Visualization by LLM-Guided Multi-Subject Consistent Diffusion",
    "seed_ids": [
        "classfreediffu",
        "dfa0a8dc4bb3025b26525cd65c99be0e60fab66a",
        "d599dc40c9cb8d6d76554ee7d21d20c22cc7cdb5",
        "1206b05eae5a06ba662ae79fb291b50e359c4f42",
        "b6346f9fa093b8e85df712485a2b851b9f680dac",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "a6238191cc43c41a544caadcf8b00947293cf099",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "9d4292f60a1935812054f7d655e3586a0016d45a",
    "abstract": "Story visualization aims to create visually compelling images or videos corresponding to textual narratives. Despite recent advances in diffusion models yielding promising results, existing methods still struggle to create a coherent sequence of subject-consistent frames based solely on a story. To this end, we propose DreamStory, an automatic open-domain story visualization framework by leveraging the LLMs and a novel multi-subject consistent diffusion model. DreamStory consists of (1) an LLM acting as a story director and (2) an innovative Multi-Subject consistent Diffusion model (MSD) for generating consistent multi-subject across the images. First, DreamStory employs the LLM to generate descriptive prompts for subjects and scenes aligned with the story, annotating each scene's subjects for subsequent subject-consistent generation. Second, DreamStory utilizes these detailed subject descriptions to create portraits of the subjects, with these portraits and their corresponding textual information serving as multimodal anchors (guidance). Finally, the MSD uses these multimodal anchors to generate story scenes with consistent multi-subject. Specifically, the MSD includes Masked Mutual Self-Attention (MMSA) and Masked Mutual Cross-Attention (MMCA) modules. MMSA and MMCA modules ensure appearance and semantic consistency with reference images and text, respectively. Both modules employ masking mechanisms to prevent subject blending. To validate our approach and promote progress in story visualization, we established a benchmark, DS-500, which can assess the overall performance of the story visualization framework, subject-identification accuracy, and the consistency of the generation model. Extensive experiments validate the effectiveness of DreamStory in both subjective and objective evaluations. Please visit our project homepage at https://dream-xyz.github.io/dreamstory.",
    "authors": [
        "Huiguo He",
        "Huan Yang",
        "Zixi Tuo",
        "Yuan Zhou",
        "Qiuyue Wang",
        "Yuhang Zhang",
        "Zeyu Liu",
        "Wenhao Huang",
        "Hongyang Chao",
        "Jian Yin"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A benchmark is established, DS-500, which can assess the overall performance of the story visualization framework, subject-identification accuracy, and the consistency of the generation model, and the effectiveness of DreamStory in both subjective and objective evaluations."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}