{
    "acronym": "9e147826995203059f86eac7e7fba2fe1a66e00c",
    "title": "vec2text with Round-Trip Translations",
    "seed_ids": [
        "gpt2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9e147826995203059f86eac7e7fba2fe1a66e00c",
    "abstract": "We investigate models that can generate arbitrary natural language text (e.g. all English sentences) from a bounded, convex and well-behaved control space. We call them universal vec2text models. Such models would allow making semantic decisions in the vector space (e.g. via reinforcement learning) while the natural language generation is handled by the vec2text model. We propose four desired properties: universality, diversity, fluency, and semantic structure, that such vec2text models should possess and we provide quantitative and qualitative methods to assess them. We implement a vec2text model by adding a bottleneck to a 250M parameters Transformer model and training it with an auto-encoding objective on 400M sentences (10B tokens) extracted from a massive web corpus. We propose a simple data augmentation technique based on round-trip translations and show in extensive experiments that the resulting vec2text model surprisingly leads to vector spaces that fulfill our four desired properties and that this model strongly outperforms both standard and denoising auto-encoders.",
    "authors": [
        "Geoffrey Cideron",
        "Sertan Girgin",
        "Anton Raichuk",
        "O. Pietquin",
        "Olivier Bachem",
        "L'eonard Hussenot"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work investigates models that can generate arbitrary natural language text from a bounded, convex and well-behaved control space and proposes four desired properties: universality, diversity, fluency, and semantic structure, that such vec2text models should possess and provides quantitative and qualitative methods to assess them."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}