{
    "acronym": "9e4c8b2e888c2cbffdecc5af750bdd9d26fae623",
    "title": "Investigating Trojan Attacks on Pre-trained Language Model-powered Database Middleware",
    "seed_ids": [
        "gpt",
        "71ba5f845bd22d42003675b7cea970ca9e590bcc",
        "1e69f7b278ba4ae61fdbeb3330d041107287bd20"
    ],
    "s2id": "9e4c8b2e888c2cbffdecc5af750bdd9d26fae623",
    "abstract": "The recent success of pre-trained language models (PLMs) such as BERT has resulted in the development of various beneficial database middlewares, including natural language query interfaces and entity matching. This shift has been greatly facilitated by the extensive external knowledge of PLMs. However, as PLMs are often provided by untrusted third parties, their lack of standardization and regulation poses significant security risks that have yet to be fully explored. This paper investigates the security threats posed by malicious PLMs to these emerging database middleware. We specifically propose a novel type of Trojan attack, where a maliciously designed PLM causes unexpected behavior in the database middleware. These Trojan attacks possess the following characteristics: (1) Triggerability: The Trojan-infected database middleware will function normally with normal input, but will likely malfunction when triggered by the attacker. (2) Imperceptibility: There is no need for noticeable modification of the input to trigger the Trojan. (3) Generalizability: The Trojan is capable of targeting a variety of downstream tasks, not just one specific task. We thoroughly evaluate the impact of these Trojan attacks through experiments and analyze potential countermeasures and their limitations. Our findings could aid in the creation of stronger mechanisms for the implementation of PLMs in database middleware.",
    "authors": [
        "Peiran Dong",
        "Song Guo",
        "Junxiao Wang"
    ],
    "venue": "Knowledge Discovery and Data Mining",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a novel type of Trojan attack, where a maliciously designed PLM causes unexpected behavior in the database middleware, and thoroughly evaluates the impact of these Trojan attacks through experiments and analyzes potential countermeasures and their limitations."
    },
    "citationCount": 2,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}