{
    "acronym": "9e6547e841754684b1c157cbea707d0f3f0fad60",
    "title": "Multi-view Counterfactual Contrastive Learning for Fact-checking Fake News Detection",
    "seed_ids": [
        "bert"
    ],
    "s2id": "9e6547e841754684b1c157cbea707d0f3f0fad60",
    "abstract": "Fact-checking fake news detection involves using verified accurate factual information in news reports as \"evidence\" to validate objective statement \"claim\". Existing works primarily focus on identifying critical elements within the evidence that support or refute specific claims by assessing the congruence or divergence between the claim and the associated evidence. These methods can broadly be divided into text-based and graph-based-the former centers on understanding the nuances of unstructured text to extract semantic word-level information. At the same time, the latter is proficient at analyzing the node-level structure of graphs it creates from the text to reveal topological insights. Each type provides a distinct view on identifying critical elements for fact-checking. To enhance the complementary nature of the two perspectives, this paper proposes an end-to-end framework for fact-checking fake news detection entitled Multi-view Counterfactual Contrastive Learning (MCCL). The framework incorporates a counterfactual technique to refine the fused features from both the \"entity-view\" of textual content and the \"centrality-view\" of the graph structure. Additionally, it employs contrastive learning to sharpen the distinctions among multi-view features, which facilitates the exact identification of critical elements in the evidence related to their respective claims. Experimental results on real datasets demonstrate that the proposed MCCL outperforms state-of-the-art methods.",
    "authors": [
        "Yongcheng Zhang",
        "Lingou Kong",
        "Sheng Tian",
        "Hao Fei",
        "Changpeng Xiang",
        "Huan Wang",
        "Xiaomei Wei"
    ],
    "venue": "International Conference on Multimedia Retrieval",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An end-to-end framework for fact-checking fake news detection entitled Multi-view Counterfactual Contrastive Learning (MCCL), which incorporates a counterfactual technique to refine the fused features from both the \"entity-view\" of textual content and the \"centrality-view\" of the graph structure."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}