{
    "acronym": "9eb6da3bff35a8e235fc3c16499b6b7836d6304f",
    "title": "Medformer: A Multi-Granularity Patching Transformer for Medical Time-Series Classification",
    "seed_ids": [
        "transformer",
        "afeeb8f5018eebb1a1d334b94dbbfc48d167efef",
        "016e99ccef0afb7011f3ea3b1b932611c8fb957b",
        "8064d3873c646dc9ff949d72c54c634a906fc092",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "30dcc0e191a376fea0e7a46f94c53872c029efc9"
    ],
    "s2id": "9eb6da3bff35a8e235fc3c16499b6b7836d6304f",
    "abstract": "Medical time series data, such as Electroencephalography (EEG) and Electrocardiography (ECG), play a crucial role in healthcare, such as diagnosing brain and heart diseases. Existing methods for medical time series classification primarily rely on handcrafted biomarkers extraction and CNN-based models, with limited exploration of transformers tailored for medical time series. In this paper, we introduce Medformer, a multi-granularity patching transformer tailored specifically for medical time series classification. Our method incorporates three novel mechanisms to leverage the unique characteristics of medical time series: cross-channel patching to leverage inter-channel correlations, multi-granularity embedding for capturing features at different scales, and two-stage (intra- and inter-granularity) multi-granularity self-attention for learning features and correlations within and among granularities. We conduct extensive experiments on five public datasets under both subject-dependent and challenging subject-independent setups. Results demonstrate Medformer's superiority over 10 baselines, achieving top averaged ranking across five datasets on all six evaluation metrics. These findings underscore the significant impact of our method on healthcare applications, such as diagnosing Myocardial Infarction, Alzheimer's, and Parkinson's disease. We release the source code at \\url{https://github.com/DL4mHealth/Medformer}.",
    "authors": [
        "Yihe Wang",
        "Nan Huang",
        "Taida Li",
        "Yujun Yan",
        "Xiang Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Results demonstrate Medformer's superiority over 10 baselines, achieving top averaged ranking across five datasets on all six evaluation metrics, and underscore the significant impact of the method on healthcare applications, such as diagnosing Myocardial Infarction, Alzheimer's, and Parkinson's disease."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}