{
    "acronym": "9f215dbdb92f37f80d70dcadddfcbb3d8ee2a511",
    "title": "Fourier-Mixed Window Attention: Accelerating Informer for Long Sequence Time-Series Forecasting",
    "seed_ids": [
        "fnet",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "9b6af0e358e76d22f209c75b1702c3e6ea7815b1",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "955f90930d48750e7239478b4eed440eb84131cd",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "9f215dbdb92f37f80d70dcadddfcbb3d8ee2a511",
    "abstract": "We study a fast local-global window-based attention method to accelerate Informer for long sequence time-series forecasting. While window attention being local is a considerable computational saving, it lacks the ability to capture global token information which is compensated by a subsequent Fourier transform block. Our method, named FWin, does not rely on query sparsity hypothesis and an empirical approximation underlying the ProbSparse attention of Informer. Through experiments on univariate and multivariate datasets, we show that FWin transformers improve the overall prediction accuracies of Informer while accelerating its inference speeds by 1.6 to 2 times. We also provide a mathematical definition of FWin attention, and prove that it is equivalent to the canonical full attention under the block diagonal invertibility (BDI) condition of the attention matrix. The BDI is shown experimentally to hold with high probability for typical benchmark datasets.",
    "authors": [
        "Nhat Tran",
        "Jack Xin"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A fast local-global window-based attention method to accelerate Informer for long sequence time-series forecasting, which shows that FWin transformers improve the overall prediction accuracies of Informer while accelerating its inference speeds by 1.6 to 2 times."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}