{
    "acronym": "9f808d689639f3eb577614d2236ad7feaa3b6ecb",
    "title": "Semantic Models for the First-Stage Retrieval: A Comprehensive Review",
    "seed_ids": [
        "gpt",
        "2c953a3c378b40dadf2e3fb486713c8608b8e282",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "9f808d689639f3eb577614d2236ad7feaa3b6ecb",
    "abstract": "Multi-stage ranking pipelines have been a practical solution in modern search systems, where the first-stage retrieval is to return a subset of candidate documents and latter stages attempt to re-rank those candidates. Unlike re-ranking stages going through quick technique shifts over the past decades, the first-stage retrieval has long been dominated by classical term-based models. Unfortunately, these models suffer from the vocabulary mismatch problem, which may block re-ranking stages from relevant documents at the very beginning. Therefore, it has been a long-term desire to build semantic models for the first-stage retrieval that can achieve high recall efficiently. Recently, we have witnessed an explosive growth of research interests on the first-stage semantic retrieval models. We believe it is the right time to survey current status, learn from existing methods, and gain some insights for future development. In this article, we describe the current landscape of the first-stage retrieval models under a unified framework to clarify the connection between classical term-based retrieval methods, early semantic retrieval methods, and neural semantic retrieval methods. Moreover, we identify some open challenges and envision some future directions, with the hope of inspiring more research on these important yet less investigated topics.",
    "authors": [
        "Yinqiong Cai",
        "Yixing Fan",
        "Jiafeng Guo",
        "Fei Sun",
        "Ruqing Zhang",
        "Xueqi Cheng"
    ],
    "venue": "ACM Trans. Inf. Syst.",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The current landscape of the first-stage retrieval models under a unified framework is described to clarify the connection between classical term-based retrieval methods, early semantic retrieved methods, and neural semantic retrieval methods."
    },
    "citationCount": 87,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}