{
    "acronym": "9fa9d5dd481400b2f3904b33d542d70a6affccb9",
    "title": "Dynamic Neuro-Symbolic Knowledge Graph Construction for Zero-shot Commonsense Question Answering",
    "seed_ids": [
        "gpt",
        "83fac78857c7e65fe10a11a798674dd3cd259c1d",
        "710d183174844da5b7f392667f3cc25d2b098dde",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "9fa9d5dd481400b2f3904b33d542d70a6affccb9",
    "abstract": "Understanding narratives requires reasoning about implicit world knowledge related to the causes, effects, and states of situations described in text. At the core of this challenge is how to access contextually relevant knowledge on demand and reason over it.\n\nIn this paper, we present initial studies toward zero-shot commonsense question answering by formulating the task as inference over dynamically generated commonsense knowledge graphs. In contrast to previous studies for knowledge integration that rely on retrieval of existing knowledge from static knowledge graphs, our study requires commonsense knowledge integration where contextually relevant knowledge is often not present in existing knowledge bases. Therefore, we present a novel approach that generates contextually-relevant symbolic knowledge structures on demand using generative neural commonsense knowledge models.\n\nEmpirical results on two datasets demonstrate the efficacy of our neuro-symbolic approach for dynamically constructing knowledge graphs for reasoning. Our approach achieves significant performance boosts over pretrained language models and vanilla knowledge models, all while providing interpretable reasoning paths for its predictions.",
    "authors": [
        "Antoine Bosselut",
        "Ronan Le Bras",
        "Yejin Choi"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper presents a novel approach that generates contextually-relevant symbolic knowledge structures on demand using generative neural commonsense knowledge models and achieves significant performance boosts over pretrained language models and vanilla knowledge models, all while providing interpretable reasoning paths for its predictions."
    },
    "citationCount": 106,
    "influentialCitationCount": 9,
    "code": null,
    "description": null,
    "url": null
}