{
    "acronym": "a03aec83d9dc8f85aebb7ce881cb4faec84b3a8a",
    "title": "Interactive Prompt Debugging with Sequence Salience",
    "seed_ids": [
        "gpt2",
        "1ec16018e9152c50bbaed1d49c3077b9fb6d2838",
        "ac34c70ee85b048ad97328713c790f389656e4eb",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a03aec83d9dc8f85aebb7ce881cb4faec84b3a8a",
    "abstract": "We present Sequence Salience, a visual tool for interactive prompt debugging with input salience methods. Sequence Salience builds on widely used salience methods for text classification and single-token prediction, and extends this to a system tailored for debugging complex LLM prompts. Our system is well-suited for long texts, and expands on previous work by 1) providing controllable aggregation of token-level salience to the word, sentence, or paragraph level, making salience over long inputs tractable; and 2) supporting rapid iteration where practitioners can act on salience results, refine prompts, and run salience on the new output. We include case studies showing how Sequence Salience can help practitioners work with several complex prompting strategies, including few-shot, chain-of-thought, and constitutional principles. Sequence Salience is built on the Learning Interpretability Tool, an open-source platform for ML model visualizations, and code, notebooks, and tutorials are available at http://goo.gle/sequence-salience.",
    "authors": [
        "Ian Tenney",
        "Ryan Mullins",
        "Bin Du",
        "Shree Pandya",
        "Minsuk Kahng",
        "Lucas Dixon"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work builds on widely used salience methods for text classification and single-token prediction, and extends this to a system tailored for debugging complex LLM prompts, and includes case studies showing how Sequence Salience can help practitioners work with several complex prompting strategies."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}