{
    "acronym": "a05ebd2941a0ea9354eeaf0d8f251f662d29f90f",
    "title": "Crowdsourcing public attitudes toward local services through the lens of Google Maps reviews: An urban density-based perspective",
    "seed_ids": [
        "bert"
    ],
    "s2id": "a05ebd2941a0ea9354eeaf0d8f251f662d29f90f",
    "abstract": "Understanding how urban density impacts public perceptions of urban service is important for informing livable, accessible, and equitable urban planning. Conventional methods such as surveys are limited by their sampling scope, time efficiency, and expense. On the other hand, crowdsourcing through online platforms presents an opportunity for decision-makers to tap into a user-generated source of information that is widely available and cost-effective. To demonstrate such potential, we collect Google Maps reviews for 23,906 points of interest (POIs) in Atlanta, Georgia. Next, we use the Bidirectional Encoder Representations from Transformers (BERT) model to classify reviewers' attitudes toward urban density and the Robustly Optimized BERT approach (RoBERTa) to compute sentiment. Finally, a partial least squares regression is fitted to examine the relationships between average sentiment and socio-spatial factors. The findings reveal areas in Atlanta with predominantly negative sentiments toward urban density and highlight the variation in sentiment distribution across different POIs. Further, the regression analysis reveals that minority and low-income communities often express more negative sentiments, and higher land use density exacerbates such negativity. This study introduces a novel data source and methodological framework that can be easily adapted to different regions, offering useful insights into public sentiment toward the built environment and shedding light on how planning policies can be designed to handle related challenges.",
    "authors": [
        "Lingyao Li",
        "Songhua Hu",
        "Atiyya Shaw",
        "Libby Hemphill"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study introduces a novel data source and methodological framework that can be easily adapted to different regions, offering useful insights into public sentiment toward the built environment and shedding light on how planning policies can be designed to handle related challenges."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}