{
    "acronym": "a07a94168608322600fd3cab54df1410b96852b6",
    "title": "Case-based Reasoning for Natural Language Queries over Knowledge Bases",
    "seed_ids": [
        "bigbird",
        "5cdab78acc4f3aab429a0dd41c3ec7e605d42e7b",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "a07a94168608322600fd3cab54df1410b96852b6",
    "abstract": "It is often challenging to solve a complex problem from scratch, but much easier if we can access other similar problems with their solutions — a paradigm known as case-based reasoning (CBR). We propose a neuro-symbolic CBR approach (CBR-KBQA) for question answering over large knowledge bases. CBR-KBQA consists of a nonparametric memory that stores cases (question and logical forms) and a parametric model that can generate a logical form for a new question by retrieving cases that are relevant to it. On several KBQA datasets that contain complex questions, CBR-KBQA achieves competitive performance. For example, on the CWQ dataset, CBR-KBQA outperforms the current state of the art by 11% on accuracy. Furthermore, we show that CBR-KBQA is capable of using new cases without any further training: by incorporating a few human-labeled examples in the case memory, CBR-KBQA is able to successfully generate logical forms containing unseen KB entities as well as relations.",
    "authors": [
        "Rajarshi Das",
        "M. Zaheer",
        "Dung Ngoc Thai",
        "Ameya Godbole",
        "Ethan Perez",
        "Jay Yoon Lee",
        "Lizhen Tan",
        "L. Polymenakos",
        "A. McCallum"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A neuro-symbolic CBR approach (CBR-KBQA) for question answering over large knowledge bases that is capable of using new cases without any further training and is able to successfully generate logical forms containing unseen KB entities as well as relations."
    },
    "citationCount": 131,
    "influentialCitationCount": 22,
    "code": null,
    "description": null,
    "url": null
}