{
    "acronym": "a082c9c93b5cc0d38e7ac14c6c9dfe186bb5c824",
    "title": "Mitigating Object Hallucination in Large Vision-Language Models via Classifier-Free Guidance",
    "seed_ids": [
        "classfreediffu",
        "5a3a04af4935302f0871bf14a4b573d477ce96be",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c"
    ],
    "s2id": "a082c9c93b5cc0d38e7ac14c6c9dfe186bb5c824",
    "abstract": "The advancement of Large Vision-Language Models (LVLMs) has increasingly highlighted the critical issue of their tendency to hallucinate non-existing objects in the images. To address this issue, previous works focused on using specially curated datasets or powerful LLMs (e.g., GPT-3.5) to rectify the outputs of LVLMs. However, these approaches require either expensive training/fine-tuning or API access to advanced LLMs to correct the model's output post-generation. In this paper, we tackle this challenge by introducing a framework called Mitigating hallucinAtion via classifieR-Free guIdaNcE (MARINE), which is both training-free and API-free, and can effectively and efficiently reduce object hallucinations during the generation process. Specifically, MARINE enriches the visual context of LVLMs by integrating existing open-source vision models, and employs classifier-free guidance to incorporate the additional object grounding features to improve the precision of LVLMs' generations. Through comprehensive evaluations across $6$ popular LVLMs with diverse evaluation metrics, we demonstrate the effectiveness of MARINE, which even outperforms existing fine-tuning-based methods. Remarkably, it not only reduces hallucinations but also improves the detailedness of LVLMs' generations, as assessed by GPT-4V.",
    "authors": [
        "Linxi Zhao",
        "Yihe Deng",
        "Weitong Zhang",
        "Quanquan Gu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces a framework called Mitigating hallucinAtion via classifieR-Free guIdaNcE (MARINE), which is both training-free and API-free, and can effectively and efficiently reduce object hallucinations during the generation process, and even outperforms existing fine-tuning-based methods."
    },
    "citationCount": 13,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}