{
    "acronym": "a0bad9f4c22cae39dc2c87fb77eacea4e35109e2",
    "title": "Towards a study of everyday geographic information: Bringing the everyday into view",
    "seed_ids": [
        "gpt3"
    ],
    "s2id": "a0bad9f4c22cae39dc2c87fb77eacea4e35109e2",
    "abstract": "Events are the driving force behind social media, whether we try to create them or keep up with them. A wide range of studies has focused on how content from social media can be used to detect, model and predict events and identify key topics of discussion. At the same time, very limited attention has been given so far to the quantitative study of the everyday, which has fascinated qualitative human geography research in the past few decades. That is partly due to the lack of a formal definition of what constitutes the everyday. In this paper, we aim to advance our understanding of the everyday, not by reducing it to any kind of definition but by bringing it into view through a quantitative analysis. We hypothesise that the by-products of current methods focused on event detection might be used to quantitatively explore everyday geographies as represented through Twitter data. We consider the use of both statistical approaches based on term frequency and state-of-the-art large language models, and we conduct a case study on content posted on Twitter and geolocated in the city of Leicester. Our paper makes two key advances for research concerned with the everyday and the analysis of geographic information. First, we illustrate how large language models combined with spatial analysis and visualisation can foster the study of everyday geographies, providing an insight into the still elusive concept of the everyday, representing what other approaches to the everyday have struggled to qualify. Secondly, we showcase the potential held by large language models and visual analytics in democratising sophisticated natural language processing and thus providing new tools for research in human geography.",
    "authors": [
        "Stefano De Sabbata",
        "Katy Bennett",
        "Zoe Gardner"
    ],
    "venue": "Environment and Planning B Urban Analytics and City Science",
    "year": 2023,
    "tldr": null,
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}