{
    "acronym": "a0e7f328781eda3e3dc919c77bd1eedb99b99612",
    "title": "S2IP-LLM: Semantic Space Informed Prompt Learning with LLM for Time Series Forecasting",
    "seed_ids": [
        "gpt2",
        "afeeb8f5018eebb1a1d334b94dbbfc48d167efef",
        "83ac79bb8e8695fb3c3c024be74790d862adea74",
        "16f01c1b3ddd0b2abd5ddfe4fdb3f74767607277",
        "d84cf745c534c010b8e55e5a4a04878906848dc3",
        "5b7f5488c380cf5085a5dd93e993ad293b225eee",
        "863171ed35ca0035074f73bb202b153cc346f2f3",
        "3aa2c10dd6c72267ea8a622c8f30b3c9240d5fab",
        "8064d3873c646dc9ff949d72c54c634a906fc092",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a0e7f328781eda3e3dc919c77bd1eedb99b99612",
    "abstract": "Recently, there has been a growing interest in leveraging pre-trained large language models (LLMs) for various time series applications. However, the semantic space of LLMs, established through the pre-training, is still underexplored and may help yield more distinctive and informative representations to facilitate time series forecasting. To this end, we propose Semantic Space Informed Prompt learning with LLM ($S^2$IP-LLM) to align the pre-trained semantic space with time series embeddings space and perform time series forecasting based on learned prompts from the joint space. We first design a tokenization module tailored for cross-modality alignment, which explicitly concatenates patches of decomposed time series components to create embeddings that effectively encode the temporal dynamics. Next, we leverage the pre-trained word token embeddings to derive semantic anchors and align selected anchors with time series embeddings by maximizing the cosine similarity in the joint space. This way, $S^2$IP-LLM can retrieve relevant semantic anchors as prompts to provide strong indicators (context) for time series that exhibit different temporal dynamics. With thorough empirical studies on multiple benchmark datasets, we demonstrate that the proposed $S^2$IP-LLM can achieve superior forecasting performance over state-of-the-art baselines. Furthermore, our ablation studies and visualizations verify the necessity of prompt learning informed by semantic space.",
    "authors": [
        "Zijie Pan",
        "Yushan Jiang",
        "Sahil Garg",
        "Anderson Schneider",
        "Yuriy Nevmyvaka",
        "Dongjin Song"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes Semantic Space Informed Prompt learning with LLM ($S^2$IP-LLM) to align the pre-trained semantic space with time series embeddings space and perform time series forecasting based on learned prompts from the joint space."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}