{
    "acronym": "a1455ebf34e25cf0c6db4573258bb09d49f0b77c",
    "title": "Mamba State-Space Models Can Be Strong Downstream Learners",
    "seed_ids": [
        "gpt3",
        "mamba",
        "jamba",
        "canmambaicl",
        "cbaf689fd9ea9bc939510019d90535d6249b3367",
        "319762c8841f8e1e413642bc551ed748add4777b",
        "2dda6da7375bf5e8bcf60f87b17ba10757f3bc57",
        "9da427202cc48370fd66359f5d72ff5ff3bc8b57",
        "57a6c75ebb987ea29a1f904de23f72451e095032",
        "ac45bbf9940512d9d686cf8cd3a95969bc313570",
        "189fde3f4dfa105bb51472a8945618f395919560",
        "1df04f33a8ef313cc2067147dbb79c3ca7c5c99f",
        "3169a2478154e26fd7f63fdf43cf3a24f1007962",
        "b24e899ec0f77eef2fc87a9b8e50516367aa1f97",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "a1455ebf34e25cf0c6db4573258bb09d49f0b77c",
    "abstract": "Mamba state-space models (SSMs) have recently outperformed state-of-the-art (SOTA) Transformer large language models (LLMs) in various tasks and been widely adapted. However, Mamba's downstream learning capabilities remain either unexplored$\\unicode{x2013}$e.g., mixed-precision (MPFT) and parameter-efficient fine-tuning (PEFT)--or under-evaluated$\\unicode{x2013}$e.g., in-context learning (ICL). For the latter, recent works reported Mamba's ICL rivals SOTA Transformer LLMs using non-standard benchmarks. In contrast, we show that on standard benchmarks, pretrained Mamba models achieve only 38% of the ICL performance improvements (over zero-shot) of comparable Transformers. Enabling MPFT and PEFT in Mamba architectures is challenging due to recurrent dynamics and highly customized CUDA kernels, respectively. However, we prove that Mamba's recurrent dynamics are robust to small input changes using dynamical systems theory. Empirically, we show that performance changes in Mamba's inference and fine-tuning due to mixed-precision align with Transformer LLMs. Furthermore, we show that targeting key memory buffers in Mamba's customized CUDA kernels for low-rank adaptation regularizes SSM parameters, thus achieving parameter efficiency while retaining speedups. We show that combining MPFT and PEFT enables up to 2.15 times more tokens-per-second and 65.5% reduced per-token-memory compared to full Mamba fine-tuning, while achieving up to 81.5% of the ICL performance improvements (over zero-shot) of comparably fine-tuned Transformers.",
    "authors": [
        "John T. Halloran",
        "Manbir Gulati",
        "Paul F. Roysdon"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is proved that Mamba's recurrent dynamics are robust to small input changes using dynamical systems theory and targeting key memory buffers in Mamba's customized CUDA kernels for low-rank adaptation regularizes SSM parameters, thus achieving parameter efficiency while retaining speedups."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}