{
    "acronym": "a19463a5cefd4c2eb98a529e7a78fcac70e284cd",
    "title": "A Reconfigurable Framework for Neural Network Based Video In-Loop Filtering",
    "seed_ids": [
        "metaformer",
        "0d508600d77d8a7e6a655cdb6d139779732f649f",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "6f68e1bb253925d8431588555d3010419f322e04"
    ],
    "s2id": "a19463a5cefd4c2eb98a529e7a78fcac70e284cd",
    "abstract": "This article proposes a reconfigurable framework for neural network based video in-loop filtering to guide large-scale models for content-aware processing. Specifically, the backbone neural model is decomposed into several convolutional groups and the encoder systematically traverses all candidate configurations combined by these groups to find the best one. The selected configuration index is then encapsulated as side information and passed to the decoder, enabling dynamic model reconfiguration during the decoding stage. The preceding reconfiguration process is only deployed in the inference stage on top of a pre-trained backbone model. Furthermore, we devise WMSPFormer, a wavelet multi-scale Poolformer, as the backbone network structure. WMSPFormer utilizes a wavelet-based multi-scale structure to losslessly decompose the input into multiple scales for spatial-spectral features aggregation. Moreover, it uses multi-scale pooling operations (MSPoolformer) instead of complicated matrix calculations to substitute the attention process. We also extend MSPoolformer to a large-scale version using more parameters, referred to as MSPoolformerExt. Extensive experiments demonstrate that the proposed WMSPFormer+Reconfig. and WMSPFormerExt+Reconfig. achieve a remarkable 7.13% and 7.92% BD-Rate reduction over the anchor H.266/VVC, outperforming most existing methods evaluated under the same training and testing conditions. In addition, the low-complexity nature of the WMSPFormer series makes it attractive for practical applications.",
    "authors": [
        "Yichi Zhang",
        "Dandan Ding",
        "Zhan Ma",
        "Zhu Li"
    ],
    "venue": "ACM Trans. Multim. Comput. Commun. Appl.",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A reconfigurable framework for neural network based video in-loop filtering to guide large-scale models for content-aware processing by decomposed into several convolutional groups and passed to the decoder, enabling dynamic model reconfiguration during the decoding stage."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}