{
    "acronym": "a1a05b4c7e8adfe15345885da40c73c12f189e39",
    "title": "Actions Speak Louder than Words: Trillion-Parameter Sequential Transducers for Generative Recommendations",
    "seed_ids": [
        "gpt3",
        "flash",
        "22b58dce1a13382418b8372bbd50ed3b2533f899",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "cbf3bf8f541f5b446c59c8deacbcc18527768c75",
        "dc0102a51a9d33e104a4a3808a18cf17f057228c",
        "53c3940f35b8b45d55ed49056282e1961954513d",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "690edf44e8739fd80bdfb76f40c9a4a222f3bba8"
    ],
    "s2id": "a1a05b4c7e8adfe15345885da40c73c12f189e39",
    "abstract": "Large-scale recommendation systems are characterized by their reliance on high cardinality, heterogeneous features and the need to handle tens of billions of user actions on a daily basis. Despite being trained on huge volume of data with thousands of features, most Deep Learning Recommendation Models (DLRMs) in industry fail to scale with compute. Inspired by success achieved by Transformers in language and vision domains, we revisit fundamental design choices in recommendation systems. We reformulate recommendation problems as sequential transduction tasks within a generative modeling framework (\"Generative Recommenders\"), and propose a new architecture, HSTU, designed for high cardinality, non-stationary streaming recommendation data. HSTU outperforms baselines over synthetic and public datasets by up to 65.8% in NDCG, and is 5.3x to 15.2x faster than FlashAttention2-based Transformers on 8192 length sequences. HSTU-based Generative Recommenders, with 1.5 trillion parameters, improve metrics in online A/B tests by 12.4% and have been deployed on multiple surfaces of a large internet platform with billions of users. More importantly, the model quality of Generative Recommenders empirically scales as a power-law of training compute across three orders of magnitude, up to GPT-3/LLaMa-2 scale, which reduces carbon footprint needed for future model developments, and further paves the way for the first foundational models in recommendations.",
    "authors": [
        "Jiaqi Zhai",
        "Lucy Liao",
        "Xing Liu",
        "Yueming Wang",
        "Rui Li",
        "Xuan Cao",
        "Leon Gao",
        "Zhaojie Gong",
        "Fangda Gu",
        "Michael He",
        "Yin-Hua Lu",
        "Yu Shi"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The model quality of Generative Recommenders empirically scales as a power-law of training compute across three orders of magnitude, up to GPT-3/LLaMa-2 scale, which reduces carbon footprint needed for future model developments, and further paves the way for the first foundational models in recommendations."
    },
    "citationCount": 8,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}