{
    "acronym": "a20e7e5e4338644d24145e71a9b89100af87e5d0",
    "title": "DeCap: Decoding CLIP Latents for Zero-Shot Captioning via Text-Only Training",
    "seed_ids": [
        "gpt2",
        "05bcf9999525656cfaa59bc71f8572d771ff3776",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "ada81a4de88a6ce474df2e2446ad11fea480616e",
        "838a2297b94f7bad96c4f8370a5f58487f194f44",
        "5e00596fa946670d894b1bdaeff5a98e3867ef13",
        "70557ea6b65846fc30729ceed224acd4ac64ca5d",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a20e7e5e4338644d24145e71a9b89100af87e5d0",
    "abstract": "Large-scale pre-trained multi-modal models (e.g., CLIP) demonstrate strong zero-shot transfer capability in many discriminative tasks. Their adaptation to zero-shot image-conditioned text generation tasks has drawn increasing interest. Prior arts approach to zero-shot captioning by either utilizing the existing large language models (e.g., GPT-2) or pre-training the encoder-decoder network in an end-to-end manner. In this work, we propose a simple framework, named DeCap, for zero-shot captioning. We introduce a lightweight visual-aware language decoder. This decoder is both data-efficient and computation-efficient: 1) it only requires the text data for training, easing the burden on the collection of paired data. 2) it does not require end-to-end training. When trained with text-only data, the decoder takes the text embedding extracted from the off-the-shelf CLIP encoder as a prefix embedding. The challenge is that the decoder is trained on the text corpus but at the inference stage, it needs to generate captions based on visual inputs. The modality gap issue is widely observed in multi-modal contrastive models that prevents us from directly taking the visual embedding as the prefix embedding. We propose a training-free mechanism to reduce the modality gap. We project the visual embedding into the CLIP text embedding space, while the projected embedding retains the information of the visual input. Taking the projected embedding as the prefix embedding, the decoder generates high-quality descriptions that match the visual input. The experiments show that DeCap outperforms other zero-shot captioning methods and unpaired captioning methods on the typical image captioning benchmarks, i.e., MSCOCO and NoCaps.",
    "authors": [
        "Wei Li",
        "Linchao Zhu",
        "Longyin Wen",
        "Yi Yang"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a lightweight visual-aware language decoder that only requires the text data for training, easing the burden on the collection of paired data, and proposes a training-free mechanism to reduce the modality gap."
    },
    "citationCount": 45,
    "influentialCitationCount": 8,
    "code": null,
    "description": null,
    "url": null
}