{
    "acronym": "a211cad31f834ada815b55e38b3c1a5222234f50",
    "title": "HCPM: Hierarchical Candidates Pruning for Efficient Detector-Free Matching",
    "seed_ids": [
        "lineartransformer",
        "a6159daf277e73ca511da98a0d05432f6bab0de7",
        "0d5c74ce06a32078cd1ad6ee518af088c7dd54e9",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "221e3f9f9c6e68eb68dd7084ef8e1e692869da85",
        "0d9b8ccb1135b8e380dd8015b080158c6aae3ae5",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "54983a66dc8bc15af89890bc9e1a63e056594179"
    ],
    "s2id": "a211cad31f834ada815b55e38b3c1a5222234f50",
    "abstract": "Deep learning-based image matching methods play a crucial role in computer vision, yet they often suffer from substantial computational demands. To tackle this challenge, we present HCPM, an efficient and detector-free local feature-matching method that employs hierarchical pruning to optimize the matching pipeline. In contrast to recent detector-free methods that depend on an exhaustive set of coarse-level candidates for matching, HCPM selectively concentrates on a concise subset of informative candidates, resulting in fewer computational candidates and enhanced matching efficiency. The method comprises a self-pruning stage for selecting reliable candidates and an interactive-pruning stage that identifies correlated patches at the coarse level. Our results reveal that HCPM significantly surpasses existing methods in terms of speed while maintaining high accuracy. The source code will be made available upon publication.",
    "authors": [
        "Ying Chen",
        "Yong Liu",
        "Kai Wu",
        "Qiang Nie",
        "Shang Xu",
        "Huifang Ma",
        "Bing Wang",
        "Chengjie Wang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "HCPM is an efficient and detector-free local feature-matching method that employs hierarchical pruning to optimize the matching pipeline and significantly surpasses existing methods in terms of speed while maintaining high accuracy."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}