{
    "acronym": "a25be4db3b13f1a83a77c045fe4211e2f79717f1",
    "title": "ClinicalMamba: A Generative Clinical Language Model on Longitudinal Clinical Notes",
    "seed_ids": [
        "mamba",
        "d5e7c9eb41061be87d770cca7730f47d69a0cef7",
        "f30e95be411456a709e7cb9a8b3a3e557bd0356a",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "7e9ff94476f41041c75e253e84f487db00e9c861"
    ],
    "s2id": "a25be4db3b13f1a83a77c045fe4211e2f79717f1",
    "abstract": "The advancement of natural language processing (NLP) systems in healthcare hinges on language models’ ability to interpret the intricate information contained within clinical notes. This process often requires integrating information from various time points in a patient’s medical history. However, most earlier clinical language models were pretrained with a context length limited to roughly one clinical document. In this study, We introduce ClinicalMamba, a specialized version of the Mamba language model, pretrained on a vast corpus of longitudinal clinical notes to address the unique linguistic characteristics and information processing needs of the medical domain. ClinicalMamba models, with 130 million and 2.8 billion parameters, demonstrate superior performance in modeling clinical language across extended text lengths compared to Mamba and other clinical models based on longformer and Llama. With few-shot learning, ClinicalMamba achieves notable benchmarks in speed and performance, outperforming existing clinical language models and large language models like GPT-4 in longitudinal clinical tasks.",
    "authors": [
        "Zhichao Yang",
        "Avijit Mitra",
        "Sunjae Kwon",
        "Hong Yu"
    ],
    "venue": "Clinical Natural Language Processing Workshop",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "ClinicalMamba, a specialized version of the Mamba language model, pretrained on a vast corpus of longitudinal clinical notes to address the unique linguistic characteristics and information processing needs of the medical domain, achieves notable benchmarks in speed and performance."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}