{
    "acronym": "a275071f9b02fd9f194ba0cfbefe1d662a7ed7e9",
    "title": "We Care: Multimodal Depression Detection and Knowledge Infused Mental Health Therapeutic Response Generation",
    "seed_ids": [
        "bert"
    ],
    "s2id": "a275071f9b02fd9f194ba0cfbefe1d662a7ed7e9",
    "abstract": "The detection of depression through non-verbal cues has gained significant attention. Previous research predominantly centred on identifying depression within the confines of controlled laboratory environments, often with the supervision of psychologists or counsellors. Unfortunately, datasets generated in such controlled settings may struggle to account for individual behaviours in real-life situations. In response to this limitation, we present the Extended D-vlog dataset, encompassing a collection of 1, 261 YouTube vlogs. Additionally, the emergence of large language models (LLMs) like GPT3.5, and GPT4 has sparked interest in their potential they can act like mental health professionals. Yet, the readiness of these LLM models to be used in real-life settings is still a concern as they can give wrong responses that can harm the users. We introduce a virtual agent serving as an initial contact for mental health patients, offering Cognitive Behavioral Therapy (CBT)-based responses. It comprises two core functions: 1. Identifying depression in individuals, and 2. Delivering CBT-based therapeutic responses. Our Mistral model achieved impressive scores of 70.1% and 30.9% for distortion assessment and classification, along with a Bert score of 88.7%. Moreover, utilizing the TVLT model on our Multimodal Extended D-vlog Dataset yielded outstanding results, with an impressive F1-score of 67.8%",
    "authors": [
        "Palash Moon",
        "Pushpak Bhattacharyya"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A virtual agent is introduced serving as an initial contact for mental health patients, offering Cognitive Behavioral Therapy (CBT)-based responses, and comprises two core functions: Identifying depression in individuals, and delivering CBT-based therapeutic responses."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}