{
    "acronym": "a283af2f729c71470d83b07ddebbb6e8011f383d",
    "title": "Are Current Task-oriented Dialogue Systems Able to Satisfy Impolite Users?",
    "seed_ids": [
        "gpt2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "791c3c30f2af10ac06f4fbc5b1e8960064aacbc7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a283af2f729c71470d83b07ddebbb6e8011f383d",
    "abstract": "Task-oriented dialogue (TOD) systems have assisted users on many tasks, including ticket booking and service inquiries. While existing TOD systems have shown promising performance in serving customer needs, these systems mostly assume that users would interact with the dialogue agent politely. This assumption is unrealistic as impatient or frustrated customers may also interact with TOD systems impolitely. This paper aims to address this research gap by investigating impolite users' effects on TOD systems. Specifically, we constructed an impolite dialogue corpus and conducted extensive experiments to evaluate the state-of-the-art TOD systems on our impolite dialogue corpus. Our experimental results show that existing TOD systems are unable to handle impolite user utterances. We also present a data augmentation method to improve TOD performance in impolite dialogues. Nevertheless, handling impolite dialogues remains a very challenging research task. We hope by releasing the impolite dialogue corpus and establishing the benchmark evaluations, more researchers are encouraged to investigate this new challenging research task.",
    "authors": [
        "Zhiqiang Hu",
        "R. Lee",
        "Nancy F. Chen"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper constructed an impolite dialogue corpus and conducted extensive experiments to evaluate the state-of-the-art TOD systems on the basis of this corpus and presents a data augmentation method to improve TOD performance in impolites dialogues."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}