{
    "acronym": "a2b529b9916b5ac8d6dd9ead56a796ad259a822a",
    "title": "Gradable ChatGPT Translation Evaluation",
    "seed_ids": [
        "gpt3",
        "4161ad2d2495d8af1d62dc5e71882bde642cd1c1",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "5548d8a116dff78827d658ef0bbf3fa0dcaec8f1",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "a2b529b9916b5ac8d6dd9ead56a796ad259a822a",
    "abstract": "ChatGPT, as a language model based on large-scale pre-training, has exerted a profound influence on the domain of machine translation. In ChatGPT, a\"Prompt\"refers to a segment of text or instruction employed to steer the model towards generating a specific category of response. The design of the translation prompt emerges as a key aspect that can wield influence over factors such as the style, precision and accuracy of the translation to a certain extent. However, there is a lack of a common standard and methodology on how to design and select a translation prompt. Accordingly, this paper proposes a generic taxonomy, which defines gradable translation prompts in terms of expression type, translation style, POS information and explicit statement, thus facilitating the construction of prompts endowed with distinct attributes tailored for various translation tasks. Specific experiments and cases are selected to validate and illustrate the effectiveness of the method.",
    "authors": [
        "Hui Jiao",
        "Bei Peng",
        "Lu Zong",
        "Xiaojun Zhang",
        "Xinwei Li"
    ],
    "venue": "Proces. del Leng. Natural",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A generic taxonomy is proposed, which defines gradable translation prompts in terms of expression type, translation style, POS information and explicit statement, thus facilitating the construction of prompts endowed with distinct attributes tailored for various translation tasks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}