{
    "acronym": "a2ca24ae72fbbc54d41083307fc2a24d12f4f23c",
    "title": "TURNA: A Turkish Encoder-Decoder Language Model for Enhanced Understanding and Generation",
    "seed_ids": [
        "bert",
        "b21670e8061a06ab97e7d6052c9345a326e84ff8",
        "2a218786f4615b82389f78472e7ff22e6ce57490",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a2ca24ae72fbbc54d41083307fc2a24d12f4f23c",
    "abstract": "The recent advances in natural language processing have predominantly favored well-resourced English-centric models, resulting in a significant gap with low-resource languages. In this work, we introduce the language model TURNA, which is developed for the low-resource language Turkish and is capable of both natural language understanding and generation tasks. TURNA is pretrained with an encoder-decoder architecture based on the unified framework UL2 with a diverse corpus that we specifically curated for this purpose. We evaluated TURNA with three generation tasks and five understanding tasks for Turkish. The results show that TURNA outperforms several multilingual models in both understanding and generation tasks, and competes with monolingual Turkish models in understanding tasks. TURNA is made available at https://huggingface.co/boun-tabi-LMG/TURNA .",
    "authors": [
        "Gokcce Uludougan",
        "Zeynep Yirmibecsouglu Balal",
        "Furkan Akkurt",
        "Melikcsah Turker",
        "Onur Gungor",
        "S. Uskudarli"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The language model TURNA is introduced, which is developed for the low-resource language Turkish and is capable of both natural language understanding and generation tasks, and competes with monolingual Turkish models in understanding tasks."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}