{
    "acronym": "a2d534fda2eafabf5ac19934ce500cd975e33030",
    "title": "Adapting a Language Model for Controlled Affective Text Generation",
    "seed_ids": [
        "gpt",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a2d534fda2eafabf5ac19934ce500cd975e33030",
    "abstract": "Human use language not just to convey information but also to express their inner feelings and mental states. In this work, we adapt the state-of-the-art language generation models to generate affective (emotional) text. We posit a model capable of generating affect-driven and topic focused sentences without losing grammatical correctness as the affect intensity increases. We propose to incorporate emotion as prior for the probabilistic state-of-the-art text generation model such as GPT-2. The model gives a user the flexibility to control the category and intensity of emotion as well as the topic of the generated text. Previous attempts at modelling fine-grained emotions fall out on grammatical correctness at extreme intensities, but our model is resilient to this and delivers robust results at all intensities. We conduct automated evaluations and human studies to test the performance of our model, and provide a detailed comparison of the results with other models. In all evaluations, our model outperforms existing affective text generation models.",
    "authors": [
        "Ishika Singh",
        "Ahsan Barkati",
        "Tushar Goswamy",
        "Ashutosh Modi"
    ],
    "venue": "International Conference on Computational Linguistics",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes to incorporate emotion as prior for the probabilistic state-of-the-art text generation model such as GPT-2 to give a user the flexibility to control the category and intensity of emotion as well as the topic of the generated text."
    },
    "citationCount": 26,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}