{
    "acronym": "a2e92c76a070b72202d41613eb3b9ba7031af907",
    "title": "Comparative analysis of classification techniques for topic-based biomedical literature categorisation",
    "seed_ids": [
        "longformer",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "a2e92c76a070b72202d41613eb3b9ba7031af907",
    "abstract": "Introduction: Scientific articles serve as vital sources of biomedical information, but with the yearly growth in publication volume, processing such vast amounts of information has become increasingly challenging. This difficulty is particularly pronounced when it requires the expertise of highly qualified professionals. Our research focused on the domain-specific articles classification to determine whether they contain information about drug-induced liver injury (DILI). DILI is a clinically significant condition and one of the reasons for drug registration failures. The rapid and accurate identification of drugs that may cause such conditions can prevent side effects in millions of patients. Methods: Developing a text classification method can help regulators, such as the FDA, much faster at a massive scale identify facts of potential DILI of concrete drugs. In our study, we compared several text classification methodologies, including transformers, LSTMs, information theory, and statistics-based methods. We devised a simple and interpretable text classification method that is as fast as Naïve Bayes while delivering superior performance for topic-oriented text categorisation. Moreover, we revisited techniques and methodologies to handle the imbalance of the data. Results: Transformers achieve the best results in cases if the distribution of classes and semantics of test data matches the training set. But in cases of imbalanced data, simple statistical-information theory-based models can surpass complex transformers, bringing more interpretable results that are so important for the biomedical domain. As our results show, neural networks can achieve better results if they are pre-trained on domain-specific data, and the loss function was designed to reflect the class distribution. Discussion: Overall, transformers are powerful architecture, however, in certain cases, such as topic classification, its usage can be redundant and simple statistical approaches can achieve compatible results while being much faster and explainable. However, we see potential in combining results from both worlds. Development of new neural network architectures, loss functions and training procedures that bring stability to unbalanced data is a promising topic of development.",
    "authors": [
        "Ihor Stepanov",
        "Arsentii Ivasiuk",
        "Oleksandr Yavorskyi",
        "Alina Frolova"
    ],
    "venue": "Frontiers in Genetics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This research focused on the domain-specific articles classification to determine whether they contain information about drug-induced liver injury, and devised a simple and interpretable text classification method that is as fast as Naïve Bayes while delivering superior performance for topic-oriented text categorisation."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}