{
    "acronym": "a3184d40d390793232c99c89b57b8f65c16320b2",
    "title": "ERNIE 3.0 Titan: Exploring Larger-scale Knowledge Enhanced Pre-training for Language Understanding and Generation",
    "seed_ids": [
        "transformerxl",
        "24e775b20adf21e9b5b95c6a9b7a5c164d055849",
        "319b84be7a843250bc81d7086f79a4126d550277",
        "04b40daa1ca74bdbb578beb314bf662538ecd18e",
        "afad10da0a3b83a4f2a94e8c16c84ac64338e9fe",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "c6c734e16f66fbfcefac7625cc64599e83292c1e",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "80cf2a6af4200ecfca1c18fc89de16148f1cd4bf",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a3184d40d390793232c99c89b57b8f65c16320b2",
    "abstract": "Pre-trained language models have achieved state-of-the-art results in various Natural Language Processing (NLP) tasks. GPT-3 has shown that scaling up pre-trained language models can further exploit their enormous potential. A unified framework named ERNIE 3.0 was recently proposed for pre-training large-scale knowledge enhanced models and trained a model with 10 billion parameters. ERNIE 3.0 outperformed the state-of-the-art models on various NLP tasks. In order to explore the performance of scaling up ERNIE 3.0, we train a hundred-billion-parameter model called ERNIE 3.0 Titan with up to 260 billion parameters on the PaddlePaddle platform. Furthermore, we design a self-supervised adversarial loss and a controllable language modeling loss to make ERNIE 3.0 Titan generate credible and controllable texts. To reduce the computation overhead and carbon emission, we propose an online distillation framework for ERNIE 3.0 Titan, where the teacher model will teach students and train itself simultaneously. ERNIE 3.0 Titan is the largest Chinese dense pre-trained model so far. Empirical results show that the ERNIE 3.0 Titan outperforms the state-of-the-art models on 68 NLP datasets.",
    "authors": [
        "Shuohuan Wang",
        "Yu Sun",
        "Yang Xiang",
        "Zhihua Wu",
        "Siyu Ding",
        "Weibao Gong",
        "Shi Feng",
        "Junyuan Shang",
        "Yanbin Zhao",
        "Chao Pang",
        "Jiaxiang Liu",
        "Xuyi Chen",
        "Yuxiang Lu",
        "Weixin Liu",
        "Xi Wang",
        "Yangfan Bai",
        "Qiuliang Chen",
        "Li Zhao",
        "Shiyong Li",
        "Peng Sun",
        "Dianhai Yu",
        "Yanjun Ma",
        "Hao Tian",
        "Hua Wu",
        "Tian Wu",
        "Wei Zeng",
        "Ge Li",
        "Wen Gao",
        "Haifeng Wang"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A hundred-billion-parameter model called ERNIE 3.0 Titan with up to 260 billion parameters is trained, which is the largest Chinese dense pre-trained model so far and outperforms the state-of-the-art models on 68 NLP datasets."
    },
    "citationCount": 60,
    "influentialCitationCount": 18,
    "code": null,
    "description": null,
    "url": null
}