{
    "acronym": "a342b93c073f91c3adcc1c2ba1e936373b2f5480",
    "title": "Semantic-Enhanced Variational Graph Autoencoder for Movie Recommendation: An Innovative Approach Integrating Plot Summary Information and Contrastive Learning Strategy",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "a342b93c073f91c3adcc1c2ba1e936373b2f5480",
    "abstract": "This study introduces a novel movie recommender system utilizing a Semantic-Enhanced Variational Graph Autoencoder for Movie Recommendation (SeVGAER) architecture. The system harnesses additional information from movie plot summaries scraped from the internet, transformed into semantic vectors via a large language model. These vectors serve as supplementary features for movie nodes in the SeVGAER-based recommender. The system incorporates an encoder-decoder structure, operating on a user-movie bipartite graph, and employs GraphSAGE convolutional layers with modified aggregators as the encoder to extract latent representations of the nodes, and a Multi-Layer Perceptron (MLP) as the decoder to predict ratings with additional graph-based features. To address overfitting and improve model generalization, a novel training strategy is introduced. We employ a random data splitting approach, dividing the dataset into two halves for each training instance. The model then generates outputs on each half of the data, and a new loss function is introduced to ensure consistency between these two outputs, a strategy that can be seen as a form of contrastive learning. The model’s performance is optimized using a combination of this new contrastive loss, graph reconstruction loss, and KL divergence loss. Experiments conducted on the Movielens100k dataset demonstrate the effectiveness of this approach in enhancing movie recommendation performance",
    "authors": [
        "Mingye Wang",
        "Xiaohui Hu",
        "Pan Xie",
        "Yao Du"
    ],
    "venue": "Information Technology and Control",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}