{
    "acronym": "a3c24b0c2b5f1893fdbd4677ba2cdb1fe3409fb0",
    "title": "A Conversational Brain-Artificial Intelligence Interface",
    "seed_ids": [
        "gpt3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a3c24b0c2b5f1893fdbd4677ba2cdb1fe3409fb0",
    "abstract": "We introduce Brain-Artificial Intelligence Interfaces (BAIs) as a new class of Brain-Computer Interfaces (BCIs). Unlike conventional BCIs, which rely on intact cognitive capabilities, BAIs leverage the power of artificial intelligence to replace parts of the neuro-cognitive processing pipeline. BAIs allow users to accomplish complex tasks by providing high-level intentions, while a pre-trained AI agent determines low-level details. This approach enlarges the target audience of BCIs to individuals with cognitive impairments, a population often excluded from the benefits of conventional BCIs. We present the general concept of BAIs and illustrate the potential of this new approach with a Conversational BAI based on EEG. In particular, we show in an experiment with simulated phone conversations that the Conversational BAI enables complex communication without the need to generate language. Our work thus demonstrates, for the first time, the ability of a speech neuroprosthesis to enable fluent communication in realistic scenarios with non-invasive technologies.",
    "authors": [
        "Anja Meunier",
        "Michal Robert Zák",
        "Lucas Munz",
        "Sofiya Garkot",
        "Manuel Eder",
        "Jiachen Xu",
        "Moritz Grosse-Wentrup"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown in an experiment with simulated phone conversations that the Conversational BAI enables complex communication without the need to generate language, and demonstrates, for the first time, the ability of a speech neuroprosthesis to enable fluent communication in realistic scenarios with non-invasive technologies."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}