{
    "acronym": "a3e7714865d0d56cd0139617a045108eed46a03c",
    "title": "TrustAI at SemEval-2024 Task 8: A Comprehensive Analysis of Multi-domain Machine Generated Text Detection Techniques",
    "seed_ids": [
        "bert",
        "23447f473cd240494b0a20ea008038aaef7e3391",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a3e7714865d0d56cd0139617a045108eed46a03c",
    "abstract": "The Large Language Models (LLMs) exhibit remarkable ability to generate fluent content across a wide spectrum of user queries. However, this capability has raised concerns regarding misinformation and personal information leakage. In this paper, we present our methods for the SemEval2024 Task8, aiming to detect machine-generated text across various domains in both mono-lingual and multi-lingual contexts. Our study comprehensively analyzes various methods to detect machine-generated text, including statistical, neural, and pre-trained model approaches. We also detail our experimental setup and perform a in-depth error analysis to evaluate the effectiveness of these methods. Our methods obtain an accuracy of 86.9% on the test set of subtask-A mono and 83.7% for subtask-B. Furthermore, we also highlight the challenges and essential factors for consideration in future studies.",
    "authors": [
        "Ashok Urlana",
        "Aditya Saibewar",
        "B. Garlapati",
        "Charaka Vinayak Kumar",
        "Ajeet Kumar Singh",
        "S. Chalamala"
    ],
    "venue": "International Workshop on Semantic Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper comprehensively analyzes various methods to detect machine-generated text, including statistical, neural, and pre-trained model approaches for the SemEval2024 Task8, aiming to detect machine-generated text across various domains in both mono-lingual and multi-lingual contexts."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}