{
    "acronym": "a40074004a2166c14604ddf16f54729a7ed7bc59",
    "title": "Combining Constrained Diffusion Models and Numerical Solvers for Efficient and Robust Non-Convex Trajectory Optimization",
    "seed_ids": [
        "classfreediffu",
        "74d4de69a1a81ad9a76abbfcffa24e186e96afd3",
        "5f90d43e6ece5c6ee6e8186e4b57d46c85377713",
        "15736f7c205d961c00378a938daffaacb5a0718d"
    ],
    "s2id": "a40074004a2166c14604ddf16f54729a7ed7bc59",
    "abstract": "Motivated by the need to solve open-loop optimal control problems with computational efficiency and reliable constraint satisfaction, we introduce a general framework that combines diffusion models and numerical optimization solvers. Optimal control problems are rarely solvable in closed form, hence they are often transcribed into numerical trajectory optimization problems, which then require initial guesses. These initial guesses are supplied in our framework by diffusion models. To mitigate the effect of samples that violate the problem constraints, we develop a novel constrained diffusion model to approximate the true distribution of locally optimal solutions with an additional constraint violation loss in training. To further enhance the robustness, the diffusion samples as initial guesses are fed to the numerical solver to refine and derive final optimal (and hence feasible) solutions. Experimental evaluations on three tasks verify the improved constraint satisfaction and computational efficiency with 4$\\times$ to 30$\\times$ acceleration using our proposed framework, which generalizes across trajectory optimization problems and scales well with problem complexity.",
    "authors": [
        "Anjian Li",
        "Zihan Ding",
        "Adji B. Dieng",
        "Ryne Beeson"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel constrained diffusion model is developed to approximate the true distribution of locally optimal solutions with an additional constraint violation loss in training to enhance the robustness and mitigate the effect of samples that violate the problem constraints."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}