{
    "acronym": "a405b19f43f2e461e8e3b5681b3890b51ce1113f",
    "title": "Why Warmup the Learning Rate? Underlying Mechanisms and Improvements",
    "seed_ids": [
        "transformer",
        "5c326260baa5e91a6a39c4d87ebe6770ade86816",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a405b19f43f2e461e8e3b5681b3890b51ce1113f",
    "abstract": "It is common in deep learning to warm up the learning rate $\\eta$, often by a linear schedule between $\\eta_{\\text{init}} = 0$ and a predetermined target $\\eta_{\\text{trgt}}$. In this paper, we show through systematic experiments using SGD and Adam that the overwhelming benefit of warmup arises from allowing the network to tolerate larger $\\eta_{\\text{trgt}}$ by forcing the network to more well-conditioned areas of the loss landscape. The ability to handle larger $\\eta_{\\text{trgt}}$ makes hyperparameter tuning more robust while improving the final performance. We uncover different regimes of operation during the warmup period, depending on whether training starts off in a progressive sharpening or sharpness reduction phase, which in turn depends on the initialization and parameterization. Using these insights, we show how $\\eta_{\\text{init}}$ can be properly chosen by utilizing the loss catapult mechanism, which saves on the number of warmup steps, in some cases completely eliminating the need for warmup. We also suggest an initialization for the variance in Adam which provides benefits similar to warmup.",
    "authors": [
        "Dayal Singh Kalra",
        "M. Barkeshli"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The overwhelming benefit of warmup arises from allowing the network to tolerate larger $\\eta_{\\text{trgt}}$ by forcing the network to more well-conditioned areas of the loss landscape, which makes hyperparameter tuning more robust while improving the final performance."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}