{
    "acronym": "a41a75755380327e7b4891796cc2493a8a6df284",
    "title": "Show and Write: Entity-aware News Generation with Image Information",
    "seed_ids": [
        "gpt",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a41a75755380327e7b4891796cc2493a8a6df284",
    "abstract": "Automatically writing long articles is a complex and challenging language generation task. Prior work has primarily focused on generating these articles using human-written prompt to provide some topical context and some metadata about the article. That said, for many applications, such as generating news stories, these articles are often paired with images and their captions or alt-text, which in turn are based on real-world events and may reference many different named entities that are difﬁcult to be correctly recognized and predicted by language models. To address these two problems, this paper introduces an Entity-aware News Generation method with Image iNformation, E NGIN , to incorporate news image information into language models. E NGIN produces news articles conditioned on both metadata and information such as captions and named entities extracted from images. We also propose an Entity-aware mechanism to help our model better recognize and predict the entity names in news. We perform experiments on two public large-scale news datasets, Good-News and VisualNews. Quantitative results show that our approach improves article perplexity by 4-5 points over the base models. Qualitative results demonstrate the text generated by E NGIN is more consistent with news images. We also perform article quality annotation experiment on the generated articles to validate that our model produces higher-quality articles. Finally, we investigate the effect E NGIN has on methods that automatically detect machine-generated articles.",
    "authors": [
        "Zhongping Zhang",
        "Yiwen Gu",
        "Bryan A. Plummer"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces an Entity-aware News Generation method with Image iNformation, E NGIN, to incorporate news image information into language models and proposes an Entity-aware mechanism to help the model better recognize and predict the entity names in news."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}