{
    "acronym": "a43a3fadc9190e61b34f59a913f1716e443519e4",
    "title": "On the Opportunities and Challenges of Foundation Models for Geospatial Artificial Intelligence",
    "seed_ids": [
        "gpt2",
        "2c0b112d66d70487971bc96ef8c927464af8c8a8",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "83fac78857c7e65fe10a11a798674dd3cd259c1d",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a43a3fadc9190e61b34f59a913f1716e443519e4",
    "abstract": "Large pre-trained models, also known as foundation models (FMs), are trained in a task-agnostic manner on large-scale data and can be adapted to a wide range of downstream tasks by fine-tuning, few-shot, or even zero-shot learning. Despite their successes in language and vision tasks, we have yet seen an attempt to develop foundation models for geospatial artificial intelligence (GeoAI). In this work, we explore the promises and challenges of developing multimodal foundation models for GeoAI. We first investigate the potential of many existing FMs by testing their performances on seven tasks across multiple geospatial subdomains including Geospatial Semantics, Health Geography, Urban Geography, and Remote Sensing. Our results indicate that on several geospatial tasks that only involve text modality such as toponym recognition, location description recognition, and US state-level/county-level dementia time series forecasting, these task-agnostic LLMs can outperform task-specific fully-supervised models in a zero-shot or few-shot learning setting. However, on other geospatial tasks, especially tasks that involve multiple data modalities (e.g., POI-based urban function classification, street view image-based urban noise intensity classification, and remote sensing image scene classification), existing foundation models still underperform task-specific models. Based on these observations, we propose that one of the major challenges of developing a FM for GeoAI is to address the multimodality nature of geospatial tasks. After discussing the distinct challenges of each geospatial data modality, we suggest the possibility of a multimodal foundation model which can reason over various types of geospatial data through geospatial alignments. We conclude this paper by discussing the unique risks and challenges to develop such a model for GeoAI.",
    "authors": [
        "Gengchen Mai",
        "Weiming Huang",
        "Jin Sun",
        "Suhang Song",
        "Deepak Mishra",
        "Ninghao Liu",
        "Song Gao",
        "Tianming Liu",
        "G. Cong",
        "Yingjie Hu",
        "Chris Cundy",
        "Ziyuan Li",
        "Rui Zhu",
        "Ni Lao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is proposed that one of the major challenges of developing a FM for GeoAI is to address the multimodality nature of geospatial tasks and the possibility of a multimodal foundation model which can reason over various types ofGeoAI data through geosp spatial alignments is suggested."
    },
    "citationCount": 83,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}