{
    "acronym": "a4416be650be4d7f5d55a4208f7fe6345ac4a30b",
    "title": "Intent-driven Command Recommendations for Analysts",
    "seed_ids": [
        "gpt",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a4416be650be4d7f5d55a4208f7fe6345ac4a30b",
    "abstract": "Recent times have seen data analytics software applications become an integral part of the decision-making process of analysts. The users of these software applications generate a vast amount of un-structured log data. These logs contain clues to the user intentions, which traditional recommender systems may find difficult to model implicitly from the log data. With this assumption, we would like to assist the analytics process of a user through command recommendations. We categorize the commands into software and data categories based on their purpose to fulfill the task at hand. On the premise that the sequence of commands leading up to a data command is a good predictor of the latter, we design, develop, and validate various sequence modeling techniques. In this paper, we propose a framework to provide intent-driven data command recommendations to the user by leveraging unstructured logs. We use the log data of a web-based analytics software to train our neural network models and quantify their performance, in comparison to relevant and competitive baselines. We propose a custom loss function to tailor the recommended data commands according to the intent provided exogenously. We also propose an evaluation metric that captures the degree of intent orientation of the recommendations. We demonstrate the promise of our approach by evaluating the models with the proposed metric and showcasing the robustness of our models in the case of adversarial examples, where the intent input is misaligned with the user activity.",
    "authors": [
        "Rohin Garg",
        "Samarth Aggarwal",
        "Abhilasha Sancheti",
        "Bhanu Prakash",
        "Reddy Guda",
        "I. Burhanuddin"
    ],
    "venue": "",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A framework to provide intent-driven data command recommendations to the user by leveraging unstructured logs by using the log data of a web-based analytics software to train the neural network models and quantify their performance, in comparison to relevant and competitive baselines."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}