{
    "acronym": "a44d96a9ae26d1939e12d7cb27067e594e0d8542",
    "title": "Addressing Information Inequality for Text-Based Person Search via Pedestrian-Centric Visual Denoising and Bias-Aware Alignments",
    "seed_ids": [
        "bert",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "a44d96a9ae26d1939e12d7cb27067e594e0d8542",
    "abstract": "Text-based person search is an important task in video surveillance, which aims to retrieve the corresponding pedestrian images with a given description. In this fine-grained retrieval task, accurate cross-modal information matching is an essential yet challenging problem. However, existing methods usually ignore the information inequality between modalities, which could introduce great difficulties to cross-modal matching. Specifically, in this task, the images inevitably contain some pedestrian-irrelevant noise like background and occlusion, and the descriptions could be biased to partial pedestrian content in images. With that in mind, in this paper, we propose a Text-Guided Denoising and Alignment (TGDA) model to alleviate the information inequality and realize effective cross-modal matching. In TGDA, we first design a prototype-based denoising module, which integrates pedestrian knowledge from textual features into a prototype vector and uses it as guidance to filter out pedestrian-irrelevant noise from visual features. Thereafter, a bias-aware alignment module is introduced, which guides our model to focus on the description-biased pedestrian content in cross-modal features consistently. Through extensive experiments, the effectiveness of both modules has been validated. Besides, our TGDA achieves state-of-the-art performance on various related benchmarks.",
    "authors": [
        "Liying Gao",
        "K. Niu",
        "Bingliang Jiao",
        "Peng Wang",
        "Yanning Zhang"
    ],
    "venue": "IEEE transactions on circuits and systems for video technology (Print)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Text-Guided Denoising and Alignment model, which integrates pedestrian knowledge from textual features into a prototype vector and uses it as guidance to filter out pedestrian-irrelevant noise from visual features and achieves state-of-the-art performance on various related benchmarks."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}