{
    "acronym": "a459c3b8b98b09c09e4aa3d41bff23b7479f9f7e",
    "title": "Guiding Attention in End-to-End Driving Models",
    "seed_ids": [
        "transformer",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "a459c3b8b98b09c09e4aa3d41bff23b7479f9f7e",
    "abstract": "Vision-based end-to-end driving models trained by imitation learning can lead to affordable solutions for autonomous driving. However, training these well-performing models usually requires a huge amount of data, while still lacking explicit and intuitive activation maps to reveal the inner workings of these models while driving. In this paper, we study how to guide the attention of these models to improve their driving quality and obtain more intuitive activation maps by adding a loss term during training using salient semantic maps. In contrast to previous work, our method does not require these salient semantic maps to be available during testing time, as well as removing the need to modify the model’s architecture to which it is applied. We perform tests using perfect and noisy salient semantic maps with encouraging results in both, the latter of which is inspired by possible errors encountered with real data. Using CIL++ as a representative state-of-the-art model and the CARLA simulator with its standard benchmarks, we conduct experiments that show the effectiveness of our method in training better autonomous driving models, especially when data and computational resources are scarce.",
    "authors": [
        "Diego Porres",
        "Yi Xiao",
        "Gabriel Villalonga",
        "Alexandre Levy",
        "Antonio M. L'opez"
    ],
    "venue": "2024 IEEE Intelligent Vehicles Symposium (IV)",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper studies how to guide the attention of these models to improve their driving quality and obtain more intuitive activation maps by adding a loss term during training using salient semantic maps, and demonstrates the effectiveness of this method in training better autonomous driving models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}