{
    "acronym": "a45bdbbf9a197a21ef97291c60b77de47bc51db2",
    "title": "STT: Soft Template Tuning for Few-Shot Adaptation",
    "seed_ids": [
        "gpt",
        "da454295392cf4caaa39cc465734237ffe55392f",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "b47381e04739ea3f392ba6c8faaf64105493c196"
    ],
    "s2id": "a45bdbbf9a197a21ef97291c60b77de47bc51db2",
    "abstract": "Prompt tuning has been an extremely effective tool to adapt a pre-trained model to downstream tasks. However, standard prompt-based methods mainly consider the case of sufficient data of downstream tasks. It is still unclear whether the advantage can be transferred to the few-shot regime, where only limited data are available for each downstream task. Although some works have demonstrated the potential of prompt-tuning under the few-shot setting, the main stream methods via searching discrete prompts or tuning soft prompts with limited data are still very challenging. Through extensive empirical studies, we find that there is still a gap between prompt tuning and fully fine-tuning for few-shot learning. To bridge the gap, we propose a new prompt-tuning framework, called Soft Template Tuning (STT) 1. STT combines manual and auto prompts, and treats down-stream classification tasks as a masked language modeling task. Comprehensive evaluation on different settings suggests STT can close the gap between fine-tuning and prompt-based methods without introducing additional parameters. Significantly, it can even outperform the time- and resource-consuming fine-tuning method on sentiment classification tasks.",
    "authors": [
        "Ping Yu",
        "Wei Wang",
        "Chunyuan Li",
        "Ruiyi Zhang",
        "Zhanpeng Jin",
        "Changyou Chen"
    ],
    "venue": "2022 IEEE International Conference on Data Mining Workshops (ICDMW)",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new prompt-tuning framework, called Soft Template Tuning (STT) is proposed, which combines manual and auto prompts, and treats down-stream classification tasks as a masked language modeling task and can even outperform the time- and resource-consuming fine- Tuning method on sentiment classification tasks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}