{
    "acronym": "a4715887bd5a4c328ebf1d6ebb18ab94e71ee8d8",
    "title": "MosaicBERT: A Bidirectional Encoder Optimized for Fast Pretraining",
    "seed_ids": [
        "bert",
        "alibi",
        "flashattn",
        "44b7adbd196e69c8771734aa8c9af5fd69c04370",
        "83edcfbb206ddad38a971d605da09390604248ea",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "53c3940f35b8b45d55ed49056282e1961954513d",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "79b4ec1aaf67a04a9afa0d8138f84b7be66c00cb",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "5a3749929bf5fb8b1f98a7b2a43c3b957bcf6c88"
    ],
    "s2id": "a4715887bd5a4c328ebf1d6ebb18ab94e71ee8d8",
    "abstract": "Although BERT-style encoder models are heavily used in NLP research, many researchers do not pretrain their own BERTs from scratch due to the high cost of training. In the past half-decade since BERT first rose to prominence, many advances have been made with other transformer architectures and training configurations that have yet to be systematically incorporated into BERT. Here, we introduce MosaicBERT, a BERT-style encoder architecture and training recipe that is empirically optimized for fast pretraining. This efficient architecture incorporates FlashAttention, Attention with Linear Biases (ALiBi), Gated Linear Units (GLU), a module to dynamically remove padded tokens, and low precision LayerNorm into the classic transformer encoder block. The training recipe includes a 30% masking ratio for the Masked Language Modeling (MLM) objective, bfloat16 precision, and vocabulary size optimized for GPU throughput, in addition to best-practices from RoBERTa and other encoder models. When pretrained from scratch on the C4 dataset, this base model achieves a downstream average GLUE (dev) score of 79.6 in 1.13 hours on 8 A100 80 GB GPUs at a cost of roughly $20. We plot extensive accuracy vs. pretraining speed Pareto curves and show that MosaicBERT base and large are consistently Pareto optimal when compared to a competitive BERT base and large. This empirical speed up in pretraining enables researchers and engineers to pretrain custom BERT-style models at low cost instead of finetune on existing generic models. We open source our model weights and code.",
    "authors": [
        "Jacob Portes",
        "Alex Trott",
        "Sam Havens",
        "Daniel King",
        "Abhinav Venigalla",
        "Moin Nadeem",
        "Nikhil Sardana",
        "D. Khudia",
        "Jonathan Frankle"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that MosaicBERT base and large are consistently Pareto optimal when compared to a competitive BERT base and large, enabling researchers and engineers to pretrain custom BERT-style models at low cost instead of finetune on existing generic models."
    },
    "citationCount": 6,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}