{
    "acronym": "a477ee76ed952429e106a871ae0790b6a2f5acd8",
    "title": "Super(ficial)-alignment: Strong Models May Deceive Weak Models in Weak-to-Strong Generalization",
    "seed_ids": [
        "gpt2",
        "e9aec062906c7fb16e540dc9fb7ed2cbcf129407",
        "0f7308fbcae43d22813f70c334c2425df0b1cce1",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a477ee76ed952429e106a871ae0790b6a2f5acd8",
    "abstract": "Superalignment, where humans are weak supervisors of superhuman models, has become an important and widely discussed issue in the current era of rapid development of Large Language Models (LLMs). The recent work preliminarily studies this problem by using weak models to supervise strong models. It discovers that weakly supervised strong students can consistently outperform weak teachers towards the alignment target, leading to a weak-to-strong generalization phenomenon. However, we are concerned that behind such a promising phenomenon, whether there exists an issue of weak-to-strong deception, where strong models may deceive weak models by exhibiting well-aligned in areas known to weak models but producing misaligned behaviors in cases weak models do not know. We then take an initial step towards exploring this security issue in a specific but realistic multi-objective alignment case, where there may be some alignment targets conflicting with each other (e.g., helpfulness v.s. harmlessness). Such a conflict is likely to cause strong models to deceive weak models in one alignment dimension to gain high reward in other alignment dimension. Our experiments on both the reward modeling task and the preference optimization scenario indicate: (1) the weak-to-strong deception exists; (2) the deception phenomenon may intensify as the capability gap between weak and strong models increases. We also discuss potential solutions and find bootstrapping with an intermediate model can mitigate the deception to some extent. Our work highlights the urgent need to pay more attention to the true reliability of superalignment.",
    "authors": [
        "Wenkai Yang",
        "Shiqi Shen",
        "Guangyao Shen",
        "Zhi Gong",
        "Yankai Lin"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The authors' experiments indicate that the weak-to-strong deception exists and the deception phenomenon may intensify as the capability gap between weak and strong models increases, and potential solutions are discussed, including bootstrapping with an intermediate model can mitigate the deception to some extent."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}