{
    "acronym": "a4935769b2aff7987d737e9e71a7c0f3c74983e2",
    "title": "Automatic assessment of communication skill in real-world job interviews: A comparative study using deep learning and domain adaptation.",
    "seed_ids": [
        "bert",
        "4990f7542f0600e0501a7e7a931b32eb7cb804d5",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "a4935769b2aff7987d737e9e71a7c0f3c74983e2",
    "abstract": "With the increasing use of video-based job interviews, there is a growing demand for automated tools that can accurately evaluate the interviewee’s performance. While hiring decisions have traditionally been made based on a combination of a candidate’s knowledge, skills, and overall fit for the job, the use of automated evaluation tools can help provide more objective and consistent assessments. Traditional methods of assessing communication skills are subjective and prone to biases, leading to inconsistent evaluation of candidates. Such tools can assist in identifying candidates who possess the necessary competencies for the job and may help streamline the recruitment process for employers. This paper explores the use of deep learning and domain adaptation algorithms to improve the automatic assessment of communication skills for candidates preparing for the Civil Services Examination. Automated assessment tools provide a more objective and consistent evaluation, based on speech, language, and nonverbal cues in video-based interviews. However, these tools require large amounts of labeled data, which can be a challenge in some cases. To address this issue, we have used domain adaptation, which can transfer knowledge from a source domain to improve predictions in a target domain. The paper investigates video classification and multimodal classification methods, attention mechanisms, and deep learning techniques, along with domain adaptation approaches to enhance performance. The paper presents the interview dataset collected in an uncontrolled setting, our modeling approaches adopted to address the problem, and the experimental results and analysis. The results show the best classification accuracy is 71%.",
    "authors": [
        "Jinal Hitesh Thakkar",
        "Chinchu Thomas",
        "D. Jayagopi"
    ],
    "venue": "Indian Conference on Computer Vision, Graphics & Image Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The use of deep learning and domain adaptation algorithms are explored to improve the automatic assessment of communication skills for candidates preparing for the Civil Services Examination by using domain adaptation approaches to enhance performance."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}