{
    "acronym": "a4bb895284b501aca71447239baebdacd602e2c6",
    "title": "EssayGAN: Essay Data Augmentation Based on Generative Adversarial Networks for Automated Essay Scoring",
    "seed_ids": [
        "reformer",
        "05e396e79a2f88f0b8f8d99f5ab36ab3efa95c14",
        "0a9b7f2ff0e25f4eecd946bae4ad2f8c2d53b562",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "a4bb895284b501aca71447239baebdacd602e2c6",
    "abstract": "In large-scale testing and e-learning environments, automated essay scoring (AES) can relieve the burden upon human raters by replacing human grading with machine grading. However, building AES systems based on deep learning requires a training dataset consisting of essays that are manually rated with scores. In this study, we introduce EssayGAN, an automatic essay generator based on generative adversarial networks (GANs). To generate essays rated with scores, EssayGAN has multiple generators for each score range and one discriminator. Each generator is dedicated to a specific score and can generate an essay rated with that score. Therefore, the generators can focus only on generating a realistic-looking essay that can fool the discriminator without considering the target score. Although ordinary-text GANs generate text on a word basis, EssayGAN generates essays on a sentence basis. Therefore, EssayGAN can compose not only a long essay by predicting a sentence instead of a word at each step, but can also compose a score-rated essay by adopting multiple generators dedicated to the target score. Since EssayGAN can generate score-rated essays, the generated essays can be used in the supervised learning process for AES systems. Experimental results show that data augmentation using augmented essays helps to improve the performance of AES systems. We conclude that EssayGAN can generate essays not only consisting of multiple sentences but also maintaining coherence between sentences in essays.",
    "authors": [
        "Yo-Han Park",
        "Yong-Seok Choi",
        "Cheon-Young Park",
        "K. Lee"
    ],
    "venue": "Applied Sciences",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "EssayGAN can generate essays not only consisting of multiple sentences but also maintaining coherence between sentences in essays, and experimental results show that data augmentation using augmented essays helps to improve the performance of AES systems."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}