{
    "acronym": "a4c1fedaefad0fb6fb971d4434b6a186f839b8f9",
    "title": "Vector-Vector-Matrix Architecture: A Novel Hardware-Aware Framework for Low-Latency Inference in NLP Applications",
    "seed_ids": [
        "transformerxl",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f4238bd2385a52413ccbacfd9e409a650235bd13"
    ],
    "s2id": "a4c1fedaefad0fb6fb971d4434b6a186f839b8f9",
    "abstract": "Deep neural networks have become the standard approach to building reliable Natural Language Processing (NLP) applications, ranging from Neural Machine Translation (NMT) to dialogue systems. However, improving accuracy by increasing the model size requires a large number of hardware computations, which can slow down NLP applications significantly at inference time. To address this issue, we propose a novel vector-vector-matrix architecture (VVMA), which greatly reduces the latency at inference time for NMT. This architecture takes advantage of specialized hardware that has low-latency vector-vector operations and higher-latency vector-matrix operations. It also reduces the number of parameters and FLOPs for virtually all models that rely on efficient matrix multipliers without significantly impacting accuracy. We present empirical results suggesting that our framework can reduce the latency of sequence-to-sequence and Transformer models used for NMT by a factor of four. Finally, we show evidence suggesting that our VVMA extends to other domains, and we discuss novel hardware for its efficient use.",
    "authors": [
        "Matthew Khoury",
        "Rumen Dangovski",
        "L. Ou",
        "Preslav Nakov",
        "Yichen Shen",
        "L. Jing"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel vector-vector-matrix architecture (VVMA) is proposed, which greatly reduces the latency at inference time for NMT and reduces the number of parameters and FLOPs for virtually all models that rely on efficient matrix multipliers without significantly impacting accuracy."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}