{
    "acronym": "a4c7d059e5544ce6e6a1209f92a33024d3eacbbc",
    "title": "Live2Diff: Live Stream Translation via Uni-directional Attention in Video Diffusion Models",
    "seed_ids": [
        "transformer",
        "43bafa19f94a42caea89b32a86489aa850317617",
        "1206b05eae5a06ba662ae79fb291b50e359c4f42",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "a4c7d059e5544ce6e6a1209f92a33024d3eacbbc",
    "abstract": "Large Language Models have shown remarkable efficacy in generating streaming data such as text and audio, thanks to their temporally uni-directional attention mechanism, which models correlations between the current token and previous tokens. However, video streaming remains much less explored, despite a growing need for live video processing. State-of-the-art video diffusion models leverage bi-directional temporal attention to model the correlations between the current frame and all the surrounding (i.e. including future) frames, which hinders them from processing streaming videos. To address this problem, we present Live2Diff, the first attempt at designing a video diffusion model with uni-directional temporal attention, specifically targeting live streaming video translation. Compared to previous works, our approach ensures temporal consistency and smoothness by correlating the current frame with its predecessors and a few initial warmup frames, without any future frames. Additionally, we use a highly efficient denoising scheme featuring a KV-cache mechanism and pipelining, to facilitate streaming video translation at interactive framerates. Extensive experiments demonstrate the effectiveness of the proposed attention mechanism and pipeline, outperforming previous methods in terms of temporal smoothness and/or efficiency.",
    "authors": [
        "Zhening Xing",
        "Gereon Fox",
        "Yanhong Zeng",
        "Xingang Pan",
        "Mohamed Elgharib",
        "Christian Theobalt",
        "Kai Chen"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents Live2Diff, the first attempt at designing a video diffusion model with uni-directional temporal attention, specifically targeting live streaming video translation and uses a highly efficient denoising scheme featuring a KV-cache mechanism and pipelining, to facilitate streaming video translation at interactive framerates."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}