{
    "acronym": "a4d83345bdc9aaeca5bb6c3e4aa2cb117459c9ef",
    "title": "Beyond the Edge: An Advanced Exploration of Reinforcement Learning for Mobile Edge Computing, its Applications, and Future Research Trajectories",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "a4d83345bdc9aaeca5bb6c3e4aa2cb117459c9ef",
    "abstract": "Mobile Edge Computing (MEC) broadens the scope of computation and storage beyond the central network, incorporating edge nodes close to end devices. This expansion facilitates the implementation of large-scale\"connected things\"within edge networks. The advent of applications necessitating real-time, high-quality service presents several challenges, such as low latency, high data rate, reliability, efficiency, and security, all of which demand resolution. The incorporation of reinforcement learning (RL) methodologies within MEC networks promotes a deeper understanding of mobile user behaviors and network dynamics, thereby optimizing resource use in computing and communication processes. This paper offers an exhaustive survey of RL applications in MEC networks, initially presenting an overview of RL from its fundamental principles to the latest advanced frameworks. Furthermore, it outlines various RL strategies employed in offloading, caching, and communication within MEC networks. Finally, it explores open issues linked with software and hardware platforms, representation, RL robustness, safe RL, large-scale scheduling, generalization, security, and privacy. The paper proposes specific RL techniques to mitigate these issues and provides insights into their practical applications.",
    "authors": [
        "Ning Yang",
        "Shuo Chen",
        "Haijun Zhang",
        "Randall Berry"
    ],
    "venue": "IEEE Communications Surveys &amp; Tutorials",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper offers an exhaustive survey of RL applications in MEC networks, initially presenting an overview of RL from its fundamental principles to the latest advanced frameworks, and outlines various RL strategies employed in offloading, caching, and communication within MEC networks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}