{
    "acronym": "a4f43d045a40e5d5ee486eebdfb1774e74d26f3b",
    "title": "Towards the Diagnosis of Heart Disease Using an Ensemble Learning Approach",
    "seed_ids": [
        "bert"
    ],
    "s2id": "a4f43d045a40e5d5ee486eebdfb1774e74d26f3b",
    "abstract": "Heart disease is one of the leading causes of death worldwide. Understanding the presence of heart disease is crucial for timely intervention and effective management. However, it is still a challenging task to accurately diagnose and treat heart disease. In this paper, we propose an ensemble machine learning model that combines the predictive power of three state-of-the-art machine learning algorithms: BERT (Bidirectional Encoder Representations from Transformers), FT-transformer, and XG-Boost. Through extensive training and evaluation, we assess the performance of our model using established metrics such as accuracy, precision, recall, F1-score, and receiver operating char-acteristic (ROC) curve analysis. The results obtained demonstrate the effectiveness and validity of our machine learning system in predicting heart disease accurately. This paper presents a promising approach that can assist healthcare professionals in making informed decisions and improving patient outcomes, enhances our understanding of heart disease patterns, and contributes to the development of effective diagnostic and treatment approaches.",
    "authors": [
        "Zheng Zhang",
        "Liangliang Xu",
        "Yida Bao",
        "Sanjeev Baskiyar"
    ],
    "venue": "International Conference on Machine Learning and Applications",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An ensemble machine learning model is proposed that combines the predictive power of three state-of-the-art machine learning algorithms: BERT (Bidirectional Encoder Representations from Transformers), FT-transformer, and XG-Boost to assist healthcare professionals in making informed decisions and improving patient outcomes."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}