{
    "acronym": "a5421264347581b7950acc2d12d2680a466beec2",
    "title": "Large Language Models Offer an Alternative to the Traditional Approach of Topic Modelling",
    "seed_ids": [
        "transformer",
        "gpt3",
        "bert",
        "a2e92c76a070b72202d41613eb3b9ba7031af907",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "7a15950dc71079285a4eaf195de5aadd87c41b40"
    ],
    "s2id": "a5421264347581b7950acc2d12d2680a466beec2",
    "abstract": "Topic modelling, as a well-established unsupervised technique, has found extensive use in automatically detecting significant topics within a corpus of documents. However, classic topic modelling approaches (e.g., LDA) have certain drawbacks, such as the lack of semantic understanding and the presence of overlapping topics. In this work, we investigate the untapped potential of large language models (LLMs) as an alternative for uncovering the underlying topics within extensive text corpora. To this end, we introduce a framework that prompts LLMs to generate topics from a given set of documents and establish evaluation protocols to assess the clustering efficacy of LLMs. Our findings indicate that LLMs with appropriate prompts can stand out as a viable alternative, capable of generating relevant topic titles and adhering to human guidelines to refine and merge topics. Through in-depth experiments and evaluation, we summarise the advantages and constraints of employing LLMs in topic extraction.",
    "authors": [
        "Yida Mu",
        "Chun Dong",
        "Kalina Bontcheva",
        "Xingyi Song"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The findings indicate that LLMs with appropriate prompts can stand out as a viable alternative, capable of generating relevant topic titles and adhering to human guidelines to refine and merge topics."
    },
    "citationCount": 3,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}