{
    "acronym": "a554a0aae55be5597de8f6ece0a4dd0bd5a0e5f4",
    "title": "A Survey on Text Classification: From Traditional to Deep Learning",
    "seed_ids": [
        "gpt",
        "adc61e21eafecfbf6ebecc570f9f913659a2bfb2",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "a022bda79947d1f656a1164003c1b3ae9a843df9",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3"
    ],
    "s2id": "a554a0aae55be5597de8f6ece0a4dd0bd5a0e5f4",
    "abstract": "Text classification is the most fundamental and essential task in natural language processing. The last decade has seen a surge of research in this area due to the unprecedented success of deep learning. Numerous methods, datasets, and evaluation metrics have been proposed in the literature, raising the need for a comprehensive and updated survey. This paper fills the gap by reviewing the state-of-the-art approaches from 1961 to 2021, focusing on models from traditional models to deep learning. We create a taxonomy for text classification according to the text involved and the models used for feature extraction and classification. We then discuss each of these categories in detail, dealing with both the technical developments and benchmark datasets that support tests of predictions. A comprehensive comparison between different techniques, as well as identifying the pros and cons of various evaluation metrics are also provided in this survey. Finally, we conclude by summarizing key implications, future research directions, and the challenges facing the research area.",
    "authors": [
        "Qian Li",
        "Hao Peng",
        "Jianxin Li",
        "Congyin Xia",
        "Renyu Yang",
        "Lichao Sun",
        "Philip S. Yu",
        "Lifang He"
    ],
    "venue": "ACM Transactions on Intelligent Systems and Technology",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A taxonomy for text classification according to the text involved and the models used for feature extraction and classification is created, dealing with both the technical developments and benchmark datasets that support tests of predictions."
    },
    "citationCount": 199,
    "influentialCitationCount": 9,
    "code": null,
    "description": null,
    "url": null
}