{
    "acronym": "a5899634615e57f71f03ea257f1ea4b9b6a671ee",
    "title": "Language Model Using Differentiable Neural Computer Based on Forget Gate-Based Memory Deallocation",
    "seed_ids": [
        "transformerxl",
        "d1f8f4dfdf6aae9262129efb507064c4e99f6ee7"
    ],
    "s2id": "a5899634615e57f71f03ea257f1ea4b9b6a671ee",
    "abstract": ": A differentiable neural computer (DNC) is analogous to the Von Neumann machine with a neural network controller that interacts with an external memory through an attention mechanism. Such DNC’s offer a gener-alized method for task-specific deep learning models and have demonstrated reliability with reasoning problems. In this study, we apply a DNC to a language model (LM) task. The LM task is one of the reasoning problems, because it can predict the next word using the previous word sequence. However, memory deallocation is a problem in DNCs as some information unrelated to the input sequence is not allocated and remains in the external memory, which degrades performance. Therefore, we propose a forget gate-based memory deallocation (FMD) method, which searches for the minimum value of elements in a forget gate-based retention vector. The forget gate-based retention vector indicates the retention degree of information stored in each external memory address. In experiments, we applied our proposed NTM architecture to LM tasks as a task-specific example and to rescoring for speech recognition as a general-purpose example. For LM tasks, we evaluated DNC using the Penn Treebank and enwik8 LM tasks. Although it does not yield SOTA results in LM tasks, the FMD method exhibits relatively improved performance compared with DNC in terms of bits-per-character. For the speech recognition rescoring tasks, FMD again showed a relativeimprovement using the LibriSpeech data in terms of word error rate.",
    "authors": [
        "Donghyun Lee",
        "Hosung Park",
        "Soonshin Seo",
        "Changmin Kim",
        "Hyunsoo Son",
        "Gyujin Kim",
        "Ji-Hwan Kim"
    ],
    "venue": "Computers Materials & Continua",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A forget gate-based memory deallocation (FMD) method, which searches for the minimum value of elements in a forget gate -based retention vector, which indicates the retention degree of information stored in each external memory address."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}