{
    "acronym": "a5c846c65d4cfebd4f1e5b5c2527cf4707041405",
    "title": "Multi-modal interaction with transformers: bridging robots and human with natural language",
    "seed_ids": [
        "bert"
    ],
    "s2id": "a5c846c65d4cfebd4f1e5b5c2527cf4707041405",
    "abstract": "Abstract The language-guided visual robotic grasping task focuses on enabling robots to grasp objects based on human language instructions. However, real-world human-robot collaboration tasks often involve situations with ambiguous language instructions and complex scenarios. These challenges arise in the understanding of linguistic queries, discrimination of key concepts in visual and language information, and generation of executable grasping configurations for the robot’s end-effector. To overcome these challenges, we propose a novel multi-modal transformer-based framework in this study, which assists robots in localizing spatial interactions of objects using text queries and visual sensing. This framework facilitates object grasping in accordance with human instructions. Our developed framework consists of two main components. First, a visual-linguistic transformer encoder is employed to model multi-modal interactions for objects referred to in the text. Second, the framework performs joint spatial localization and grasping. Extensive ablation studies have been conducted on multiple datasets to evaluate the advantages of each component in our model. Additionally, physical experiments have been performed with natural language-driven human-robot interactions on a physical robot to validate the practicality of our approach.",
    "authors": [
        "Shaochen Wang",
        "Zhangli Zhou",
        "Bin Li",
        "Zhijun Li",
        "Zheng Kan"
    ],
    "venue": "Robotica (Cambridge. Print)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel multi-modal transformer-based framework is proposed, which assists robots in localizing spatial interactions of objects using text queries and visual sensing, and facilitates object grasping in accordance with human instructions."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}