{
    "acronym": "a6a52671751e9216c32bcb08e469fb222fb8bb6f",
    "title": "WebRPG: Automatic Web Rendering Parameters Generation for Visual Presentation",
    "seed_ids": [
        "gpt3",
        "0b0debb710366cdff461938c80763eace1651af6",
        "bb3faec0406af580a5c1dfe05bba59295a8272f7",
        "68adb03744692247fb834406798894db9fe77010",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "23070cb7b4e282f784237c2e475b518238ff7e44"
    ],
    "s2id": "a6a52671751e9216c32bcb08e469fb222fb8bb6f",
    "abstract": "In the era of content creation revolution propelled by advancements in generative models, the field of web design remains unexplored despite its critical role in modern digital communication. The web design process is complex and often time-consuming, especially for those with limited expertise. In this paper, we introduce Web Rendering Parameters Generation (WebRPG), a new task that aims at automating the generation for visual presentation of web pages based on their HTML code. WebRPG would contribute to a faster web development workflow. Since there is no existing benchmark available, we develop a new dataset for WebRPG through an automated pipeline. Moreover, we present baseline models, utilizing VAE to manage numerous elements and rendering parameters, along with custom HTML embedding for capturing essential semantic and hierarchical information from HTML. Extensive experiments, including customized quantitative evaluations for this specific task, are conducted to evaluate the quality of the generated results.",
    "authors": [
        "Zirui Shao",
        "Feiyu Gao",
        "Hangdi Xing",
        "Zepeng Zhu",
        "Zhi Yu",
        "Jiajun Bu",
        "Qi Zheng",
        "Cong Yao"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces Web Rendering Parameters Generation (WebRPG), a new task that aims at automating the generation for visual presentation of web pages based on their HTML code, and presents baseline models, utilizing VAE to manage numerous elements and rendering parameters."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}