{
    "acronym": "a6d3ca7bd056a16d879fad619c2fd0874ff2536f",
    "title": "Exact Conversion of In-Context Learning to Model Weights in Linearized-Attention Transformers",
    "seed_ids": [
        "gpt",
        "performer",
        "lineartransformer",
        "roformer",
        "f4a0c4154203808f362e4678f3741b3d317fdc82",
        "240103933ffe3dac2179cc160a2bd91299357a53",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "a25370452533bf47549243e97852b9cdf7a0ee0e",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04"
    ],
    "s2id": "a6d3ca7bd056a16d879fad619c2fd0874ff2536f",
    "abstract": "In-Context Learning (ICL) has been a powerful emergent property of large language models that has attracted increasing attention in recent years. In contrast to regular gradient-based learning, ICL is highly interpretable and does not require parameter updates. In this paper, we show that, for linearized transformer networks, ICL can be made explicit and permanent through the inclusion of bias terms. We mathematically demonstrate the equivalence between a model with ICL demonstration prompts and the same model with the additional bias terms. Our algorithm (ICLCA) allows for exact conversion in an inexpensive manner. Existing methods are not exact and require expensive parameter updates. We demonstrate the efficacy of our approach through experiments that show the exact incorporation of ICL tokens into a linear transformer. We further suggest how our method can be adapted to achieve cheap approximate conversion of ICL tokens, even in regular transformer networks that are not linearized. Our experiments on GPT-2 show that, even though the conversion is only approximate, the model still gains valuable context from the included bias terms.",
    "authors": [
        "Brian K Chen",
        "Tianyang Hu",
        "Hui Jin",
        "Hwee Kuan Lee",
        "Kenji Kawaguchi"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper shows that, for linearized transformer networks, ICL can be made explicit and permanent through the inclusion of bias terms, and mathematically demonstrates the equivalence between a model with ICL demonstration prompts and the same model with the additional bias terms."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}