{
    "acronym": "a6dd2a8debb5d5324c4f2be7fb7bb52ce109cbaf",
    "title": "PAEG: Phrase-level Adversarial Example Generation for Neural Machine Translation",
    "seed_ids": [
        "lighdynconv",
        "60acc34101dc0395ae6d2ab6abf26cbedb00e961"
    ],
    "s2id": "a6dd2a8debb5d5324c4f2be7fb7bb52ce109cbaf",
    "abstract": "While end-to-end neural machine translation (NMT) has achieved impressive progress, noisy input usually leads models to become fragile and unstable. Generating adversarial examples as the augmented data has been proved to be useful to alleviate this problem. Existing methods for adversarial example generation (AEG) are word-level or character-level, which ignore the ubiquitous phrase structure. In this paper, we propose a Phrase-level Adversarial Example Generation (PAEG) framework to enhance the robustness of the translation model. Our method further improves the gradient-based word-level AEG method by adopting a phrase-level substitution strategy. We verify our method on three benchmarks, including LDC Chinese-English, IWSLT14 German-English, and WMT14 English-German tasks. Experimental results demonstrate that our approach significantly improves translation performance and robustness to noise compared to previous strong baselines.",
    "authors": [
        "Juncheng Wan",
        "Jian Yang",
        "Jian Yang",
        "Shuming Ma",
        "Dongdong Zhang",
        "Weinan Zhang",
        "Yong Yu",
        "Zhoujun Li"
    ],
    "venue": "International Conference on Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a Phrase-level Adversarial Example Generation (PAEG) framework to enhance the robustness of the translation model and significantly improves translation performance and robustness to noise compared to previous strong baselines."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}