{
    "acronym": "a7721b6523971394a8bd4bfda139122ef59b22cd",
    "title": "Sparse Attention with Linear Units",
    "seed_ids": [
        "sparsetransformer",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "f6390beca54411b06f3bde424fb983a451789733"
    ],
    "s2id": "a7721b6523971394a8bd4bfda139122ef59b22cd",
    "abstract": "Recently, it has been argued that encoder-decoder models can be made more interpretable by replacing the softmax function in the attention with its sparse variants. In this work, we introduce a novel, simple method for achieving sparsity in attention: we replace the softmax activation with a ReLU, and show that sparsity naturally emerges from such a formulation. Training stability is achieved with layer normalization with either a specialized initialization or an additional gating function. Our model, which we call Rectified Linear Attention (ReLA), is easy to implement and more efficient than previously proposed sparse attention mechanisms. We apply ReLA to the Transformer and conduct experiments on five machine translation tasks. ReLA achieves translation performance comparable to several strong baselines, with training and decoding speed similar to that of the vanilla attention. Our analysis shows that ReLA delivers high sparsity rate and head diversity, and the induced cross attention achieves better accuracy with respect to source-target word alignment than recent sparsified softmax-based models. Intriguingly, ReLA heads also learn to attend to nothing (i.e. ‘switch off’) for some queries, which is not possible with sparsified softmax alternatives.",
    "authors": [
        "Biao Zhang",
        "Ivan Titov",
        "Rico Sennrich"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a novel, simple method for achieving sparsity in attention: it replaces the softmax activation with a ReLU, and shows that sparsity naturally emerges from such a formulation."
    },
    "citationCount": 31,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}