{
    "acronym": "a78553f7e9b994ff693f27b0cd81c97ae0470203",
    "title": "Effect of Post-processing on Contextualized Word Representations",
    "seed_ids": [
        "gpt",
        "ca4ecf116a9b97ce525a01f3f51117877688ddf5",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee",
        "8659bf379ca8756755125a487c43cfe8611ce842",
        "f6fbb6809374ca57205bd2cf1421d4f4fa04f975",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a78553f7e9b994ff693f27b0cd81c97ae0470203",
    "abstract": "Post-processing of static embedding has been shown to improve their performance on both lexical and sequence-level tasks. However, post-processing for contextualized embeddings is an under-studied problem. In this work, we question the usefulness of post-processing for contextualized embeddings obtained from different layers of pre-trained language models. More specifically, we standardize individual neuron activations using z-score, min-max normalization, and by removing top principal components using the all-but-the-top method. Additionally, we apply unit length normalization to word representations. On a diverse set of pre-trained models, we show that post-processing unwraps vital information present in the representations for both lexical tasks (such as word similarity and analogy) and sequence classification tasks. Our findings raise interesting points in relation to the research studies that use contextualized representations, and suggest z-score normalization as an essential step to consider when using them in an application.",
    "authors": [
        "Hassan Sajjad",
        "Firoj Alam",
        "Fahim Dalvi",
        "Nadir Durrani"
    ],
    "venue": "International Conference on Computational Linguistics",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "On a diverse set of pre-trained models, it is shown that post-processing unwraps vital information present in the representations for both lexical tasks and sequence classification tasks, and suggests z-score normalization as an essential step to consider when using them in an application."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}