{
    "acronym": "a7e7e7db24d07fdbfd5b7fc321bc48b4317680c1",
    "title": "Representing the Intangible Cultural Heritage Knowledge Graph with Vector Embedding",
    "seed_ids": [
        "bert"
    ],
    "s2id": "a7e7e7db24d07fdbfd5b7fc321bc48b4317680c1",
    "abstract": "The construction and effective application of an intangible cultural heritage knowledge graph (ICH KG) can realize the knowledge integration, and optimize the ICH knowledge management. However, high complexity and low computational efficiency of ICH KG make its application face challenges. We propose a multi-source knowledge graph embedding (KGE) model named ICHMKGE to convert the ICH KG into the vector representations to improve the computational efficiency of ICH KG and promote the digital sustainable development of ICH. Firstly, we take the Chinese ICH project 24 solar terms as an example and combine multiple official data sources to construct the Chinese ICH KG as a basis for this study. Secondly, as the ICH project is being further explored with the limited coverage of ICH knowledge, entity sparsity poses a serious challenge for ICH KGE. This paper employs the BERT model to encode the complete description information of entities, and establishes connection between triples entities and ontology concepts via cross-view modeling. Finally, the proposed ICHMKGE model is compared with the baseline models, and the experimental results demonstrate that the model exhibits superiority.",
    "authors": [
        "Mao Han",
        "Qing Wang",
        "Hong Chen",
        "Wei Chen",
        "Junchang Zhang",
        "Guang Wang"
    ],
    "venue": "2023 IEEE International Conference on High Performance Computing & Communications, Data Science & Systems, Smart City & Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A multi-source knowledge graph embedding model named ICHMKGE is proposed to convert the ICH KG into the vector representations to improve the computational efficiency of ICH KG and promote the digital sustainable development of ICH."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}