{
    "acronym": "a872697c5b57d0cd0fb963d51fbaed3604b05ea1",
    "title": "Reducing Hallucinations in Entity Abstract Summarization with Facts-Template Decomposition",
    "seed_ids": [
        "memcompress",
        "addd2d86d19c1e7c8854e827fb2656a50c250440",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "0bd5beed98675a63f9207851674d478009549900"
    ],
    "s2id": "a872697c5b57d0cd0fb963d51fbaed3604b05ea1",
    "abstract": "Entity abstract summarization aims to generate a coherent description of a given entity based on a set of relevant Internet documents. Pretrained language models (PLMs) have achieved significant success in this task, but they may suffer from hallucinations, i.e. generating non-factual information about the entity. To address this issue, we decompose the summary into two components: Facts that represent the factual information about the given entity, which PLMs are prone to fabricate; and Template that comprises generic content with designated slots for facts, which PLMs can generate competently. Based on the facts-template decomposition, we propose SlotSum, an explainable framework for entity abstract summarization. SlotSum first creates the template and then predicts the fact for each template slot based on the input documents. Benefiting from our facts-template decomposition, SlotSum can easily locate errors and further rectify hallucinated predictions with external knowledge. We construct a new dataset WikiFactSum to evaluate the performance of SlotSum. Experimental results demonstrate that SlotSum could generate summaries that are significantly more factual with credible external knowledge.",
    "authors": [
        "Fangwei Zhu",
        "Peiyi Wang",
        "Zhifang Sui"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Experimental results demonstrate that SlotSum could generate summaries that are significantly more factual with credible external knowledge and benefit from the facts-template decomposition."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}