{
    "acronym": "a880fc74ba61fc2a47adc8a70b7921ae37163205",
    "title": "Coherent and Multi-modality Image Inpainting via Latent Space Optimization",
    "seed_ids": [
        "classfreediffu",
        "f1c39410893794ee3643efa85be1816964aa85ea",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "a880fc74ba61fc2a47adc8a70b7921ae37163205",
    "abstract": "With the advancements in denoising diffusion probabilistic models (DDPMs), image inpainting has significantly evolved from merely filling information based on nearby regions to generating content conditioned on various prompts such as text, exemplar images, and sketches. However, existing methods, such as model fine-tuning and simple concatenation of latent vectors, often result in generation failures due to overfitting and inconsistency between the inpainted region and the background. In this paper, we argue that the current large diffusion models are sufficiently powerful to generate realistic images without further tuning. Hence, we introduce PILOT (in\\textbf{P}ainting v\\textbf{I}a \\textbf{L}atent \\textbf{O}p\\textbf{T}imization), an optimization approach grounded on a novel \\textit{semantic centralization} and \\textit{background preservation loss}. Our method searches latent spaces capable of generating inpainted regions that exhibit high fidelity to user-provided prompts while maintaining coherence with the background. Furthermore, we propose a strategy to balance optimization expense and image quality, significantly enhancing generation efficiency. Our method seamlessly integrates with any pre-trained model, including ControlNet and DreamBooth, making it suitable for deployment in multi-modal editing tools. Our qualitative and quantitative evaluations demonstrate that PILOT outperforms existing approaches by generating more coherent, diverse, and faithful inpainted regions in response to provided prompts.",
    "authors": [
        "Lingzhi Pan",
        "Tong Zhang",
        "Bingyuan Chen",
        "Qi Zhou",
        "Wei Ke",
        "Sabine E. Susstrunk",
        "Mathieu Salzmann"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "PILOT is introduced, an optimization approach grounded on a novel semantic centralization and background preservation loss that outperforms existing approaches by generating more coherent, diverse, and faithful inpainted regions in response to provided prompts."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}