{
    "acronym": "a89c30ceca55783a1b2ff843eb6a4793e4a54b66",
    "title": "Don't Take This Out of Context! On the Need for Contextual Models and Evaluations for Stylistic Rewriting",
    "seed_ids": [
        "gpt2",
        "5c982f5dbb653d748e1ada858004e0847e09edff",
        "36c50e6638dddc8324eef9bfa064bfcab80cbef4",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a89c30ceca55783a1b2ff843eb6a4793e4a54b66",
    "abstract": "Most existing stylistic text rewriting methods and evaluation metrics operate on a sentence level, but ignoring the broader context of the text can lead to preferring generic, ambiguous, and incoherent rewrites. In this paper, we investigate integrating the preceding textual context into both the $\\textit{rewriting}$ and $\\textit{evaluation}$ stages of stylistic text rewriting, and introduce a new composite contextual evaluation metric $\\texttt{CtxSimFit}$ that combines similarity to the original sentence with contextual cohesiveness. We comparatively evaluate non-contextual and contextual rewrites in formality, toxicity, and sentiment transfer tasks. Our experiments show that humans significantly prefer contextual rewrites as more fitting and natural over non-contextual ones, yet existing sentence-level automatic metrics (e.g., ROUGE, SBERT) correlate poorly with human preferences ($\\rho$=0--0.3). In contrast, human preferences are much better reflected by both our novel $\\texttt{CtxSimFit}$ ($\\rho$=0.7--0.9) as well as proposed context-infused versions of common metrics ($\\rho$=0.4--0.7). Overall, our findings highlight the importance of integrating context into the generation and especially the evaluation stages of stylistic text rewriting.",
    "authors": [
        "Akhila Yerukola",
        "Xuhui Zhou",
        "Maarten Sap"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new composite contextual evaluation metric is introduced that combines similarity to the original sentence with contextual cohesiveness and highlights the importance of integrating context into the generation and especially the evaluation stages of stylistic text rewriting."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}