{
    "acronym": "a8b66565cdb2b8c90556bb98a7fc58ac679c2cec",
    "title": "Accelerating Retrieval-Augmented Language Model Serving with Speculation",
    "seed_ids": [
        "gpt2",
        "cbbc2cc774c50b0b19922185b80e9ce90b7cd2f6",
        "d9964ab436eefd21f923a4bc833c6b66692c7f00",
        "465471bb5bf1a945549d6291c2d23367966b4957",
        "da1d6445b6b64ce9eb4587ba8abbdc490f648ec1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a8b66565cdb2b8c90556bb98a7fc58ac679c2cec",
    "abstract": "Retrieval-augmented language models (RaLM) have demonstrated the potential to solve knowledge-intensive natural language processing (NLP) tasks by combining a non-parametric knowledge base with a parametric language model. Instead of fine-tuning a fully parametric model, RaLM excels at its low-cost adaptation to the latest data and better source attribution mechanisms. Among various RaLM approaches, iterative RaLM delivers a better generation quality due to a more frequent interaction between the retriever and the language model. Despite the benefits, iterative RaLM usually encounters high overheads due to the frequent retrieval step. To this end, we propose RaLMSpec, a speculation-inspired framework that provides generic speed-up over iterative RaLM while preserving the same model outputs through speculative retrieval and batched verification. By further incorporating prefetching, optimal speculation stride scheduler, and asynchronous verification, RaLMSpec can automatically exploit the acceleration potential to the fullest. For naive iterative RaLM serving, extensive evaluations over three language models on four downstream QA datasets demonstrate that RaLMSpec can achieve a speed-up ratio of 1.75-2.39x, 1.04-1.39x, and 1.31-1.77x when the retriever is an exact dense retriever, approximate dense retriever, and sparse retriever respectively compared with the baseline. For KNN-LM serving, RaLMSpec can achieve a speed-up ratio up to 7.59x and 2.45x when the retriever is an exact dense retriever and approximate dense retriever, respectively, compared with the baseline.",
    "authors": [
        "Zhihao Zhang",
        "Alan Zhu",
        "Lijie Yang",
        "Yihua Xu",
        "Lanting Li",
        "P. Phothilimthana",
        "Zhihao Jia"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes RaLMSpec, a speculation-inspired framework that provides generic speed-up over iterative RaLM while preserving the same model outputs through speculative retrieval and batched verification, and can automatically exploit the acceleration potential to the fullest."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}