{
    "acronym": "a8d24ff3c82eb9c3e31c07335b2ed27ed3c6036a",
    "title": "Effective Controllable Bias Mitigation for Classification and Retrieval using Gate Adapters",
    "seed_ids": [
        "bert",
        "f1e56def812bc398d1b2b8c9a7ea6a623abd38e5",
        "4a6a65968a8eb8c09ffb57a7774ddabb596565b1",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "a8d24ff3c82eb9c3e31c07335b2ed27ed3c6036a",
    "abstract": "Bias mitigation of Language Models has been the topic of many studies with a recent focus on learning separate modules like adapters for on-demand debiasing. Besides optimizing for a modularized debiased model, it is often critical in practice to control the degree of bias reduction at inference time, e.g., in order to tune for a desired performance-fairness trade-off in search results or to control the strength of debiasing in classification tasks. In this paper, we introduce Controllable Gate Adapter (ConGater), a novel modular gating mechanism with adjustable sensitivity parameters, %In addition to better perseverance of task performance and enhanced information removal, which allows for a gradual transition from the biased state of the model to the fully debiased version at inference time. We demonstrate ConGater performance by (1) conducting adversarial debiasing experiments with three different models on three classification tasks with four protected attributes, and (2) reducing the bias of search results through fairness list-wise regularization to enable adjusting a trade-off between performance and fairness metrics. Our experiments on the classification tasks show that compared to baselines of the same caliber, ConGater can maintain higher task performance while containing less information regarding the attributes. Our results on the retrieval task show that the fully debiased ConGater can achieve the same fairness performance while maintaining more than twice as high task performance than recent strong baselines. Overall, besides strong performance ConGater enables the continuous transitioning between biased and debiased states of models, enhancing personalization of use and interpretability through controllability.",
    "authors": [
        "Shahed Masoudian",
        "Cornelia Volaucnik",
        "Markus Schedl"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Controllable Gate Adapter (ConGater), a novel modular gating mechanism with adjustable sensitivity parameters, which allows for a gradual transition from the biased state of the model to the fully debiased version at inference time, and enables the continuous transitioning between biased and debiased states of models."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}