{
    "acronym": "a96d038246c4ad4a16bf97de09329bdcd0dc2ddf",
    "title": "Centroid Transformers: Learning to Abstract with Attention",
    "seed_ids": [
        "linformer",
        "reformer",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2"
    ],
    "s2id": "a96d038246c4ad4a16bf97de09329bdcd0dc2ddf",
    "abstract": "Self-attention, as the key block of transformers, is a powerful mechanism for extracting features from the inputs. In essence, what self-attention does is to infer the pairwise relations between the elements of the inputs, and modify the inputs by propagating information between input pairs. As a result, it maps inputs to N outputs and casts a quadratic $O(N^2)$ memory and time complexity. We propose centroid attention, a generalization of self-attention that maps N inputs to M outputs $(M\\leq N)$, such that the key information in the inputs are summarized in the smaller number of outputs (called centroids). We design centroid attention by amortizing the gradient descent update rule of a clustering objective function on the inputs, which reveals an underlying connection between attention and clustering. By compressing the inputs to the centroids, we extract the key information useful for prediction and also reduce the computation of the attention module and the subsequent layers. We apply our method to various applications, including abstractive text summarization, 3D vision, and image processing. Empirical results demonstrate the effectiveness of our method over the standard transformers.",
    "authors": [
        "Lemeng Wu",
        "Xingchao Liu",
        "Qiang Liu"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Centroid attention is proposed, a generalization of self-attention that maps N inputs to M outputs $(M\\leq N)$, such that the key information in the inputs are summarized in the smaller number of outputs (called centroids)."
    },
    "citationCount": 22,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}