{
    "acronym": "a9d80358a2b3f2184d45d30dd71f3d1c0b5b0744",
    "title": "Lightning: A Reconfigurable Photonic-Electronic SmartNIC for Fast and Energy-Efficient Inference",
    "seed_ids": [
        "gpt2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "a9d80358a2b3f2184d45d30dd71f3d1c0b5b0744",
    "abstract": "The massive growth of machine learning-based applications and the end of Moore's law have created a pressing need to redesign computing platforms. We propose Lightning, the first reconfigurable photonic-electronic smartNIC to serve real-time deep neural network inference requests. Lightning uses a fast datapath to feed traffic from the NIC into the photonic domain without creating digital packet processing and data movement bottlenecks. To do so, Lightning leverages a novel reconfigurable count-action abstraction that keeps track of the required computation operations of each inference packet. Our count-action abstraction decouples the compute control plane from the data plane by counting the number of operations in each task and triggers the execution of the next task(s) without interrupting the dataflow. We evaluate Lightning's performance using four platforms: a prototype, chip synthesis, emulations, and simulations. Our prototype demonstrates the feasibility of performing 8-bit photonic multiply-accumulate operations with 99.25% accuracy. To the best of our knowledge, our prototype is the highest-frequency photonic computing system, capable of serving real-time inference queries at 4.055 GHz end-to-end. Our simulations with large DNN models show that compared to Nvidia A100 GPU, A100X DPU, and Brainwave smartNIC, Lightning accelerates the average inference serve time by 337×, 329×, and 42×, while consuming 352×, 419×, and 54× less energy, respectively.",
    "authors": [
        "Zhizhen Zhong",
        "Mingran Yang",
        "Jay Lang",
        "Christian Williams",
        "Liam Kronman",
        "Alexander Sludds",
        "H. Esfahanizadeh",
        "Dirk Englund",
        "M. Ghobadi"
    ],
    "venue": "Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Lightning, the first reconfigurable photonic-electronic smartNIC to serve real-time deep neural network inference requests, uses a fast datapath to feed traffic from the NIC into the photonic domain without creating digital packet processing and data movement bottlenecks and leverages a novel reconfigured count-action abstraction."
    },
    "citationCount": 11,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}