{
    "acronym": "aa01f43e88184f13a0b9f8d5e8337951f1c2fef1",
    "title": "Croppable Knowledge Graph Embedding",
    "seed_ids": [
        "bert",
        "ef8d788a904ed66bd8e30ffa69bc3ea1fe57dda7",
        "c6c734e16f66fbfcefac7625cc64599e83292c1e",
        "80cf2a6af4200ecfca1c18fc89de16148f1cd4bf"
    ],
    "s2id": "aa01f43e88184f13a0b9f8d5e8337951f1c2fef1",
    "abstract": "Knowledge Graph Embedding (KGE) is a common method for Knowledge Graphs (KGs) to serve various artificial intelligence tasks. The suitable dimensions of the embeddings depend on the storage and computing conditions of the specific application scenarios. Once a new dimension is required, a new KGE model needs to be trained from scratch, which greatly increases the training cost and limits the efficiency and flexibility of KGE in serving various scenarios. In this work, we propose a novel KGE training framework MED, through which we could train once to get a croppable KGE model applicable to multiple scenarios with different dimensional requirements, sub-models of the required dimensions can be cropped out of it and used directly without any additional training. In MED, we propose a mutual learning mechanism to improve the low-dimensional sub-models performance and make the high-dimensional sub-models retain the capacity that low-dimensional sub-models have, an evolutionary improvement mechanism to promote the high-dimensional sub-models to master the knowledge that the low-dimensional sub-models can not learn, and a dynamic loss weight to balance the multiple losses adaptively. Experiments on 3 KGE models over 4 standard KG completion datasets, 3 real application scenarios over a real-world large-scale KG, and the experiments of extending MED to the language model BERT show the effectiveness, high efficiency, and flexible extensibility of MED.",
    "authors": [
        "Yushan Zhu",
        "Wen Zhang",
        "Zhiqiang Liu",
        "Mingyang Chen",
        "Lei Liang",
        "Hua-zeng Chen"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel KGE training framework MED, through which a croppable KGE model applicable to multiple scenarios with different dimensional requirements can be trained and sub-models of the required dimensions can be cropped out of it and used directly without any additional training."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}