{
    "acronym": "aa1a154b09e2e420513665825a57938358bf9761",
    "title": "LogDAPT: Log Data Anomaly Detection with Domain-Adaptive Pretraining (industry track)",
    "seed_ids": [
        "bert"
    ],
    "s2id": "aa1a154b09e2e420513665825a57938358bf9761",
    "abstract": "Large software systems usually record important runtime information by printing system logs, which are a vital resource for engineers to understand system behaviors and identify fatal errors. However, due to the large scale and high complexity of modern industrial software systems, the conventional manual sifting of logs has become impractical. Recently, many deep learning models, including pre-trained models, have been applied to automatically detect system anomalies via logs. Normally, these methods require large amounts of labeled data to achieve satisfying results. However, abundant labeled data is rarely available in regular industrial scenarios. In order to address this issue, we propose LogDAPT, a novel framework based on domain-adaptive pretraining (DAPT). To improve the performance under few-shot setting, LogDAPT learns the semantics of logs by applying a second phase of pretraining in-domain to the BERT base model. In our experiments, we utilize two different schemes for DAPT, which are MLM scheme and Span scheme. The experimental results on three public log datasets (HDFS, BGL and Thunderbird) show that LogDAPT achieves satisfactory F1-Scores under few-shot industrial conditions.",
    "authors": [
        "Haoyu Zheng",
        "Guojun Chu",
        "Haifeng Sun",
        "Jingyu Wang",
        "Shimin Tao",
        "Hao Yang"
    ],
    "venue": "Middleware Industry",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "To improve the performance under few-shot setting, LogDAPT learns the semantics of logs by applying a second phase of pretraining in-domain to the BERT base model."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}