{
    "acronym": "aa2d103e58acb17908799954fb50058125ef17ca",
    "title": "DreamVideo: Composing Your Dream Videos with Customized Subject and Motion",
    "seed_ids": [
        "classfreediffu",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2d9ae4c167510ed78803735fc57ea67c3cc55a35"
    ],
    "s2id": "aa2d103e58acb17908799954fb50058125ef17ca",
    "abstract": "Customized generation using diffusion models has made impressive progress in image generation, but remains unsatisfactory in the challenging video generation task, as it requires the controllability of both subjects and motions. To that end, we present DreamVideo, a novel approach to generating personalized videos from a few static images of the desired subject and a few videos of target motion. DreamVideo decouples this task into two stages, subject learning and motion learning, by leveraging a pre-trained video diffusion model. The subject learning aims to accurately capture the fine appearance of the subject from provided images, which is achieved by combining textual inversion and fine-tuning of our carefully designed identity adapter. In motion learning, we architect a motion adapter and fine-tune it on the given videos to effectively model the target motion pattern. Combining these two lightweight and efficient adapters allows for flexible customization of any subject with any motion. Extensive experimental results demonstrate the superior performance of our DreamVideo over the state-of-the-art methods for customized video generation. Our project page is at https://dreamvideo-t2v.github.io.",
    "authors": [
        "Yujie Wei",
        "Shiwei Zhang",
        "Zhiwu Qing",
        "Hangjie Yuan",
        "Zhiheng Liu",
        "Yu Liu",
        "Yingya Zhang",
        "Jingren Zhou",
        "Hongming Shan"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "DreamVideo is presented, a novel approach to generating personalized videos from a few static images of the desired subject and a few videos of target motion, by leveraging a pre-trained video diffusion model."
    },
    "citationCount": 26,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}