{
    "acronym": "aa2f6777674ae42b197283dbe05f0df16548a097",
    "title": "A tailored Handwritten-Text-Recognition System for Medieval Latin",
    "seed_ids": [
        "gpt2",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "aa2f6777674ae42b197283dbe05f0df16548a097",
    "abstract": "The Bavarian Academy of Sciences and Humanities aims to digitize the Medieval Latin Dictionary. This dictionary entails record cards referring to lemmas in medieval Latin, a low-resource language. A crucial step of the digitization process is the handwritten text recognition (HTR) of the handwritten lemmas on the record cards. In our work, we introduce an end-to-end pipeline, tailored for the medieval Latin dictionary, for locating, extracting, and transcribing the lemmas. We employ two state-of-the-art image segmentation models to prepare the initial data set for the HTR task. Further, we experiment with different transformer-based models and conduct a set of experiments to explore the capabilities of different combinations of vision encoders with a GPT-2 decoder. Additionally, we also apply extensive data augmentation resulting in a highly competitive model. The best-performing setup achieved a character error rate of 0.015, which is even superior to the commercial Google Cloud Vision model, and shows more stable performance.",
    "authors": [
        "Philipp Koch",
        "Gilary Vera Nunez",
        "E. Arias",
        "C. Heumann",
        "Matthias Schoffel",
        "Alexander Haberlin",
        "M. Aßenmacher"
    ],
    "venue": "International Conference on Algebraic and Logic Programming",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces an end-to-end pipeline, tailored for the medieval Latin dictionary, for locating, extracting, and transcribing the lemmas and applies extensive data augmentation resulting in a highly competitive model."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}