{
    "acronym": "aa3af9a41370f50cca6e77e5f591dd9bc7de3699",
    "title": "Investigating Neural Machine Translation for Low-Resource Languages: Using Bavarian as a Case Study",
    "seed_ids": [
        "transformer",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc"
    ],
    "s2id": "aa3af9a41370f50cca6e77e5f591dd9bc7de3699",
    "abstract": "Machine Translation has made impressive progress in recent years offering close to human-level performance on many languages, but studies have primarily focused on high-resource languages with broad online presence and resources. With the help of growing Large Language Models, more and more low-resource languages achieve better results through the presence of other languages. However, studies have shown that not all low-resource languages can benefit from multilingual systems, especially those with insufficient training and evaluation data. In this paper, we revisit state-of-the-art Neural Machine Translation techniques to develop automatic translation systems between German and Bavarian. We investigate conditions of low-resource languages such as data scarcity and parameter sensitivity and focus on refined solutions that combat low-resource difficulties and creative solutions such as harnessing language similarity. Our experiment entails applying Back-translation and Transfer Learning to automatically generate more training data and achieve higher translation performance. We demonstrate noisiness in the data and present our approach to carry out text preprocessing extensively. Evaluation was conducted using combined metrics: BLEU, chrF and TER. Statistical significance results with Bonferroni correction show surprisingly high baseline systems, and that Back-translation leads to significant improvement. Furthermore, we present a qualitative analysis of translation errors and system limitations.",
    "authors": [
        "Wan-Hua Her",
        "Udo Kruschwitz"
    ],
    "venue": "SIGUL",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper revisits state-of-the-art Neural Machine Translation techniques to develop automatic translation systems between German and Bavarian and investigates conditions of low-resource languages such as data scarcity and parameter sensitivity and presents a qualitative analysis of translation errors and system limitations."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}