{
    "acronym": "aa55f4bafba03b7d2f7314fed61b924438d1a62c",
    "title": "Enhancing Knowledge Selection for Grounded Dialogues via Document Semantic Graphs",
    "seed_ids": [
        "gpt2",
        "83fac78857c7e65fe10a11a798674dd3cd259c1d",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "aa55f4bafba03b7d2f7314fed61b924438d1a62c",
    "abstract": "Providing conversation models with background knowledge has been shown to make open-domain dialogues more informative and engaging. Existing models treat knowledge selection as a sentence ranking or classification problem where each sentence is handled individually, ignoring the internal semantic connection between sentences. In this work, we propose to automatically convert the background knowledge documents into document semantic graphs and then perform knowledge selection over such graphs. Our document semantic graphs preserve sentence-level information through the use of sentence nodes and provide concept connections between sentences. We apply multi-task learning to perform sentence-level knowledge selection and concept-level knowledge selection, showing that it improves sentence-level selection. Our experiments show that our semantic graph-based knowledge selection improves over sentence selection baselines for both the knowledge selection task and the end-to-end response generation task on HollE and improves generalization on unseen topics in WoW.",
    "authors": [
        "Sha Li",
        "Madhi Namazifar",
        "Di Jin",
        "Mohit Bansal",
        "Heng Ji",
        "Yang Liu",
        "Dilek Z. Hakkani-Tür"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes to automatically convert the background knowledge documents into document semantic graphs and then perform knowledge selection over such graphs to preserve sentence-level information through the use of sentence nodes and provide concept connections between sentences."
    },
    "citationCount": 18,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}