{
    "acronym": "aa9c6d43b36a55b34c2e9207355d355fd94691af",
    "title": "Machine Reading Comprehension: The Role of Contextualized Language Models and Beyond",
    "seed_ids": [
        "gpt",
        "270f3bea8ca801870a6cc56b4d36f7f2019c9ed0",
        "c6c734e16f66fbfcefac7625cc64599e83292c1e",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "5744f56d3253bd7c4341d36de40a93fceaa266b3",
        "710d183174844da5b7f392667f3cc25d2b098dde",
        "67b1f8e48118bb1aa250f400d475425317bf4117",
        "d56c1fc337fb07ec004dc846f80582c327af717c",
        "95ecc81c2b3ef1cb7ba4028fe2a8f2e04b6f397b",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "6642ad0b2fd2bf834388b804250eb9337ceb3f88",
        "6ff68b34a5f78bdd14437fe5a79aebbc42c26467",
        "8f346de21a13dacf5b65e2de81e84d54226a5b9f",
        "9a5ba9aee44ab873f3d60b05e2773c693707da88",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47"
    ],
    "s2id": "aa9c6d43b36a55b34c2e9207355d355fd94691af",
    "abstract": "Machine reading comprehension (MRC) aims to teach machines to read and comprehend human languages, which is a long-standing goal of natural language processing (NLP). With the burst of deep neural networks and the evolution of contextualized language models (CLMs), the research of MRC has experienced two significant breakthroughs. MRC and CLM, as a phenomenon, have a great impact on the NLP community. In this survey, we provide a comprehensive and comparative review on MRC covering overall research topics about 1) the origin and development of MRC and CLM, with a particular focus on the role of CLMs; 2) the impact of MRC and CLM to the NLP community; 3) the definition, datasets, and evaluation of MRC; 4) general MRC architecture and technical methods in the view of two-stage Encoder-Decoder solving architecture from the insights of the cognitive process of humans; 5) previous highlights, emerging topics, and our empirical analysis, among which we especially focus on what works in different periods of MRC researches. We propose a full-view categorization and new taxonomies on these topics. The primary views we have arrived at are that 1) MRC boosts the progress from language processing to understanding; 2) the rapid improvement of MRC systems greatly benefits from the development of CLMs; 3) the theme of MRC is gradually moving from shallow text matching to cognitive reasoning.",
    "authors": [
        "Zhuosheng Zhang",
        "Hai Zhao",
        "Rui Wang"
    ],
    "venue": "arXiv.org",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is arrived at that 1) MRC boosts the progress from language processing to understanding; 2) the rapid improvement of MRC systems greatly benefits from the development of CLMs; 3) the theme of M RC is gradually moving from shallow text matching to cognitive reasoning."
    },
    "citationCount": 57,
    "influentialCitationCount": 7,
    "code": null,
    "description": null,
    "url": null
}