{
    "acronym": "aaedb51c8bfdc2517aec2eff796204b7a7c6d120",
    "title": "SNP2Vec: Scalable Self-Supervised Pre-Training for Genome-Wide Association Study",
    "seed_ids": [
        "bigbird",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "aaedb51c8bfdc2517aec2eff796204b7a7c6d120",
    "abstract": "Self-supervised pre-training methods have brought remarkable breakthroughs in the understanding of text, image, and speech. Recent developments in genomics has also adopted these pre-training methods for genome understanding. However, they focus only on understanding haploid sequences, which hinders their applicability towards understanding genetic variations, also known as single nucleotide polymorphisms (SNPs), which is crucial for genome-wide association study. In this paper, we introduce SNP2Vec, a scalable self-supervised pre-training approach for understanding SNP. We apply SNP2Vec to perform long-sequence genomics modeling, and we evaluate the effectiveness of our approach on predicting Alzheimer’s disease risk in a Chinese cohort. Our approach significantly outperforms existing polygenic risk score methods and all other baselines, including the model that is trained entirely with haploid sequences.",
    "authors": [
        "Samuel Cahyawijaya",
        "Tiezheng Yu",
        "Zihan Liu",
        "Tiffany Mak",
        "Xiaopu Zhou",
        "N. Ip",
        "Pascale Fung"
    ],
    "venue": "Workshop on Biomedical Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "SNP2Vec is introduced, a scalable self-supervised pre-training approach for understanding SNP that significantly outperforms existing polygenic risk score methods and all other baselines, including the model that is trained entirely with haploid sequences."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}