{
    "acronym": "ab007c455551cba5de558b35e9866734133adfc4",
    "title": "On the Power of Convolution Augmented Transformer",
    "seed_ids": [
        "mamba",
        "based",
        "landmarkattn",
        "mechdesignscaling",
        "28eb18717cfa257f0fc49fb9512c48279cafa031",
        "e9484cf633985ccef70b0ce46866ce232a81ca4b",
        "05c1dc502ed51162580ccd320d5668d2fec94a7a",
        "9da427202cc48370fd66359f5d72ff5ff3bc8b57",
        "189fde3f4dfa105bb51472a8945618f395919560",
        "62b18cc55dcc7ffe52c28e1086aee893b7bc4334",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "6f6e2e0311589a9af045f6acd00b7dee6d19fce4",
        "60b35c6d68acced19b0c66edcfc0ee0a2c11efed",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "f393aff1593c2d370ec0ae004910d18e40524967",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "240300b1da360f22bf0b82c6817eacebba6deed4",
        "70e91e16eb321067d9402710e14a40cf28311f73",
        "ca444821352a4bd91884413d8070446e2960715a",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4"
    ],
    "s2id": "ab007c455551cba5de558b35e9866734133adfc4",
    "abstract": "The transformer architecture has catalyzed revolutionary advances in language modeling. However, recent architectural recipes, such as state-space models, have bridged the performance gap. Motivated by this, we examine the benefits of Convolution-Augmented Transformer (CAT) for recall, copying, and length generalization tasks. CAT incorporates convolutional filters in the K/Q/V embeddings of an attention layer. Through CAT, we show that the locality of the convolution synergizes with the global view of the attention. Unlike comparable architectures, such as Mamba or transformer, CAT can provably solve the associative recall (AR) and copying tasks using a single layer while also enjoying guaranteed length generalization. We also establish computational tradeoffs between convolution and attention by characterizing how convolution can mitigate the need for full attention by summarizing the context window and creating salient summary tokens to attend. Evaluations on real datasets corroborate our findings and demonstrate that CAT and its variations indeed enhance the language modeling performance.",
    "authors": [
        "Mingchen Li",
        "Xuechen Zhang",
        "Yixiao Huang",
        "Samet Oymak"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The benefits of Convolution-Augmented Transformer (CAT) for recall, copying, and length generalization tasks are examined and it is shown that the locality of the convolution synergizes with the global view of the attention."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}