{
    "acronym": "ac2824755ecbc1b84eb99b65b77f80d832de97ec",
    "title": "Aspect-Driven Structuring of Historical Dutch Newspaper Archives",
    "seed_ids": [
        "longformer",
        "3b39efe6c91ae432dd35bb79431edb8a6719f906",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "ac2824755ecbc1b84eb99b65b77f80d832de97ec",
    "abstract": "Digital libraries oftentimes provide access to historical newspaper archives via keyword-based search. Historical figures and their roles are particularly interesting cognitive access points in historical research. Structuring and clustering news articles would allow more sophisticated access for users to explore such information. However, real-world limitations such as the lack of training data, licensing restrictions and non-English text with OCR errors make the composition of such a system difficult and cost-intensive in practice. In this work we tackle these issues with the showcase of the National Library of the Netherlands by introducing a role-based interface that structures news articles on historical persons. In-depth, component-wise evaluations and interviews with domain experts highlighted our prototype's effectiveness and appropriateness for a real-world digital library collection.",
    "authors": [
        "H. Kroll",
        "Christin Katharina Kreutz",
        "Mirjam Cuper",
        "Bill Matthias Thang",
        "Wolf-Tilo Balke"
    ],
    "venue": "International Conference on Theory and Practice of Digital Libraries",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work tackles real-world limitations such as the lack of training data, licensing restrictions and non-English text with OCR errors make the composition of such a system difficult and cost-intensive in practice by introducing a role-based interface that structures news articles on historical persons."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}