{
    "acronym": "ac95a18762133d4065ac8af518c33084d83c5582",
    "title": "DialogLM: Pre-trained Model for Long Dialogue Understanding and Summarization",
    "seed_ids": [
        "bigbird",
        "longformer",
        "sinkhorn",
        "f8c6d9ed61fdf04cd390dce017a817152cf4d580",
        "fa51076458b7bcf9a60f476d525755e47199a6d8",
        "e32a12b14e212506115cc6804667b3d8297917e1",
        "9dc624d7258d1a56117ca720aea953ce46b66b21",
        "c828f4bf1a752700dd2c4a96fdd08ba938cda43d",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "34a4e6818d680875ff0bef9a76de0376118446d1",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "6ebfbc954b9975d2f2651f380b9bdf46ae963178"
    ],
    "s2id": "ac95a18762133d4065ac8af518c33084d83c5582",
    "abstract": "Dialogue is an essential part of human communication and cooperation. Existing research mainly focuses on short dialogue scenarios in a one-on-one fashion. However, multi-person interactions in the real world, such as meetings or interviews, are frequently over a few thousand words. There is still a lack of corresponding research and powerful tools to understand and process such long dialogues. Therefore, in this work, we present a pre-training framework for long dialogue understanding and summarization. Considering the nature of long conversations, we propose a window-based denoising approach for generative pre-training. For a dialogue, it corrupts a window of text with dialogue-inspired noise, and guides the model to reconstruct this window based on the content of the remaining conversation. Furthermore, to process longer input, we augment the model with sparse attention which is combined with conventional attention in a hybrid manner. We conduct extensive experiments on five datasets of long dialogues, covering tasks of dialogue summarization, abstractive question answering and topic segmentation. Experimentally, we show that our pre-trained model DialogLM significantly surpasses the state-of-the-art models across datasets and tasks. Source code and all the pre-trained models are available on our GitHub repository (https://github.com/microsoft/DialogLM).",
    "authors": [
        "Ming Zhong",
        "Yang Liu",
        "Yichong Xu",
        "Chenguang Zhu",
        "Michael Zeng"
    ],
    "venue": "AAAI Conference on Artificial Intelligence",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a window-based denoising approach for generative pre-training for long dialogue understanding and summarization, and shows that the pre-trained model DialogLM significantly surpasses the state-of-the-art models across datasets and tasks."
    },
    "citationCount": 101,
    "influentialCitationCount": 17,
    "code": null,
    "description": null,
    "url": null
}