{
    "acronym": "ac9adc254550948046a24b6b3367947a24b9399c",
    "title": "Dissecting Paraphrases: The Impact of Prompt Syntax and supplementary Information on Knowledge Retrieval from Pretrained Language Models",
    "seed_ids": [
        "bert",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee",
        "f6fbb6809374ca57205bd2cf1421d4f4fa04f975",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "ac9adc254550948046a24b6b3367947a24b9399c",
    "abstract": "Pre-trained Language Models (PLMs) are known to contain various kinds of knowledge.One method to infer relational knowledge is through the use of cloze-style prompts, where a model is tasked to predict missing subjects orobjects. Typically, designing these prompts is a tedious task because small differences in syntax or semantics can have a substantial impact on knowledge retrieval performance. Simultaneously, evaluating the impact of either prompt syntax or information is challenging due to their interdependence. We designed CONPARE-LAMA – a dedicated probe, consisting of 34 million distinct prompts that facilitate comparison across minimal paraphrases. These paraphrases follow a unified meta-template enabling the controlled variation of syntax and semantics across arbitrary relations.CONPARE-LAMA enables insights into the independent impact of either syntactical form or semantic information of paraphrases on the knowledge retrieval performance of PLMs. Extensive knowledge retrieval experiments using our probe reveal that prompts following clausal syntax have several desirable properties in comparison to appositive syntax: i) they are more useful when querying PLMs with a combination of supplementary information, ii) knowledge is more consistently recalled across different combinations of supplementary information, and iii) they decrease response uncertainty when retrieving known facts. In addition, range information can boost knowledge retrieval performance more than domain information, even though domain information is more reliably helpful across syntactic forms.",
    "authors": [
        "Stephan Linzbach",
        "Dimitar Dimitrov",
        "Laura Kallmeyer",
        "Kilian Evang",
        "Hajira Jabeen",
        "Stefan Dietze"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A dedicated probe, consisting of 34 million distinct prompts that facilitate comparison across minimal paraphrases, enables insights into the independent impact of either syntactical form or semantic information of paraphrases on the knowledge retrieval performance of PLMs."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}