{
    "acronym": "ad4079a98c1f289678b673705f6391aa1ad8549f",
    "title": "DiffuCOMET: Contextual Commonsense Knowledge Diffusion",
    "seed_ids": [
        "diffusionlm",
        "a1186d7d9a9ef258c76afef1177e4f348061a537",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "9fa9d5dd481400b2f3904b33d542d70a6affccb9",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "24425954960ce968e5f14360fbdd0605abcadfcf",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "ad4079a98c1f289678b673705f6391aa1ad8549f",
    "abstract": "Inferring contextually-relevant and diverse commonsense to understand narratives remains challenging for knowledge models. In this work, we develop a series of knowledge models, DiffuCOMET, that leverage diffusion to learn to reconstruct the implicit semantic connections between narrative contexts and relevant commonsense knowledge. Across multiple diffusion steps, our method progressively refines a representation of commonsense facts that is anchored to a narrative, producing contextually-relevant and diverse commonsense inferences for an input context. To evaluate DiffuCOMET, we introduce new metrics for commonsense inference that more closely measure knowledge diversity and contextual relevance. Our results on two different benchmarks, ComFact and WebNLG+, show that knowledge generated by DiffuCOMET achieves a better trade-off between commonsense diversity, contextual relevance and alignment to known gold references, compared to baseline knowledge models.",
    "authors": [
        "Silin Gao",
        "Mete Ismayilzada",
        "Mengjie Zhao",
        "Hiromi Wakaki",
        "Yuki Mitsufuji",
        "Antoine Bosselut"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work develops a series of knowledge models that leverage diffusion to learn to reconstruct the implicit semantic connections between narrative contexts and relevant commonsense knowledge, and introduces new metrics for commonsense inference that more closely measure knowledge diversity and contextual relevance."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}