{
    "acronym": "ad80530bad63e2f5939898bffbefa4b2956ee4f8",
    "title": "Espnet-Summ: Introducing a Novel Large Dataset, Toolkit, and a Cross-Corpora Evaluation of Speech Summarization Systems",
    "seed_ids": [
        "fnet",
        "2567a34501c1b258c102a07e737b87e556af0809",
        "20502e7a11acc275ddf0e188eba08ecce878bfb9",
        "f71e009fab41b7a40f9b5cd79b384738f8bb7e0d",
        "2fc384087f55111a196c96d88029aab324aa543e",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "ad80530bad63e2f5939898bffbefa4b2956ee4f8",
    "abstract": "Speech summarization has garnered significant interest and progressed rapidly over the past few years. In particular, end-to-end models have recently emerged as a competitive alternative to cascade systems for abstractive video summarization. This paper aims to establish progress in this rapidly evolving research field, by introducing ESPNet-SUMM, a new open-source toolkit that facilitates a comprehensive comparison of end-to-end and cascade speech summarization models on 4 different speech summarization tasks spanning diverse applications. Experiments demonstrate that end-to-end models perform better for larger corpora with shorter inputs. This work also introduces Interview, the largest public open-domain multiparty interview corpus with $4400 \\mathrm{~h}$ of conversations between radio hosts and guests. Finally, this work explores the use of multiple datasets to improve end-to-end summarization, and experiments demonstrate the benefit of multi-style training over fine-tuning. 1",
    "authors": [
        "Roshan S. Sharma",
        "William Chen",
        "Takatomo Kano",
        "Ruchira Sharma",
        "Siddhant Arora",
        "Shinji Watanabe",
        "A. Ogawa",
        "Marc Delcroix",
        "Rita Singh",
        "Bhiksha Raj"
    ],
    "venue": "Automatic Speech Recognition & Understanding",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "ESNet-SUMM is introduced, a new open-source toolkit that facilitates a comprehensive comparison of end-to-end and cascade speech summarization models on 4 different speech summarization tasks spanning diverse applications and the use of multiple datasets to improve end-to-end summarization."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}