{
    "acronym": "adee2bbb2e3b3808347c769113ccf5ae91203c53",
    "title": "Evaluation and optimization of sequence-based gene regulatory deep learning models",
    "seed_ids": [
        "bert"
    ],
    "s2id": "adee2bbb2e3b3808347c769113ccf5ae91203c53",
    "abstract": "Neural networks have emerged as immensely powerful tools in predicting functional genomic regions, notably evidenced by recent successes in deciphering gene regulatory logic. However, a systematic evaluation of how model architectures and training strategies impact genomics model performance is lacking. To address this gap, we held a DREAM Challenge where competitors trained models on a dataset of millions of random promoter DNA sequences and corresponding expression levels, experimentally determined in yeast, to best capture the relationship between regulatory DNA and gene expression. For a robust evaluation of the models, we designed a comprehensive suite of benchmarks encompassing various sequence types. While some benchmarks produced similar results across the top-performing models, others differed substantially. All top-performing models used neural networks, but diverged in architectures and novel training strategies, tailored to genomics sequence data. To dissect how architectural and training choices impact performance, we developed the Prix Fixe framework to divide any given model into logically equivalent building blocks. We tested all possible combinations for the top three models and observed performance improvements for each. The DREAM Challenge models not only achieved state-of-the-art results on our comprehensive yeast dataset but also consistently surpassed existing benchmarks on Drosophila and human genomic datasets. Overall, we demonstrate that high-quality gold-standard genomics datasets can drive significant progress in model development.",
    "authors": [
        "Abdul Muntakim Rafi",
        "Dmitry Penzar",
        "Daria Nogina",
        "Dohoon Lee",
        "E. D. Vaishnav",
        "Danyeong Lee",
        "Nayeon Kim",
        "Sangyeup Kim",
        "G. Meshcheryakov",
        "Andrey S. Lando",
        "Payman Yadollahpour",
        "Arsenii Zinkevich",
        "Dohyeon Kim",
        "Yeojin Shin",
        "Il-Youp Kwak",
        "Byeong-Chan Kim",
        "Juhyun Lee",
        "Sun Kim",
        "A. Regev",
        "Jake Albrecht",
        "W. Gong",
        "I. Kulakovskiy",
        "Pablo Meyer",
        "Carl G. de Boer"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The DREAM Challenge models not only achieved state-of-the-art results on the authors' comprehensive yeast dataset but also consistently surpassed existing benchmarks on Drosophila and human genomic datasets, demonstrating that high-quality gold-standard genomics datasets can drive significant progress in model development."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}