{
    "acronym": "ae32d3a4445355891d424c9ca1c12f6f402094e2",
    "title": "Fractional Fourier Image Transformer for Multimodal Remote Sensing Data Classification",
    "seed_ids": [
        "fnet",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "ae32d3a4445355891d424c9ca1c12f6f402094e2",
    "abstract": "With the recent development of the joint classification of hyperspectral image (HSI) and light detection and ranging (LiDAR) data, deep learning methods have achieved promising performance owing to their locally sematic feature extracting ability. Nonetheless, the limited receptive field restricted the convolutional neural networks (CNNs) to represent global contextual and sequential attributes, while visual image transformers (VITs) lose local semantic information. Focusing on these issues, we propose a fractional Fourier image transformer (FrIT) as a backbone network to extract both global and local contexts effectively. In the proposed FrIT framework, HSI and LiDAR data are first fused at the pixel level, and both multisource feature and HSI feature extractors are utilized to capture local contexts. Then, a plug-and-play image transformer FrIT is explored for global contextual and sequential feature extraction. Unlike the attention-based representations in classic VIT, FrIT is capable of speeding up the transformer architectures massively and learning valuable contextual information effectively and efficiently. More significantly, to reduce redundancy and loss of information from shallow to deep layers, FrIT is devised to connect contextual features in multiple fractional domains. Five HSI and LiDAR scenes including one newly labeled benchmark are utilized for extensive experiments, showing improvement over both CNNs and VITs.",
    "authors": [
        "Xudong Zhao",
        "Mengmeng Zhang",
        "Ran Tao",
        "Wei Li",
        "Wenzhi Liao",
        "Lianfang Tian",
        "Wilfried Philips"
    ],
    "venue": "IEEE Transactions on Neural Networks and Learning Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A fractional Fourier image transformer (FrIT) as a backbone network to extract both global and local contexts effectively and to reduce redundancy and loss of information from shallow to deep layers is devised."
    },
    "citationCount": 40,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}