{
    "acronym": "ae7606881a405a773dae6cce8efd87fe0b9b73d9",
    "title": "Zero-Shot Tokenizer Transfer",
    "seed_ids": [
        "gpt2",
        "ac45bbf9940512d9d686cf8cd3a95969bc313570",
        "e1f4b94479bfcb735a1a0add178a2337def07c9b",
        "c61065446ad3f2851b6553afeb5e6afc3fabdf94",
        "70ffc32ecb69740bd508a7863a2d303d4eb4f208",
        "17fbffb05fa14e21d1c506fd5f0f568b955fe983",
        "412e266cddfd87c79087a88ba1e4d11b89a45a13",
        "71ba5f845bd22d42003675b7cea970ca9e590bcc",
        "5e52d654fd31f04c1bd884cd5480e6af8c95ad50",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "ae7606881a405a773dae6cce8efd87fe0b9b73d9",
    "abstract": "Language models (LMs) are bound to their tokenizer, which maps raw text to a sequence of vocabulary items (tokens). This restricts their flexibility: for example, LMs trained primarily on English may still perform well in other natural and programming languages, but have vastly decreased efficiency due to their English-centric tokenizer. To mitigate this, we should be able to swap the original LM tokenizer with an arbitrary one, on the fly, without degrading performance. Hence, in this work we define a new problem: Zero-Shot Tokenizer Transfer (ZeTT). The challenge at the core of ZeTT is finding embeddings for the tokens in the vocabulary of the new tokenizer. Since prior heuristics for initializing embeddings often perform at chance level in a ZeTT setting, we propose a new solution: we train a hypernetwork taking a tokenizer as input and predicting the corresponding embeddings. We empirically demonstrate that the hypernetwork generalizes to new tokenizers both with encoder (e.g., XLM-R) and decoder LLMs (e.g., Mistral-7B). Our method comes close to the original models' performance in cross-lingual and coding tasks while markedly reducing the length of the tokenized sequence. We also find that the remaining gap can be quickly closed by continued training on less than 1B tokens. Finally, we show that a ZeTT hypernetwork trained for a base (L)LM can also be applied to fine-tuned variants without extra training. Overall, our results make substantial strides toward detaching LMs from their tokenizer.",
    "authors": [
        "Benjamin Minixhofer",
        "E. Ponti",
        "Ivan Vuli'c"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results make substantial strides toward detaching LMs from their tokenizer, and it is shown that a ZeTT hypernetwork trained for a base (L)LM can also be applied to fine-tuned variants without extra training."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}