{
    "acronym": "aef07ca1500bf59e12bc16abbfec3e03297c2ce8",
    "title": "Large-Scale Actionless Video Pre-Training via Discrete Diffusion for Efficient Policy Learning",
    "seed_ids": [
        "perceiverio",
        "1206b05eae5a06ba662ae79fb291b50e359c4f42",
        "828e27fd4fcd5e8982032b903950947b12afb6bb",
        "979810ca765695a481c37126103b8ba256ee2192",
        "60c8d0619481eaafdd1189af610d0e636271fed5",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "2d9ae4c167510ed78803735fc57ea67c3cc55a35",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "aef07ca1500bf59e12bc16abbfec3e03297c2ce8",
    "abstract": "Learning a generalist embodied agent capable of completing multiple tasks poses challenges, primarily stemming from the scarcity of action-labeled robotic datasets. In contrast, a vast amount of human videos exist, capturing intricate tasks and interactions with the physical world. Promising prospects arise for utilizing actionless human videos for pre-training and transferring the knowledge to facilitate robot policy learning through limited robot demonstrations. In this paper, we introduce a novel framework that leverages a unified discrete diffusion to combine generative pre-training on human videos and policy fine-tuning on a small number of action-labeled robot videos. We start by compressing both human and robot videos into unified video tokens. In the pre-training stage, we employ a discrete diffusion model with a mask-and-replace diffusion strategy to predict future video tokens in the latent space. In the fine-tuning stage, we harness the imagined future videos to guide low-level action learning trained on a limited set of robot data. Experiments demonstrate that our method generates high-fidelity future videos for planning and enhances the fine-tuned policies compared to previous state-of-the-art approaches with superior generalization ability. Our project website is available at https://video-diff.github.io/.",
    "authors": [
        "Haoran He",
        "Chenjia Bai",
        "Ling Pan",
        "Weinan Zhang",
        "Bin Zhao",
        "Xuelong Li"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces a novel framework that leverages a unified discrete diffusion model with a mask-and-replace diffusion strategy to combine generative pre-training on human videos and policy fine-tuning on a small number of action-labeled robot videos."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}