{
    "acronym": "af04a53668817026de8a21c1160005d49d21351b",
    "title": "Visual Attention Methods in Deep Learning: An In-Depth Survey",
    "seed_ids": [
        "rfa",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "a96d038246c4ad4a16bf97de09329bdcd0dc2ddf",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "c0f709acf38eb27702b0fbce1215db0ebaa2de2b",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "af04a53668817026de8a21c1160005d49d21351b",
    "abstract": "Inspired by the human cognitive system, attention is a mechanism that imitates the human cognitive awareness about specific information, amplifying critical details to focus more on the essential aspects of data. Deep learning has employed attention to boost performance for many applications. Interestingly, the same attention design can suit processing different data modalities and can easily be incorporated into large networks. Furthermore, multiple complementary attention mechanisms can be incorporated into one network. Hence, attention techniques have become extremely attractive. However, the literature lacks a comprehensive survey on attention techniques to guide researchers in employing attention in their deep models. Note that, besides being demanding in terms of training data and computational resources, transformers only cover a single category in self-attention out of the many categories available. We fill this gap and provide an in-depth survey of 50 attention techniques, categorizing them by their most prominent features. We initiate our discussion by introducing the fundamental concepts behind the success of the attention mechanism. Next, we furnish some essentials such as the strengths and limitations of each attention category, describe their fundamental building blocks, basic formulations with primary usage, and applications specifically for computer vision. We also discuss the challenges and general open questions related to attention mechanisms. Finally, we recommend possible future research directions for deep attention. All the information about visual attention methods in deep learning is provided at \\href{https://github.com/saeed-anwar/VisualAttention}{https://github.com/saeed-anwar/VisualAttention}",
    "authors": [
        "Mohammed Hassanin",
        "Saeed Anwar",
        "Ibrahim Radwan",
        "F. Khan",
        "A. Mian"
    ],
    "venue": "Information Fusion",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work provides an in-depth survey of 50 attention techniques, categorizing them by their most prominent features, and discusses the challenges and general open questions related to attention mechanisms."
    },
    "citationCount": 59,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}