{
    "acronym": "af2966d1dcffc2961a37aad88f7e51b984b096f9",
    "title": "L EARNING O PERATIONS FOR N EURAL PDE S OLVERS",
    "seed_ids": [
        "butterfly",
        "a68c3412e60560290400d2707596f82a914b7c00",
        "b1ac64438608aac1a8dfd0adf8fec8c6220f6bfd"
    ],
    "s2id": "af2966d1dcffc2961a37aad88f7e51b984b096f9",
    "abstract": "In recent years neural networks have been identified as candidates for fast partial differential equation (PDE) solvers, leading to numerous approaches to designing network layers that attempt to go beyond the usual convolution-based way of working with multi-dimensional data. We take a neural architecture search (NAS) inspired approach, introducing a relaxed space of neural operations that contains numerous types of layers including multi-channel convolutions and the recent state-of-the-art Fourier Neural Operators (FNOs) of Li et al. (2021b). To do so we exploit the fact that many operations of interest are linear maps diagonalized by efficient matrices such as the discrete Fourier transform (DFT); allowing these matrices to vary as additional “architecture parameters” of the model yields our Expressive Diagonalization (XD) operations. Empirically, we demonstrate that XD-operations outperform FNOs using a similar network across multiple problem settings while using fewer parameters in the case of 2d and 3d domains.",
    "authors": [
        "Nicholas Roberts",
        "M. Khodak",
        "Tri Dao",
        "Liam Li",
        "Christopher R´e",
        "Ameet Talwalkar"
    ],
    "venue": "",
    "year": null,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A neural architecture search (NAS) inspired approach is taken, introducing a relaxed space of neural operations that contains numerous types of layers including multi-channel convolutions and the recent state-of-the-art Fourier Neural Operators (FNOs) of Li et al. (2021b)."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}