{
    "acronym": "afad10da0a3b83a4f2a94e8c16c84ac64338e9fe",
    "title": "ERNIE-Doc: A Retrospective Long-Document Modeling Transformer",
    "seed_ids": [
        "bigbird",
        "longformer",
        "sparsetransformer",
        "transformerxl",
        "320efa53dea3e8f836790682fbd4196132c49749",
        "2c953a3c378b40dadf2e3fb486713c8608b8e282",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "34a4e6818d680875ff0bef9a76de0376118446d1",
        "f51497f463566581874c941353dd9d80069c5b77",
        "2e14e84ccec924ed770b58108ad1d9de6f0ca295",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "afad10da0a3b83a4f2a94e8c16c84ac64338e9fe",
    "abstract": "Transformers are not suited for processing long documents, due to their quadratically increasing memory and time consumption. Simply truncating a long document or applying the sparse attention mechanism will incur the context fragmentation problem or lead to an inferior modeling capability against comparable model sizes. In this paper, we propose ERNIE-Doc, a document-level language pretraining model based on Recurrence Transformers. Two well-designed techniques, namely the retrospective feed mechanism and the enhanced recurrence mechanism, enable ERNIE-Doc, which has a much longer effective context length, to capture the contextual information of a complete document. We pretrain ERNIE-Doc to explicitly learn the relationships among segments with an additional document-aware segment-reordering objective. Various experiments were conducted on both English and Chinese document-level tasks. ERNIE-Doc improved the state-of-the-art language modeling result of perplexity to 16.8 on WikiText-103. Moreover, it outperformed competitive pretraining models by a large margin on most language understanding tasks, such as text classification and question answering.",
    "authors": [
        "Siyu Ding",
        "Junyuan Shang",
        "Shuohuan Wang",
        "Yu Sun",
        "Hao Tian",
        "Hua Wu",
        "Haifeng Wang"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 45,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}