{
    "acronym": "afb2d837f337a60785a9f9a50f590f11f37876b0",
    "title": "From natural language to simulations: applying AI to automate simulation modelling of logistics systems",
    "seed_ids": [
        "gpt3",
        "1b45949be1b203f096d6451d88cf91174c620be7",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "afb2d837f337a60785a9f9a50f590f11f37876b0",
    "abstract": "ABSTRACT Our research strives to examine how simulation models of logistics systems can be produced automatically from verbal descriptions in natural language and how human experts and artificial intelligence (AI)-based systems can collaborate in the domain of simulation modelling. We demonstrate that a framework constructed upon the refined GPT-3 Codex is capable of generating functionally valid simulations for queuing and inventory management systems when provided with a verbal explanation. As a result, the language model could produce simulation models for inventory and process control. These results, along with the rapid improvement of language models, enable a significant simplification of simulation model development. Our study offers guidelines and a design of a natural language processing-based framework on how to build simulation models of logistics systems automatically, given the verbal description. In generalised terms, our work offers a technological underpinning of human-AI collaboration for the development of simulation models.",
    "authors": [
        "Ilya Jackson",
        "María Jesús Sáenz",
        "Dmitry A. Ivanov"
    ],
    "venue": "International Journal of Production Research",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that a framework constructed upon the refined GPT-3 Codex is capable of generating functionally valid simulations for queuing and inventory management systems when provided with a verbal explanation."
    },
    "citationCount": 15,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}