{
    "acronym": "afd9f4b861b954146c88a43f0f46504219b781a8",
    "title": "PEEP-Talk: A Situational Dialogue-based Chatbot for English Education",
    "seed_ids": [
        "gpt",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "afd9f4b861b954146c88a43f0f46504219b781a8",
    "abstract": "English is acknowledged worldwide as a mode of communication. However, due to the absence of realistic practicing scenarios, students learning English as a foreign language (EFL) typically have limited chances to converse and share feedback with others. In this paper, we propose PEEP-Talk, a real-world situational dialogue-based chatbot designed for English education. It also naturally switches to a new topic or situation in response to out-of-topic utterances, which are common among English beginners. Furthermore, PEEP-Talk provides feedback score on conversation and grammar error correction. We performed automatic and user evaluations to validate performance and education efficiency of our system. The results show that PEEP-Talk generates appropriate responses in various real-life situations while providing accurate feedback to learners. Moreover, we demonstrate a positive impact on English-speaking, grammar, and English learning anxiety, implying that PEEP-Talk can lower the barrier to learning natural conversation in effective ways.",
    "authors": [
        "Seugnjun Lee",
        "Yoonna Jang",
        "Chanjun Park",
        "Jungseob Lee",
        "Jaehyung Seo",
        "Hyeonseok Moon",
        "Sugyeong Eo",
        "Seounghoon Lee",
        "Bernardo Yahya",
        "Heu-Jeoung Lim"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A real-world situational dialogue-based chatbot designed for English education that generates appropriate responses in various real-life situations while providing accurate feedback to learners, PEEP-Talk demonstrates a positive impact on English-speaking, grammar, and English learning anxiety."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}