{
    "acronym": "afeeb8f5018eebb1a1d334b94dbbfc48d167efef",
    "title": "iTransformer: Inverted Transformers Are Effective for Time Series Forecasting",
    "seed_ids": [
        "flashattn",
        "flowformer",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "9b61adb6f0d1e8831ab2f5481a12e2125b13c50a",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "f7890aaf985b001e9226da375f8c2289a323db90"
    ],
    "s2id": "afeeb8f5018eebb1a1d334b94dbbfc48d167efef",
    "abstract": "The recent boom of linear forecasting models questions the ongoing passion for architectural modifications of Transformer-based forecasters. These forecasters leverage Transformers to model the global dependencies over temporal tokens of time series, with each token formed by multiple variates of the same timestamp. However, Transformers are challenged in forecasting series with larger lookback windows due to performance degradation and computation explosion. Besides, the embedding for each temporal token fuses multiple variates that represent potential delayed events and distinct physical measurements, which may fail in learning variate-centric representations and result in meaningless attention maps. In this work, we reflect on the competent duties of Transformer components and repurpose the Transformer architecture without any modification to the basic components. We propose iTransformer that simply applies the attention and feed-forward network on the inverted dimensions. Specifically, the time points of individual series are embedded into variate tokens which are utilized by the attention mechanism to capture multivariate correlations; meanwhile, the feed-forward network is applied for each variate token to learn nonlinear representations. The iTransformer model achieves state-of-the-art on challenging real-world datasets, which further empowers the Transformer family with promoted performance, generalization ability across different variates, and better utilization of arbitrary lookback windows, making it a nice alternative as the fundamental backbone of time series forecasting. Code is available at this repository: https://github.com/thuml/iTransformer.",
    "authors": [
        "Yong Liu",
        "Tengge Hu",
        "Haoran Zhang",
        "Haixu Wu",
        "Shiyu Wang",
        "Lintao Ma",
        "Mingsheng Long"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The iTransformer model achieves state-of-the-art on challenging real-world datasets, which further empowers the Transformer family with promoted performance, generalization ability across different variates, and better utilization of arbitrary lookback windows, making it a nice alternative as the fundamental backbone of time series forecasting."
    },
    "citationCount": 102,
    "influentialCitationCount": 27,
    "code": null,
    "description": null,
    "url": null
}