{
    "acronym": "b085968c4362fb286ad6c5ef71a5db9630da0498",
    "title": "KVQuant: Towards 10 Million Context Length LLM Inference with KV Cache Quantization",
    "seed_ids": [
        "pi",
        "4c14b1c41cb0aaa68f5d3f4a432f55e7199657ea",
        "713806165610c237f551a7b68e6b09b3ded75502",
        "b6346f9fa093b8e85df712485a2b851b9f680dac",
        "73290ecbec2f38d1d647ddef1ada69cee41725b3",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "60b35c6d68acced19b0c66edcfc0ee0a2c11efed",
        "0a6906bd6f026d3da3031c641ed03081bd0b574e",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "e3aa232577bb427b1f3a34acbdef84bd85734042"
    ],
    "s2id": "b085968c4362fb286ad6c5ef71a5db9630da0498",
    "abstract": "LLMs are seeing growing use for applications such as document analysis and summarization which require large context windows, and with these large context windows KV cache activations surface as the dominant contributor to memory consumption during inference. Quantization is a promising approach for compressing KV cache activations; however, existing solutions fail to represent activations accurately in ultra-low precisions, such as sub-4-bit. In this work, we present KVQuant, which addresses this problem by incorporating novel methods for quantizing cached KV activations, including: (i) Per-Channel Key Quantization, where we adjust the dimension along which we quantize the Key activations to better match the distribution; (ii) Pre-RoPE Key Quantization, where we quantize Key activations before the rotary positional embedding to mitigate its impact on quantization; (iii) Non-Uniform KV Cache Quantization, where we derive per-layer sensitivity-weighted non-uniform datatypes that better represent the distributions; and (iv) Per-Vector Dense-and-Sparse Quantization, where we isolate outliers separately for each vector to minimize skews in quantization ranges. By applying our method to the LLaMA, Llama-2, Llama-3, and Mistral models, we achieve $<0.1$ perplexity degradation with 3-bit quantization on both Wikitext-2 and C4, outperforming existing approaches. Our method enables serving the LLaMA-7B model with a context length of up to 1 million on a single A100-80GB GPU and up to 10 million on an 8-GPU system.",
    "authors": [
        "Coleman Hooper",
        "Sehoon Kim",
        "Hiva Mohammadzadeh",
        "Michael W. Mahoney",
        "Y. Shao",
        "Kurt Keutzer",
        "A. Gholami"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "KVQuant is presented, which addresses the problem of quantizing cached KV cache activations by incorporating novel methods for quantizing cached KV activations by incorporating novel methods for quantizing cached KV Cache Quantization."
    },
    "citationCount": 36,
    "influentialCitationCount": 7,
    "code": null,
    "description": null,
    "url": null
}