{
    "acronym": "b09e7e0ddb656ce6e8b7bfe40398e2b5785d86dc",
    "title": "Multi-Evidence based Fact Verification via A Confidential Graph Neural Network",
    "seed_ids": [
        "bert",
        "1e443b79706653bd668b13beb205e6f73146b2e6",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "81d89880586ff87b3ac8a14588b4e3f55c110ff8"
    ],
    "s2id": "b09e7e0ddb656ce6e8b7bfe40398e2b5785d86dc",
    "abstract": "Fact verification tasks aim to identify the integrity of textual contents according to the truthful corpus. Existing fact verification models usually build a fully connected reasoning graph, which regards claim-evidence pairs as nodes and connects them with edges. They employ the graph to propagate the semantics of the nodes. Nevertheless, the noisy nodes usually propagate their semantics via the edges of the reasoning graph, which misleads the semantic representations of other nodes and amplifies the noise signals. To mitigate the propagation of noisy semantic information, we introduce a Confidential Graph Attention Network (CO-GAT), which proposes a node masking mechanism for modeling the nodes. Specifically, CO-GAT calculates the node confidence score by estimating the relevance between the claim and evidence pieces. Then, the node masking mechanism uses the node confidence scores to control the noise information flow from the vanilla node to the other graph nodes. CO-GAT achieves a 73.59% FEVER score on the FEVER dataset and shows the generalization ability by broadening the effectiveness to the science-specific domain.",
    "authors": [
        "Yuqing Lan",
        "Zhenghao Liu",
        "Yu Gu",
        "Xiaoyuan Yi",
        "Xiaohua Li",
        "Liner Yang",
        "Ge Yu"
    ],
    "venue": "IEEE Transactions on Big Data",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Confidential Graph Attention Network (CO-GAT), which proposes a node masking mechanism for modeling the nodes, achieves a 73.59% FEVER score on the FEVER dataset and shows the generalization ability by broadening the effectiveness to the science-specific domain."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}