{
    "acronym": "b0bd64273dc8075db530fd696ee7eecb179bb908",
    "title": "Image Conductor: Precision Control for Interactive Video Synthesis",
    "seed_ids": [
        "classfreediffu",
        "1206b05eae5a06ba662ae79fb291b50e359c4f42",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "b0bd64273dc8075db530fd696ee7eecb179bb908",
    "abstract": "Filmmaking and animation production often require sophisticated techniques for coordinating camera transitions and object movements, typically involving labor-intensive real-world capturing. Despite advancements in generative AI for video creation, achieving precise control over motion for interactive video asset generation remains challenging. To this end, we propose Image Conductor, a method for precise control of camera transitions and object movements to generate video assets from a single image. An well-cultivated training strategy is proposed to separate distinct camera and object motion by camera LoRA weights and object LoRA weights. To further address cinematographic variations from ill-posed trajectories, we introduce a camera-free guidance technique during inference, enhancing object movements while eliminating camera transitions. Additionally, we develop a trajectory-oriented video motion data curation pipeline for training. Quantitative and qualitative experiments demonstrate our method's precision and fine-grained control in generating motion-controllable videos from images, advancing the practical application of interactive video synthesis. Project webpage available at https://liyaowei-stu.github.io/project/ImageConductor/",
    "authors": [
        "Yaowei Li",
        "Xintao Wang",
        "Zhaoyang Zhang",
        "Zhouxia Wang",
        "Ziyang Yuan",
        "Liangbin Xie",
        "Yuexian Zou",
        "Ying Shan"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}