{
    "acronym": "b0de1d5fe394226cec0a59d783ab739eb52da76f",
    "title": "G-Transformer for Document-Level Machine Translation",
    "seed_ids": [
        "longformer",
        "reformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "cae07d4d7552cd67a495de1c6c26eec0d2802f09",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280"
    ],
    "s2id": "b0de1d5fe394226cec0a59d783ab739eb52da76f",
    "abstract": "Document-level MT models are still far from satisfactory. Existing work extend translation unit from single sentence to multiple sentences. However, study shows that when we further enlarge the translation unit to a whole document, supervised training of Transformer can fail. In this paper, we find such failure is not caused by overfitting, but by sticking around local minima during training. Our analysis shows that the increased complexity of target-to-source attention is a reason for the failure. As a solution, we propose G-Transformer, introducing locality assumption as an inductive bias into Transformer, reducing the hypothesis space of the attention from target to source. Experiments show that G-Transformer converges faster and more stably than Transformer, achieving new state-of-the-art BLEU scores for both nonpretraining and pre-training settings on three benchmark datasets.",
    "authors": [
        "Guangsheng Bao",
        "Yue Zhang",
        "Zhiyang Teng",
        "Boxing Chen",
        "Weihua Luo"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "G-Transformer is proposed, introducing locality assumption as an inductive bias into Transformer, reducing the hypothesis space of the attention from target to source, and achieving new state-of-the-art BLEU scores for both nonpretraining and pre-training settings on three benchmark datasets."
    },
    "citationCount": 63,
    "influentialCitationCount": 15,
    "code": null,
    "description": null,
    "url": null
}