{
    "acronym": "b0e009533eddb7d2d45e5587989afc7d9b6b87ce",
    "title": "Neural correlates of object-extracted relative clause processing across English and Chinese",
    "seed_ids": [
        "gpt2",
        "eaee0b647d336c6fc8b844812675ec35cddf14a1",
        "f8b89d917065d5e406ba9769be020ba0d95a31ce",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "b0e009533eddb7d2d45e5587989afc7d9b6b87ce",
    "abstract": "Are the brain bases of language comprehension the same across all human languages, or do these bases vary in a way that corresponds to differences in linguistic typology? English and Mandarin Chinese attest such a typological difference in the domain of relative clauses. Using fMRI with English and Chinese participants, who listened to the same translation-equivalent story, we analyzed neuroimages time-aligned to object-extracted relative clauses in both languages. In a GLM analysis of these naturalistic data, comprehension was selectively associated with increased hemodynamic activity in left posterior temporal lobe, angular gyrus, inferior frontal gyrus, precuneus, and posterior cingulate cortex in both languages. This result suggests the processing of object-extracted relative clauses is subserved by a common collection of brain regions, regardless of typology. However, there were also regions that were activated uniquely in our Chinese participants albeit not to a significantly greater degree. These were in the temporal lobe. These Chinese-specific results could reflect structural ambiguity-resolution work that must be done in Chinese but not English ORCs.",
    "authors": [
        "Donald Dunagan",
        "Miloš Stanojević",
        "Maximin Coavoux",
        "Shulin Zhang",
        "Shohini Bhattasali",
        "Jixing Li",
        "Jonathan Brennan",
        "John Hale"
    ],
    "venue": "bioRxiv",
    "year": 2023,
    "tldr": null,
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}