{
    "acronym": "b1e600dfa7e61c54fb21fe4bd2d1edc7943166aa",
    "title": "CacheBlend: Fast Large Language Model Serving for RAG with Cached Knowledge Fusion",
    "seed_ids": [
        "griffin",
        "dee2bf14c31f876e7cf2c43b816dacbac666268f",
        "d53fe76bd2795a19ddf52d012917782f6f6f2c1e",
        "ef1b02dc1b82f9955fc4760fcefd92c0fff9f227",
        "b085968c4362fb286ad6c5ef71a5db9630da0498",
        "2b35b946a8ad64e018c24b283bc1c6c65d36fb67",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "e586a4591ba0303b769f2c07cbddaf1899cb72e4",
        "465471bb5bf1a945549d6291c2d23367966b4957",
        "5f895e84c1fea75de07b4f90da518273c2e57291",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "f4d546b9cd5681430de63e7d8739dc2d50045fb4"
    ],
    "s2id": "b1e600dfa7e61c54fb21fe4bd2d1edc7943166aa",
    "abstract": "Large language models (LLMs) often incorporate multiple text chunks in their inputs to provide the necessary contexts. To speed up the prefill of the long LLM inputs, one can pre-compute the KV cache of a text and re-use the KV cache when the context is reused as the prefix of another LLM input. However, the reused text chunks are not always the input prefix, and when they are not, their precomputed KV caches cannot be directly used since they ignore the text's cross-attention with the preceding text in the LLM input. Thus, the benefits of reusing KV caches remain largely unrealized. This paper tackles just one question: when an LLM input contains multiple text chunks, how to quickly combine their precomputed KV caches in order to achieve the same generation quality as the expensive full prefill (i.e., without reusing KV cache)? We present CacheBlend, a scheme that reuses the pre-computed KV caches, regardless prefix or not, and selectively recomputes the KV values of a small subset of tokens to partially update each reused KV cache. In the meantime,the small extra delay for recomputing some tokens can be pipelined with the retrieval of KV caches within the same job,allowing CacheBlend to store KV caches in slower devices with more storage capacity while retrieving them without increasing the inference delay. By comparing CacheBlend with the state-of-the-art KV cache reusing schemes on three open-source LLMs of various sizes and four popular benchmark datasets of different tasks, we show that CacheBlend reduces time-to-first-token (TTFT) by 2.2-3.3X and increases the inference throughput by 2.8-5X, compared with full KV recompute, without compromising generation quality or incurring more storage cost.",
    "authors": [
        "Jiayi Yao",
        "Hanchen Li",
        "Yuhan Liu",
        "Siddhant Ray",
        "Yihua Cheng",
        "Qizheng Zhang",
        "Kuntai Du",
        "Shan Lu",
        "Junchen Jiang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "CacheBlend is presented, a scheme that reuses the pre-computed KV caches, regardless prefix or not, and selectively recomputes the KV values of a small subset of tokens to partially update each reused KV cache, allowing CacheBlend to store KV caches in slower devices with more storage capacity while retrieving them without increasing the inference delay."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}