{
    "acronym": "b1fc02780a21bc0f61d8d8e70a8e8f6987c06bb0",
    "title": "Recurrent Attention Networks for Long-text Modeling",
    "seed_ids": [
        "longformer",
        "brt",
        "d6a0dfd5f39222d8924b7727a0a49f81fa247d71",
        "da1d6445b6b64ce9eb4587ba8abbdc490f648ec1",
        "33d15b2d2a434ab33a2a88585604f4728a324baf",
        "736eb449526fe7128917954ec5532b59e318ec78",
        "dc0102a51a9d33e104a4a3808a18cf17f057228c",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "1a703f08da01cf737cce3fb9064259b3f4b44e9c",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "b1fc02780a21bc0f61d8d8e70a8e8f6987c06bb0",
    "abstract": "Self-attention-based models have achieved remarkable progress in short-text mining. However, the quadratic computational complexities restrict their application in long text processing. Prior works have adopted the chunking strategy to divide long documents into chunks and stack a self-attention backbone with the recurrent structure to extract semantic representation. Such an approach disables parallelization of the attention mechanism, significantly increasing the training cost and raising hardware requirements. Revisiting the self-attention mechanism and the recurrent structure, this paper proposes a novel long-document encoding model, Recurrent Attention Network (RAN), to enable the recurrent operation of self-attention. Combining the advantages from both sides, the well-designed RAN is capable of extracting global semantics in both token-level and document-level representations, making it inherently compatible with both sequential and classification tasks, respectively. Furthermore, RAN is computationally scalable as it supports parallelization on long document processing. Extensive experiments demonstrate the long-text encoding ability of the proposed RAN model on both classification and sequential tasks, showing its potential for a wide range of applications.",
    "authors": [
        "Xianming Li",
        "Zongxi Li",
        "Xiaotian Luo",
        "Haoran Xie",
        "Xing Lee",
        "Yingbin Zhao",
        "Fu Lee Wang",
        "Qing Li"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel long-document encoding model, Recurrent Attention Network (RAN), is proposed to enable the recurrent operation of self-attention and is capable of extracting global semantics in both token-level and document-level representations, making it inherently compatible with both sequential and classification tasks, respectively."
    },
    "citationCount": 9,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}