{
    "acronym": "b25a3088e03d6ee3612bf8bb99d4dde3d7191900",
    "title": "Rethinking Efficacy of Softmax for Lightweight Non-local Neural Networks",
    "seed_ids": [
        "transformerxl",
        "2e644c67a697073d561da4f4dad35e5ad5316cfd",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87"
    ],
    "s2id": "b25a3088e03d6ee3612bf8bb99d4dde3d7191900",
    "abstract": "Non-local (NL) block is a popular module that demonstrates the capability to model global contexts. However, NL block generally has heavy computation and memory costs, so it is impractical to apply the block to high-resolution feature maps. In this paper, to investigate the efficacy of NL block, we empirically analyze if the magnitude and direction of input feature vectors properly affect the attention between vectors. The results show the inefficacy of softmax operation that is generally used to normalize the attention map of the NL block. Attention maps normalized with softmax operation highly rely upon magnitude of key vectors, and performance is degenerated if the magnitude information is removed. By replacing softmax operation with the scaling factor, we demonstrate improved performance on CIFAR-10, CIFAR-100, and Tiny-ImageNet. In Addition, our method shows robustness to embedding channel reduction and embedding weight initialization. Notably, our method makes multi-head attention employable without additional computational cost.",
    "authors": [
        "Yooshin Cho",
        "Youngsoo Kim",
        "Hanbyel Cho",
        "Jaesung Ahn",
        "H. Hong",
        "Junmo Kim"
    ],
    "venue": "International Conference on Information Photonics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper empirically analyzes if the magnitude and direction of input feature vectors properly affect the attention between vectors in non-local (NL) block and replaces softmax operation with the scaling factor, and shows robustness to embedding channel reduction and embedding weight initialization."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}