{
    "acronym": "b285df3cdae1eee198a86fe3b02b1e10c78df59e",
    "title": "Meta-Learning via Classifier(-free) Guidance",
    "seed_ids": [
        "classfreediffu",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "b285df3cdae1eee198a86fe3b02b1e10c78df59e",
    "abstract": "State-of-the-art meta-learning techniques do not optimize for zero-shot adaptation to unseen tasks, a setting in which humans excel. On the contrary, meta-learning algorithms learn hyperparameters and weight initializations that explicitly optimize for few-shot learning performance. In this work, we take inspiration from recent advances in generative modeling and language-conditioned image synthesis to pro-pose meta-learning techniques that use natural language guidance to achieve higher zero-shot performance compared to the state-of-the-art. We do so by recasting the meta-learning problem as a multi-modal generative modeling problem: given a task, we consider its adapted neural network weights and its natural language description as equivalent multi-modal task representations. We ﬁrst train an unconditional generative hypernetwork model to produce neural network weights; then we train a second “guidance” model that, given a natural language task description, traverses the hypernetwork latent space to ﬁnd high-performance task-adapted weights in a zero-shot manner. We explore two alternative approaches for latent space guidance: “HyperCLIP”-based classiﬁer guidance and a conditional Hypernetwork Latent Diffusion Model (“HyperLDM”), which we show to beneﬁt",
    "authors": [
        "Elvis Nava",
        "Seijin Kobayashi",
        "Yifei Yin",
        "Robert K. Katzschmann",
        "B. Grewe"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work takes inspiration from recent advances in generative modeling and language-conditioned image synthesis to pro-pose meta-learning techniques that use natural language guidance to achieve higher zero-shot performance compared to the state-of-the-art."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}