{
    "acronym": "b289d426e888a17b259b486a878c714e6ccd171e",
    "title": "A study of concept similarity in Wikidata",
    "seed_ids": [
        "bert",
        "933cb8bf1cd50d6d5833a627683327b15db28836"
    ],
    "s2id": "b289d426e888a17b259b486a878c714e6ccd171e",
    "abstract": "Robust estimation of concept similarity is crucial for applications of AI in the commercial, biomedical, and publishing domains, among others. While the related task of word similarity has been extensively studied, resulting in a wide range of methods, estimating concept similarity between nodes in Wikidata has not been considered so far. In light of the adoption of Wikidata for increasingly complex tasks that rely on similarity, and its unique size, breadth, and crowdsourcing nature, we propose that conceptual similarity should be revisited for the case of Wikidata. In this paper, we study a wide range of representative similarity methods for Wikidata, organized into three categories, and leverage background information for knowledge injection via retrofitting. We measure the impact of retrofitting with different weighted subsets from Wikidata and ProBase. Experiments on three benchmarks show that the best performance is achieved by pairing language models with rich information, whereas the impact of injecting knowledge is most positive on methods that originally do not consider comprehensive information. The performance of retrofitting is conditioned on the selection of high-quality similarity knowledge. A key limitation of this study, similar to prior work lies in the limited size and scope of the similarity benchmarks. While Wikidata provides an unprecedented possibility for a representative evaluation of concept similarity, effectively doing so remains a key challenge.",
    "authors": [
        "Filip Ilievski",
        "K. Shenoy",
        "Hans Chalupsky",
        "Nicholas Klein",
        "Pedro Szekely"
    ],
    "venue": "Semantic Web",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A wide range of representative similarity methods for Wikidata are studied, organized into three categories, and background information for knowledge injection via retrofitting is Leveraged and the impact of retrofitting with different weighted subsets from Wikidata and ProBase is measured."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}