{
    "acronym": "b2a3959b5253a02e5b82ab1c3491cd9204a6b883",
    "title": "Prompting for Numerical Sequences: A Case Study on Market Comment Generation",
    "seed_ids": [
        "gpt3",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "b2a3959b5253a02e5b82ab1c3491cd9204a6b883",
    "abstract": "Large language models (LLMs) have been applied to a wide range of data-to-text generation tasks, including tables, graphs, and time-series numerical data-to-text settings. While research on generating prompts for structured data such as tables and graphs is gaining momentum, in-depth investigations into prompting for time-series numerical data are lacking. Therefore, this study explores various input representations, including sequences of tokens and structured formats such as HTML, LaTeX, and Python-style codes. In our experiments, we focus on the task of Market Comment Generation, which involves taking a numerical sequence of stock prices as input and generating a corresponding market comment. Contrary to our expectations, the results show that prompts resembling programming languages yield better outcomes, whereas those similar to natural languages and longer formats, such as HTML and LaTeX, are less effective. Our findings offer insights into creating effective prompts for tasks that generate text from numerical sequences.",
    "authors": [
        "Masayuki Kawarada",
        "Tatsuya Ishigaki",
        "Hiroya Takamura"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study explores various input representations, including sequences of tokens and structured formats such as HTML, LaTeX, and Python-style codes, and shows that prompts resembling programming languages yield better outcomes, whereas those similar to natural languages and longer formats are less effective."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}