{
    "acronym": "b2b0e91254de5947cd9ed7ad894a95f5436226fb",
    "title": "It Is Not About What You Say, It Is About How You Say It: A Surprisingly Simple Approach for Improving Reading Comprehension",
    "seed_ids": [
        "gpt2",
        "gpt3",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "b2b0e91254de5947cd9ed7ad894a95f5436226fb",
    "abstract": "Natural language processing has seen rapid progress over the past decade. Due to the speed of developments, some practices get established without proper evaluation. Considering one such case and focusing on reading comprehension, we ask our first research question: 1) How does the order of inputs -- i.e., question and context -- affect model performance? Additionally, given recent advancements in input emphasis, we ask a second research question: 2) Does emphasizing either the question, the context, or both enhance performance? Experimenting with 9 large language models across 3 datasets, we find that presenting the context before the question improves model performance, with an accuracy increase of up to $31\\%$. Furthermore, emphasizing the context yields superior results compared to question emphasis, and in general, emphasizing parts of the input is particularly effective for addressing questions that models lack the parametric knowledge to answer. Experimenting with both prompt-based and attention-based emphasis methods, we additionally find that the best method is surprisingly simple: it only requires concatenating a few tokens to the input and results in an accuracy improvement of up to $36\\%$, allowing smaller models to outperform their significantly larger counterparts.",
    "authors": [
        "Sagi Shaier",
        "Lawrence E Hunter",
        "K. Wense"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Experimenting with 9 large language models across 3 datasets, it is found that presenting the context before the question improves model performance, with an accuracy increase of up to $31\\%$, allowing smaller models to outperform their significantly larger counterparts."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}