{
    "acronym": "b30195763eb103e2e5564228119f3810ab423b2e",
    "title": "Weakly-Supervised Text Classification Using Label Names Only",
    "seed_ids": [
        "gpt",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee"
    ],
    "s2id": "b30195763eb103e2e5564228119f3810ab423b2e",
    "abstract": "Current text classification methods typically require a good number of human-labeled documents as training data, which can be costly and difficult to obtain in real applications. Humans can perform classification without seeing any labeled examples but only based on a small set of words describing the categories to be classified. In this paper, we explore the potential of only using the label name of each class to train classification models on unlabeled data, without using any labeled documents. We use pre-trained neural language models both as general linguistic knowledge sources for category understanding and as representation learning models for document classification. Our method (1) associates semantically related words with the label names, (2) finds category-indicative words and trains the model to predict their implied categories, and (3) generalizes the model via self-training. We show that our model achieves around 90% accuracy on four benchmark datasets including topic and sentiment classification without using any labeled documents but learning from unlabeled data supervised by at most 3 words (1 in most cases) per class as the label name.",
    "authors": [
        "Yu Meng",
        "Yunyi Zhang",
        "Jiaxin Huang",
        "Chenyan Xiong",
        "Heng Ji",
        "Chao Zhang",
        "Jiawei Han"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper uses pre-trained neural language models both as general linguistic knowledge sources for category understanding and as representation learning models for document classification, and achieves around 90% accuracy on four benchmark datasets."
    },
    "citationCount": 60,
    "influentialCitationCount": 9,
    "code": null,
    "description": null,
    "url": null
}