{
    "acronym": "b39743039412e40fef6d5b2f86db36320eab30e1",
    "title": "DualCoOp: Fast Adaptation to Multi-Label Recognition with Limited Annotations",
    "seed_ids": [
        "gpt2",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "b39743039412e40fef6d5b2f86db36320eab30e1",
    "abstract": "Solving multi-label recognition (MLR) for images in the low-label regime is a challenging task with many real-world applications. Recent work learns an alignment between textual and visual spaces to compensate for insufficient image labels, but loses accuracy because of the limited amount of available MLR annotations. In this work, we utilize the strong alignment of textual and visual features pretrained with millions of auxiliary image-text pairs and propose Dual Context Optimization (DualCoOp) as a unified framework for partial-label MLR and zero-shot MLR. DualCoOp encodes positive and negative contexts with class names as part of the linguistic input (i.e. prompts). Since DualCoOp only introduces a very light learnable overhead upon the pretrained vision-language framework, it can quickly adapt to multi-label recognition tasks that have limited annotations and even unseen classes. Experiments on standard multi-label recognition benchmarks across two challenging low-label settings demonstrate the advantages of our approach over state-of-the-art methods.",
    "authors": [
        "Ximeng Sun",
        "Ping Hu",
        "Kate Saenko"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The strong alignment of textual and visual features pretrained with millions of auxiliary image-text pairs is utilized and Dual Context Optimization (DualCoOp) is proposed as a unified framework for partial-label MLR and zero-shot MLR."
    },
    "citationCount": 74,
    "influentialCitationCount": 12,
    "code": null,
    "description": null,
    "url": null
}