{
    "acronym": "b3c1fad1f5f8f0213b6d3f3458fa86205a3434f7",
    "title": "A Survey for Biomedical Text Summarization: From Pre-trained to Large Language Models",
    "seed_ids": [
        "gpt2",
        "longformer",
        "848909fbae167f21589bfc7a54fbf27e306b883c",
        "8a9e7290d403dd2098e5ce80d6338ae03071cf85",
        "89a87a8a3f94dc28ad941d64336c1744533b5a77",
        "c54a5fffdb9f30df445900742815de50dda28376",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "b15469d0ab3dc3a9dec037d761817b3fe546bed6",
        "d25121da56c9050137800c69520111b30201d1ed",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "25db56fc85fe15625c3375064a35e908ba6dfd2a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "b3c1fad1f5f8f0213b6d3f3458fa86205a3434f7",
    "abstract": "The exponential growth of biomedical texts such as biomedical literature and electronic health records (EHRs), poses a significant challenge for clinicians and researchers to access clinical information efficiently. To tackle this challenge, biomedical text summarization (BTS) has been proposed as a solution to support clinical information retrieval and management. BTS aims at generating concise summaries that distill key information from single or multiple biomedical documents. In recent years, the rapid advancement of fundamental natural language processing (NLP) techniques, from pre-trained language models (PLMs) to large language models (LLMs), has greatly facilitated the progress of BTS. This growth has led to numerous proposed summarization methods, datasets, and evaluation metrics, raising the need for a comprehensive and up-to-date survey for BTS. In this paper, we present a systematic review of recent advancements in BTS, leveraging cutting-edge NLP techniques from PLMs to LLMs, to help understand the latest progress, challenges, and future directions. We begin by introducing the foundational concepts of BTS, PLMs and LLMs, followed by an in-depth review of available datasets, recent approaches, and evaluation metrics in BTS. We finally discuss existing challenges and promising future directions in the era of LLMs. To facilitate the research community, we line up open resources including available datasets, recent approaches, codes, evaluation metrics, and the leaderboard in a public project: https://github.com/KenZLuo/Biomedical-Text-Summarization-Survey/tree/master. We believe that this survey will be a useful resource to researchers, allowing them to quickly track recent advancements and provide guidelines for future BTS research within the research community.",
    "authors": [
        "Qianqian Xie",
        "Zheheng Luo",
        "Benyou Wang",
        "S. Ananiadou"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A systematic review of recent advancements in BTS, leveraging cutting-edge NLP techniques from PLMs to LLMs, to help understand the latest progress, challenges, and future directions is presented."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}