{
    "acronym": "b3caabbae4b7c3b842086b21940ce9d5b25d476f",
    "title": "State-space Models with Layer-wise Nonlinearity are Universal Approximators with Exponential Decaying Memory",
    "seed_ids": [
        "hyena",
        "f393aff1593c2d370ec0ae004910d18e40524967",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "a128b1c47e6842605fb95bceae930d2135fc38fc",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "a30ac45ac5b7bd2148d3fb80ee7f3c29724e3170",
        "ca444821352a4bd91884413d8070446e2960715a",
        "1d5c8c6e5a774d2fef8d92bd28670a6345a97f7a",
        "7e9ff94476f41041c75e253e84f487db00e9c861"
    ],
    "s2id": "b3caabbae4b7c3b842086b21940ce9d5b25d476f",
    "abstract": "State-space models have gained popularity in sequence modelling due to their simple and efficient network structures. However, the absence of nonlinear activation along the temporal direction limits the model's capacity. In this paper, we prove that stacking state-space models with layer-wise nonlinear activation is sufficient to approximate any continuous sequence-to-sequence relationship. Our findings demonstrate that the addition of layer-wise nonlinear activation enhances the model's capacity to learn complex sequence patterns. Meanwhile, it can be seen both theoretically and empirically that the state-space models do not fundamentally resolve the issue of exponential decaying memory. Theoretical results are justified by numerical verifications.",
    "authors": [
        "Shida Wang",
        "Beichen Xue"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is proved that stacking state-space models with layer-wise nonlinear activation is sufficient to approximate any continuous sequence-to-sequence relationship."
    },
    "citationCount": 14,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}