{
    "acronym": "b3cddf8a3c83a66f8a5d995411ab7f1dc5a23cdf",
    "title": "GestFormer: Multiscale Wavelet Pooling Transformer Network for Dynamic Hand Gesture Recognition",
    "seed_ids": [
        "transformer",
        "metaformer",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "94b69cf199fa0b6c842e17fe5d6174a9d161c3df",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "b69b84706fe84c4c614e4473760c57dffbfeb9a0",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "b3cddf8a3c83a66f8a5d995411ab7f1dc5a23cdf",
    "abstract": "Transformer model have achieved state-of-the-art results in many applications like NLP, classification, etc. But their exploration in gesture recognition task is still limited. So, we propose a novel GestFormer architecture for dynamic hand gesture recognition. The motivation behind this design is to propose a resource efficient transformer model, since transformers are computationally expensive and very complex. So, we propose to use a pooling based token mixer named PoolFormer, since it uses only pooling layer which is a non-parametric layer instead of quadratic attention. The proposed model also leverages the space-invariant features of the wavelet transform and also the multiscale features are selected using multi-scale pooling. Further, a gated mechanism helps to focus on fine details of the gesture with the contextual information. This enhances the performance of the proposed model compared to the traditional transformer with fewer parameters, when evaluated on dynamic hand gesture datasets, NVidia Dynamic Hand Gesture and Briareo datasets. To prove the efficacy of the proposed model, we have experimented on single as well multimodal inputs such as infrared, normals, depth, optical flow and color images. We have also compared the proposed GestFormer in terms of resource efficiency and number of operations. The source code is available at https://github.com/mallikagarg/GestFormer.",
    "authors": [
        "Mallika Garg",
        "Debashis Ghosh",
        "P. M. Pradhan"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The motivation behind this design is to propose a resource efficient transformer model, since transformers are computationally expensive and very complex, and to use a pooling based token mixer named PoolFormer, since it uses only pooling layer which is a non-parametric layer instead of quadratic attention."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}