{
    "acronym": "b43b6eccea45eb485305dbfc20aa6f994e065490",
    "title": "Understanding Transformers for Bot Detection in Twitter",
    "seed_ids": [
        "gpt",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "b43b6eccea45eb485305dbfc20aa6f994e065490",
    "abstract": "In this paper we shed light on the impact of fine-tuning over social media data in the internal representations of neural language models. We focus on bot detection in Twitter, a key task to mitigate and counteract the automatic spreading of disinformation and bias in social media. We investigate the use of pre-trained language models to tackle the detection of tweets generated by a bot or a human account based exclusively on its content. Unlike the general trend in benchmarks like GLUE, where BERT generally outperforms generative transformers like GPT and GPT-2 for most classification tasks on regular text, we observe that fine-tuning generative transformers on a bot detection task produces higher accuracies. We analyze the architectural components of each transformer and study the effect of fine-tuning on their hidden states and output representations. Among our findings, we show that part of the syntactical information and distributional properties captured by BERT during pre-training is lost upon fine-tuning while the generative pre-training approach manage to preserve these properties.",
    "authors": [
        "Andres Garcia-Silva",
        "Cristian Berrio",
        "José Manuél Gómez-Pérez"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is observed that fine-tuning generative transformers on a bot detection task produces higher accuracies and part of the syntactical information and distributional properties captured by BERT during pre-training is lost upon fine- Tuning while the generative pre- training approach manage to preserve these properties."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}