{
    "acronym": "b47507f12a8b7d26f78a484e32a08d61d3f87358",
    "title": "BABILong: Testing the Limits of LLMs with Long Context Reasoning-in-a-Haystack",
    "seed_ids": [
        "gpt2",
        "infinibench",
        "rmt",
        "brt",
        "compressivetransformer",
        "884ca2feb4ffb14390e98daf95d1efbdca7a9b11",
        "d8b51d518f2dd62943762ceaa8961d3b1bfbcc1a",
        "cbaf689fd9ea9bc939510019d90535d6249b3367",
        "66c2ec4d903bc3718893e76b4303ec28e59e5552",
        "fd2cb81c01d9ab51c78de69b53f8b337775e290c",
        "2b8439f319dfa73df62ca8957ff6d0c1f3c7a73c",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "b0db25e317cf856f1ec1ca3df0e573d850ed4696",
        "cbbc2cc774c50b0b19922185b80e9ce90b7cd2f6",
        "2f7364d8e5cf94315bf8905f57de9c5543e9a4bf",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "d6a0dfd5f39222d8924b7727a0a49f81fa247d71",
        "b9a701c90f3d3df27366f5b29a97f798eb940ac7",
        "0e802c0739771acf70e60d59c2df51cd7e8c50c0",
        "736eb449526fe7128917954ec5532b59e318ec78",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "67ee20536c30a225b86902af2f091e28e5e19b40",
        "70557ea6b65846fc30729ceed224acd4ac64ca5d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "b47507f12a8b7d26f78a484e32a08d61d3f87358",
    "abstract": "In recent years, the input context sizes of large language models (LLMs) have increased dramatically. However, existing evaluation methods have not kept pace, failing to comprehensively assess the efficiency of models in handling long contexts. To bridge this gap, we introduce the BABILong benchmark, designed to test language models' ability to reason across facts distributed in extremely long documents. BABILong includes a diverse set of 20 reasoning tasks, including fact chaining, simple induction, deduction, counting, and handling lists/sets. These tasks are challenging on their own, and even more demanding when the required facts are scattered across long natural text. Our evaluations show that popular LLMs effectively utilize only 10-20\\% of the context and their performance declines sharply with increased reasoning complexity. Among alternatives to in-context reasoning, Retrieval-Augmented Generation methods achieve a modest 60\\% accuracy on single-fact question answering, independent of context length. Among context extension methods, the highest performance is demonstrated by recurrent memory transformers, enabling the processing of lengths up to 11 million tokens. The BABILong benchmark is extendable to any length to support the evaluation of new upcoming models with increased capabilities, and we provide splits up to 1 million token lengths.",
    "authors": [
        "Yuri Kuratov",
        "Aydar Bulatov",
        "Petr Anokhin",
        "Ivan Rodkin",
        "Dmitry Sorokin",
        "Artyom Sorokin",
        "Mikhail Burtsev"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The BABILong benchmark is introduced, designed to test language models' ability to reason across facts distributed in extremely long documents, and is extendable to any length to support the evaluation of new upcoming models with increased capabilities."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}