{
    "acronym": "b5323e2f9a6ebbd1578fc045c3c8d37cc5cfaf3b",
    "title": "Ensembling Models for the Generation of Queries to an Altering Search Engine Using Reinforcement Learning",
    "seed_ids": [
        "memcompress"
    ],
    "s2id": "b5323e2f9a6ebbd1578fc045c3c8d37cc5cfaf3b",
    "abstract": "The automatic generation of queries to a search engine based on the incoming text is important for question-answering, recommendation, and text reuse detection systems. Every such query requires resources from a user and a search engine itself. A method of ensembling query generation models that maximizes the search completeness metric for the minimum number of queries could be useful. The task of selecting the best model or an ensemble of models is trivial for the case of a fixed search engine. However, real search engines are constantly changing their behavior, learning on incoming data, changing their index of web pages and documents. They are black boxes for a user. In this paper we propose an approach to ensemble query generation models based on reinforcement learning. By reformulating the problem so that the agent selects a sequence of models rather than a single query generation model, we guarantee maximum retrieval recall even when the worst possible action is selected. As a reward, we introduce a discount recall metric that penalizes the agent for each extra step of a model request. We modify the UCB learning algorithm so that the re-initialization of the recidivism penalty matrix occurs independently of the engine index state. In this way, we ensure that the top 3 best actions (i.e. sequences of generation model requests) are found in just 5 epochs, each epoch contains 1050 documents. The model ensemble maintains a stable performance even when the index alters in a way that the ensemble was not informed about.",
    "authors": [
        "Damir Shodiev",
        "Ilia Kopanichuk",
        "Artem Chashchin",
        "Andrey Grabovoy",
        "A. Kildyakov",
        "Yury Chekhovich"
    ],
    "venue": "2023 Ivannikov Ispras Open Conference (ISPRAS)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper reformulates the problem so that the agent selects a sequence of models rather than a single query generation model, guaranteeing maximum retrieval recall even when the worst possible action is selected, and introduces a discount recall metric that penalizes the agent for each extra step of a model request."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}