{
    "acronym": "b5718931570960c896868bd094f22ef3dbb9d281",
    "title": "The Overcooked Generalisation Challenge",
    "seed_ids": [
        "s5",
        "f73c5a1ab681f34e11efc634253a8bd287667efb",
        "d98b5c1d0f9a4e39dc79ea7a3f74e54789df5e13",
        "bfe6fd05f09647b001c7eb6e333a95c881c88344",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51"
    ],
    "s2id": "b5718931570960c896868bd094f22ef3dbb9d281",
    "abstract": "We introduce the Overcooked Generalisation Challenge (OGC) - the first benchmark to study agents' zero-shot cooperation abilities when faced with novel partners and levels in the Overcooked-AI environment. This perspective starkly contrasts a large body of previous work that has trained and evaluated cooperating agents only on the same level, failing to capture generalisation abilities required for real-world human-AI cooperation. Our challenge interfaces with state-of-the-art dual curriculum design (DCD) methods to generate auto-curricula for training general agents in Overcooked. It is the first cooperative multi-agent environment specially designed for DCD methods and, consequently, the first benchmarked with state-of-the-art methods. It is fully GPU-accelerated, built on the DCD benchmark suite minimax, and freely available under an open-source license: https://git.hcics.simtech.uni-stuttgart.de/public-projects/OGC. We show that current DCD algorithms struggle to produce useful policies in this novel challenge, even if combined with recent network architectures that were designed for scalability and generalisability. The OGC pushes the boundaries of real-world human-AI cooperation by enabling the research community to study the impact of generalisation on cooperating agents.",
    "authors": [
        "Constantin Ruhdorfer",
        "Matteo Bortoletto",
        "Anna Penzkofer",
        "Andreas Bulling"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Overcooked Generalisation Challenge (OGC) is introduced - the first benchmark to study agents' zero-shot cooperation abilities when faced with novel partners and levels in the Overcooked-AI environment and is the first benchmarked with state-of-the-art methods."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}