{
    "acronym": "b5753b738ce4efe08303fef48aa711df6d0bc719",
    "title": "Cross-species modeling of plant genomes at single nucleotide resolution using a pre-trained DNA language model",
    "seed_ids": [
        "mamba",
        "7d281e18a7416dfd5e67809c21663244426f6554",
        "bfd2b76998a0521c12903ef5ced517adf70ad2ba",
        "0f4780f3f42dbe9755d54495ae17244cc88a7483"
    ],
    "s2id": "b5753b738ce4efe08303fef48aa711df6d0bc719",
    "abstract": "Understanding the function and fitness effects of diverse plant genomes requires transferable models. Language models (LMs) pre-trained on large-scale biological sequences can learn evolutionary conservation, thus expected to offer better cross-species prediction through fine-tuning on limited labeled data compared to supervised deep learning models. We introduce PlantCaduceus, a plant DNA LM based on the Caduceus and Mamba architectures, pre-trained on a carefully curated dataset consisting of 16 diverse Angiosperm genomes. Fine-tuning PlantCaduceus on limited labeled Arabidopsis data for four tasks involving transcription and translation modeling demonstrated high transferability to maize that diverged 160 million years ago, outperforming the best baseline model by 1.45-fold to 7.23-fold. PlantCaduceus also enables genome-wide deleterious mutation identification without multiple sequence alignment (MSA). PlantCaduceus demonstrated a threefold enrichment of rare alleles in prioritized deleterious mutations compared to MSA-based methods and matched state-of-the-art protein LMs. PlantCaduceus is a versatile pre-trained DNA LM expected to accelerate plant genomics and crop breeding applications.",
    "authors": [
        "Jingjing Zhai",
        "Aaron Gokaslan",
        "Yair Schiff",
        "Ana Berthel",
        "Zong-Yan Liu",
        "Zachary R. Miller",
        "Armin Scheben",
        "Michelle C. Stitzer",
        "M. Romay",
        "Edward S. Buckler",
        "Volodymyr Kuleshov"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "PlantCaduceus is a versatile pre-trained DNA LM expected to accelerate plant genomics and crop breeding applications and demonstrates a threefold enrichment of rare alleles in prioritized deleterious mutations compared to MSA-based methods and matched state-of-the-art protein LMs."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}