{
    "acronym": "b5982eee6b5d24c740d7d543a08859582f184bed",
    "title": "Training-Free Exponential Extension of Sliding Window Context with Cascading KV Cache",
    "seed_ids": [
        "streamingllm",
        "3fd5bc3077d04965eaa3498372c39bbdd09d55e4",
        "4e2a3ddeaf5defb9318b43c364b9a9efe3847dcf",
        "93e58491830abe1eb965ab37ec64fa97263f6048",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "5fc1a3a49e8f1d106118b69d1d6be3b6caa23da0",
        "b6346f9fa093b8e85df712485a2b851b9f680dac",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "60b35c6d68acced19b0c66edcfc0ee0a2c11efed",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77"
    ],
    "s2id": "b5982eee6b5d24c740d7d543a08859582f184bed",
    "abstract": "The context window within a transformer provides a form of active memory for the current task, which can be useful for few-shot learning and conditional generation, both which depend heavily on previous context tokens. However, as the context length grows, the computational cost increases quadratically. Recent works have shown that saving a few initial tokens along with a fixed-sized sliding window leads to stable streaming generation with linear complexity in transformer-based Large Language Models (LLMs). However, they make suboptimal use of the fixed window by naively evicting all tokens unconditionally from the key-value (KV) cache once they reach the end of the window, resulting in tokens being forgotten and no longer able to affect subsequent predictions. To overcome this limitation, we propose a novel mechanism for storing longer sliding window contexts with the same total cache size by keeping separate cascading sub-cache buffers whereby each subsequent buffer conditionally accepts a fraction of the relatively more important tokens evicted from the previous buffer. Our method results in a dynamic KV cache that can store tokens from the more distant past than a fixed, static sliding window approach. Our experiments show improvements of 5.6% on long context generation (LongBench), 1.2% in streaming perplexity (PG19), and 0.6% in language understanding (MMLU STEM) using LLMs given the same fixed cache size. Additionally, we provide an efficient implementation that improves the KV cache latency from 1.33ms per caching operation to 0.54ms, a 59% speedup over previous work.",
    "authors": [
        "Jeffrey Willette",
        "Heejun Lee",
        "Youngwan Lee",
        "Myeongjae Jeon",
        "Sung Ju Hwang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel mechanism for storing longer sliding window contexts with the same total cache size by keeping separate cascading sub-cache buffers whereby each subsequent buffer conditionally accepts a fraction of the relatively more important tokens evicted from the previous buffer."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}