{
    "acronym": "b5b019e1aee09dbaf1147be7bfe0736ed51736ee",
    "title": "ECtHR-PCR: A Dataset for Precedent Understanding and Prior Case Retrieval in the European Court of Human Rights",
    "seed_ids": [
        "bert",
        "ff28f812113a7082f7d285ed3bf6dcbed49d0320",
        "0476fe2b42398f3482946fff2d5392e22662a248",
        "063bfb1cb74a8150a5378125cd34d998aac9dd21",
        "cc2d1a66c701e9be9124eb95431b6c3dd79a61d3"
    ],
    "s2id": "b5b019e1aee09dbaf1147be7bfe0736ed51736ee",
    "abstract": "In common law jurisdictions, legal practitioners rely on precedents to construct arguments, in line with the doctrine of stare decisis. As the number of cases grow over the years, prior case retrieval (PCR) has garnered significant attention. Besides lacking real-world scale, existing PCR datasets do not simulate a realistic setting, because their queries use complete case documents while only masking references to prior cases. The query is thereby exposed to legal reasoning not yet available when constructing an argument for an undecided case as well as spurious patterns left behind by citation masks, potentially short-circuiting a comprehensive understanding of case facts and legal principles. To address these limitations, we introduce a PCR dataset based on judgements from the European Court of Human Rights (ECtHR), which explicitly separate facts from arguments and exhibit precedential practices, aiding us to develop this PCR dataset to foster systems’ comprehensive understanding. We benchmark different lexical and dense retrieval approaches with various negative sampling strategies, adapting them to deal with long text sequences using hierarchical variants. We found that difficulty-based negative sampling strategies were not effective for the PCR task, highlighting the need for investigation into domain-specific difficulty criteria. Furthermore, we observe performance of the dense models degrade with time and calls for further research into temporal adaptation of retrieval models. Additionally, we assess the influence of different views , Halsbury’s and Goodhart’s, in practice in ECtHR jurisdiction using PCR task.",
    "authors": [
        "Santosh T.Y.S.S",
        "R. Haddad",
        "Matthias Grabmair"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A PCR dataset based on judgements from the European Court of Human Rights (ECtHR) is introduced, which explicitly separate facts from arguments and exhibit precedential practices, aiding to develop this PCR dataset to foster systems’ comprehensive understanding."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}