{
    "acronym": "b639124771f9c62cd656a24e8e685a456918e0ff",
    "title": "Character-Level Encoding with S4 for QA",
    "seed_ids": [
        "s4",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "b639124771f9c62cd656a24e8e685a456918e0ff",
    "abstract": "We propose a question answering model that encodes text inputs at character level to utilize subword structures and mitigate the out-of-vocabulary problem. Character-level inputs are quite long compared to word sequences, so the model encoding them should be able to handle long-range dependencies effectively and efficiently. S4 (Structured State Space sequence model) is such a model that fulfills this requirement. We build our model based on QANet, replacing all the CNN and self-attention layers with S4 layers, and feeding it with character embeddings. To make the model benefit both from character-level information and word-level information, our model first encodes inputs at character-level, and then aggregates the character-level hidden states to word-level hidden states by a max pooling operation, so that word-level modeling can be applied in the deeper stages of the network. Experiments on SQuAD 2.0 show that both S4 and character-level encoding improve the model performance on the question answering task. Case studies attribute part of this improvement to the out-of-vocabulary problem.",
    "authors": [
        "Stanford CS224N",
        "Peng Chen"
    ],
    "venue": "",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A question answering model that encodes text inputs at character level to utilize subword structures and mitigate the out-of-vocabulary problem is proposed, and both S4 and character-level encoding improve the model performance on the question answering task."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}