{
    "acronym": "b64e7b1b23f2b42e96d8803b53dca03acc0218e7",
    "title": "DLUE: Benchmarking Document Language Understanding",
    "seed_ids": [
        "performer",
        "linformer",
        "longformer",
        "sparsetransformer",
        "2b60b8b639c916f934026af4bd4b9a8b66062704",
        "4e3935ef7da6bcbb202ec7f8b285c313cadcd044",
        "9dc624d7258d1a56117ca720aea953ce46b66b21",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "d9f6ada77448664b71128bb19df15765336974a6"
    ],
    "s2id": "b64e7b1b23f2b42e96d8803b53dca03acc0218e7",
    "abstract": "Understanding documents is central to many real-world tasks but remains a challenging topic. Unfortunately, there is no well-established consensus on how to comprehensively evaluate document understanding abilities, which significantly hinders the fair comparison and measuring the progress of the field. To benchmark document understanding researches, this paper summarizes four representative abilities, i.e., document classification, document structural analysis, document information extraction, and document transcription. Under the new evaluation framework, we propose \\textbf{Document Language Understanding Evaluation} -- \\textbf{DLUE}, a new task suite which covers a wide-range of tasks in various forms, domains and document genres. We also systematically evaluate six well-established transformer models on DLUE, and find that due to the lengthy content, complicated underlying structure and dispersed knowledge, document understanding is still far from being solved, and currently there is no neural architecture that dominates all tasks, raising requirements for a universal document understanding architecture.",
    "authors": [
        "Ruoxi Xu",
        "Hongyu Lin",
        "Xinyan Guan",
        "Xianpei Han",
        "Yingfei Sun",
        "Le Sun"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper summarizes four representative abilities of document understanding abilities, i.e., document classification, document structural analysis, document information extraction, and document transcription, and proposes a new task suite which covers a wide-range of tasks in various forms, domains and document genres."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}