{
    "acronym": "b6a2d35629eaa19d3f2b2963a828763534a8749f",
    "title": "A Case Study on Context-Aware Neural Machine Translation with Multi-Task Learning",
    "seed_ids": [
        "transformer",
        "b0de1d5fe394226cec0a59d783ab739eb52da76f",
        "7a09101ac03b74db501648597fa54e992a0fc84f"
    ],
    "s2id": "b6a2d35629eaa19d3f2b2963a828763534a8749f",
    "abstract": "In document-level neural machine translation (DocNMT), multi-encoder approaches are common in encoding context and source sentences. Recent studies \\cite{li-etal-2020-multi-encoder} have shown that the context encoder generates noise and makes the model robust to the choice of context. This paper further investigates this observation by explicitly modelling context encoding through multi-task learning (MTL) to make the model sensitive to the choice of context. We conduct experiments on cascade MTL architecture, which consists of one encoder and two decoders. Generation of the source from the context is considered an auxiliary task, and generation of the target from the source is the main task. We experimented with German--English language pairs on News, TED, and Europarl corpora. Evaluation results show that the proposed MTL approach performs better than concatenation-based and multi-encoder DocNMT models in low-resource settings and is sensitive to the choice of context. However, we observe that the MTL models are failing to generate the source from the context. These observations align with the previous studies, and this might suggest that the available document-level parallel corpora are not context-aware, and a robust sentence-level model can outperform the context-aware models.",
    "authors": [
        "Ramakrishna Appicharla",
        "Baban Gain",
        "Santanu Pal",
        "Asif Ekbal",
        "Pushpak Bhattacharyya"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed MTL approach performs better than concatenation-based and multi-encoder DocNMT models in low-resource settings and is sensitive to the choice of context, but it is observed that the MTL models are failing to generate the source from the context."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}