{
    "acronym": "b6a5c103e01d43f7a3bd23939947701ee8d05e0a",
    "title": "City-wide Origin-Destination Matrix Generation via Graph Denoising Diffusion",
    "seed_ids": [
        "d3pms",
        "9714b88d4d984426d901fc539c7c69d03290ce12",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "b6a5c103e01d43f7a3bd23939947701ee8d05e0a",
    "abstract": "The Origin-Destination (OD) matrix provides an estimation of number of individuals traveling between regions, i.e., mobility flow in the city, which is widely-used in urban planning, transportation, etc. Given various city characteristics of urban regions, generating the city-wide OD matrix without using historical flow information has become increasingly appealing to both researchers and practitioners. However, existing works are limited in independent generation of each element, i.e., flow, in OD matrix, overlooking the element relations within the matrix that can be well formulated as a network. In this paper, we instead propose to generate the city-wide OD matrix from the network perspective, and design a graph denoising diffusion method to learn the conditional joint probability distribution of all elements in the OD matrix given city characteristics at region level. To overcome the learning difficulty of the city-wide OD matrix covering over thousands of regions, we decompose the original one-shot generative modeling of the diffusion model into two cascaded stages, corresponding to the generation of network topology and mobility flow, respectively. To further reproduce important network properties contained in city-wide OD matrices, we design an elaborated graph denoising network structure including a node property augmentation module and a graph transformer backbone. Empirical experiments on data collected in two large US cities have verified that our method can generate OD matrices for new cities with network statistics remarkably similar with the ground truth, further achieving superior outperformance over competitive baselines in terms of the generation realism.",
    "authors": [
        "Can Rong"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper designs a graph denoising diffusion method to learn the conditional joint probability distribution of all elements in the OD matrix given city characteristics at region level, and decomposes the original one-shot generative modeling of the diffusion model into two cascaded stages corresponding to the generation of network topology and mobility flow."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}