{
    "acronym": "b73248a3902494d9d5c303bc39807446464fef27",
    "title": "A Unified and Biologically-Plausible Relational Graph Representation of Vision Transformers",
    "seed_ids": [
        "metaformer",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "b73248a3902494d9d5c303bc39807446464fef27",
    "abstract": "Vision transformer (ViT) and its variants have achieved remarkable success in various tasks. The key characteristic of these ViT models is to adopt different aggregation strategies of spatial patch information within the artificial neural networks (ANNs). However, there is still a key lack of unified representation of different ViT architectures for systematic understanding and assessment of model representation performance. Moreover, how those well-performing ViT ANNs are similar to real biological neural networks (BNNs) is largely unexplored. To answer these fundamental questions, we, for the first time, propose a unified and biologically plausible relational graph representation of ViT models. Specifically, the proposed relational graph representation consists of two key subgraphs: an aggregation graph and an affine graph. The former considers ViT tokens as nodes and describes their spatial interaction, while the latter regards network channels as nodes and reflects the information communication between channels. Using this unified relational graph representation, we found that: 1) model performance was closely related to graph measures; 2) the proposed relational graph representation of ViT has high similarity with real BNNs; and 3) there was a further improvement in model performance when training with a superior model to constrain the aggregation graph.",
    "authors": [
        "Yuzhong Chen",
        "Yu Du",
        "Zhe Xiao",
        "Lin Zhao",
        "Lu Zhang",
        "David Liu",
        "Dajiang Zhu",
        "Tuo Zhang",
        "Xintao Hu",
        "Tianming Liu",
        "Xi Jiang"
    ],
    "venue": "IEEE Transactions on Neural Networks and Learning Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a unified and biologically plausible relational graph representation of ViT models that considers ViT tokens as nodes and describes their spatial interaction, while the latter regards network channels as nodes and reflects the information communication between channels."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}