{
    "acronym": "b78c1b7d8658a203257689f2ef390b08a9d36a21",
    "title": "Unified Chest X-ray and Radiology Report Generation Model with Multi-view Chest X-rays",
    "seed_ids": [
        "performer",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06"
    ],
    "s2id": "b78c1b7d8658a203257689f2ef390b08a9d36a21",
    "abstract": "Generated synthetic data in medical research can substitute privacy and security-sensitive data with a large-scale curated dataset, reducing data collection and annotation costs. As part of this effort, we propose UniXGen, a uniﬁed chest X-ray and report generation model, with the following contributions. First, we design a uniﬁed model for bidirectional chest X-ray and report generation by adopting a vector quantization method to discretize chest X-rays into discrete visual tokens and formulating both tasks as sequence generation tasks. Second, we introduce several special tokens to generate chest X-rays with speciﬁc views that can be useful when the desired views are unavailable. Furthermore, UniXGen can ﬂexibly take various inputs from single to multiple views to take advantage of the additional ﬁndings available in other X-ray views. We adopt an efﬁcient transformer for computational and memory efﬁciency to handle the long-range input sequence of multi-view chest X-rays with high resolution and long paragraph reports. In extensive experiments, we show that our uniﬁed model has a synergistic effect on both generation tasks, as opposed to training only the task-speciﬁc models. We also ﬁnd that view-speciﬁc special tokens can distinguish between different views and properly generate speciﬁc views even if they do not exist in the dataset, and utilizing multi-view chest X-rays can faithfully capture the abnormal ﬁndings",
    "authors": [
        "HyunGyung Lee",
        "Wonjae Kim",
        "Jin-Hwa Kim",
        "Tackeun Kim",
        "Jihang Kim",
        "L. Sunwoo",
        "E. Choi"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The UniXGen model has a synergistic effect on both generation tasks, as opposed to training only the task-speciﬁc models, and utilizing multi-view chest X-rays can faithfully capture the abnormal segments of the dataset."
    },
    "citationCount": 15,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}