{
    "acronym": "b7a87ddf2022edc6c4db6f39df67c286c37e4bda",
    "title": "DLT: Conditioned layout generation with Joint Discrete-Continuous Diffusion Layout Transformer",
    "seed_ids": [
        "d3pms",
        "81621c53c6aa421deb81bb1359138ded0fb4e258",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "15736f7c205d961c00378a938daffaacb5a0718d",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "b7a87ddf2022edc6c4db6f39df67c286c37e4bda",
    "abstract": "Generating visual layouts is an essential ingredient of graphic design. The ability to condition layout generation on a partial subset of component attributes is critical to real-world applications that involve user interaction. Recently, diffusion models have demonstrated high-quality generative performances in various domains. However, it is unclear how to apply diffusion models to the natural representation of layouts which consists of a mix of discrete (class) and continuous (location, size) attributes. To address the conditioning layout generation problem, we introduce DLT, a joint discrete-continuous diffusion model. DLT is a transformer-based model which has a flexible conditioning mechanism that allows for conditioning on any given subset of all the layout component classes, locations, and sizes. Our method outperforms state-of-the-art generative models on various layout generation datasets with respect to different metrics and conditioning settings. Additionally, we validate the effectiveness of our proposed conditioning mechanism and the joint continuous-diffusion process. This joint process can be incorporated into a wide range of mixed discrete-continuous generative tasks. More information can be found on our project webpage: https://wix-incubator.github.io/DLT",
    "authors": [
        "Elad Levi",
        "E. Brosh",
        "Mykola Mykhailych",
        "Meir Perez"
    ],
    "venue": "IEEE International Conference on Computer Vision",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "DLT is a transformer-based model which has a flexible conditioning mechanism that allows for conditioning on any given subset of all the layout component classes, locations, and sizes and outperforms state-of-the-art generative models on various layout generation datasets with respect to different metrics and conditioning settings."
    },
    "citationCount": 9,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}