{
    "acronym": "b7acfe1c9d709d6d14b96e45cd3d7c7703471a58",
    "title": "Block Walsh–Hadamard Transform-based Binary Layers in Deep Neural Networks",
    "seed_ids": [
        "fnet",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f"
    ],
    "s2id": "b7acfe1c9d709d6d14b96e45cd3d7c7703471a58",
    "abstract": "Convolution has been the core operation of modern deep neural networks. It is well known that convolutions can be implemented in the Fourier Transform domain. In this article, we propose to use binary block Walsh–Hadamard transform (WHT) instead of the Fourier transform. We use WHT-based binary layers to replace some of the regular convolution layers in deep neural networks. We utilize both one-dimensional (1D) and 2D binary WHTs in this article. In both 1D and 2D layers, we compute the binary WHT of the input feature map and denoise the WHT domain coefficients using a nonlinearity that is obtained by combining soft-thresholding with the tanh function. After denoising, we compute the inverse WHT. We use 1D-WHT to replace the 1 × 1 convolutional layers, and 2D-WHT layers can replace the 3 × 3 convolution layers and Squeeze-and-Excite layers. 2D-WHT layers with trainable weights can be also inserted before the Global Average Pooling layers to assist the dense layers. In this way, we can reduce the number of trainable parameters significantly with a slight decrease in trainable parameters. In this article, we implement the WHT layers into MobileNet-V2, MobileNet-V3-Large, and ResNet to reduce the number of parameters significantly with negligible accuracy loss. Moreover, according to our speed test, the 2D-FWHT layer runs about 24 times as fast as the regular 3 × 3 convolution with 19.51% less RAM usage in an NVIDIA Jetson Nano experiment.",
    "authors": [
        "Hongyi Pan",
        "Diaa Badawi",
        "A. Cetin"
    ],
    "venue": "ACM Transactions on Embedded Computing Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This article proposes to use binary block Walsh–Hadamard transform (WHT) instead of the Fourier transform to use WHT-based binary layers to replace some of the regular convolution layers in deep neural networks and implements the WHT layers into MobileNet-V2, Mobile net-V3-Large, and ResNet to reduce the number of parameters significantly with negligible accuracy loss."
    },
    "citationCount": 17,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}