{
    "acronym": "b7ad6a754911dc96190469a56962ddde3608e67a",
    "title": "SemScore: Automated Evaluation of Instruction-Tuned LLMs based on Semantic Textual Similarity",
    "seed_ids": [
        "gpt3",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "e6e7d253ace58185acc8b4d8962f7c7b75ab110b",
        "270f3bea8ca801870a6cc56b4d36f7f2019c9ed0",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "b7ad6a754911dc96190469a56962ddde3608e67a",
    "abstract": "Instruction-tuned Large Language Models (LLMs) have recently showcased remarkable advancements in their ability to generate fitting responses to natural language instructions. However, many current works rely on manual evaluation to judge the quality of generated responses. Since such manual evaluation is time-consuming, it does not easily scale to the evaluation of multiple models and model variants. In this short paper, we propose a straightforward but remarkably effective evaluation metric called SemScore, in which we directly compare model outputs to gold target responses using semantic textual similarity (STS). We conduct a comparative evaluation of the model outputs of 12 prominent instruction-tuned LLMs using 8 widely-used evaluation metrics for text generation. We find that our proposed SemScore metric outperforms all other, in many cases more complex, evaluation metrics in terms of correlation to human evaluation. These findings indicate the utility of our proposed metric for the evaluation of instruction-tuned LLMs.",
    "authors": [
        "Ansar Aynetdinov",
        "Alan Akbik"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A comparative evaluation of the model outputs of 12 prominent instruction-tuned LLMs using 8 widely-used evaluation metrics for text generation finds that the proposed SemScore metric outperforms all other, in many cases more complex, evaluation metrics in terms of correlation to human evaluation."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}