{
    "acronym": "b7bc0de38c2ca410d330ed3dae39573633a693da",
    "title": "Bias Detection for Customer Interaction Data: A Survey on Datasets, Methods, and Tools",
    "seed_ids": [
        "gpt",
        "7ea0e91c5d5dc73f2133bc46d7ebb6cb83034dae",
        "039b1c1210c437f3b3ce6e0275ee2137bf5b951c",
        "5e9c85235210b59a16bdd84b444a904ae271f7e7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "b7bc0de38c2ca410d330ed3dae39573633a693da",
    "abstract": "With the increase in usage of machine learning models within many different aspects of customer interactions, it has become very clear that bias detection within associated customer interaction datasets has led to a critical focus on issues such as the identification of bias prior to model building, lack of understanding and transparency within models, and ultimately the prevention of biased predictions or classifications. This has never been more important since the introduction of the EU General Data Protection Regulation (GDPR) and the associated rule of “right of explanation”. In this paper, we survey the state of the art for bias detection, avoidance and mitigation within datasets, and the associated methods and tools available. Our purpose is to establish an understanding of how established customer interaction-based use cases can utilise these techniques. The focus is primarily on tackling the bias in unstructured text data as a pre-process prior to the machine learning model training phase. We hope that this research encourages the further establishment of responsible usage of customer interaction datasets to allow the prevention of bias being introduced into machine learning pipelines and to also allow greater awareness of the potential for further research in this area.",
    "authors": [
        "Andy Donald",
        "Apostolos Galanopoulos",
        "E. Curry",
        "Emir Muñoz",
        "Ihsan Ullah",
        "M. Waskow",
        "Maciej Dabrowski",
        "Manan Kalra"
    ],
    "venue": "IEEE Access",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The state of the art for bias detection, avoidance and mitigation within datasets, and the associated methods and tools available are surveyed to establish an understanding of how established customer interaction-based use cases can utilise these techniques."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}