{
    "acronym": "b807d9bdd73337c53d2fdef7352a3fd4fd517c4c",
    "title": "MeetingQA: Extractive Question-Answering on Meeting Transcripts",
    "seed_ids": [
        "longformer",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "4e3935ef7da6bcbb202ec7f8b285c313cadcd044",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "6ff68b34a5f78bdd14437fe5a79aebbc42c26467",
        "b47381e04739ea3f392ba6c8faaf64105493c196",
        "0371c6376d08d7368e4feea161b4909032b59a35"
    ],
    "s2id": "b807d9bdd73337c53d2fdef7352a3fd4fd517c4c",
    "abstract": "With the ubiquitous use of online meeting platforms and robust automatic speech recognition systems, meeting transcripts have emerged as a promising domain for natural language tasks. Most recent works on meeting transcripts primarily focus on summarization and extraction of action items. However, meeting discussions also have a useful question-answering (QA) component, crucial to understanding the discourse or meeting content, and can be used to build interactive interfaces on top of long transcripts. Hence, in this work, we leverage this inherent QA component of meeting discussions and introduce MeetingQA, an extractive QA dataset comprising of questions asked by meeting participants and corresponding responses. As a result, questions can be open-ended and actively seek discussions, while the answers can be multi-span and distributed across multiple speakers. Our comprehensive empirical study of several robust baselines including long-context language models and recent instruction-tuned models reveals that models perform poorly on this task (F1 = 57.3) and severely lag behind human performance (F1 = 84.6), thus presenting a challenging new task for the community to improve upon.",
    "authors": [
        "Archiki Prasad",
        "Trung Bui",
        "Seunghyun Yoon",
        "Hanieh Deilamsalehy",
        "Franck Dernoncourt",
        "Mohit Bansal"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces MeetingQA, an extractive QA dataset comprising of questions asked by meeting participants and corresponding responses, which can be open-ended and actively seek discussions, while the answers can be multi-span and distributed across multiple speakers."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}