{
    "acronym": "b86622e7a4ba5f9365c17d2170418218c7674792",
    "title": "SVGDreamer: Text Guided SVG Generation with Diffusion Model",
    "seed_ids": [
        "classfreediffu",
        "9550076d9930dd3533ab9276126f1a9265fad7b4",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "b86622e7a4ba5f9365c17d2170418218c7674792",
    "abstract": "Recently, text-guided scalable vector graphics (SVGs) synthesis has shown promise in domains such as iconography and sketch. However, existing text-to-SVG generation methods lack editability and struggle with visual quality and result diversity. To address these limitations, we propose a novel text-guided vector graphics synthesis method called SVGDreamer. SVGDreamer incorporates a semantic-driven image vectorization (SIVE) process that enables the decomposition of synthesis into foreground objects and background, thereby enhancing editability. Specifically, the SIVE process introduces attention-based primitive control and an attention-mask loss function for effective control and manipulation of individual elements. Additionally, we propose a Vectorized Particle-based Score Distillation (VPSD) approach to address issues of shape over-smoothing, color over-saturation, limited diversity, and slow convergence of the existing text-to-SVG generation methods by modeling SVGs as distributions of control points and colors. Furthermore, VPSD leverages a reward model to re-weight vector particles, which improves aesthetic appeal and accelerates convergence. Extensive experiments are conducted to validate the effectiveness of SVGDreamer, demonstrating its superiority over baseline methods in terms of editability, visual quality, and diversity. Project page: \\href{https://ximinng.github.io/SVGDreamer-project/}{https://ximinng.github.io/SVGDreamer-project/}",
    "authors": [
        "Ximing Xing",
        "Haitao Zhou",
        "Chuang Wang",
        "Jing Zhang",
        "Dong Xu",
        "Qian Yu"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "SVGDreamer incorporates a semantic-driven image vectorization process that enables the decomposition of synthesis into foreground objects and background, thereby enhancing editability and a Vectorized Particle-based Score Distillation approach to address issues of shape over-smoothing, color over-saturation, limited diversity, and slow convergence."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}