{
    "acronym": "b8c236dc5963dac36b0d8e419beb5876e3a18f96",
    "title": "Deep Transformers without Shortcuts: Modifying Self-attention for Faithful Signal Propagation",
    "seed_ids": [
        "alibi",
        "roformer",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "4cf963e5fd88825ac62ad6cce364447e5d2dfb2b",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "b8c236dc5963dac36b0d8e419beb5876e3a18f96",
    "abstract": "Skip connections and normalisation layers form two standard architectural components that are ubiquitous for the training of Deep Neural Networks (DNNs), but whose precise roles are poorly understood. Recent approaches such as Deep Kernel Shaping have made progress towards reducing our reliance on them, using insights from wide NN kernel theory to improve signal propagation in vanilla DNNs (which we define as networks without skips or normalisation). However, these approaches are incompatible with the self-attention layers present in transformers, whose kernels are intrinsically more complicated to analyse and control. And so the question remains: is it possible to train deep vanilla transformers? We answer this question in the affirmative by designing several approaches that use combinations of parameter initialisations, bias matrices and location-dependent rescaling to achieve faithful signal propagation in vanilla transformers. Our methods address various intricacies specific to signal propagation in transformers, including the interaction with positional encoding and causal masking. In experiments on WikiText-103 and C4, our approaches enable deep transformers without normalisation to train at speeds matching their standard counterparts, and deep vanilla transformers to reach the same performance as standard ones after about 5 times more iterations.",
    "authors": [
        "Bobby He",
        "James Martens",
        "Guodong Zhang",
        "Aleksandar Botev",
        "Andy Brock",
        "Samuel L. Smith",
        "Y. Teh"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Several approaches are designed that use combinations of parameter initialisations, bias matrices and location-dependent rescaling to achieve faithful signal propagation in vanilla transformers, including the interaction with positional encoding and causal masking."
    },
    "citationCount": 18,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}