{
    "acronym": "ba3c926b711198c7df83dcf5bc1c9198f7288109",
    "title": "Relational Prompt-based Pre-trained Language Models for Social Event Detection",
    "seed_ids": [
        "bert",
        "f8258069425323de1df423ff50abf97c12e22289",
        "42117d01d498eb9f8c21b788c3565bc6855d620b",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "a022bda79947d1f656a1164003c1b3ae9a843df9"
    ],
    "s2id": "ba3c926b711198c7df83dcf5bc1c9198f7288109",
    "abstract": "Social Event Detection (SED) aims to identify significant events from social streams, and has a wide application ranging from public opinion analysis to risk management. In recent years, Graph Neural Network (GNN) based solutions have achieved state-of-the-art performance. However, GNN-based methods often struggle with noisy and missing edges between messages, affecting the quality of learned message embedding. Moreover, these methods statically initialize node embedding before training, which, in turn, limits the ability to learn from message texts and relations simultaneously. In this paper, we approach social event detection from a new perspective based on Pre-trained Language Models (PLMs), and present RPLM_SED (Relational prompt-based Pre-trained Language Models for Social Event Detection). We first propose a new pairwise message modeling strategy to construct social messages into message pairs with multi-relational sequences. Secondly, a new multi-relational prompt-based pairwise message learning mechanism is proposed to learn more comprehensive message representation from message pairs with multi-relational prompts using PLMs. Thirdly, we design a new clustering constraint to optimize the encoding process by enhancing intra-cluster compactness and inter-cluster dispersion, making the message representation more distinguishable. We evaluate the RPLM_SED on three real-world datasets, demonstrating that the RPLM_SED model achieves state-of-the-art performance in offline, online, low-resource, and long-tail distribution scenarios for social event detection tasks.",
    "authors": [
        "Pu Li",
        "Xiaoyan Yu",
        "Hao Peng",
        "Yantuan Xian",
        "Linqin Wang",
        "Li Sun",
        "Jingyun Zhang",
        "Philip S. Yu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new pairwise message modeling strategy to construct social messages into message pairs with multi-relational sequences using Pre-trained Language Models for Social Event Detection is proposed, and a new clustering constraint is designed to optimize the encoding process by enhancing intra-cluster compactness and inter-cluster dispersion."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}