{
    "acronym": "baa6c40d809e3e8d5a5f43dc7e9b2b114cff4574",
    "title": "HiPool: Modeling Long Documents Using Graph Neural Networks",
    "seed_ids": [
        "bigbird",
        "b0c5c673c690c644a7d4af73adb783bd98486181",
        "da0d38cf2ac7e2a6908e0d9e1fff07058daab2ed",
        "84daddd294fa3cc12596b5785f81c2a153d2fb1d",
        "61a5ae33fc34efcdbc710004554ec57e607ce75e",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "b76e98a0a023d37c6534aa2ead09c8ff595f0bae"
    ],
    "s2id": "baa6c40d809e3e8d5a5f43dc7e9b2b114cff4574",
    "abstract": "Encoding long sequences in Natural Language Processing (NLP) is a challenging problem. Though recent pretraining language models achieve satisfying performances in many NLP tasks, they are still restricted by a pre-defined maximum length, making them challenging to be extended to longer sequences. So some recent works utilize hierarchies to model long sequences. However, most of them apply sequential models for upper hierarchies, suffering from long dependency issues. In this paper, we alleviate these issues through a graph-based method. We first chunk the sequence with a fixed length to model the sentence-level information. We then leverage graphs to model intra- and cross-sentence correlations with a new attention mechanism. Additionally, due to limited standard benchmarks for long document classification (LDC), we propose a new challenging benchmark, totaling six datasets with up to 53k samples and 4034 average tokens’ length. Evaluation shows our model surpasses competitive baselines by 2.6% in F1 score, and 4.8% on the longest sequence dataset. Our method is shown to outperform hierarchical sequential models with better performance and scalability, especially for longer sequences.",
    "authors": [
        "Irene Li",
        "Aosong Feng",
        "Dragomir R. Radev",
        "Rex Ying"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper first chunked the sequence with a fixed length to model the sentence-level information, then leverage graphs to model intra- and cross-sentence correlations with a new attention mechanism, and is shown to outperform hierarchical sequential models with better performance and scalability, especially for longer sequences."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}