{
    "acronym": "bad12cb32faee21eafadbed03c6eec7e23e88ac9",
    "title": "Improving Sequential Recommendations with LLMs",
    "seed_ids": [
        "bert",
        "ca7bd64d372e3bcb3f4633ca4a20291ff57de3c3",
        "11628f656257e75e46447ac21cdaa86c4b340a0a",
        "df602516e28a9ef0ef665ed0aef551984d8d770d",
        "690edf44e8739fd80bdfb76f40c9a4a222f3bba8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "bad12cb32faee21eafadbed03c6eec7e23e88ac9",
    "abstract": "The sequential recommendation problem has attracted considerable research attention in the past few years, leading to the rise of numerous recommendation models. In this work, we explore how Large Language Models (LLMs), which are nowadays introducing disruptive effects in many AI-based applications, can be used to build or improve sequential recommendation approaches. Specifically, we design three orthogonal approaches and hybrids of those to leverage the power of LLMs in different ways. In addition, we investigate the potential of each approach by focusing on its comprising technical aspects and determining an array of alternative choices for each one. We conduct extensive experiments on three datasets and explore a large variety of configurations, including different language models and baseline recommendation models, to obtain a comprehensive picture of the performance of each approach. Among other observations, we highlight that initializing state-of-the-art sequential recommendation models such as BERT4Rec or SASRec with embeddings obtained from an LLM can lead to substantial performance gains in terms of accuracy. Furthermore, we find that fine-tuning an LLM for recommendation tasks enables it to learn not only the tasks, but also concepts of a domain to some extent. We also show that fine-tuning OpenAI GPT leads to considerably better performance than fine-tuning Google PaLM 2. Overall, our extensive experiments indicate a huge potential value of leveraging LLMs in future recommendation approaches. We publicly share the code and data of our experiments to ensure reproducibility.",
    "authors": [
        "Artun Boz",
        "Wouter Zorgdrager",
        "Zoe Kotti",
        "Jesse Harte",
        "Panos Louridas",
        "Dietmar Jannach",
        "Marios Fragkoulis"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work designs three orthogonal approaches and hybrids of those to leverage the power of LLMs in different ways to build or improve sequential recommendation approaches, and finds that fine-tuning an LLM for recommendation tasks enables it to learn not only the tasks, but also concepts of a domain to some extent."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}