{
    "acronym": "baed71eed57ad462f3ab138d4b1700a738cd5414",
    "title": "ETC: Encoding Long and Structured Data in Transformers",
    "seed_ids": [
        "longformer",
        "reformer",
        "transformerxl",
        "bptrans",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "2e14e84ccec924ed770b58108ad1d9de6f0ca295",
        "f4238bd2385a52413ccbacfd9e409a650235bd13",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0",
        "2a31319e73d4486716168b65cdf7559baeda18ce"
    ],
    "s2id": "baed71eed57ad462f3ab138d4b1700a738cd5414",
    "abstract": "Transformer-based models have pushed the state of the art in many natural language processing tasks. However, one of their main limitations is the quadratic computational and memory cost of the standard attention mechanism. In this paper, we present a new family of Transformer models, which we call the Extended Transformer Construction (ETC), that allows for significant increases in input sequence length by introducing a new global-local attention mechanism between a global memory and the standard input tokens. We also show that combining global-local attention with relative position encodings allows ETC to handle structured data with ease. Empirical results on the Natural Questions data set show the promise of the approach.",
    "authors": [
        "J. Ainslie",
        "Santiago Ontañón",
        "Chris Alberti",
        "Philip Pham",
        "Anirudh Ravula",
        "Sumit K. Sanghai"
    ],
    "venue": "arXiv.org",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper presents a new family of Transformer models, which they call the Extended Transformer Construction (ETC), that allows for significant increases in input sequence length by introducing a new global-local attention mechanism between a global memory and the standard input tokens."
    },
    "citationCount": 53,
    "influentialCitationCount": 9,
    "code": null,
    "description": null,
    "url": null
}