{
    "acronym": "bb07ac7a94ab5cefc6d40df46fe20b71382ef09d",
    "title": "Neural Natural Language Processing for Long Texts: A Survey of the State-of-the-Art",
    "seed_ids": [
        "longformer",
        "hitrans",
        "f8d44802ac8190864c61c9aaf4a8b450261873ab",
        "b21670e8061a06ab97e7d6052c9345a326e84ff8",
        "94e46e18d2628343a926acf6c3d0817e11d35d58",
        "24b951275a7a42ef36aca8352caaf6f4cd6238d2",
        "e96493b4181de6c60b761dc66492db8e66fd784f",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "fd33e77884e69f6bc099990fc2790248af2749d9",
        "84daddd294fa3cc12596b5785f81c2a153d2fb1d",
        "2d097ebde47e9b620f5236d2d5c57c12794f159f",
        "29584ed6d68a06fdf91440a018f6bc83a44fd177",
        "afad10da0a3b83a4f2a94e8c16c84ac64338e9fe",
        "f6245b3e6270e4dc2e279c4b728030523dffcff4",
        "a554a0aae55be5597de8f6ece0a4dd0bd5a0e5f4",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "cc2d1a66c701e9be9124eb95431b6c3dd79a61d3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "bb07ac7a94ab5cefc6d40df46fe20b71382ef09d",
    "abstract": "The adoption of Deep Neural Networks (DNNs) has greatly benefited Natural Language Processing (NLP) during the past decade. However, the demands of long document analysis are quite different from those of shorter texts, while the ever increasing size of documents uploaded on-line renders automated understanding of long texts a critical area of research. This article has two goals: a) it overviews the relevant neural building blocks, thus serving as a short tutorial, and b) it surveys the state-of-the-art in long document NLP, mainly focusing on two central tasks: document classification and document summarization. Sentiment analysis for long texts is also covered, since it is typically treated as a particular case of document classification. Additionally, this article discusses the main challenges, issues and current solutions related to long document NLP. Finally, the relevant, publicly available, annotated datasets are presented, in order to facilitate further research.",
    "authors": [
        "Dimitrios Tsirmpas",
        "I. Gkionis",
        "Ioannis Mademlis"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The relevant neural building blocks are overviewed, thus serving as a short tutorial, and the state of the art in long document NLP is surveyed, mainly focusing on two central tasks: document classification and document summarization."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}