{
    "acronym": "bb417c6057817fabd16af635e6e806333cab5511",
    "title": "GSAP-NER: A Novel Task, Corpus, and Baseline for Scholarly Entity Extraction Focused on Machine Learning Models and Datasets",
    "seed_ids": [
        "bert"
    ],
    "s2id": "bb417c6057817fabd16af635e6e806333cab5511",
    "abstract": "Named Entity Recognition (NER) models play a crucial role in various NLP tasks, including information extraction (IE) and text understanding. In academic writing, references to machine learning models and datasets are fundamental components of various computer science publications and necessitate accurate models for identification. Despite the advancements in NER, existing ground truth datasets do not treat fine-grained types like ML model and model architecture as separate entity types, and consequently, baseline models cannot recognize them as such. In this paper, we release a corpus of 100 manually annotated full-text scientific publications and a first baseline model for 10 entity types centered around ML models and datasets. In order to provide a nuanced understanding of how ML models and datasets are mentioned and utilized, our dataset also contains annotations for informal mentions like\"our BERT-based model\"or\"an image CNN\". You can find the ground truth dataset and code to replicate model training at https://data.gesis.org/gsap/gsap-ner.",
    "authors": [
        "Wolfgang Otto",
        "Matthäus Zloch",
        "Lu Gan",
        "Saurav Karmakar",
        "Stefan Dietze"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper releases a corpus of 100 manually annotated full-text scientific publications and a first baseline model for 10 entity types centered around ML models and datasets and contains annotations for informal mentions like\"the authors' BERT-based model\"or\"an image CNN\"."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}