{
    "acronym": "bb713434acf246f96781043f75bc2547f7e8338c",
    "title": "StereoHate: Toward identifying stereotypical bias and target group in hate speech detection",
    "seed_ids": [
        "bert",
        "2ea64b7c7617f6cc1768373124ca0243d772a90f",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "bb713434acf246f96781043f75bc2547f7e8338c",
    "abstract": "\n \n \n Though social media helps spread knowledge more effectively, it also stimulates the propagation of online abuse and harassment, including hate speech. It is crucial to prevent hate speech since it may have serious adverse effects on both society and individuals. Therefore, it is not only important for models to detect these speeches but to also output explanations of why a given text is toxic. While plenty of research is going on to detect online hate speech in English, there is very little research on low-resource languages like Hindi and the explainability aspect of hate speech. Recent laws like the “right to explanations” of the General Data Protection Regulation have spurred research in developing interpretable models rather than only focusing on performance. Motivated by this, we create the first interpretable benchmark hate speech corpus hate speech explanation (HHES) in the Hindi language, where each hate post has its stereotypical bias and target group category. Providing descriptions of internal stereotypical bias as an explanation of hate posts makes a hate speech detection model more trustworthy. Current work proposes a commonsense-aware unified generative framework, CGenEx, by reframing the multitask problem as a text-to-text generation task. The novelty of this framework is it can solve two different categories of tasks (generation and classification) simultaneously. We establish the efficacy of our proposed model (CGenEx-fuse) on various evaluation metrics over other baselines when applied to the Hindi HHES dataset.\n \n \n \n The article contains profanity, an inevitable situation for the nature of the work involved. These in no way reflect the opinion of authors.\n",
    "authors": [
        "Krishanu Maity",
        "Nilabja Ghosh",
        "Raghav Jain",
        "Sriparna Saha",
        "P. Bhattacharyya"
    ],
    "venue": "Natural Language Processing",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A commonsense-aware unified generative framework, CGenEx, is proposed by reframing the multitask problem as a text-to-text generation task, which can solve two different categories of tasks (generation and classification) simultaneously."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}