{
    "acronym": "bbbf305b1a92fd9d0400852204a7c29caf0a9839",
    "title": "Personal Entity, Concept, and Named Entity Linking in Conversations",
    "seed_ids": [
        "longformer",
        "3029263ca51e6c2907f9f99277083cf6afb1adb7",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "bbbf305b1a92fd9d0400852204a7c29caf0a9839",
    "abstract": "Building conversational agents that can have natural and knowledge-grounded interactions with humans requires understanding user utterances. Entity Linking (EL) is an effective technique for understanding natural language text and connecting it to external knowledge. It is, however, shown that the existing EL methods developed for annotating documents are suboptimal for conversations, where concepts and personal entities (e.g., \"my cars'') are essential for understanding user utterances. In this paper, we introduce a collection and a tool for entity linking in conversations. We provide EL annotations for 1,327 conversational utterances, consisting of links to named entities, concepts, and personal entities. The dataset is used for training our toolkit for conversational entity linking, CREL. Unlike existing EL methods, CREL is developed to identify both named entities and concepts. It also utilizes coreference resolution techniques to identify personal entities and their references to the explicit entity mentions in the conversations. We compare CREL with state-of-the-art techniques and show that it outperforms all existing baselines.",
    "authors": [
        "Hideaki Joko",
        "Faegheh Hasibi"
    ],
    "venue": "International Conference on Information and Knowledge Management",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper provides EL annotations for 1,327 conversational utterances, consisting of links to named entities, concepts, and personal entities, and develops a toolkit for conversational entity linking, CREL, which outperforms all existing baselines."
    },
    "citationCount": 6,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}