{
    "acronym": "bc346ff648e1971c64bdf330893e46b8284614cb",
    "title": "On Deep Learning Approaches to Automated Assessment: Strategies for Short Answer Grading",
    "seed_ids": [
        "gpt",
        "1a8a4686f81efdcb5b1dd1e24eca9997280e2521",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "96a3461e5f05973db7aec78afdb763304bd2e195"
    ],
    "s2id": "bc346ff648e1971c64bdf330893e46b8284614cb",
    "abstract": ": The recent increase in the number of courses that are delivered in a blended fashion, before the effect of the pandemic has even been considered, has led to a concurrent interest in the question of how appropriate or useful automated assessment can be in such a setting. In this paper, we consider the case of automated short answer grading (ASAG), i.e., the evaluation of student answers that are strictly limited in terms of length using machine learning and in particular deep learning methods. Although ASAG has been studied for over 50 years, it is still one of the most active areas of NLP research as it represents a starting point for the possible consideration of more open ended or conversational answering. The availability of good training data, including inter alia, labelled and domain-specific information is a key challenge for ASAG. This paper reviews deep learning approaches to this question. In particular, deep learning models, dataset curation, and evaluation metrics for ASAG tasks are considered in some detail. Finally, this study considers the development of guidelines for educators to improve the applicability of ASAG research.",
    "authors": [
        "Abbirah Ahmed",
        "Arash Joorabchi",
        "Martin J. Hayes"
    ],
    "venue": "International Conference on Computer Supported Education",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Deep learning approaches to ASAG, i.e., deep learning models, dataset curation, and evaluation metrics for ASAG tasks are considered in some detail and the development of guidelines for educators to improve the applicability of ASAG research is considered."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}