{
    "acronym": "bc5986f79a7a3747566724780502026b2edfcb19",
    "title": "LLAMAFUZZ: Large Language Model Enhanced Greybox Fuzzing",
    "seed_ids": [
        "gpt2",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "bc5986f79a7a3747566724780502026b2edfcb19",
    "abstract": "Greybox fuzzing has achieved success in revealing bugs and vulnerabilities in programs. However, randomized mutation strategies have limited the fuzzer's performance on structured data. Specialized fuzzers can handle complex structured data, but require additional efforts in grammar and suffer from low throughput. In this paper, we explore the potential of utilizing the Large Language Model to enhance greybox fuzzing for structured data. We utilize the pre-trained knowledge of LLM about data conversion and format to generate new valid inputs. We further fine-tuned it with paired mutation seeds to learn structured format and mutation strategies effectively. Our LLM-based fuzzer, LLAMAFUZZ, integrates the power of LLM to understand and mutate structured data to fuzzing. We conduct experiments on the standard bug-based benchmark Magma and a wide variety of real-world programs. LLAMAFUZZ outperforms our top competitor by 41 bugs on average. We also identified 47 unique bugs across all trials. Moreover, LLAMAFUZZ demonstrated consistent performance on both bug trigger and bug reached. Compared to AFL++, LLAMAFUZZ achieved 27.19% more branches in real-world program sets on average. We also demonstrate a case study to explain how LLMs enhance the fuzzing process in terms of code coverage.",
    "authors": [
        "Hongxiang Zhang",
        "Yuyang Rong",
        "Yifeng He",
        "Hao Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper uses the pre-trained knowledge of LLM about data conversion and format to generate new valid inputs to enhance greybox fuzzing for structured data and fine-tuned it with paired mutation seeds to learn structured format and mutation strategies effectively."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}