{
    "acronym": "bc6a196c92670b1d6750c2fab5a335ee14fcaaea",
    "title": "Stacking Your Transformers: A Closer Look at Model Growth for Efficient LLM Pre-Training",
    "seed_ids": [
        "flashattn",
        "e6c82dc331a6b83162c127de95042006aefbf626",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "a7a40b35b6f37c554f1c5c2038892ed70c693a64",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "1098ca3dbda5778c2bf6c9e8cbb9bc7a02249e10",
        "7a49beff86a855f237f96ae3f0aefc9780cb31be",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "5a3749929bf5fb8b1f98a7b2a43c3b957bcf6c88",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "bc6a196c92670b1d6750c2fab5a335ee14fcaaea",
    "abstract": "LLMs are computationally expensive to pre-train due to their large scale. Model growth emerges as a promising approach by leveraging smaller models to accelerate the training of larger ones. However, the viability of these model growth methods in efficient LLM pre-training remains underexplored. This work identifies three critical $\\underline{\\textit{O}}$bstacles: ($\\textit{O}$1) lack of comprehensive evaluation, ($\\textit{O}$2) untested viability for scaling, and ($\\textit{O}$3) lack of empirical guidelines. To tackle $\\textit{O}$1, we summarize existing approaches into four atomic growth operators and systematically evaluate them in a standardized LLM pre-training setting. Our findings reveal that a depthwise stacking operator, called $G_{\\text{stack}}$, exhibits remarkable acceleration in training, leading to decreased loss and improved overall performance on eight standard NLP benchmarks compared to strong baselines. Motivated by these promising results, we conduct extensive experiments to delve deeper into $G_{\\text{stack}}$ to address $\\textit{O}$2 and $\\textit{O}$3. For $\\textit{O}$2 (untested scalability), our study shows that $G_{\\text{stack}}$ is scalable and consistently performs well, with experiments up to 7B LLMs after growth and pre-training LLMs with 750B tokens. For example, compared to a conventionally trained 7B model using 300B tokens, our $G_{\\text{stack}}$ model converges to the same loss with 194B tokens, resulting in a 54.6\\% speedup. We further address $\\textit{O}$3 (lack of empirical guidelines) by formalizing guidelines to determine growth timing and growth factor for $G_{\\text{stack}}$, making it practical in general LLM pre-training. We also provide in-depth discussions and comprehensive ablation studies of $G_{\\text{stack}}$. Our code and pre-trained model are available at $\\href{https://llm-stacking.github.io/}{https://llm-stacking.github.io/}$.",
    "authors": [
        "Wenyu Du",
        "Tongxu Luo",
        "Zihan Qiu",
        "Zeyu Huang",
        "Yikang Shen",
        "Reynold Cheng",
        "Yike Guo",
        "Jie Fu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work summarizes existing approaches into four atomic growth operators and systematically evaluates them in a standardized LLM pre-training setting, revealing that a depthwise stacking operator, called G_{\\text{stack}, exhibits remarkable acceleration in training, leading to decreased loss and improved overall performance on eight standard NLP benchmarks compared to strong baselines."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}