{
    "acronym": "bc9dbbc23e39c93edead2ed707d2c62189f56f20",
    "title": "Can Language Models Be Tricked by Language Illusions? Easier with Syntax, Harder with Semantics",
    "seed_ids": [
        "gpt2",
        "gpt3",
        "5a2263092f49540fd0e049050a96882ff29b00c3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "bc9dbbc23e39c93edead2ed707d2c62189f56f20",
    "abstract": "Language models (LMs) have been argued to overlap substantially with human beings in grammaticality judgment tasks. But when humans systematically make errors in language processing, should we expect LMs to behave like cognitive models of language and mimic human behavior? We answer this question by investigating LMs’ more subtle judgments associated with “language illusions” – sentences that are vague in meaning, implausible, or ungrammatical but receive unexpectedly high acceptability judgments by humans. We looked at three illusions: the comparative illusion (e.g. “More people have been to Russia than I have”), the depth-charge illusion (e.g. “No head injury is too trivial to be ignored”), and the negative polarity item (NPI) illusion (e.g. “The hunter who no villager believed to be trustworthy will ever shoot a bear”). We found that probabilities represented by LMs were more likely to align with human judgments of being “tricked” by the NPI illusion which examines a structural dependency, compared to the comparative and the depth-charge illusions which require sophisticated semantic understanding. No single LM or metric yielded results that are entirely consistent with human behavior. Ultimately, we show that LMs are limited both in their construal as cognitive models of human language processing and in their capacity to recognize nuanced but critical information in complicated language materials.",
    "authors": [
        "Yuhan Zhang",
        "Edward Gibson",
        "Forrest Davis"
    ],
    "venue": "Conference on Computational Natural Language Learning",
    "year": 2023,
    "tldr": null,
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}