{
    "acronym": "bd3f9b1b5a4484f6c81ae6918488cf7f06478e42",
    "title": "Interpreting Themes from Educational Stories",
    "seed_ids": [
        "gpt3",
        "bert",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "270f3bea8ca801870a6cc56b4d36f7f2019c9ed0",
        "c6c734e16f66fbfcefac7625cc64599e83292c1e"
    ],
    "s2id": "bd3f9b1b5a4484f6c81ae6918488cf7f06478e42",
    "abstract": "Reading comprehension continues to be a crucial research focus in the NLP community. Recent advances in Machine Reading Comprehension (MRC) have mostly centered on literal comprehension, referring to the surface-level understanding of content. In this work, we focus on the next level - interpretive comprehension, with a particular emphasis on inferring the themes of a narrative text. We introduce the first dataset specifically designed for interpretive comprehension of educational narratives, providing corresponding well-edited theme texts. The dataset spans a variety of genres and cultural origins and includes human-annotated theme keywords with varying levels of granularity. We further formulate NLP tasks under different abstractions of interpretive comprehension toward the main idea of a story. After conducting extensive experiments with state-of-the-art methods, we found the task to be both challenging and significant for NLP research. The dataset and source code have been made publicly available to the research community at https://github.com/RiTUAL-UH/EduStory.",
    "authors": [
        "Yigeng Zhang",
        "Fabio A. Gonz'alez",
        "T. Solorio"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces the first dataset specifically designed for interpretive comprehension of educational narratives, providing corresponding well-edited theme texts and includes human-annotated theme keywords with varying levels of granularity."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}