{
    "acronym": "bd883b3a88f038274dee7ad6f8dde70f80dbb030",
    "title": "Stable Style Transformer: Delete and Generate Approach with Encoder-Decoder for Text Style Transfer",
    "seed_ids": [
        "gpt",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "bd883b3a88f038274dee7ad6f8dde70f80dbb030",
    "abstract": "Text style transfer is the task that generates a sentence by preserving the content of the input sentence and transferring the style. Most existing studies are progressing on non-parallel datasets because parallel datasets are limited and hard to construct. In this work, we introduce a method that follows two stages in non-parallel datasets. The first stage is to delete attribute markers of a sentence directly through a classifier. The second stage is to generate a transferred sentence by combining the content tokens and the target style. We experiment on two benchmark datasets and evaluate context, style, fluency, and semantic. It is difficult to select the best system using only these automatic metrics, but it is possible to select stable systems. We consider only robust systems in all automatic evaluation metrics to be the minimum conditions that can be used in real applications. Many previous systems are difficult to use in certain situations because performance is significantly lower in several evaluation metrics. However, our system is stable in all automatic evaluation metrics and has results comparable to other models. Also, we compare the performance results of our system and the unstable system through human evaluation.",
    "authors": [
        "Joosung Lee"
    ],
    "venue": "International Conference on Natural Language Generation",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a method that follows two stages in non-parallel datasets and considers only robust systems in all automatic evaluation metrics to be the minimum conditions that can be used in real applications."
    },
    "citationCount": 33,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}