{
    "acronym": "bda7f4d9f9529165bfc75e99c801813c7b1ca053",
    "title": "Artificial Intelligence for Impact Assessment of Administrative Burdens",
    "seed_ids": [
        "bert",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "bda7f4d9f9529165bfc75e99c801813c7b1ca053",
    "abstract": "This study proposes the use of Artificial Intelligence (AI) to automatize part of the legislative impact assessment process. In particular, the focus of this study is the automatic identification of administrative burdens from legislative documents. The goal of impact assessment for administrative burdens is to apply an evidence-based approach toward compliance costs generated by regulation. Employing advanced Natural Language Processing (NLP) techniques based on a transformer architecture, a system was specifically developed and tested using Portuguese legislation. The experimental phase involved the system's ability to accurately and comprehensively identify administrative burdens. Experimental results demonstrated the system's effectiveness, showing its suitability for supporting the legislative impact assessment process by automating a time-consuming task. To the best of our knowledge, this is the first attempt concerning the use of AI for automatizing the identification of administrative burdens. The proposed system may provide governments and policymakers with a tool to speed up the legislative impact assessment process, thereby streamlining decision-making processes. Moreover, the use of AI can make the legislative impact assessment process less subjective, thus increasing its transparency and making citizens more confident about the impartiality of the process that leads to new legislation. Doi: 10.28991/ESJ-2024-08-01-019 Full Text: PDF",
    "authors": [
        "Victor Costa",
        "Pedro Coelho",
        "Mauro Castelli"
    ],
    "venue": "Emerging Science Journal",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This first attempt concerning the use of AI for automatizing the identification of administrative burdens may provide governments and policymakers with a tool to speed up the legislative impact assessment process, thereby streamlining decision-making processes."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}