{
    "acronym": "be3ef5ede9b927ebad65204c6e22f7f00f2024af",
    "title": "Rock: Cleaning Data by Embedding ML in Logic Rules",
    "seed_ids": [
        "bert"
    ],
    "s2id": "be3ef5ede9b927ebad65204c6e22f7f00f2024af",
    "abstract": "We introduce Rock, a system for cleaning relational data. Rock implements a framework that unifies machine learning (ML) and logic deduction by embedding ML classifiers in rules as predicates. In a unified process, it identifies tuples that refer to the same real-world entity, catches semantic inconsistencies among the entities, deduces the timeliness of the attribute values of the entities, and imputes missing values by possibly extracting data from knowledge graphs. That is, Rock conducts entity resolution, conflict resolution, incomplete information imputation and timeliness deduction in the same process, makes use of their interactions and improves the overall quality of the data. Moreover, Rock supports methods, batch and incremental, for discovering rules from real-life data, detecting errors with the learned rules, accumulating ground truth, and fixing the errors, such that the corrections are logical consequences of the rules and ground truth. We present the design and implementation of Rock. We evaluate the scalability and accuracy of Rock, and share lessons learned from a variety of real-life applications.",
    "authors": [
        "Xianchun Bao",
        "Zian Bao",
        "Bie Binbin",
        "Qingsong Duan",
        "Wenfei Fan",
        "Hui Lei",
        "Daji Li",
        "Wei Lin",
        "Peng Liu",
        "Zhicong Lv",
        "Mingliang Ouyang",
        "Shuai Tang",
        "Yaoshu Wang",
        "Qiyuan Wei",
        "Min Xie",
        "Jing Zhang",
        "Xin Zhang",
        "Runxiao Zhao",
        "Shuping Zhou"
    ],
    "venue": "SIGMOD Conference Companion",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Rock implements a framework that unifies machine learning (ML) and logic deduction by embedding ML classifiers in rules as predicates and supports methods, batch and incremental, for discovering rules from real-life data, detecting errors with the learned rules, accumulating ground truth, and fixing the errors."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}