{
    "acronym": "be6c26ba4a0e1e821e260fe05f7c9366099f1d7f",
    "title": "Delving into Differentially Private Transformer",
    "seed_ids": [
        "transformer",
        "385c2ee0bf829676d1a5aacfc697fc6a9d245ed5",
        "4cf963e5fd88825ac62ad6cce364447e5d2dfb2b"
    ],
    "s2id": "be6c26ba4a0e1e821e260fe05f7c9366099f1d7f",
    "abstract": "Deep learning with differential privacy (DP) has garnered significant attention over the past years, leading to the development of numerous methods aimed at enhancing model accuracy and training efficiency. This paper delves into the problem of training Transformer models with differential privacy. Our treatment is modular: the logic is to `reduce' the problem of training DP Transformer to the more basic problem of training DP vanilla neural nets. The latter is better understood and amenable to many model-agnostic methods. Such `reduction' is done by first identifying the hardness unique to DP Transformer training: the attention distraction phenomenon and a lack of compatibility with existing techniques for efficient gradient clipping. To deal with these two issues, we propose the Re-Attention Mechanism and Phantom Clipping, respectively. We believe that our work not only casts new light on training DP Transformers but also promotes a modular treatment to advance research in the field of differentially private deep learning.",
    "authors": [
        "Youlong Ding",
        "Xueyang Wu",
        "Yining Meng",
        "Yonggang Luo",
        "Hao Wang",
        "Weike Pan"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper delves into the problem of training Transformer models with differential privacy and proposes the Re-Attention Mechanism and Phantom Clipping, respectively, a modular treatment to advance research in the field of differentially private deep learning."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}