{
    "acronym": "bed7a71e6efeb3737ddb46a6f66c405633aa3e55",
    "title": "Automatic text summarization of scientific articles using transformers—A brief review",
    "seed_ids": [
        "transformer",
        "247ac77a559d00d69f4353b02fb9e6529e3849cd",
        "732e3faec4e5be4d144256f2c379b9dc49f0b227",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "bed7a71e6efeb3737ddb46a6f66c405633aa3e55",
    "abstract": "Learning how to read research papers is a skill. The researcher must go through many published articles during the research. It is a challenging and tedious task to go through numerous published articles. The research process would sped up by automatic summarization of scientific publications, which would aid researchers in their investigation. However automatic text summarization of scientific research articles is difficult due to its distinct structure. Various text summarization approaches have been proposed for research article summarization in the past. After the invention of transformer architecture, it has created a big shift in Natural Language Processing. The models based on transformers are able to achieve state-of-the-art results in text summarization. This paper provides a brief review of transformer-based approaches used for text summarization of scientific research articles along with the available corpus and evaluation methods that can be used to assess the model generated summary. The paper also discusses the future direction and limitations in this field.",
    "authors": [
        "Seema Aswani",
        "Kabita Choudhary",
        "Sujala Shetty",
        "Nasheen Nur"
    ],
    "venue": "Journal of Autonomous Intelligence",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A brief review of transformer-based approaches used for text summarization of scientific research articles along with the available corpus and evaluation methods that can be used to assess the model generated summary."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}