{
    "acronym": "beecd5dc56fbd344749c444eb102a4bb485a2070",
    "title": "Inference to the Best Explanation in Large Language Models",
    "seed_ids": [
        "gpt3",
        "66d98dc2aad17c03532dbae21d05f098257cc2e2",
        "f9b94bcaf706892904c058c37d0087628f371df4",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d9f6ada77448664b71128bb19df15765336974a6"
    ],
    "s2id": "beecd5dc56fbd344749c444eb102a4bb485a2070",
    "abstract": "While Large Language Models (LLMs) have found success in real-world applications, their underlying explanatory process is still poorly understood. This paper proposes IBE-Eval, a framework inspired by philosophical accounts on Inference to the Best Explanation (IBE) to advance the interpretation and evaluation of LLMs' explanations. IBE-Eval estimates the plausibility of natural language explanations through a combination of explicit logical and linguistic features including: consistency, parsimony, coherence, and uncertainty. Extensive experiments are conducted on Causal Question Answering (CQA), where \\textit{IBE-Eval} is tasked to select the most plausible causal explanation amongst competing ones generated by LLMs (i.e., GPT 3.5 and Llama 2). The experiments reveal that IBE-Eval can successfully identify the best explanation with up to 77\\% accuracy ($\\approx 27\\%$ above random), improving upon a GPT 3.5-as-a-Judge baseline ($\\approx+17\\%$) while being intrinsically more efficient and interpretable. Additional analyses suggest that, despite model-specific variances, LLM-generated explanations tend to conform to IBE criteria and that IBE-Eval is significantly correlated with human judgment, opening up opportunities for future development of automated explanation verification tools.",
    "authors": [
        "Dhairya Dalal",
        "Marco Valentino",
        "André Freitas",
        "Paul Buitelaar"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "IBE-Eval is proposed, a framework inspired by philosophical accounts on Inference to the Best Explanation (IBE) to advance the interpretation and evaluation of LLMs' explanations, and it is suggested that LLM-generated explanations tend to conform to IBE criteria and that IBE-Eval is significantly correlated with human judgment, opening up opportunities for future development of automated explanation verification tools."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}