{
    "acronym": "bf10b410dd66e7b44bcef22b4b2e7ea37b0832f2",
    "title": "Unstructured Text Enhanced Open-Domain Dialogue System: A Systematic Survey",
    "seed_ids": [
        "gpt",
        "2797f8c0398af676612698f2ccc1723a8692f271",
        "6f335995b65eefa3ddf54b291abf211bc7ed4ed9",
        "ba2a423d8c7ae6cfa3424fb13bdbe3a35e5f2273",
        "9967faaec2ada5e9c638b6dc9ff577bc28bbd04c",
        "446e4ce32e36877e1670fed675d711a639e3d992",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "1614aaae6713aa18116b140f78bbcfca07a78c98",
        "200050c1f51e2c930e62b078c6ce20f2a6675468",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "6ebfbc954b9975d2f2651f380b9bdf46ae963178",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "791c3c30f2af10ac06f4fbc5b1e8960064aacbc7",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "bf10b410dd66e7b44bcef22b4b2e7ea37b0832f2",
    "abstract": "Incorporating external knowledge into dialogue generation has been proven to benefit the performance of an open-domain Dialogue System (DS), such as generating informative or stylized responses, controlling conversation topics. In this article, we study the open-domain DS that uses unstructured text as external knowledge sources (Unstructured Text Enhanced Dialogue System (UTEDS)). The existence of unstructured text entails distinctions between UTEDS and traditional data-driven DS and we aim at analyzing these differences. We first give the definition of the UTEDS related concepts, then summarize the recently released datasets and models. We categorize UTEDS into Retrieval and Generative models and introduce them from the perspective of model components. The retrieval models consist of Fusion, Matching, and Ranking modules, while the generative models comprise Dialogue and Knowledge Encoding, Knowledge Selection (KS), and Response Generation modules. We further summarize the evaluation methods utilized in UTEDS and analyze the current models’ performance. At last, we discuss the future development trends of UTEDS, hoping to inspire new research in this field.",
    "authors": [
        "Longxuan Ma",
        "Mingda Li",
        "Weinan Zhang",
        "Jiapeng Li",
        "Ting Liu"
    ],
    "venue": "ACM Trans. Inf. Syst.",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The definition of the UTEDS related concepts is given, then the recently released datasets and models are summarized, and the future development trends of UTEDS are discussed to inspire new research in this field."
    },
    "citationCount": 14,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}