{
    "acronym": "bf483a23fe55a10fe322dcc6dfdd5f0507e57e0e",
    "title": "Attention and Fusion of Deep Representations for Computer Vision",
    "seed_ids": [
        "sparsetransformer",
        "transformerxl"
    ],
    "s2id": "bf483a23fe55a10fe322dcc6dfdd5f0507e57e0e",
    "abstract": "ATTENTIONAND FUSIONOFDEEP REPRESENTATIONS FORCOMPUTERVISION Brendan Duke Advisor: University of Guelph, 2020 GrahamW. Taylor In this thesis by articles we make contributions related to attention and fusion at the intersection of the deep learning and computer vision fields. In our first article, we investigate the design of neural network operators that fuse features extracted from different modalities to make predictions on a single task. We propose a generalized class of multimodal fusion operators for visual question answering (VQA). We identify generalizations of existing multimodal fusion operators, and show that specific non-trivial instantiations of our operator exhibit superior performance in terms of open-ended accuracy on the VQA task. In our second article, we introduce Transformers to video object segmentation (VOS). We propose a scalable, end-to-end method for VOS called “Sparse Spatiotemporal Transformers” (SST) to address runtime, scalability and temporal dependency issues of prior work. We show that our method achieves competitive results on YouTube-VOS 2019 with increased scalability compared with the state of the art. iii ACKNOWLEDGEMENTS I would like to thank my advisor, Dr. Graham Taylor, and the rest of the MLRG lab for their mentorship and providing an environment where I could learn how to do research. I came to the University of Guelph without a research background. Dr. Taylor and the MLRG members were patient and allowed me to gradually find my own process for doing research, while providing helpful advice and discussions that continue through today. I am thankful that I had the opportunity to work with this group of bright, kind, motivated people and I hope our collaborations will continue into the future. I would also like to thank our academic collaborators from the Deep Vision project, who are fantastic role models for how to be good scientists. In particular I would like to thank Dr. ChristianWolf, whoprovided thoughtful insight and ideas about ourwork aswell as themachine learning and computer vision fields in general. Finally, I would like to thank Shannon Despond for her constant loving support throughout my studies.",
    "authors": [
        "Brendan Duke"
    ],
    "venue": "",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This thesis makes contributions related to attention and fusion at the intersection of the deep learning and computer vision fields, and investigates the design of neural network operators that fuse features extracted from different modalities to make predictions on a single task."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}