{
    "acronym": "bf9c8fa058c1a215d79d695a5001f9d0b51d2ef8",
    "title": "Video Sparse Transformer with Attention-guided Memory for Video Object Detection",
    "seed_ids": [
        "bigbird",
        "3d5dd5c128afa0f11a7cbdf2c3f879c82fca4351",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "bf9c8fa058c1a215d79d695a5001f9d0b51d2ef8",
    "abstract": "Detecting objects in a video, known as Video Object Detection (VOD), is challenging since appearance changes of objects over time may bring detection errors. Recent research has focused on aggregating features from adjacent frames to compensate for the deteriorated appearances of a frame. Moreover, using distant frames is also proposed to deal with deteriorated appearances over several frames. Since an object’s position may change significantly at a distant frame, they only use features of object candidate regions, which do not depend on their position. However, such methods rely on object candidate regions’ detection performance and are not practical for deteriorated appearances. In this paper, we enhance features element-wisely before the object candidate region detection, proposing Video Sparse Transformer with Attention-guided Memory (VSTAM). Furthermore, we propose aggregating element-wise features sparsely to reduce processing time and memory cost. In addition, we introduce an external memory update strategy based on the utilization of the aggregation to hold long-term information effectively. Our method achieved 8.3% and 11.1% accuracy gain from the baseline on ImageNet VID and UA-DETRAC datasets. Our method demonstrates superior performance against state-of-the-art results on widely used VOD datasets.",
    "authors": [
        "Masato Fujitake",
        "Akihiro Sugimoto"
    ],
    "venue": "IEEE Access",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Enhanced features element-wise before the object candidate region detection is enhanced, proposing Video Sparse Transformer with Attention-guided Memory (VSTAM), and aggregating element- wise features sparsely to reduce processing time and memory cost is proposed."
    },
    "citationCount": 6,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}