{
    "acronym": "bfb33894af77576cc6975b25f93a247633119b9f",
    "title": "Transformer-Based Language Models for Software Vulnerability Detection",
    "seed_ids": [
        "gpt",
        "gpt2",
        "0646bb09db4d1ba24150e69b71edcd4aff691b3c",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "bfb33894af77576cc6975b25f93a247633119b9f",
    "abstract": "The large transformer-based language models demonstrate excellent performance in natural language processing. By considering the transferability of the knowledge gained by these models in one domain to other related domains, and the closeness of natural languages to high-level programming languages, such as C/C++, this work studies how to leverage (large) transformer-based language models in detecting software vulnerabilities and how good are these models for vulnerability detection tasks. In this regard, firstly, we present a systematic (cohesive) framework that details source code translation, model preparation, and inference. Then, we perform an empirical analysis of software vulnerability datasets of C/C++ source codes having multiple vulnerabilities corresponding to the library function call, pointer usage, array usage, and arithmetic expression. Our empirical results demonstrate the good performance of the language models in vulnerability detection. Moreover, these language models have better performance metrics, such as F1-score, than the contemporary models, namely bidirectional long short term memory and bidirectional gated recurrent unit. Experimenting with the language models is always challenging due to the requirement of computing resources, platforms, libraries, and dependencies. Thus, this paper also analyses the popular platforms to efficiently fine-tune these models and present recommendations while choosing the platforms for our framework.",
    "authors": [
        "Chandra Thapa",
        "Seung Ick Jang",
        "Muhammad Ejaz Ahmed",
        "S. Çamtepe",
        "J. Pieprzyk",
        "S. Nepal"
    ],
    "venue": "Asia-Pacific Computer Systems Architecture Conference",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The popular platforms are analyzed to efficiently fine-tune these models and present recommendations while choosing the platforms for the authors' framework, which demonstrates the good performance of the language models in vulnerability detection."
    },
    "citationCount": 55,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}