{
    "acronym": "bfccdbbf24068c3d21e4b3344fc646c8e51adcbc",
    "title": "Understanding the Importance of Evolutionary Search in Automated Heuristic Design with Large Language Models",
    "seed_ids": [
        "gpt3",
        "1c259361caa85c2d95a7d04e5e42fa98693da85b",
        "0b0debb710366cdff461938c80763eace1651af6",
        "bb58f2f63888456a3e04a56a18996ab8dacdb257",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "4b27f18bff43d605805c92696a979714ced0b805"
    ],
    "s2id": "bfccdbbf24068c3d21e4b3344fc646c8e51adcbc",
    "abstract": "Automated heuristic design (AHD) has gained considerable attention for its potential to automate the development of effective heuristics. The recent advent of large language models (LLMs) has paved a new avenue for AHD, with initial efforts focusing on framing AHD as an evolutionary program search (EPS) problem. However, inconsistent benchmark settings, inadequate baselines, and a lack of detailed component analysis have left the necessity of integrating LLMs with search strategies and the true progress achieved by existing LLM-based EPS methods to be inadequately justified. This work seeks to fulfill these research queries by conducting a large-scale benchmark comprising four LLM-based EPS methods and four AHD problems across nine LLMs and five independent runs. Our extensive experiments yield meaningful insights, providing empirical grounding for the importance of evolutionary search in LLM-based AHD approaches, while also contributing to the advancement of future EPS algorithmic development. To foster accessibility and reproducibility, we have fully open-sourced our benchmark and corresponding results.",
    "authors": [
        "Rui Zhang",
        "Fei Liu",
        "Xi Lin",
        "Zhenkun Wang",
        "Zhichao Lu",
        "Qingfu Zhang"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work seeks to fulfill research queries by conducting a large-scale benchmark comprising four LLM-based EPS methods and four AHD problems across nine LLMs and five independent runs, providing empirical grounding for the importance of evolutionary search in LLM-based AHD approaches."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}