{
    "acronym": "bfcd12aa12b275b1b037c6109eb0e506a3bd5ff5",
    "title": "A Novel Knowledge-augmented Model Customization Approach for Arabic Offensive Language Detection",
    "seed_ids": [
        "bert"
    ],
    "s2id": "bfcd12aa12b275b1b037c6109eb0e506a3bd5ff5",
    "abstract": "Multiple attempts to develop systems for detecting online Arabic offensive language have been explored in previous studies. However, most of these attempts do not consider the variation of Arabic dialects, cultures, and offensive phrases. In contrast, this study aims to extract knowledge from multiple offensive language datasets to build a cross-dialect and culture knowledge-based repository. This knowledge-based repository is utilized to develop novel system architecture based on customizing the AraBERT model in a unique method to preserve dialectal knowledge and offensive cultural knowledge within the contextual word embedding of BERT architecture. Performance evaluation procedures consist of statistical evaluation metrics and a behavioral checklist. Results report more effective predictions by the customized model than the uncustomized one, particularly for offensive text. The customization process allows the model to gain more knowledge of informal text in general, and a better understanding of dialectal Arabic.",
    "authors": [
        "Fatemah Husain"
    ],
    "venue": "ACM Trans. Asian Low Resour. Lang. Inf. Process.",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study aims to extract knowledge from multiple offensive language datasets to build a cross-dialect and culture knowledge-based repository to develop novel system architecture based on customizing the AraBERT model in a unique method to preserve dialectal knowledge and offensive cultural knowledge within the contextual word embedding of BERT architecture."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}