{
    "acronym": "bfe533b42b305dc514ad688a50ffd36c5b847fe9",
    "title": "iREL at SemEval-2024 Task 9: Improving Conventional Prompting Methods for Brain Teasers",
    "seed_ids": [
        "gpt3",
        "3cb249077fa9fdd7e18db396f5e053febaa83889"
    ],
    "s2id": "bfe533b42b305dc514ad688a50ffd36c5b847fe9",
    "abstract": "This paper describes our approach for SemEval-2024 Task 9: BRAINTEASER: A Novel Task Defying Common Sense. The BRAINTEASER task comprises multiple-choice Question Answering designed to evaluate the models’ lateral thinking capabilities. It consists of Sentence Puzzle and Word Puzzle subtasks that require models to defy default commonsense associations and exhibit unconventional thinking. We propose a unique strategy to improve the performance of pre-trained language models, notably the Gemini 1.0 Pro Model, in both subtasks. We employ static and dynamic few-shot prompting techniques and introduce a model-generated reasoning strategy that utilizes the LLM’s reasoning capabilities to improve performance. Our approach demonstrated significant improvements, showing that it performed better than the baseline models by a considerable margin but fell short of performing as well as the human annotators, thus highlighting the efficacy of the proposed strategies.",
    "authors": [
        "Harshit Gupta",
        "Manav Chaudhary",
        "Tathagata Raha",
        "Shivansh Subramanian",
        "Vasudeva Varma"
    ],
    "venue": "International Workshop on Semantic Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a unique strategy to improve the performance of pre-trained language models, notably the Gemini 1.0 Pro Model, in both subtasks of SemEval-2024 Task 9: BRAINTEASER, and introduces a model-generated reasoning strategy that utilizes the LLM’s reasoning capabilities to improve performance."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}