{
    "acronym": "bfe6fd05f09647b001c7eb6e333a95c881c88344",
    "title": "Human-Timescale Adaptation in an Open-Ended Task Space",
    "seed_ids": [
        "transformerxl",
        "860bc4f071f35d6d8529a52c2c1858d030779a6a",
        "6edccbd83a9aae204785d4821f97855677c33866",
        "32c9b3859086d15184989454eb878638659e64c6",
        "6b7bf6cf5d0e1004d4468edfac4e8f81c0d0c50d",
        "59a916cdc943f0282908e6f3fa0360f4c5fb78d0"
    ],
    "s2id": "bfe6fd05f09647b001c7eb6e333a95c881c88344",
    "abstract": "Foundation models have shown impressive adaptation and scalability in supervised and self-supervised learning problems, but so far these successes have not fully translated to reinforcement learning (RL). In this work, we demonstrate that training an RL agent at scale leads to a general in-context learning algorithm that can adapt to open-ended novel embodied 3D problems as quickly as humans. In a vast space of held-out environment dynamics, our adaptive agent (AdA) displays on-the-fly hypothesis-driven exploration, efficient exploitation of acquired knowledge, and can successfully be prompted with first-person demonstrations. Adaptation emerges from three ingredients: (1) meta-reinforcement learning across a vast, smooth and diverse task distribution, (2) a policy parameterised as a large-scale attention-based memory architecture, and (3) an effective automated curriculum that prioritises tasks at the frontier of an agent's capabilities. We demonstrate characteristic scaling laws with respect to network size, memory length, and richness of the training task distribution. We believe our results lay the foundation for increasingly general and adaptive RL agents that perform well across ever-larger open-ended domains.",
    "authors": [
        "Adaptive Agent Team",
        "Jakob Bauer",
        "Kate Baumli",
        "Satinder Baveja",
        "Feryal M. P. Behbahani",
        "Avishkar Bhoopchand",
        "N. Bradley-Schmieg",
        "Michael Chang",
        "Natalie Clay",
        "Adrian Collister",
        "Vibhavari Dasagi",
        "Lucy Gonzalez",
        "Karol Gregor",
        "Edward Hughes",
        "Sheleem Kashem",
        "Maria Loks-Thompson",
        "Hannah Openshaw",
        "Jack Parker-Holder",
        "Shreyaan Pathak",
        "Nicolas Perez Nieves",
        "Nemanja Rakicevic",
        "Tim Rocktäschel",
        "Yannick Schroecker",
        "Jakub Sygnowski",
        "K. Tuyls",
        "Sarah York",
        "Alexander Zacherl",
        "Lei M. Zhang"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that training an RL agent at scale leads to a general in-context learning algorithm that can adapt to open-ended novel embodied 3D problems as quickly as humans."
    },
    "citationCount": 82,
    "influentialCitationCount": 9,
    "code": null,
    "description": null,
    "url": null
}