{
    "acronym": "c05e852fa8fa8aa2493b9ace04320701102eb6cb",
    "title": "T RENDS AND CHALLENGES OF A RABIC C HATBOTS : L ITERATURE REVIEW",
    "seed_ids": [
        "gpt",
        "7b6a8c6d44e0f77bf930484e438d77b7465a69fb",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c05e852fa8fa8aa2493b9ace04320701102eb6cb",
    "abstract": "Conversational systems have recently garnered increased attention due to advancements in Large Language Models (LLMs) and Language Models for Dialogue Applications (LaMDA). However, conversational Artificial Intelligence (AI) research focuses primarily on English. Despite Arabic being one of the most widely used languages on the Internet, only a few studies have concentrated on Arabic conversational dialogue systems thus far. This study presents a comprehensive qualitative analysis of critical research works in this domain to examine the strengths and limitations of existing approaches. The analysis begins with an overview of chatbot history and classification, then explores the language challenges encountered when developing Generative Arabic Conversational AI. Rule-based/Retrieval-based and deep learning-based approaches for Arabic chatbots are also examined. Furthermore, the study investigates the evolution of Generative Conversational AI with the advancements in deep-learning techniques. It also comprehensively reviews various metrics used to assess conversational systems.",
    "authors": [
        ".. M. M. Gammoudi",
        "Yassine Saoudi",
        "M. Gammoudi"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The analysis begins with an overview of chatbot history and classification, then explores the language challenges encountered when developing Generative Arabic Conversational AI, and comprehensively reviews various metrics used to assess conversational systems."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}