{
    "acronym": "c08d42be94b07e6253ef9173453acc0b13061e2d",
    "title": "Backtranslate what you are saying and I will tell who you are",
    "seed_ids": [
        "gpt2",
        "98f8d79d460c020ca6b51e1159f87fd9cc19a3bb",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c08d42be94b07e6253ef9173453acc0b13061e2d",
    "abstract": "With this work, we hypothesize that semantically enriching a user's text corpus using backtranslation and expansion modules can improve performance for author profiling tasks. To perform this textual enrichment, we translate an author's representative text. Translations are made from one language—the source language—into another—the target language—and then back to the original one. Finally, we expand an author's text by integrating the original version with the back‐translated one. Our framework includes these backtranslation and expansion modules followed by a SOTA classifier successfully employed for text classification. The framework is tested on three author profiling datasets from the last three years’ shared tasks on fake news, hate speech, irony and stereotypes detection hosted at the CLEF conference for the PAN Lab. This work is an extension of our previous one where we just presented our main idea. Here we improve our framework, and we also investigate more languages and more datasets. Finally, a qualitative analysis is provided. The results confirm that the backtranslation and expansion add‐on modules improve model performance on all three datasets evaluated.",
    "authors": [
        "Marco Siino",
        "Francesco Lomonaco",
        "Paolo Rosso"
    ],
    "venue": "Expert Syst. J. Knowl. Eng.",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is hypothesize that semantically enriching a user's text corpus using backtranslation and expansion modules using backtranslation and expansion modules can improve performance for author profiling tasks."
    },
    "citationCount": 8,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}