{
    "acronym": "c09d4e542a5e26fb1ca47b5bd00106c66937f2fd",
    "title": "xT: Nested Tokenization for Larger Context in Large Images",
    "seed_ids": [
        "mamba",
        "93e58491830abe1eb965ab37ec64fa97263f6048",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "3cbe314cc5407a6c3249815b5173f22ea15173c2",
        "f4238bd2385a52413ccbacfd9e409a650235bd13",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "c09d4e542a5e26fb1ca47b5bd00106c66937f2fd",
    "abstract": "Modern computer vision pipelines handle large images in one of two sub-optimal ways: down-sampling or cropping. These two methods incur significant losses in the amount of information and context present in an image. There are many downstream applications in which global context matters as much as high frequency details, such as in real-world satellite imagery; in such cases researchers have to make the uncomfortable choice of which information to discard. We introduce xT, a simple framework for vision transformers which effectively aggregates global context with local details and can model large images end-to-end on contemporary GPUs. We select a set of benchmark datasets across classic vision tasks which accurately reflect a vision model's ability to understand truly large images and incorporate fine details over large scales and assess our method's improvement on them. xT is a streaming, two-stage architecture that adapts existing vision backbones and long sequence language models to effectively model large images without quadratic memory growth. We are able to increase accuracy by up to 8.6% on challenging classification tasks and $F_1$ score by 11.6 on context-dependent segmentation on images as large as 29,000 x 29,000 pixels.",
    "authors": [
        "Ritwik Gupta",
        "Shufan Li",
        "Tyler Zhu",
        "Jitendra Malik",
        "Trevor Darrell",
        "K. Mangalam"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}