{
    "acronym": "c0f26279b8a296dd24e80e1c671dc526b132d12d",
    "title": "LLM-DA: Data Augmentation via Large Language Models for Few-Shot Named Entity Recognition",
    "seed_ids": [
        "bert",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "7eba731a7fd8de712b7b79b5af41a6e2d4dbd191"
    ],
    "s2id": "c0f26279b8a296dd24e80e1c671dc526b132d12d",
    "abstract": "Despite the impressive capabilities of large language models (LLMs), their performance on information extraction tasks is still not entirely satisfactory. However, their remarkable rewriting capabilities and extensive world knowledge offer valuable insights to improve these tasks. In this paper, we propose $LLM-DA$, a novel data augmentation technique based on LLMs for the few-shot NER task. To overcome the limitations of existing data augmentation methods that compromise semantic integrity and address the uncertainty inherent in LLM-generated text, we leverage the distinctive characteristics of the NER task by augmenting the original data at both the contextual and entity levels. Our approach involves employing 14 contextual rewriting strategies, designing entity replacements of the same type, and incorporating noise injection to enhance robustness. Extensive experiments demonstrate the effectiveness of our approach in enhancing NER model performance with limited data. Furthermore, additional analyses provide further evidence supporting the assertion that the quality of the data we generate surpasses that of other existing methods.",
    "authors": [
        "Junjie Ye",
        "Nuo Xu",
        "Yikun Wang",
        "Jie Zhou",
        "Qi Zhang",
        "Tao Gui",
        "Xuanjing Huang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes $LLM-DA, a novel data augmentation technique based on LLMs for the few-shot NER task that leverages the distinctive characteristics of the NER task by augmenting the original data at both the contextual and entity levels."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}