{
    "acronym": "c13a4cb912ef5202e99feff0f5dd01f183668d59",
    "title": "Unleashing the Power of Large Models: Exploring Human-Machine Conversations",
    "seed_ids": [
        "gpt",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "83edcfbb206ddad38a971d605da09390604248ea",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "2613734d0fcff478915ea61e702160cfe88311d8",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "a3184d40d390793232c99c89b57b8f65c16320b2",
        "2d29e1e684f8db8a143b3313cee991c4c786d340",
        "319b84be7a843250bc81d7086f79a4126d550277",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "6ebfbc954b9975d2f2651f380b9bdf46ae963178",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3"
    ],
    "s2id": "c13a4cb912ef5202e99feff0f5dd01f183668d59",
    "abstract": "“In recent years, large language models (LLMs) have garnered significant attention across variousdomains, resulting in profound impacts. In this paper, we aim to explore the potential of LLMsin the field of human-machine conversations. It begins by examining the rise and milestonesof these models, tracing their origins from neural language models to the transformative impactof the Transformer architecture on conversation processing. Next, we discuss the emergence oflarge pre-training models and their utilization of contextual knowledge at a large scale, as wellas the scaling to billion-parameter models that push the boundaries of language generation. Wefurther highlight advancements in multi-modal conversations, showcasing how LLMs bridge thegap between language and vision. We also introduce various applications in human-machine con-versations, such as intelligent assistant-style dialogues and emotionally supportive conversations,supported by successful case studies in diverse fields. Lastly, we explore the challenges facedby LLMs in this context and provide insights into future development directions and prospects.Overall, we offer a comprehensive overview of the potential and future development of LLMs inhuman-machine conversations, encompassing their milestones, applications, and the challengesahead.”",
    "authors": [
        "Liu Yuhan",
        "Xiuying Chen",
        "Yan Rui"
    ],
    "venue": "China National Conference on Chinese Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The rise and milestones of large pre-training models and their utilization of contextual knowledge at a large scale, as well as the scaling to billion-parameter models that push the boundaries of language generation are examined."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}