{
    "acronym": "c1728b2fb443a643ffdf5244a981bfbde8ce95d0",
    "title": "Systematic Literature Review on Named Entity Recognition: Approach, Method, and Application",
    "seed_ids": [
        "bert"
    ],
    "s2id": "c1728b2fb443a643ffdf5244a981bfbde8ce95d0",
    "abstract": "Named entity recognition (NER) is one of the preprocessing stages in natural language processing (NLP), which functions to detect and classify entities in the corpus. NER results are used in various NLP applications, including sentiment analysis, text summarization, chatbot, machine translation, and question answering. Several previous reviews partially discussed NER, for instance, NER reviews in specific domains, NER classification, and NER deep learning. This paper provides a comprehensive and systematic review on NER topic studies published from 2011 to 2020. The main contribution of this review is to present a comprehensive systematic literature review on NER from preprocessing techniques, datasets, application domains, feature extraction techniques, approaches, methods, and evaluation techniques. The result concludes that the deep learning approach and the Bi-directional long short-term memory with a conditional random field (Bi-LSTM-CRF) method are the most interesting methods among NER researchers. At the same time, medical and health are NER researchers' most popular domains. These developments have also led to an increasing number of public datasets in the medical and health fields. At the end of this review, we recommend some opportunities and challenges for NER research going forward.",
    "authors": [
        "Warto",
        "Supriadi Rustad",
        "G. F. Shidik",
        "E. Noersasongko",
        "Purwanto",
        "Muljono",
        "De Rosal Ignatius Moses Setiadi"
    ],
    "venue": "Statistics, Optimization &amp; Information Computing",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The result concludes that the deep learning approach and the Bi-directional long short-term memory with a conditional random field (Bi-LSTM-CRF) method are the most interesting methods among NER researchers."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}