{
    "acronym": "c193eb176985a81ae64f63c5e50b2f11cfb7c4e6",
    "title": "Dynamic Context Pruning for Efficient and Interpretable Autoregressive Transformers",
    "seed_ids": [
        "flashattn",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "f75d05e759447c2aedb7097728f29f9a520d9bc1",
        "dbf53ece1a6a8860e41ff5f721c72ceb0fb18dd6",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "4badd753be64c5c5b57dd2bb2e515fbe0c0720d8",
        "1a703f08da01cf737cce3fb9064259b3f4b44e9c",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "40ca4fcfffa7ca9aa9b7ff06ecf3cd0436712d78",
        "0b991a1a5bcdb13646ac0b6873d09bde4cc36fb5",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "9405cc0d6169988371b2755e573cc28650d14dfe",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "c193eb176985a81ae64f63c5e50b2f11cfb7c4e6",
    "abstract": "Autoregressive Transformers adopted in Large Language Models (LLMs) are hard to scale to long sequences. Despite several works trying to reduce their computational cost, most of LLMs still adopt attention layers between all pairs of tokens in the sequence, thus incurring a quadratic cost. In this study, we present a novel approach that dynamically prunes contextual information while preserving the model's expressiveness, resulting in reduced memory and computational requirements during inference. Our method employs a learnable mechanism that determines which uninformative tokens can be dropped from the context at any point across the generation process. By doing so, our approach not only addresses performance concerns but also enhances interpretability, providing valuable insight into the model's decision-making process. Our technique can be applied to existing pre-trained models through a straightforward fine-tuning process, and the pruning strength can be specified by a sparsity parameter. Notably, our empirical findings demonstrate that we can effectively prune up to 80\\% of the context without significant performance degradation on downstream tasks, offering a valuable tool for mitigating inference costs. Our reference implementation achieves up to $2\\times$ increase in inference throughput and even greater memory savings.",
    "authors": [
        "Sotiris Anagnostidis",
        "Dario Pavllo",
        "Luca Biggio",
        "Lorenzo Noci",
        "Aurélien Lucchi",
        "Thomas Hofmann"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel approach that dynamically prunes contextual information while preserving the model's expressiveness, resulting in reduced memory and computational requirements during inference, offering a valuable tool for mitigating inference costs."
    },
    "citationCount": 22,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}