{
    "acronym": "c1b1eda55d53f7eae4ef6a6e4ca23af56bebd368",
    "title": "Mixed Diffusion for 3D Indoor Scene Synthesis",
    "seed_ids": [
        "d3pms",
        "8ea1afe4dd58ed64d234a00a61f2395301b103de",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "c1b1eda55d53f7eae4ef6a6e4ca23af56bebd368",
    "abstract": "Realistic conditional 3D scene synthesis significantly enhances and accelerates the creation of virtual environments, which can also provide extensive training data for computer vision and robotics research among other applications. Diffusion models have shown great performance in related applications, e.g., making precise arrangements of unordered sets. However, these models have not been fully explored in floor-conditioned scene synthesis problems. We present MiDiffusion, a novel mixed discrete-continuous diffusion model architecture, designed to synthesize plausible 3D indoor scenes from given room types, floor plans, and potentially pre-existing objects. We represent a scene layout by a 2D floor plan and a set of objects, each defined by its category, location, size, and orientation. Our approach uniquely implements structured corruption across the mixed discrete semantic and continuous geometric domains, resulting in a better conditioned problem for the reverse denoising step. We evaluate our approach on the 3D-FRONT dataset. Our experimental results demonstrate that MiDiffusion substantially outperforms state-of-the-art autoregressive and diffusion models in floor-conditioned 3D scene synthesis. In addition, our models can handle partial object constraints via a corruption-and-masking strategy without task specific training. We show MiDiffusion maintains clear advantages over existing approaches in scene completion and furniture arrangement experiments.",
    "authors": [
        "Siyi Hu",
        "Diego Martín Arroyo",
        "Stephanie Debats",
        "Fabian Manhardt",
        "Luca Carlone",
        "Federico Tombari"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "MiDiffusion is presented, a novel mixed discrete-continuous diffusion model architecture, designed to synthesize plausible 3D indoor scenes from given room types, floor plans, and potentially pre-existing objects, and maintains clear advantages over existing approaches in scene completion and furniture arrangement experiments."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}