{
    "acronym": "c2679d0d07801c48fb31edc89b0cc33b84b837e4",
    "title": "A Novel State Space Model with Local Enhancement and State Sharing for Image Fusion",
    "seed_ids": [
        "mamba",
        "131ba9932572c92155874db93626cf299659254e",
        "d98b5c1d0f9a4e39dc79ea7a3f74e54789df5e13",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "c2679d0d07801c48fb31edc89b0cc33b84b837e4",
    "abstract": "In image fusion tasks, images from different sources possess distinct characteristics. This has driven the development of numerous methods to explore better ways of fusing them while preserving their respective characteristics. Mamba, as a state space model, has emerged in the field of natural language processing. Recently, many studies have attempted to extend Mamba to vision tasks. However, due to the nature of images different from casual language sequences, the limited state capacity of Mamba weakens its ability to model image information. Additionally, the sequence modeling ability of Mamba is only capable of spatial information and cannot effectively capture the rich spectral information in images. Motivated by these challenges, we customize and improve the vision Mamba network designed for the image fusion task. Specifically, we propose the local-enhanced vision Mamba block, dubbed as LEVM. The LEVM block can improve local information perception of the network and simultaneously learn local and global spatial information. Furthermore, we propose the state sharing technique to enhance spatial details and integrate spatial and spectral information. Finally, the overall network is a multi-scale structure based on vision Mamba, called LE-Mamba. Extensive experiments show the proposed methods achieve state-of-the-art results on multispectral pansharpening and multispectral and hyperspectral image fusion datasets, and demonstrate the effectiveness of the proposed approach. Code will be made available.",
    "authors": [
        "Zihan Cao",
        "Xiao Wu",
        "Liang-Jian Deng",
        "Yu Zhong"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work customize and improve the vision Mamba network designed for the image fusion task and proposes the local-enhanced vision Mamba block, dubbed as LEVM, which can improve local information perception of the network and simultaneously learn local and global spatial information."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}