{
    "acronym": "c2a5073564be916b900ed4c610b3be06805df598",
    "title": "Diffusion models for time-series applications: a survey",
    "seed_ids": [
        "diffusionlm",
        "e342165a614588878ad0f4bc9bacf3905df34d08",
        "17d068e78e6f25e65cb08319b19b58279bb8b214",
        "ef7993ab30d0a8afabb4ebab080e471c0d5c743c",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f"
    ],
    "s2id": "c2a5073564be916b900ed4c610b3be06805df598",
    "abstract": "Diffusion models, a family of generative models based on deep learning, have become increasingly prominent in cutting-edge machine learning research. With distinguished performance in generating samples that resemble the observed data, diffusion models are widely used in image, video, and text synthesis nowadays. In recent years, the concept of diffusion has been extended to time-series applications, and many powerful models have been developed. Considering the deficiency of a methodical summary and discourse on these models, we provide this survey as an elementary resource for new researchers in this area and to provide inspiration to motivate future research. For better understanding, we include an introduction about the basics of diffusion models. Except for this, we primarily focus on diffusion-based methods for time-series forecasting, imputation, and generation, and present them, separately, in three individual sections. We also compare different methods for the same application and highlight their connections if applicable. Finally, we conclude with the common limitation of diffusion-based methods and highlight potential future research directions. 扩散模型,一类基于深度学习的生成模型家族,在前沿机器学习研究中变得日益重要。扩散模型以在生成与观察数据相似样本方面的卓越性能而著称,如今广泛用于图像、视频和文本合成。近年来,扩散的概念已扩展到时间序列应用领域,涌现出许多强大的模型。鉴于这些模型缺乏系统性总结和讨论,我们提供此综述作为此领域新研究人员的基础资源,并为激发未来研究提供灵感。为更好理解,引入了有关扩散模型基础知识的介绍。除此之外,主要关注基于扩散的时间序列预测、插补和生成方法,并将它们分别在三个独立章节中呈现。还比较了同一应用的不同方法,并强调它们之间的关联(若适用)。最后,总结了扩散方法的共同局限性,并突出强调潜在的未来研究方向。",
    "authors": [
        "Lequan Lin",
        "Zhengkun Li",
        "Ruikun Li",
        "Xuliang Li",
        "Junbin Gao"
    ],
    "venue": "Frontiers Inf. Technol. Electron. Eng.",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey focuses on diffusion-based methods for time-series forecasting, imputation, and generation, and compares different methods for the same application and highlights their connections if applicable."
    },
    "citationCount": 29,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}