{
    "acronym": "c2aa448fea1d02ede55f0cbfeebe7ba9d08fe16d",
    "title": "Which Linguist Invented the Lightbulb? Presupposition Verification for Question-Answering",
    "seed_ids": [
        "etc",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "9a5ba9aee44ab873f3d60b05e2773c693707da88"
    ],
    "s2id": "c2aa448fea1d02ede55f0cbfeebe7ba9d08fe16d",
    "abstract": "Many Question-Answering (QA) datasets contain unanswerable questions, but their treatment in QA systems remains primitive. Our analysis of the Natural Questions (Kwiatkowski et al. 2019) dataset reveals that a substantial portion of unanswerable questions (~21%) can be explained based on the presence of unverifiable presuppositions. Through a user preference study, we demonstrate that the oracle behavior of our proposed system—which provides responses based on presupposition failure—is preferred over the oracle behavior of existing QA systems. Then, we present a novel framework for implementing such a system in three steps: presupposition generation, presupposition verification, and explanation generation, reporting progress on each. Finally, we show that a simple modification of adding presuppositions and their verifiability to the input of a competitive end-to-end QA system yields modest gains in QA performance and unanswerability detection, demonstrating the promise of our approach.",
    "authors": [
        "Najoung Kim",
        "Ellie Pavlick",
        "Burcu Karagol Ayan",
        "Deepak Ramachandran"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that a simple modification of adding presuppositions and their verifiability to the input of a competitive end-to-end QA system yields modest gains in QA performance and unanswerability detection, demonstrating the promise of the approach."
    },
    "citationCount": 36,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}