{
    "acronym": "c30deb8f4b0e942a36e5ef5c87bed01f575c0c6e",
    "title": "Pit One Against Many: Leveraging Attention-head Embeddings for Parameter-efficient Multi-head Attention",
    "seed_ids": [
        "reformer",
        "fnet",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "05d70085d1b580b2369942410ae77c48d1eeacca",
        "e4f82c0a13cae6739239ae0c25a554b6daff35af",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c49ac1f916d6d2edeb187e6619c8d23acd95eb21",
        "ce6b6046ad26e0f29932b539919c58333aedf1eb",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "1a703f08da01cf737cce3fb9064259b3f4b44e9c",
        "8fd0b70cfd6bbdaef9fbe1073afb3920cb61f80b",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "80cf2a6af4200ecfca1c18fc89de16148f1cd4bf",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c30deb8f4b0e942a36e5ef5c87bed01f575c0c6e",
    "abstract": "Scaling pre-trained language models has resulted in large performance gains in various natural language processing tasks but comes with a large cost in memory requirements. Inspired by the position embeddings in transformers, we aim to simplify and reduce the memory footprint of the multi-head attention (MHA) mechanism. We propose an alternative module that uses only a single shared projection matrix and multiple head embeddings (MHE), i.e. one per head. We empirically demonstrate that our MHE attention is substantially more memory efficient compared to alternative attention mechanisms while achieving high predictive performance retention ratio to vanilla MHA on several downstream tasks. MHE attention only requires a negligible fraction of additional parameters ($3nd$, where $n$ is the number of attention heads and $d$ the size of the head embeddings) compared to a single-head attention, while MHA requires $(3n^2-3n)d^2-3nd$ additional parameters.",
    "authors": [
        "Huiyin Xue",
        "Nikolaos Aletras"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes an alternative module that uses only a single shared projection matrix and multiple head embeddings (MHE), i.e. one per head, and empirically demonstrates that this MHE attention is substantially more memory efficient compared to alternative attention mechanisms while achieving high predictive performance retention ratio to vanilla MHA on several downstream tasks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}