{
    "acronym": "c31970f0b5a3ffa41ab604ae29ffd323af277538",
    "title": "Situational Awareness Matters in 3D Vision Language Reasoning",
    "seed_ids": [
        "gpt3",
        "13d12b26db345f62e8e512db181b96a7f8763b47",
        "42a30dc5470f54ec249f25d3c31e05d7c376c8e3",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "c31970f0b5a3ffa41ab604ae29ffd323af277538",
    "abstract": "Being able to carry out complicated vision language reasoning tasks in 3D space represents a significant milestone in developing household robots and human-centered embodied AI. In this work, we demonstrate that a critical and distinct challenge in 3D vision language reasoning is situational awareness, which incorporates two key components: (1) The autonomous agent grounds its self-location based on a language prompt. (2) The agent answers open-ended questions from the perspective of its calculated position. To address this challenge, we introduce SIG3D, an end-to-end Situation-Grounded model for 3D vision language reasoning. We tokenize the 3D scene into sparse voxel representation and propose a language-grounded situation estimator, followed by a situated question answering module. Experiments on the SQA3D and ScanQA datasets show that SIG3D outperforms state-of-the-art models in situation estimation and question answering by a large margin (e.g., an enhancement of over 30% on situation estimation accuracy). Subsequent analysis corroborates our architectural design choices, explores the distinct functions of visual and textual tokens, and highlights the importance of situational awareness in the domain of 3D question answering.",
    "authors": [
        "Yunze Man",
        "Liangyan Gui",
        "Yu-Xiong Wang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "SIG3D is introduced, an end-to-end Situation-Grounded model for 3D vision language reasoning that outperforms state-of-the-art models in situation estimation and question answering and highlights the importance of situational awareness in the domain of 3D question answering."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}