{
    "acronym": "c3382fd533b9dd7f8ed7ba7766159079bc1d3935",
    "title": "BioT5: Enriching Cross-modal Integration in Biology with Chemical Knowledge and Natural Language Associations",
    "seed_ids": [
        "gpt",
        "d55b69a533dea69c8b2673cde8de90c6626ee789",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c3382fd533b9dd7f8ed7ba7766159079bc1d3935",
    "abstract": "Recent advancements in biological research leverage the integration of molecules, proteins, and natural language to enhance drug discovery. However, current models exhibit several limitations, such as the generation of invalid molecular SMILES, underutilization of contextual information, and equal treatment of structured and unstructured knowledge. To address these issues, we propose $\\mathbf{BioT5}$, a comprehensive pre-training framework that enriches cross-modal integration in biology with chemical knowledge and natural language associations. $\\mathbf{BioT5}$ utilizes SELFIES for $100%$ robust molecular representations and extracts knowledge from the surrounding context of bio-entities in unstructured biological literature. Furthermore, $\\mathbf{BioT5}$ distinguishes between structured and unstructured knowledge, leading to more effective utilization of information. After fine-tuning, BioT5 shows superior performance across a wide range of tasks, demonstrating its strong capability of capturing underlying relations and properties of bio-entities. Our code is available at $\\href{https://github.com/QizhiPei/BioT5}{Github}$.",
    "authors": [
        "Qizhi Pei",
        "Wei Zhang",
        "Jinhua Zhu",
        "Kehan Wu",
        "Kaiyuan Gao",
        "Lijun Wu",
        "Yingce Xia",
        "Rui Yan"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A comprehensive pre-training framework that enriches cross-modal integration in biology with chemical knowledge and natural language associations, and distinguishes between structured and unstructured knowledge, leading to more effective utilization of information."
    },
    "citationCount": 23,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}