{
    "acronym": "c360b3a789b2a05072f21f6a8997c68bf1b24087",
    "title": "GlyphDiffusion: Text Generation as Image Generation",
    "seed_ids": [
        "diffusionbert",
        "d3pms",
        "diffuseq",
        "a1186d7d9a9ef258c76afef1177e4f348061a537",
        "23b7cde603b5ec8d5d13d46e1c453dc52d7c3f6c",
        "a979742220a88b1d32e1fbe72c41e8ba3007053c",
        "2c6ac935c826002976722ca8d3319f691975687e",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "599bc7cfe98c2b57ddbe111412203a636da57be0",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "e512964293671abbdc409f313d127cbe85ffe5cd",
        "24425954960ce968e5f14360fbdd0605abcadfcf",
        "4d2a05140dd9bafaf035a846e7bda05f956304d2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c360b3a789b2a05072f21f6a8997c68bf1b24087",
    "abstract": "Diffusion models have become a new generative paradigm for text generation. Considering the discrete categorical nature of text, in this paper, we propose GlyphDiffusion, a novel diffusion approach for text generation via text-guided image generation. Our key idea is to render the target text as a glyph image containing visual language content. In this way, conditional text generation can be cast as a glyph image generation task, and it is then natural to apply continuous diffusion models to discrete texts. Specially, we utilize a cascaded architecture (ie a base and a super-resolution diffusion model) to generate high-fidelity glyph images, conditioned on the input text. Furthermore, we design a text grounding module to transform and refine the visual language content from generated glyph images into the final texts. In experiments over four conditional text generation tasks and two classes of metrics (ie quality and diversity), GlyphDiffusion can achieve comparable or even better results than several baselines, including pretrained language models. Our model also makes significant improvements compared to the recent diffusion model.",
    "authors": [
        "Junyi Li",
        "Wayne Xin Zhao",
        "J. Nie",
        "Ji-rong Wen"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "GlyphDiffusion is proposed, a novel diffusion approach for text generation via text-guided image generation that utilizes a cascaded architecture (ie a base and a super-resolution diffusion model) to generate high-fidelity glyph images, conditioned on the input text."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}