{
    "acronym": "c37fed5ff81632e7e3966f85d0875ebf1ce02ddb",
    "title": "Joint Extraction of Entity Relationships in Walnut Disease and Pest Based on Chinese NLP Models",
    "seed_ids": [
        "bert"
    ],
    "s2id": "c37fed5ff81632e7e3966f85d0875ebf1ce02ddb",
    "abstract": "This study addresses the limited application of deep learning techniques in the field of walnut disease and pest and the challenges posed by complex relationships and diverse entity types in this domain. We propose a deep learning-based method for constructing a knowledge graph in the walnut disease and pest domain, incorporating ontologies to establish a conceptual model for the disease and pest knowledge graph. To overcome issues such as relationship overlap (e.g., one-to-many, many-to-many) and loss of relationship chains, we introduce a novel labeling scheme called “based on ontology binding BIESO (Begin-Inside-End-Single-Other)” that directly models triplets. By employing a label matching algorithm, we obtain triplet data. We train and predict on the dataset using an end-to-end model consisting of Bidirectional Encoder Representations from Transformers (BERT), Bi-directional Gate Recurrent Unit (BiGRU), and Conditional Random Field (CRF). Experimental results show an F1 score of 75.79%, outperforming models such as BERT-BiLSTM-CRF and word2vec-BiGRU-CRF. We semiautomatically extract unstructured knowledge and store the extracted triplets in a Neo4j graph database, enabling visualization of the knowledge. The research methodology of this knowledge graph can serve as a reference for constructing knowledge graphs in walnut agriculture and developing intelligent question-answering systems for walnut disease and pest.",
    "authors": [
        "Ruiliang Zhu",
        "Xiangshuai Song",
        "Hao Zhang",
        "Xuli Cai"
    ],
    "venue": "2024 IEEE 3rd International Conference on Electrical Engineering, Big Data and Algorithms (EEBDA)",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A deep learning-based method for constructing a knowledge graph in the walnut disease and pest domain is proposed, incorporating ontologies to establish a conceptual model for the disease and pest knowledge graph, and a novel labeling scheme called “based on ontology binding BIESO (Begin-Inside-End-Single-Other)” is introduced."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}