{
    "acronym": "c3a9829f21e3d9df3c99ac2d3b71cd8818707725",
    "title": "ExAgt: Expert-guided Augmentation for Representation Learning of Traffic Scenarios",
    "seed_ids": [
        "gpt2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c3a9829f21e3d9df3c99ac2d3b71cd8818707725",
    "abstract": "Representation learning in recent years has been addressed with self-supervised learning methods. The input data is augmented into two distorted views and an encoder learns the representations that are invariant to distortions – cross-view prediction. Augmentation is one of the key components in cross-view self-supervised learning frameworks to learn visual representations. This paper presents ExAgt, a novel method to include expert knowledge for augmenting traffic scenarios, to improve the learnt representations without any human annotation. The expert-guided augmentations are generated in an automated fashion based on the infrastructure, the interactions between the EGO and the traffic participants and an ideal sensor model. The ExAgt method is applied in two state-of-the-art cross-view prediction methods and the representations learnt are tested in downstream tasks like classification and clustering. Results show that the ExAgt method improves representation learning compared to using only standard augmentations and it provides a better representation space stability. The code is available at https://github.com/lab176344/ExAgt.",
    "authors": [
        "Lakshman Balasubramanian",
        "Jonas Wurst",
        "R. Egolf",
        "M. Botsch",
        "W. Utschick",
        "Ke Deng"
    ],
    "venue": "2022 IEEE 25th International Conference on Intelligent Transportation Systems (ITSC)",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Results show that the ExAgt method improves representation learning compared to using only standard augmentations and it provides a better representation space stability."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}