{
    "acronym": "c3ed03a289eda82d9ebbae04fe49fc9c6b4b2631",
    "title": "MICL: Improving In-Context Learning through Multiple-Label Words in Demonstration",
    "seed_ids": [
        "gpt2",
        "7bd4ca8706a79983d31ab74e6c79bfdfd949602e",
        "dc385646887a3669ae0ee506a263d592f4f7c7a6",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c3ed03a289eda82d9ebbae04fe49fc9c6b4b2631",
    "abstract": "In-context learning (ICL) enables large language models (LLMs) to perform new tasks by using sample-label pairs as demonstrations. However, variations in demonstrations can lead to significantly different performances. Current research mainly focuses on selecting demonstration samples, preassuming the class name to be the label word when creating sample-label pairs. However, the choice of label words is crucial for ICL performance. In addition, we observe that using a single class name in demonstration may not yield optimal results. In this paper, we propose to use multiple label words in one sample-label pair to enhance ICL performance. Further, we select and order sample-label pairs based on LLM's output distribution, aiming to optimize the demonstration examples from both the samples' and labels' perspectives. Evaluation results on seven classification datasets show that the use of multiple label words, strategically organized by their selection, order and quantity, improves ICL performance through diverse label information.",
    "authors": [
        "Zixiao Zhu",
        "Zijian Feng",
        "Hanzhang Zhou",
        "Junlang Qian",
        "Mao Kezhi"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Evaluation results on seven classification datasets show that the use of multiple label words, strategically organized by their selection, order and quantity, improves ICL performance through diverse label information."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}