{
    "acronym": "c3f565245540196b96e2e5a0c9718de1f1b7a78b",
    "title": "AQuA – Combining Experts’ and Non-Experts’ Views To Assess Deliberation Quality in Online Discussions Using LLMs",
    "seed_ids": [
        "bert",
        "e1f4b94479bfcb735a1a0add178a2337def07c9b",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "c3f565245540196b96e2e5a0c9718de1f1b7a78b",
    "abstract": "Measuring the quality of contributions in political online discussions is crucial in deliberation research and computer science. Research has identified various indicators to assess online discussion quality, and with deep learning advancements, automating these measures has become feasible. While some studies focus on analyzing specific quality indicators, a comprehensive quality score incorporating various deliberative aspects is often preferred. In this work, we introduce AQuA, an additive score that calculates a unified deliberative quality score from multiple indices for each discussion post. Unlike other singular scores, AQuA preserves information on the deliberative aspects present in comments, enhancing model transparency. We develop adapter models for 20 deliberative indices, and calculate correlation coefficients between experts’ annotations and the perceived deliberativeness by non-experts to weigh the individual indices into a single deliberative score. We demonstrate that the AQuA score can be computed easily from pre-trained adapters and aligns well with annotations on other datasets that have not be seen during training. The analysis of experts’ vs. non-experts’ annotations confirms theoretical findings in the social science literature.",
    "authors": [
        "Maike Behrendt",
        "Stefan Sylvius Wagner",
        "Marc Ziegele",
        "L. Wilms",
        "Anke Stoll",
        "Dominique Heinbach",
        "Stefan Harmeling"
    ],
    "venue": "DELITE",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces AQuA, an additive score that calculates a unified deliberative quality score from multiple indices for each discussion post, and develops adapter models for 20 deliberative indices, and calculates correlation coefficients between experts’ annotations and the perceived deliberativeness by non-experts to weigh the individual indices into a single deliberative score."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}