{
    "acronym": "c49ac1f916d6d2edeb187e6619c8d23acd95eb21",
    "title": "cosFormer: Rethinking Softmax in Attention",
    "seed_ids": [
        "performer",
        "rfa",
        "linformer",
        "lineartransformer",
        "bigbird",
        "longformer",
        "reformer",
        "sinkhorn",
        "08ffdec40291a2ccb5f8a6cc048b01247fb34b96",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "79b4ec1aaf67a04a9afa0d8138f84b7be66c00cb",
        "6fa1cfc4f97f03a8485692418c7aa1a06c574a85",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "c0f709acf38eb27702b0fbce1215db0ebaa2de2b",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "34a4e6818d680875ff0bef9a76de0376118446d1",
        "8cef9900c04d7f661c08f4b5b1ed4337ace042a3",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "c49ac1f916d6d2edeb187e6619c8d23acd95eb21",
    "abstract": "Transformer has shown great successes in natural language processing, computer vision, and audio processing. As one of its core components, the softmax attention helps to capture long-range dependencies yet prohibits its scale-up due to the quadratic space and time complexity to the sequence length. Kernel methods are often adopted to reduce the complexity by approximating the softmax operator. Nevertheless, due to the approximation errors, their performances vary in different tasks/corpus and suffer crucial performance drops when compared with the vanilla softmax attention. In this paper, we propose a linear transformer called cosFormer that can achieve comparable or better accuracy to the vanilla transformer in both casual and cross attentions. cosFormer is based on two key properties of softmax attention: i). non-negativeness of the attention matrix; ii). a non-linear re-weighting scheme that can concentrate the distribution of the attention matrix. As its linear substitute, cosFormer fulfills these properties with a linear operator and a cosine-based distance re-weighting mechanism. Extensive experiments on language modeling and text understanding tasks demonstrate the effectiveness of our method. We further examine our method on long sequences and achieve state-of-the-art performance on the Long-Range Arena benchmark. The source code is available at https://github.com/OpenNLPLab/cosFormer.",
    "authors": [
        "Zhen Qin",
        "Weixuan Sun",
        "Huicai Deng",
        "Dongxu Li",
        "Yunshen Wei",
        "Baohong Lv",
        "Junjie Yan",
        "Lingpeng Kong",
        "Yiran Zhong"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A linear transformer called cosFormer is proposed that can achieve comparable or better accuracy to the vanilla transformer in both casual and cross attentions and is based on two key properties of softmax attention: non-negativeness of the attention matrix and a non-linear re-weighting scheme that can concentrate the distribution of the Attention matrix."
    },
    "citationCount": 154,
    "influentialCitationCount": 23,
    "code": null,
    "description": null,
    "url": null
}