{
    "acronym": "c49c1a348637ebc5ee52cf5e6d38980a189048ee",
    "title": "ComMU: Dataset for Combinatorial Music Generation",
    "seed_ids": [
        "transformerxl",
        "f9fff0d57ea37ec2a3a47bdbb8ced605e43f6b87",
        "f07c5c540233b22f0ca154c80c713e2aed3c9606",
        "fda805c6e85a03d10549acdc5489420ca8f3d405",
        "ce510c6cfeac703706460680e977c54554840830",
        "24a70db0bbb5f486126477e32a6a44ab917a4b11",
        "fb507ada871d1e8c29e376dbf7b7879689aa89f9"
    ],
    "s2id": "c49c1a348637ebc5ee52cf5e6d38980a189048ee",
    "abstract": "Commercial adoption of automatic music composition requires the capability of generating diverse and high-quality music suitable for the desired context (e.g., music for romantic movies, action games, restaurants, etc.). In this paper, we introduce combinatorial music generation, a new task to create varying background music based on given conditions. Combinatorial music generation creates short samples of music with rich musical metadata, and combines them to produce a complete music. In addition, we introduce ComMU, the first symbolic music dataset consisting of short music samples and their corresponding 12 musical metadata for combinatorial music generation. Notable properties of ComMU are that (1) dataset is manually constructed by professional composers with an objective guideline that induces regularity, and (2) it has 12 musical metadata that embraces composers' intentions. Our results show that we can generate diverse high-quality music only with metadata, and that our unique metadata such as track-role and extended chord quality improves the capacity of the automatic composition. We highly recommend watching our video before reading the paper (https://pozalabs.github.io/ComMU).",
    "authors": [
        "Lee Hyun",
        "Taehyun Kim",
        "Hyolim Kang",
        "Minjoo Ki",
        "H. Hwang",
        "Kwanho Park",
        "Sharang Han",
        "Seon Joo Kim"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results show that the new combinatorial music generation, a new task to create varying background music based on given conditions, can generate diverse high-quality music only with metadata, and that the unique metadata such as track-role and extended chord quality improves the capacity of the automatic composition."
    },
    "citationCount": 7,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}