{
    "acronym": "c4f8b1a4a540c0963d61188582e4d50a40f3b38d",
    "title": "Cross-Modal Adaptive Dual Association for Text-to-Image Person Retrieval",
    "seed_ids": [
        "bert"
    ],
    "s2id": "c4f8b1a4a540c0963d61188582e4d50a40f3b38d",
    "abstract": "Text-to-image person re-identification (ReID) aims to retrieve images of a person based on a given textual description. The key challenge is to learn the relations between detailed information from visual and textual modalities. Existing work focuses on learning a latent space to narrow the modality gap and further build local correspondences between two modalities. However, these methods assume that image-to-text and text-to-image associations are modality-agnostic, resulting in suboptimal associations. In this work, we demonstrate the discrepancy between image-to-text association and text-to-image association and proposecross-modal adaptive dual association (CADA) to build fine bidirectional image-text detailed associations. Our approach features a decoder-based adaptive dual association module that enables full interaction between visual and textual modalities, enabling bidirectional and adaptive cross-modal correspondence associations. Specifically, this paper proposes a bidirectional association mechanism: Association of text Tokens to image Patches (ATP) and Association of image Regions to text Attributes (ARA). We adaptively model the ATP based on the fact that aggregating cross-modal features based on mistaken associations will lead to feature distortion. For modeling the ARA, since attributes are typically the first distinguishing cues of a person, we explore attribute-level associations by predicting the masked text phrase using the related image region. Finally, we learn the dual associations between texts and images, and the experimental results demonstrate the superiority of our dual formulation.",
    "authors": [
        "Dixuan Lin",
        "Yi-Xing Peng",
        "Jingke Meng",
        "Wei-Shi Zheng"
    ],
    "venue": "IEEE transactions on multimedia",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work demonstrates the discrepancy between image-to-text association and text-to-image association and proposescross-modal adaptive dual association (CADA) to build fine bidirectional image-text detailed associations and demonstrates the superiority of this dual formulation."
    },
    "citationCount": 1,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}