{
    "acronym": "c4fb74b5f69e5c0f3822b82e1bd082d5d95fc8d0",
    "title": "Tractable Control for Autoregressive Language Generation",
    "seed_ids": [
        "gpt2",
        "12daedd80a4f860960c5b50314d09d6827f4fd4a",
        "b6c4a96e09b9f11e7c70e7f1fbe3f3971b92762d",
        "1f479fe113b0a4a5d6da08e0632395d3273fd3dd",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c4fb74b5f69e5c0f3822b82e1bd082d5d95fc8d0",
    "abstract": "Despite the success of autoregressive large language models in text generation, it remains a major challenge to generate text that satisfies complex constraints: sampling from the conditional distribution ${\\Pr}(\\text{text} | \\alpha)$ is intractable for even the simplest lexical constraints $\\alpha$. To overcome this challenge, we propose to use tractable probabilistic models (TPMs) to impose lexical constraints in autoregressive text generation models, which we refer to as GeLaTo (Generating Language with Tractable Constraints). To demonstrate the effectiveness of this framework, we use distilled hidden Markov models, where we can efficiently compute ${\\Pr}(\\text{text} | \\alpha)$, to guide autoregressive generation from GPT2. GeLaTo achieves state-of-the-art performance on challenging benchmarks for constrained text generation (e.g., CommonGen), beating various strong baselines by a large margin. Our work not only opens up new avenues for controlling large language models but also motivates the development of more expressive TPMs.",
    "authors": [
        "Honghua Zhang",
        "Meihua Dang",
        "Nanyun Peng",
        "Guy Van den Broeck"
    ],
    "venue": "International Conference on Machine Learning",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes to use tractable probabilistic models (TPMs) to impose lexical constraints in autoregressive text generation models, which is referred to as GeLaTo (Generating Language with Tractable Constraints)."
    },
    "citationCount": 17,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}