{
    "acronym": "c51192d7440807dc98cc4374fb5d919390d70b0b",
    "title": "OpenFold: Retraining AlphaFold2 yields new insights into its learning mechanisms and capacity for generalization",
    "seed_ids": [
        "flashattn",
        "6edccbd83a9aae204785d4821f97855677c33866",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "53c3940f35b8b45d55ed49056282e1961954513d"
    ],
    "s2id": "c51192d7440807dc98cc4374fb5d919390d70b0b",
    "abstract": "AlphaFold2 revolutionized structural biology with the ability to predict protein structures with exceptionally high accuracy. Its implementation, however, lacks the code and data required to train new models. These are necessary to (i) tackle new tasks, like protein-ligand complex structure prediction, (ii) investigate the process by which the model learns, which remains poorly understood, and (iii) assess the model’s generalization capacity to unseen regions of fold space. Here we report OpenFold, a fast, memory-efficient, and trainable implementation of AlphaFold2. We train OpenFold from scratch, fully matching the accuracy of AlphaFold2. Having established parity, we assess OpenFold’s capacity to generalize across fold space by retraining it using carefully designed datasets. We find that OpenFold is remarkably robust at generalizing despite extreme reductions in training set size and diversity, including near-complete elisions of classes of secondary structure elements. By analyzing intermediate structures produced by OpenFold during training, we also gain surprising insights into the manner in which the model learns to fold proteins, discovering that spatial dimensions are learned sequentially. Taken together, our studies demonstrate the power and utility of OpenFold, which we believe will prove to be a crucial new resource for the protein modeling community.",
    "authors": [
        "Gustaf Ahdritz",
        "N. Bouatta",
        "S. Kadyan",
        "Qinghui Xia",
        "William Gerecke",
        "Tim O’Donnell",
        "Daniel Berenberg",
        "Ian Fisk",
        "Niccoló Zanichelli",
        "Bo Zhang",
        "Arkadiusz Nowaczynski",
        "Bei Wang",
        "Marta M. Stepniewska-Dziubinska",
        "Shang Zhang",
        "Adegoke A. Ojewole",
        "Murat Efe Guney",
        "Stella Biderman",
        "A. Watkins",
        "Stephen Ra",
        "P. R. Lorenzo",
        "Lucas Nivon",
        "Brian D. Weitzner",
        "Y. Ban",
        "P. Sorger",
        "Emad Mostaque",
        "Zhao Zhang",
        "Richard Bonneau",
        "Mohammed Alquraishi"
    ],
    "venue": "bioRxiv",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "OpenFold is reported, a fast, memory-efficient, and trainable implementation of AlphaFold2 that is remarkably robust at generalizing despite extreme reductions in training set size and diversity, including near-complete elisions of classes of secondary structure elements."
    },
    "citationCount": 118,
    "influentialCitationCount": 8,
    "code": null,
    "description": null,
    "url": null
}