{
    "acronym": "c522009902ae5dbfb23db9ffac69da11d2cb778b",
    "title": "AISPACE at SemEval-2024 task 8: A Class-balanced Soft-voting System for Detecting Multi-generator Machine-generated Text",
    "seed_ids": [
        "bert",
        "6c761cfdb031701072582e434d8f64d436255da6",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "c522009902ae5dbfb23db9ffac69da11d2cb778b",
    "abstract": "SemEval-2024 Task 8 provides a challenge to detect human-written and machine-generated text. There are 3 subtasks for different detection scenarios. This paper proposes a system that mainly deals with Subtask B. It aims to detect if given full text is written by human or is generated by a specific Large Language Model (LLM), which is actually a multi-class text classification task. Our team AISPACE conducted a systematic study of fine-tuning transformer-based models, including encoder-only, decoder-only and encoder-decoder models. We compared their performance on this task and identified that encoder-only models performed exceptionally well. We also applied a weighted Cross Entropy loss function to address the issue of data imbalance of different class samples. Additionally, we employed soft-voting strategy over multi-models ensemble to enhance the reliability of our predictions. Our system ranked top 1 in Subtask B, which sets a state-of-the-art benchmark for this new challenge.",
    "authors": [
        "Renhua Gu",
        "Xiangfeng Meng"
    ],
    "venue": "International Workshop on Semantic Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a system that mainly deals with Subtask B of SemEval-2024 Task 8, which aims to detect if given full text is written by human or is generated by a specific Large Language Model, which is actually a multi-class text classification task."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}