{
    "acronym": "c523e7a3ed56acddde679f2fa5db9fc79d3b1243",
    "title": "LanguageFlow: Advancing Diffusion Language Generation with Probabilistic Flows",
    "seed_ids": [
        "gpt2",
        "diffusionlm",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "4a6a65968a8eb8c09ffb57a7774ddabb596565b1",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "b6c4a96e09b9f11e7c70e7f1fbe3f3971b92762d",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c523e7a3ed56acddde679f2fa5db9fc79d3b1243",
    "abstract": "Recent works have demonstrated success in controlling sentence attributes (e.g., sentiment) and structure (e.g., syntactic structure) based on the diffusion language model. A key component that drives theimpressive performance for generating high-quality samples from noise is iteratively denoise for thousands of steps. While beneficial, the complexity of starting from the noise and the learning steps has limited its implementation to many NLP real-world applications. This paper proposes Language Rectified Flow (LF).Our method is based on the reformulation of the standard probabilistic flow models.Language rectified flow learns (neural) ordinary differentialequation models to transport between the source distribution and the target distribution, henceproviding a unified and effective solution to generative modeling and domain transfer.From the source distribution, our language rectified flow yields fast simulation and effectively decreases the inference time. Experiments on three challenging fine-grained control tasks and multiple high-quality text editing show that our method consistently outperforms its baselines. Extensive experiments and ablation studies demonstrate that our method can be general, effective, and beneficial for many NLP tasks.",
    "authors": [
        "Shujian Zhang",
        "Lemeng Wu",
        "Chengyue Gong",
        "Xingchao Liu"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Language rectified flow learns (neural) ordinary differential differentialequation models to transport between the source distribution and the target distribution, hence providing a unified and effective solution to generative modeling and domain transfer."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}