{
    "acronym": "c570475cab4c8d0662144c4d414c17e776d39409",
    "title": "A Light Recipe to Train Robust Vision Transformers",
    "seed_ids": [
        "metaformer",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "c570475cab4c8d0662144c4d414c17e776d39409",
    "abstract": "In this paper, we ask whether Vision Transformers (ViTs) can serve as an underlying architecture for improving the adversarial robustness of machine learning models against evasion attacks. While earlier works have focused on improving Convolutional Neural Networks, we show that also ViTs are highly suitable for adversarial training to achieve competitive performance. We achieve this objective using a custom adversarial training recipe, discovered using rigorous ablation studies on a subset of the ImageNet dataset. The canonical training recipe for ViTs recommends strong data augmentation, in part to compensate for the lack of vision inductive bias of attention modules, when compared to convolutions. We show that this recipe achieves suboptimal performance when used for adversarial training. In contrast, we find that omitting all heavy data augmentation, and adding some additional bag-of-tricks $(\\varepsilon-\\mathbf{warmup}$ and larger weight decay), significantly boosts the performance of robust ViTs. We show that our recipe generalizes to different classes of ViT architectures and large-scale models on full ImageNet-1k. Additionally, investigating the reasons for the robustness of our models, we show that it is easier to generate strong attacks during training when using our recipe and that this leads to better robustness at test time. Finally, we further study one consequence of adversarial training by proposing a way to quantify the semantic nature of adversarial perturbations and highlight its correlation with the robustness of the model. Overall, we recommend that the community should avoid translating the canonical training recipes in ViTs to robust training and rethink common training choices in the context of adversarial training. We share the code for your experiments at the following URL: https://github.com/dedeswim/vits-robustness-torch.",
    "authors": [
        "Edoardo Debenedetti",
        "Vikash Sehwag",
        "Prateek Mittal"
    ],
    "venue": "2023 IEEE Conference on Secure and Trustworthy Machine Learning (SaTML)",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper shows that ViTs are highly suitable for adversarial training to achieve competitive performance, and proposes a way to quantify the semantic nature of adversarial perturbations and highlight its correlation with the robustness of the model."
    },
    "citationCount": 43,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}