{
    "acronym": "c5a0246bf3c977dce06d7c77d292c4ee6295dc05",
    "title": "LongSSM: On the Length Extension of State-space Models in Language Modelling",
    "seed_ids": [
        "s4",
        "mamba",
        "alibi",
        "d53fe76bd2795a19ddf52d012917782f6f6f2c1e",
        "62b18cc55dcc7ffe52c28e1086aee893b7bc4334",
        "9c5062743eaace5c1ff822bba819031f05cd3106",
        "a54761081c2b001c057fb6e1ea9a48058d5aa5e0",
        "5d8fec20573bc89ec72151277974919c85d8bdfd",
        "b3caabbae4b7c3b842086b21940ce9d5b25d476f",
        "240103933ffe3dac2179cc160a2bd91299357a53",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "9575afb5702bc33d7df14c48feeee5901ea00369",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "6f68e1bb253925d8431588555d3010419f322e04"
    ],
    "s2id": "c5a0246bf3c977dce06d7c77d292c4ee6295dc05",
    "abstract": "In this paper, we investigate the length-extension of state-space models (SSMs) in language modeling. Length extension involves training models on short sequences and testing them on longer ones. We show that state-space models trained with zero hidden states initialization have difficulty doing length extension. We explain this difficulty by pointing out the length extension is equivalent to polynomial extrapolation. Based on the theory, we propose a simple yet effective method - changing the hidden states initialization scheme - to improve the length extension. Moreover, our method shows that using long training sequence length is beneficial but not necessary to length extension. Changing the hidden state initialization enables the efficient training of long-memory model with a smaller training context length.",
    "authors": [
        "Shida Wang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a simple yet effective method - changing the hidden states initialization scheme - to improve the length extension of state-space models in language modeling and shows that using long training sequence length is beneficial but not necessary to length extension."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}