{
    "acronym": "c61065446ad3f2851b6553afeb5e6afc3fabdf94",
    "title": "OFA: A Framework of Initializing Unseen Subword Embeddings for Efficient Large-scale Multilingual Continued Pretraining",
    "seed_ids": [
        "bert",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "dec69765fc6c188897b09c8282d32db788e2c261",
        "65f788fb964901e3f1149a0a53317535ca85ed7d",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c61065446ad3f2851b6553afeb5e6afc3fabdf94",
    "abstract": "Instead of pretraining multilingual language models from scratch, a more efficient method is to adapt existing pretrained language models (PLMs) to new languages via vocabulary extension and continued pretraining. However, this method usually randomly initializes the embeddings of new subwords and introduces substantially more embedding parameters to the model, thus weakening the efficiency. To address these issues, we propose a novel framework: $\\textbf{O}$ne $\\textbf{F}$or $\\textbf{A}$ll ($\\textbf{OFA}$), which wisely initializes the embeddings of unseen subwords and thus can adapt a PLM to multiple languages efficiently and effectively. OFA takes advantage of external well-aligned multilingual static word vectors and injects the alignment knowledge into the subword embeddings. In addition, OFA applies matrix factorization and replaces the cumbersome embeddings with two lower-dimensional matrices, which largely reduces the number of parameters. We show OFA accelerates the convergence of continued pretraining, which is environmentally friendly as much fewer carbon footprints are generated. Through extensive experiments, we demonstrate OFA can achieve competitive or better performance than default continued pretraining baselines on a wide range of crosslingual downstream tasks. We make our code and models publicly available.",
    "authors": [
        "Yihong Liu",
        "Peiqin Lin",
        "Mingyang Wang",
        "Hinrich Schütze"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel framework, OFA, which wisely initializes the embeddings of unseen subwords and thus can adapt a PLM to multiple languages efficiently and effectively and accelerates the convergence of continued pretraining, which is environmentally friendly as much fewer carbon footprints are generated."
    },
    "citationCount": 11,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}