{
    "acronym": "c62321199fb07ce317921ff8832e9da1cee778af",
    "title": "Sparse-IFT: Sparse Iso-FLOP Transformations for Maximizing Training Efficiency",
    "seed_ids": [
        "gpt",
        "gpt2",
        "d1869155960e4b1b882b39171dbecd25a7eda3cd",
        "8326dba15f6b8ee6e43c23eea3265a05e59e8135",
        "5f895e84c1fea75de07b4f90da518273c2e57291",
        "ac591dbf261777e05d89c27f9a7bcb06f88aab5a",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "c62321199fb07ce317921ff8832e9da1cee778af",
    "abstract": "Recent research has focused on weight sparsity in deep neural network training to reduce FLOPs, aiming for improved efficiency (test accuracy w.r.t training FLOPs). However, sparse weight training often compromises accuracy, requiring extended training schedules to attain the accuracy of dense models. In contrast, our approach, Sparse Iso-FLOP Transformations (Sparse-IFT), uses sparsity to improve accuracy while maintaining dense model FLOPs. Using a single hyperparameter (i.e., the sparsity level), Sparse-IFTs efficiently replace dense layers, expanding the search space for optimal sparse masks. In addition, dynamic sparse training (DST) with Sparse-IFT models effectively navigate this larger sparse mask-weight space, which is evidenced by a spectral analysis using Ramanujan graph properties. Our study reveals a robust correlation among mask topology, weights, and final performance. Notably, without adjusting any training hyperparameters, replacing dense layers with Sparse-IFT yields significant improvements, such as a +3.5% boost for ResNet-18 on ImageNet and +0.9% for GPT-3 Small on the Open LLM leaderboard. To the best of our knowledge, this is the first work to demonstrate the use of sparsity for improving the accuracy of dense models through a set of simple-to-use sparse transformations. Code is available at: https://github.com/CerebrasResearch/Sparse-IFT.",
    "authors": [
        "Vithursan Thangarasa",
        "S. Saxena",
        "Abhay Gupta",
        "Sean Lie"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This is the first work to demonstrate the use of sparsity for improving the accuracy of dense models through a set of simple-to-use sparse transformations, and reveals a robust correlation among mask topology, weights, and final performance."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}