{
    "acronym": "c67843e9ccb8221abb5d2feecc4f3ce2708e9cf2",
    "title": "Swiss-Judgment-Prediction: A Multilingual Legal Judgment Prediction Benchmark",
    "seed_ids": [
        "neurallegal",
        "fd33e77884e69f6bc099990fc2790248af2749d9",
        "29584ed6d68a06fdf91440a018f6bc83a44fd177",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "c67843e9ccb8221abb5d2feecc4f3ce2708e9cf2",
    "abstract": "In many jurisdictions, the excessive workload of courts leads to high delays. Suitable predictive AI models can assist legal professionals in their work, and thus enhance and speed up the process. So far, Legal Judgment Prediction (LJP) datasets have been released in English, French, and Chinese. We publicly release a multilingual (German, French, and Italian), diachronic (2000-2020) corpus of 85K cases from the Federal Supreme Court of Switzer- land (FSCS). We evaluate state-of-the-art BERT-based methods including two variants of BERT that overcome the BERT input (text) length limitation (up to 512 tokens). Hierarchical BERT has the best performance (approx. 68-70% Macro-F1-Score in German and French). Furthermore, we study how several factors (canton of origin, year of publication, text length, legal area) affect performance. We release both the benchmark dataset and our code to accelerate future research and ensure reproducibility.",
    "authors": [
        "Joel Niklaus",
        "Ilias Chalkidis",
        "Matthias Sturmer"
    ],
    "venue": "NLLP",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work publicly releases a multilingual (German, French, and Italian), diachronic corpus of 85K cases from the Federal Supreme Court of Switzer- land (FSCS), and evaluates state-of-the-art BERT-based methods including two variants of BERT that overcome the BERT input (text) length limitation."
    },
    "citationCount": 49,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}