{
    "acronym": "c7879caf6538fc087678244d45d2ba15cd1a2482",
    "title": "Graph Structure Prompt Learning: A Novel Methodology to Improve Performance of Graph Neural Networks",
    "seed_ids": [
        "bert",
        "277dd73bfeb5c46513ce305136b0e71fcd2a311c"
    ],
    "s2id": "c7879caf6538fc087678244d45d2ba15cd1a2482",
    "abstract": "Graph neural networks (GNNs) are widely applied in graph data modeling. However, existing GNNs are often trained in a task-driven manner that fails to fully capture the intrinsic nature of the graph structure, resulting in sub-optimal node and graph representations. To address this limitation, we propose a novel Graph structure Prompt Learning method (GPL) to enhance the training of GNNs, which is inspired by prompt mechanisms in natural language processing. GPL employs task-independent graph structure losses to encourage GNNs to learn intrinsic graph characteristics while simultaneously solving downstream tasks, producing higher-quality node and graph representations. In extensive experiments on eleven real-world datasets, after being trained by GPL, GNNs significantly outperform their original performance on node classification, graph classification, and edge prediction tasks (up to 10.28%, 16.5%, and 24.15%, respectively). By allowing GNNs to capture the inherent structural prompts of graphs in GPL, they can alleviate the issue of over-smooth and achieve new state-of-the-art performances, which introduces a novel and effective direction for GNN research with potential applications in various domains.",
    "authors": [
        "Zhenhua Huang",
        "Kunhao Li",
        "Shaojie Wang",
        "Zhaohong Jia",
        "Wentao Zhu",
        "Sharad Mehrotra"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "By allowing GNNs to capture the inherent structural prompts of graphs in GPL, they can alleviate the issue of over-smooth and achieve new state-of-the-art performances, which introduces a novel and effective direction for GNN research with potential applications in various domains."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}