{
    "acronym": "c7c6d338e47b236edea76790d2997333f497319e",
    "title": "TaleBrush: Sketching Stories with Generative Pretrained Language Models",
    "seed_ids": [
        "gpt2",
        "e7c698bdace380f7183dedbe657686f1885f615c",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c7c6d338e47b236edea76790d2997333f497319e",
    "abstract": "While advanced text generation algorithms (e.g., GPT-3) have enabled writers to co-create stories with an AI, guiding the narrative remains a challenge. Existing systems often leverage simple turn-taking between the writer and the AI in story development. However, writers remain unsupported in intuitively understanding the AI’s actions or steering the iterative generation. We introduce TaleBrush, a generative story ideation tool that uses line sketching interactions with a GPT-based language model for control and sensemaking of a protagonist’s fortune in co-created stories. Our empirical evaluation found our pipeline reliably controls story generation while maintaining the novelty of generated sentences. In a user study with 14 participants with diverse writing experiences, we found participants successfully leveraged sketching to iteratively explore and write stories according to their intentions about the character’s fortune while taking inspiration from generated stories. We conclude with a reflection on how sketching interactions can facilitate the iterative human-AI co-creation process.",
    "authors": [
        "John Joon Young Chung",
        "Wooseok Kim",
        "Kang Min Yoo",
        "Hwaran Lee",
        "Eytan Adar",
        "Minsuk Chang"
    ],
    "venue": "International Conference on Human Factors in Computing Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "TaleBrush is introduced, a generative story ideation tool that uses line sketching interactions with a GPT-based language model for control and sensemaking of a protagonist’s fortune in co-created stories and a reflection on how Sketching interactions can facilitate the iterative human-AI co-creation process."
    },
    "citationCount": 116,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}