{
    "acronym": "c7fc4c09a18bf0c26d04fc69f5567bfd3ac0c8f6",
    "title": "Cross-Model Comparative Loss for Enhancing Neuronal Utility in Language Understanding",
    "seed_ids": [
        "longformer",
        "6702d9ef324f5e7fd8e24163399a820dd3fcc929",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f55794bdbf7c99144353b94da58c60f48f7d91e9",
        "95ecc81c2b3ef1cb7ba4028fe2a8f2e04b6f397b"
    ],
    "s2id": "c7fc4c09a18bf0c26d04fc69f5567bfd3ac0c8f6",
    "abstract": "Current natural language understanding (NLU) models have been continuously scaling up, both in terms of model size and input context, introducing more hidden and input neurons. While this generally improves performance on average, the extra neurons do not yield a consistent improvement for all instances. This is because some hidden neurons are redundant, and the noise mixed in input neurons tends to distract the model. Previous work mainly focuses on extrinsically reducing low-utility neurons by additional post- or pre-processing, such as network pruning and context selection, to avoid this problem. Beyond that, can we make the model reduce redundant parameters and suppress input noise by intrinsically enhancing the utility of each neuron? If a model can efficiently utilize neurons, no matter which neurons are ablated (disabled), the ablated submodel should perform no better than the original full model. Based on such a comparison principle between models, we propose a cross-model comparative loss for a broad range of tasks. Comparative loss is essentially a ranking loss on top of the task-specific losses of the full and ablated models, with the expectation that the task-specific loss of the full model is minimal. We demonstrate the universal effectiveness of comparative loss through extensive experiments on 14 datasets from three distinct NLU tasks based on five widely used pre-trained language models and find it particularly superior for models with few parameters or long input.",
    "authors": [
        "Yunchang Zhu",
        "Liang Pang",
        "Kangxi Wu",
        "Yanyan Lan",
        "Huawei Shen",
        "Xueqi Cheng"
    ],
    "venue": "ACM Trans. Inf. Syst.",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The universal effectiveness of comparative loss is demonstrated through extensive experiments on 14 datasets from three distinct NLU tasks based on five widely used pre-trained language models and find it particularly superior for models with few parameters or long input."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}