{
    "acronym": "c8567b3a1fb12babb43e6dcc182a063d7996eb95",
    "title": "G-SAP: Graph-based Structure-Aware Prompt Learning over Heterogeneous Knowledge for Commonsense Reasoning",
    "seed_ids": [
        "bert",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "710d183174844da5b7f392667f3cc25d2b098dde",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47"
    ],
    "s2id": "c8567b3a1fb12babb43e6dcc182a063d7996eb95",
    "abstract": "Commonsense question answering has demonstrated considerable potential across various applications like assistants and social robots. Although fully fine-tuned Pre-trained Language Model(PLM) has achieved remarkable performance in commonsense reasoning, their tendency to excessively prioritize textual information hampers the precise transfer of structural knowledge and undermines interpretability. Some studies have explored combining Language Models (LM) with Knowledge Graphs (KGs) by coarsely fusing the two modalities to perform Graph Neural Network (GNN)-based reasoning that lacks a profound interaction between heterogeneous modalities. In this paper, we propose a novel \\underlineG raph-based \\underlineS tructure-\\underlineA ware \\underlineP rompt Learning Model for commonsense reasoning, named G-SAP, aiming to maintain a balance between heterogeneous knowledge and enhance the cross-modal interaction within the LM+GNNs model. In particular, an evidence graph is constructed by integrating multiple knowledge sources, i.e. ConceptNet, Wikipedia, and Cambridge Dictionary to boost the performance. Afterward, a structure-aware frozen PLM is employed to fully incorporate the structured and textual information from the evidence graph, where the generation of prompts is driven by graph entities and relations. Finally, a heterogeneous message-passing reasoning module is used to facilitate deep interaction of knowledge between the LM and graph-based networks. Empirical validation, conducted through extensive experiments on three benchmark datasets, demonstrates the notable performance of the proposed model. The results reveal a significant advancement over the existing models, especially, with 6.12% improvement over the SoTA LM+GNNs model ~\\citehuang2023mvp on the OpenbookQA dataset.",
    "authors": [
        "Ruiting Dai",
        "Yuqiao Tan",
        "Lisi Mo",
        "Shuang Liang",
        "Guohao Huo",
        "Jiayi Luo",
        "Yao Cheng"
    ],
    "venue": "International Conference on Multimedia Retrieval",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel G-SAP is proposed aiming to maintain a balance between heterogeneous knowledge and enhance the cross-modal interaction within the LM+GNNs model, aiming to maintain a balance between heterogeneous knowledge and enhance the cross-modal interaction within the LM+GNNs model."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}