{
    "acronym": "c85bb5fba72f85b852a455e70d569a301367f21d",
    "title": "SNVformer: An Attention-based Deep Neural Network for GWAS Data",
    "seed_ids": [
        "linformer",
        "aaedb51c8bfdc2517aec2eff796204b7a7c6d120",
        "0e802c0739771acf70e60d59c2df51cd7e8c50c0",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77"
    ],
    "s2id": "c85bb5fba72f85b852a455e70d569a301367f21d",
    "abstract": "Despite being the widely-used gold standard for linking common genetic variations to phenotypes and disease, genome-wide association studies (GWAS) suffer major limitations, partially attributable to the reliance on simple, typically linear, models of genetic effects. More elaborate methods, such as epistasis-aware models, typically struggle with the scale of GWAS data. In this paper, we build on recent advances in neural networks employing Transformer-based architectures to enable such models at a large scale. As a first step towards replacing linear GWAS with a more expressive approximation, we demonstrate prediction of gout, a painful form of inflammatory arthritis arising when monosodium urate crystals form in the joints under high serum urate conditions, from Single Nucleotide Variants (SNVs) using a scalable (long input) variant of the Transformer architecture. Furthermore, we show that sparse SNVs can be efficiently used by these Transformer-based networks without expanding them to a full genome. By appropriately encoding SNVs, we are able to achieve competitive initial performance, with an AUROC of 83% when classifying a balanced test set using genotype and demographic information. Moreover, the confidence with which the network makes its prediction is a good indication of the prediction accuracy. Our results indicate a number of opportunities for extension, enabling full genome-scale data analysis using more complex and accurate genotype-phenotype association models.",
    "authors": [
        "Kieran Elmes",
        "Diana Benavides-Prado",
        "N. Tan",
        "T. Nguyen",
        "N. Sumpter",
        "M. Leask",
        "Michael Witbrock",
        "A. Gavryushkin"
    ],
    "venue": "bioRxiv",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper demonstrates prediction of gout, a painful form of inflammatory arthritis arising when monosodium urate crystals form in the joints under high serum urate conditions, from Single Nucleotide Variants (SNVs) using a scalable variant of the Transformer architecture, and shows that sparse SNVs can be efficiently used by these Transformer-based networks without expanding them to a full genome."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}