{
    "acronym": "c8f2b173e02a5ec7036a878f70b5c483a5c6b75d",
    "title": "PSparseFormer: Enhancing Fault Feature Extraction Based on Parallel Sparse Self-Attention and Multiscale Broadcast Feedforward Block",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "c8f2b173e02a5ec7036a878f70b5c483a5c6b75d",
    "abstract": "Currently, various state-of-the-art Transformer variants have gained widespread attention in the field of fault diagnosis. However, these Transformers often adopt a global sequence modeling strategy to extract fault features, which is susceptible to the interference of redundant information and strong noise, due to the local and sparse nature of vibration signals. Therefore, a new feature enhancement and end-to-end fault diagnosis model named PSparseFormer is proposed in this article. First, a parallel sparse self-attention module is designed to efficiently extract the local and sparse features at different locations of complex vibration signals to reduce the oversensitivity to irrelevant information. Second, the multiscale broadcast feedforward block is developed to simultaneously facilitate global and local spatial feature information transmission and adjust the contribution of features at different levels, enhancing the robustness of local feature extraction against noise. Experimental analysis using data sets from two planetary gearboxes illustrates the effectiveness of the proposed method in addressing challenges related to feature extraction and enhancement, particularly in the presence of strong noise interference. Comparative evaluations against various state-of-the-art Transformers reveal that the proposed method exhibits superior diagnostic performance.",
    "authors": [
        "Jie Wang",
        "Haidong Shao",
        "Ying Peng",
        "Bin Liu"
    ],
    "venue": "IEEE Internet of Things Journal",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Comparative evaluations against various state-of-the-art Transformers reveal that the proposed method exhibits superior diagnostic performance, and the effectiveness of the proposed method in addressing challenges related to feature extraction and enhancement, particularly in the presence of strong noise interference."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}