{
    "acronym": "c90fe514cd532f84b1b6a34965a17cd866037716",
    "title": "Layer-Wise Neural Network Compression via Layer Fusion",
    "seed_ids": [
        "gpt",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "c90fe514cd532f84b1b6a34965a17cd866037716",
    "abstract": "This paper proposes layer fusion - a model compression technique that discovers which weights to combine and then fuses weights of similar fully-connected, convolutional and attention layers. Layer fusion can signiﬁcantly reduce the number of layers of the original network with little additional computation overhead, while maintaining competitive performance. From experiments on CIFAR-10, we ﬁnd that various deep convolution neural networks can remain within 2% accuracy points of the original networks up to a compression ratio of 3.33 when iteratively retrained with layer fusion. For experiments on the WikiText-2 language modelling dataset, we compress Transformer models to 20% of their original size while being within 5 perplexity points of the original network. We also ﬁnd that other well-established compression techniques can achieve competitive performance when compared to their original networks given a sufﬁcient number of retraining steps. Generally, we observe a clear inﬂection point in performance as the amount of compression increases, suggesting a bound on the amount of compression that can be achieved before an exponential degradation in performance.",
    "authors": [
        "James O'Neill",
        "G. V. Steeg",
        "A. Galstyan"
    ],
    "venue": "Asian Conference on Machine Learning",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A bound on the amount of compression that can be achieved before an exponential degradation in performance is suggested, suggesting a clear inﬂection point in performance as the amount of compression increases."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}