{
    "acronym": "c957c50ead898bd76944a554f0bf02bdf59c67e5",
    "title": "ShellGPT: Generative Pre-trained Transformer Model for Shell Language Understanding",
    "seed_ids": [
        "gpt2",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "4b27f18bff43d605805c92696a979714ced0b805",
        "0646bb09db4d1ba24150e69b71edcd4aff691b3c",
        "28307bc149a74cfcae657f782f1c7630b6f4acce",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "c957c50ead898bd76944a554f0bf02bdf59c67e5",
    "abstract": "This paper presents ShellGPT, a pre-trained language model specifically designed to enhance the understanding of shell language which plays a crucial role in IT operations. Based on the GPT series of models, ShellGPT is trained on a corpus that aligns shell language with natural language, aiming to inject domain-specific knowledge into the model. The technique of pre-tokenization is employed to maximize the reuse of a general-purpose vocabulary, facilitating effective model transfer from general domain. Furthermore, a new pre-training objective, named equivalent command learning, is proposed to refine the command representations through modeling function equivalence of commands. To evaluate the performance of ShellGPT, we conduct fine-tuning on various downstream tasks related to shell language understanding. These tasks include command recommendation, command correction, and translation from natural language to shell command. Our experimental results demonstrate that ShellGPT outperforms other baseline models in terms of performance across almost all evaluated tasks. The findings from our experiments highlight the effectiveness of Shell-GPT in enhancing shell language understanding and demonstrate its potential for practical applications in IT operations.",
    "authors": [
        "Jie Shi",
        "Sihang Jiang",
        "Bo Xu",
        "Jiaqing Liang",
        "Yanghua Xiao",
        "Wei Wang"
    ],
    "venue": "IEEE International Symposium on Software Reliability Engineering",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "ShellGPT is a pre-trained language model specifically designed to enhance the understanding of shell language which plays a crucial role in IT operations and outperforms other baseline models in terms of performance across almost all evaluated tasks."
    },
    "citationCount": 3,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}