{
    "acronym": "c96b17f3362c2d795964d07427a9396a09db6b2c",
    "title": "Analysing The Impact of Sequence Composition on Language Model Pre-Training",
    "seed_ids": [
        "gpt3",
        "11cf88dce827bd67cbfa60400306318022e736d5",
        "b069c32fcd77160f944ab3ba71ab6f0cfb782c68",
        "d203c764fb5dec2b053be667c8b06e516ea6ef10",
        "3fb0731538c59f8520a309996a0567b58965f0fe",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a"
    ],
    "s2id": "c96b17f3362c2d795964d07427a9396a09db6b2c",
    "abstract": "Most language model pre-training frameworks concatenate multiple documents into fixed-length sequences and use causal masking to compute the likelihood of each token given its context; this strategy is widely adopted due to its simplicity and efficiency. However, to this day, the influence of the pre-training sequence composition strategy on the generalisation properties of the model remains under-explored. In this work, we find that applying causal masking can lead to the inclusion of distracting information from previous documents during pre-training, which negatively impacts the performance of the models on language modelling and downstream tasks. In intra-document causal masking, the likelihood of each token is only conditioned on the previous tokens in the same document, eliminating potential distracting information from previous documents and significantly improving performance. Furthermore, we find that concatenating related documents can reduce some potential distractions during pre-training, and our proposed efficient retrieval-based sequence construction method, BM25Chunk, can improve in-context learning (+11.6\\%), knowledge memorisation (+9.8\\%), and context utilisation (+7.2\\%) abilities of language models without sacrificing efficiency.",
    "authors": [
        "Yu Zhao",
        "Yuanbin Qu",
        "Konrad Staniszewski",
        "Szymon Tworkowski",
        "Wei Liu",
        "Piotr Milo's",
        "Yuxiang Wu",
        "Pasquale Minervini"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work finds that applying causal masking can lead to the inclusion of distracting information from previous documents during pre-training, which negatively impacts the performance of the models on language modelling and downstream tasks, and proposes a method that can improve in-context learning, knowledge memorisation, and context utilisation abilities of language models without sacrificing efficiency."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}