{
    "acronym": "c97980a741b78bf4b28a6cad3eb54ef71b79e0f2",
    "title": "Performance Evaluation of Sequence Model Architectures for Load Forecasting: A Comparative Study",
    "seed_ids": [
        "transformer",
        "9932a6b10f6c40232a5d0eeb47bf2f579c124c85",
        "35a9749df07a2ab97c51af4d260b095b00da7676"
    ],
    "s2id": "c97980a741b78bf4b28a6cad3eb54ef71b79e0f2",
    "abstract": "In this study, the performance of five state-of-the-art sequence model architectures in load forecasting is investigated: LSTMs, LSTM with attention, sequence-to-sequence, transformers, and informer. The authors make two contributions to improve the performance of these models: a more sophisticated input embedding for the future unknown variables and the use of a different encoder for historical load inputs and weather data. The research evaluates these models using real-world data from the Hellenic interconnected power system, considering the complexities of long-range temporal dependencies and the lack of measurements. Results show the effectiveness of the RNN embedding layer in improving forecasting accuracy, with the Informer model outperforming others due to its unique attention mechanism and dilated convolutional layers. The paper highlights the significance of these models for practical load forecasting applications and provides insights into their performance for both short-term and day-ahead scenarios.",
    "authors": [
        "G. Sideratos",
        "A. Dimeas",
        "N. Hatziargyriou"
    ],
    "venue": "2024 International Workshop on Artificial Intelligence and Machine Learning for Energy Transformation (AIE)",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Results show the effectiveness of the RNN embedding layer in improving forecasting accuracy, with the Informer model outperforming others due to its unique attention mechanism and dilated convolutional layers."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}