{
    "acronym": "c9ff9fbbe21985b35d6a070b67f22a0e065c4328",
    "title": "JetMoE: Reaching Llama2 Performance with 0.1M Dollars",
    "seed_ids": [
        "roformer",
        "b46d05bcf42295b872f3cebf875643d2e66496a4",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "43014fc85c4860487336579ec98f509fec1803f7",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "0bd2602df71e89c8961562175c8759e625e99389",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "c9ff9fbbe21985b35d6a070b67f22a0e065c4328",
    "abstract": "Large Language Models (LLMs) have achieved remarkable results, but their increasing resource demand has become a major obstacle to the development of powerful and accessible super-human intelligence. This report introduces JetMoE-8B, a new LLM trained with less than $0.1 million, using 1.25T tokens from carefully mixed open-source corpora and 30,000 H100 GPU hours. Despite its low cost, the JetMoE-8B demonstrates impressive performance, with JetMoE-8B outperforming the Llama2-7B model and JetMoE-8B-Chat surpassing the Llama2-13B-Chat model. These results suggest that LLM training can be much more cost-effective than generally thought. JetMoE-8B is based on an efficient Sparsely-gated Mixture-of-Experts (SMoE) architecture, composed of attention and feedforward experts. Both layers are sparsely activated, allowing JetMoE-8B to have 8B parameters while only activating 2B for each input token, reducing inference computation by about 70% compared to Llama2-7B. Moreover, JetMoE-8B is highly open and academia-friendly, using only public datasets and training code. All training parameters and data mixtures have been detailed in this report to facilitate future efforts in the development of open foundation models. This transparency aims to encourage collaboration and further advancements in the field of accessible and efficient LLMs. The model weights are publicly available at https://github.com/myshell-ai/JetMoE.",
    "authors": [
        "Yikang Shen",
        "Zhen Guo",
        "Tianle Cai",
        "Zengyi Qin"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "JetMoE-8B demonstrates impressive performance, with JetMoE-8B outperforming the Llama2-7B model and JetMoE-8B-Chat surpassing the Llama2-13B-Chat model, suggesting that LLM training can be much more cost-effective than generally thought."
    },
    "citationCount": 9,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}