{
    "acronym": "ca04700240c273a4ca237607ef5a1cbf9163fa16",
    "title": "Simplicial Hopfield networks",
    "seed_ids": [
        "hopfield",
        "562bf6d0aac2c6362086ef4c80503de8ea56b340"
    ],
    "s2id": "ca04700240c273a4ca237607ef5a1cbf9163fa16",
    "abstract": "Hopfield networks are artificial neural networks which store memory patterns on the states of their neurons by choosing recurrent connection weights and update rules such that the energy landscape of the network forms attractors around the memories. How many stable, sufficiently-attracting memory patterns can we store in such a network using $N$ neurons? The answer depends on the choice of weights and update rule. Inspired by setwise connectivity in biology, we extend Hopfield networks by adding setwise connections and embedding these connections in a simplicial complex. Simplicial complexes are higher dimensional analogues of graphs which naturally represent collections of pairwise and setwise relationships. We show that our simplicial Hopfield networks increase memory storage capacity. Surprisingly, even when connections are limited to a small random subset of equivalent size to an all-pairwise network, our networks still outperform their pairwise counterparts. Such scenarios include non-trivial simplicial topology. We also test analogous modern continuous Hopfield networks, offering a potentially promising avenue for improving the attention mechanism in Transformer models.",
    "authors": [
        "Thomas F Burns",
        "T. Fukai"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Surprisingly, even when connections are limited to a small random subset of equivalent size to an all-pairwise network, these networks still outperform their pairwise counterparts."
    },
    "citationCount": 10,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}