{
    "acronym": "ca36408d797191f09e371ffaa2baee484d89ff8f",
    "title": "OmniGenome: Aligning RNA Sequences with Secondary Structures in Genomic Foundation Models",
    "seed_ids": [
        "bert",
        "7d281e18a7416dfd5e67809c21663244426f6554",
        "7c65c43c6b6052282e22d7a57458e959ceed3a5a",
        "bfd2b76998a0521c12903ef5ced517adf70ad2ba",
        "0f4780f3f42dbe9755d54495ae17244cc88a7483",
        "9e16d8cc6096ec0d2733a4ecf41ce09d9a4bd19c",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4"
    ],
    "s2id": "ca36408d797191f09e371ffaa2baee484d89ff8f",
    "abstract": "The structures of RNA sequences play a vital role in various cellular processes, while existing genomic foundation models (FMs) have struggled with precise sequence-structure alignment, due to the complexity of exponential combinations of nucleotide bases. In this study, we introduce OmniGenome, a foundation model that addresses this critical challenge of sequence-structure alignment in RNA FMs. OmniGenome bridges the sequences with secondary structures using structure-contextualized modeling, enabling hard in-silico genomic tasks that existing FMs cannot handle, e.g., RNA design tasks. The results on two comprehensive genomic benchmarks show that OmniGenome achieves state-of-the-art performance on complex RNA subtasks. For example, OmniGenome solved 74% of complex puzzles, compared to SpliceBERT which solved only 3% of the puzzles. Besides, OmniGenome solves most of the puzzles within $1$ hour, while the existing methods usually allocate $24$ hours for each puzzle. Overall, OmniGenome establishes wide genomic application cases and offers profound insights into biological mechanisms from the perspective of sequence-structure alignment.",
    "authors": [
        "Heng Yang",
        "Ke Li"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study introduces OmniGenome, a foundation model that addresses this critical challenge of sequence-structure alignment in RNA FMs, enabling hard in-silico genomic tasks that existing FMs cannot handle, e.g., RNA design tasks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}