{
    "acronym": "ca8690f322fb4bbf452d54e8799f46bc6a2e9cc4",
    "title": "Towards Supporting Legal Argumentation with NLP: Is More Data Really All You Need?",
    "seed_ids": [
        "neurallegal",
        "1c8840fc74ed2fa44b5995d6879ef10cf62101c4",
        "80cee5037d01470edc7fbd20c564f2e1fc2c6b85",
        "ff28f812113a7082f7d285ed3bf6dcbed49d0320",
        "0476fe2b42398f3482946fff2d5392e22662a248",
        "fd33e77884e69f6bc099990fc2790248af2749d9",
        "c67843e9ccb8221abb5d2feecc4f3ce2708e9cf2",
        "0f655ded8a5e0a1e3770f59b9eadb7f68065f7d7",
        "61a5ae33fc34efcdbc710004554ec57e607ce75e",
        "1e3e65e7773b7869d9bd7f5394b54199e48195e6",
        "29584ed6d68a06fdf91440a018f6bc83a44fd177",
        "b97f6c541e06e0200e53bb4361818af975a36336",
        "95b4ed2e757189ff02c7840d0dc04c1bc3c88f5c",
        "7c1b18b5075bd779813c3a30dae3aeb99fdd802e"
    ],
    "s2id": "ca8690f322fb4bbf452d54e8799f46bc6a2e9cc4",
    "abstract": "Modeling legal reasoning and argumentation justifying decisions in cases has always been central to AI&Law, yet contemporary developments in legal NLP have increasingly focused on statistically classifying legal conclusions from text. While conceptually simpler, these approaches often fall short in providing usable justifications connecting to appropriate legal concepts. This paper reviews both traditional symbolic works in AI&Law and recent advances in legal NLP, and distills possibilities of integrating expert-informed knowledge to strike a balance between scalability and explanation in symbolic vs. data-driven approaches. We identify open challenges and discuss the potential of modern NLP models and methods that integrate",
    "authors": [
        "Santosh T.Y.S.S",
        "Kevin D. Ashley",
        "Katie Atkinson",
        "Matthias Grabmair"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Reviews both traditional symbolic works in AI&Law and recent advances in legal NLP, and distills possibilities of integrating expert-informed knowledge to strike a balance between scalability and explanation in symbolic vs. data-driven approaches."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}