{
    "acronym": "cae07d4d7552cd67a495de1c6c26eec0d2802f09",
    "title": "Better Document-Level Machine Translation with Bayes’ Rule",
    "seed_ids": [
        "transformerxl",
        "a7a3b46cdc90609810899975892787a9ae6a4f34",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "cae07d4d7552cd67a495de1c6c26eec0d2802f09",
    "abstract": "Abstract We show that Bayes’ rule provides an effective mechanism for creating document translation models that can be learned from only parallel sentences and monolingual documents a compelling benefit because parallel documents are not always available. In our formulation, the posterior probability of a candidate translation is the product of the unconditional (prior) probability of the candidate output document and the “reverse translation probability” of translating the candidate output back into the source language. Our proposed model uses a powerful autoregressive language model as the prior on target language documents, but it assumes that each sentence is translated independently from the target to the source language. Crucially, at test time, when a source document is observed, the document language model prior induces dependencies between the translations of the source sentences in the posterior. The model’s independence assumption not only enables efficient use of available data, but it additionally admits a practical left-to-right beam-search algorithm for carrying out inference. Experiments show that our model benefits from using cross-sentence context in the language model, and it outperforms existing document translation approaches.",
    "authors": [
        "Lei Yu",
        "Laurent Sartran",
        "Wojciech Stokowiec",
        "Wang Ling",
        "Lingpeng Kong",
        "Phil Blunsom",
        "Chris Dyer"
    ],
    "venue": "Transactions of the Association for Computational Linguistics",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that Bayes’ rule provides an effective mechanism for creating document translation models that can be learned from only parallel sentences and monolingual documents a compelling benefit because parallel documents are not always available."
    },
    "citationCount": 42,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}