{
    "acronym": "cb0ac335adda4ceef9987cbcbca9129e71c37f0a",
    "title": "Laughing Hyena Distillery: Extracting Compact Recurrences From Convolutions",
    "seed_ids": [
        "hyena",
        "resurrectrnn",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "a7d68b1702af08ce4dbbf2cd0b083e744ae5c6be",
        "f393aff1593c2d370ec0ae004910d18e40524967",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "54155c2977a977bf129849455dcae3a2b79b3f41",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "1d5c8c6e5a774d2fef8d92bd28670a6345a97f7a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "cb0ac335adda4ceef9987cbcbca9129e71c37f0a",
    "abstract": "Recent advances in attention-free sequence models rely on convolutions as alternatives to the attention operator at the core of Transformers. In particular, long convolution sequence models have achieved state-of-the-art performance in many domains, but incur a significant cost during auto-regressive inference workloads -- naively requiring a full pass (or caching of activations) over the input sequence for each generated token -- similarly to attention-based models. In this paper, we seek to enable $\\mathcal O(1)$ compute and memory cost per token in any pre-trained long convolution architecture to reduce memory footprint and increase throughput during generation. Concretely, our methods consist in extracting low-dimensional linear state-space models from each convolution layer, building upon rational interpolation and model-order reduction techniques. We further introduce architectural improvements to convolution-based layers such as Hyena: by weight-tying the filters across channels into heads, we achieve higher pre-training quality and reduce the number of filters to be distilled. The resulting model achieves 10x higher throughput than Transformers and 1.5x higher than Hyena at 1.3B parameters, without any loss in quality after distillation.",
    "authors": [
        "Stefano Massaroli",
        "Michael Poli",
        "Daniel Y. Fu",
        "Hermann Kumbong",
        "Rom N. Parnichkun",
        "Aman Timalsina",
        "David W. Romero",
        "Quinn McIntyre",
        "Beidi Chen",
        "A. Rudra",
        "Ce Zhang",
        "Christopher Ré",
        "Stefano Ermon",
        "Y. Bengio"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper seeks to enable compute and memory cost per token in any pre-trained long convolution architecture to reduce memory footprint and increase throughput during generation, and introduces architectural improvements to convolution-based layers such as Hyena."
    },
    "citationCount": 10,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}