{
    "acronym": "cb15472f8041a122fac2d0004d34596990719a33",
    "title": "Unveiling and Controlling Anomalous Attention Distribution in Transformers",
    "seed_ids": [
        "streamingllm",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "6edccbd83a9aae204785d4821f97855677c33866",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "f6390beca54411b06f3bde424fb983a451789733",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "cb15472f8041a122fac2d0004d34596990719a33",
    "abstract": "With the advent of large models based on the Transformer architecture, researchers have observed an anomalous phenomenon in the Attention mechanism--there is a very high attention on the first element, which is prevalent across Transformer-based models. It is crucial to understand it for the development of techniques focusing on attention distribution, such as Key-Value (KV) Cache compression and infinite extrapolation; however, the latent cause leaves to be unknown. In this paper, we analyze such a phenomenon from the perspective of waiver phenomenon, which involves reducing the internal values of certain elements in the sequence, allowing them to absorb excess attention without affecting their contribution to information. In specific models, due to differences in positional encoding and attention patterns, we have found that the selection of waiver elements by the model can be categorized into two methods: positional-encoding-based and feature-distribution-within-elements-based.",
    "authors": [
        "Ruiqing Yan",
        "Xingbo Du",
        "Haoyu Deng",
        "Linghan Zheng",
        "Qiuzhuang Sun",
        "Jifang Hu",
        "Yuhang Shao",
        "Penghao Jiang",
        "Jinrong Jiang",
        "Lian Zhao"
    ],
    "venue": "",
    "year": 2024,
    "tldr": null,
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}