{
    "acronym": "cb1f361b2711c6c1bde482d726684dd34d7fe254",
    "title": "Advancing Chatbot Conversations: A Review of Knowledge Update Approaches",
    "seed_ids": [
        "transformer",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a"
    ],
    "s2id": "cb1f361b2711c6c1bde482d726684dd34d7fe254",
    "abstract": "Conversational systems like chatbots have emerged as powerful tools for automating interactive tasks traditionally confined to human involvement. Fundamental to chatbot functionality is their knowledge base, the foundation of their reasoning processes. A pivotal challenge resides in chatbots' innate incapacity to seamlessly integrate changes within their knowledge base, thereby hindering their ability to provide real-time responses. The increasing literature attention dedicated to effective knowledge base updates, which we term content update, underscores the significance of this topic. This work provides an overview of content update methodologies in the context of conversational agents. We delve into the state-of-the-art approaches for natural language understanding, such as language models and alike, which are essential for turning data into knowledge. Additionally, we discuss turning point strategies and primary resources, such as deep learning, which are crucial for supporting language models. As our principal contribution, we review and discuss the core techniques underpinning information extraction as well as knowledge base representation and update in the context of conversational agents.\n ",
    "authors": [
        "Luis Antonio Leite Francisco da Costa",
        "Mateus Begnini Melchiades",
        "Valéria Soldera Girelli",
        "Felipe Colombelli",
        "D. A. Araújo",
        "S. Rigo",
        "G. D. O. Ramos",
        "Cristiano André da Costa",
        "R. Righi",
        "Jorge L. V. Barbosa"
    ],
    "venue": "Journal of the Brazilian Computer Society",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work provides an overview of content update methodologies in the context of conversational agents and dives into the state-of-the-art approaches for natural language understanding, such as language models and alike, which are essential for turning data into knowledge."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}