{
    "acronym": "cbaf689fd9ea9bc939510019d90535d6249b3367",
    "title": "Jamba: A Hybrid Transformer-Mamba Language Model",
    "seed_ids": [
        "mamba",
        "26e6cd121c5fdb147df83cb848e4813c926737c8",
        "9da427202cc48370fd66359f5d72ff5ff3bc8b57",
        "745594bd0dc3e9dc86f74e100cd2c98ed36256c0",
        "b0db25e317cf856f1ec1ca3df0e573d850ed4696",
        "0a067fab18c67d4a386efa846c080f8afff5e8f3",
        "067aaf0d1cde4ee21063be137559f2fe50125570",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "980e55d9226cac302d0fae7732da4e67b8bc952c",
        "661e8d555c4424b5953f17434f2ba910bfcf3afe",
        "a2fc77f075f666b462d9350e7576f0ba9845c61b",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "cbaf689fd9ea9bc939510019d90535d6249b3367",
    "abstract": "We present Jamba, a new base large language model based on a novel hybrid Transformer-Mamba mixture-of-experts (MoE) architecture. Specifically, Jamba interleaves blocks of Transformer and Mamba layers, enjoying the benefits of both model families. MoE is added in some of these layers to increase model capacity while keeping active parameter usage manageable. This flexible architecture allows resource- and objective-specific configurations. In the particular configuration we have implemented, we end up with a powerful model that fits in a single 80GB GPU. Built at large scale, Jamba provides high throughput and small memory footprint compared to vanilla Transformers, and at the same time state-of-the-art performance on standard language model benchmarks and long-context evaluations. Remarkably, the model presents strong results for up to 256K tokens context length. We study various architectural decisions, such as how to combine Transformer and Mamba layers, and how to mix experts, and show that some of them are crucial in large scale modeling. We also describe several interesting properties of these architectures which the training and evaluation of Jamba have revealed, and plan to release checkpoints from various ablation runs, to encourage further exploration of this novel architecture. We make the weights of our implementation of Jamba publicly available under a permissive license.",
    "authors": [
        "Opher Lieber",
        "Barak Lenz",
        "Hofit Bata",
        "Gal Cohen",
        "Jhonathan Osin",
        "Itay Dalmedigos",
        "Erez Safahi",
        "S. Meirom",
        "Yonatan Belinkov",
        "Shai Shalev-Shwartz",
        "Omri Abend",
        "Raz Alon",
        "Tomer Asida",
        "Amir Bergman",
        "Roman Glozman",
        "Michael Gokhman",
        "Avshalom Manevich",
        "Nir Ratner",
        "N. Rozen",
        "Erez Shwartz",
        "Mor Zusman",
        "Y. Shoham"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Jamba is presented, a new base large language model based on a novel hybrid Transformer-Mamba mixture-of-experts (MoE) architecture that provides high throughput and small memory footprint compared to vanilla Transformers, and at the same time state-of-the-art performance on standard language model benchmarks and long-context evaluations."
    },
    "citationCount": 46,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}