{
    "acronym": "cbbacf9ba52942fd6a43588295385e2ab39545b0",
    "title": "Interacting with Next-Phrase Suggestions: How Suggestion Systems Aid and Influence the Cognitive Processes of Writing",
    "seed_ids": [
        "gpt2",
        "65ccc1c6f45b8f9054578deb419557df9ec9f1f9",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "cbbacf9ba52942fd6a43588295385e2ab39545b0",
    "abstract": "Writing with next-phrase suggestions powered by large language models is becoming more pervasive by the day. However, research to understand writers’ interaction and decision-making processes while engaging with such systems is still emerging. We conducted a qualitative study to shed light on writers’ cognitive processes while writing with next-phrase suggestion systems. To do so, we recruited 14 amateur writers to write two movie reviews each, one without suggestions and one with suggestions. Additionally, we also positively and negatively biased the suggestion system to get a diverse range of instances where writers’ opinions and the bias in the language model align or misalign to varying degrees. We found that writers interact with next-phrase suggestions in various complex ways: Writers abstracted and extracted multiple parts of the suggestions and incorporated them within their writing, even when they disagreed with the suggestion as a whole; along with evaluating the suggestions on various criteria. The suggestion system also had various effects on the writing process, such as altering the writer’s usual writing plans, leading to higher levels of distraction etc. Based on our qualitative analysis using the cognitive process model of writing by Hayes [35] as a lens, we propose a theoretical model of ’writer-suggestion interaction’ for writing with GPT-2 (and causal language models in general) for a movie review writing task, followed by directions for future research and design.",
    "authors": [
        "Advait Bhat",
        "Saaket Agashe",
        "Niharika Mohile",
        "Parth Oberoi",
        "R. Jangir",
        "Anirudha N. Joshi"
    ],
    "venue": "International Conference on Intelligent User Interfaces",
    "year": 2022,
    "tldr": null,
    "citationCount": 25,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}