{
    "acronym": "ccb657d6ef9bb57d5714ff3deb89f1b257c17c7f",
    "title": "Detection of Anti-Human Rights Discourse from Colombian Social Media Conversations Using Advanced Transformer Models",
    "seed_ids": [
        "bert",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "ccb657d6ef9bb57d5714ff3deb89f1b257c17c7f",
    "abstract": "In illiberal democracies such as Colombia, social media campaigns have been used to vilify human rights defenders. These campaigns can be causally linked to physical violence against these groups, and hence, identifying such content with a goal towards its tagging or complete removal is necessary. Current content moderation policies of social media platforms cannot adequately filter this content because it may not be written in English, and includes context specific references. This paper proposes a comprehensive computational approach to identify anti-human rights content from social media conversations collected in Colombia. The approach includes various state-of-the-art transformer models on binary and three-way classification problems. The approach can separate anti-human rights content from a combination of pro-human rights and neutral content with a F1-score of 0.82. It achieves a F1-score of 0.70 in three-way classification. The paper also contributes to the body of work on transformer models by the virtue of being one of the first extensive applications of these models to a real-life problem. This has ultimately resulted in detailed comparisons and insights regarding the strengths and weaknesses of the various transformer models.",
    "authors": [
        "Atharva Manjrekar",
        "S. Gokhale",
        "Richard A. Wilson"
    ],
    "venue": "International Conference on Machine Learning and Applications",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A comprehensive computational approach to identify anti-human rights content from social media conversations collected in Colombia is proposed, which includes various state-of-the-art transformer models on binary and three-way classification problems."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}