{
    "acronym": "ccbca16fe7c6b12ffca2af1893450855ad106bc8",
    "title": "Budget-Constrained Tool Learning with Planning",
    "seed_ids": [
        "longformer",
        "a53c8ba374d430d6c3786d13c04edb200d547750",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "ccbca16fe7c6b12ffca2af1893450855ad106bc8",
    "abstract": "Despite intensive efforts devoted to tool learning, the problem of budget-constrained tool learning, which focuses on resolving user queries within a specific budget constraint, has been widely overlooked. This paper proposes a novel method for budget-constrained tool learning. Our approach involves creating a preferable plan under the budget constraint before utilizing the tools. This plan outlines the feasible tools and the maximum number of times they can be employed, offering a comprehensive overview of the tool learning process for large language models. This allows them to allocate the budget from a broader perspective. To devise the plan without incurring significant extra costs, we suggest initially estimating the usefulness of the candidate tools based on past experience. Subsequently, we employ dynamic programming to formulate the plan. Experimental results demonstrate that our method can be integrated with various tool learning methods, significantly enhancing their effectiveness under strict budget constraints.",
    "authors": [
        "Yuanhang Zheng",
        "Peng Li",
        "Mingshi Yan",
        "Ji Zhang",
        "Fei Huang",
        "Yang Liu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Experimental results demonstrate that the proposed novel method for budget-constrained tool learning can be integrated with various tool learning methods, significantly enhancing their effectiveness under strict budget constraints."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}