{
    "acronym": "ccdc5c852589a2c0b7430f22d01f6740a6f51148",
    "title": "Transformer-based deep learning integrates multi-omic data with cancer pathways",
    "seed_ids": [
        "transformer",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530"
    ],
    "s2id": "ccdc5c852589a2c0b7430f22d01f6740a6f51148",
    "abstract": "Multi-omic data analysis incorporating machine learning has the potential to significantly improve cancer diagnosis and prognosis. Traditional machine learning methods are usually limited to omic measurements, omitting existing domain knowledge, such as the biological networks that link molecular entities in various omic data types. Here we develop a Transformer-based explainable deep learning model, DeePathNet, which integrates cancer-specific pathway information into multi-omic data analysis. Using a variety of big datasets, including ProCan-DepMapSanger, CCLE, and TCGA, we demonstrate and validate that DeePathNet outperforms traditional methods for predicting drug response and classifying cancer type and subtype. Combining biomedical knowledge and state-of-the-art deep learning methods, DeePathNet enables biomarker discovery at the pathway level, maximizing the power of data-driven approaches to cancer research. DeePathNet is available on GitHub at https://github.com/CMRI-ProCan/DeePathNet. Highlights DeePathNet integrates biological pathways for enhanced cancer analysis. DeePathNet utilizes Transformer-based deep learning for superior accuracy. DeePathNet outperforms existing models in drug response prediction. DeePathNet enables pathway-level biomarker discovery in cancer research.",
    "authors": [
        "Zhaoxiang Cai",
        "R. C. Poulos",
        "Adel Aref",
        "Phillip J. Robinson",
        "R. Reddel",
        "Qing Zhong"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Transformer-based explainable deep learning model, DeePathNet, is developed, which integrates cancer-specific pathway information into multi-omic data analysis and enables pathway-level biomarker discovery in cancer research."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}