{
    "acronym": "cce6c0c6b2bdaaf788bd80d9dca15f2ce0792fde",
    "title": "Sparse Contrastive Learning of Sentence Embeddings",
    "seed_ids": [
        "bert"
    ],
    "s2id": "cce6c0c6b2bdaaf788bd80d9dca15f2ce0792fde",
    "abstract": "Recently, SimCSE has shown the feasibility of contrastive learning in training sentence embeddings and illustrates its expressiveness in spanning an aligned and uniform embedding space. However, prior studies have shown that dense models could contain harmful parameters that affect the model performance, and it is no wonder that SimCSE can as well be invented with such parameters. Driven by this, parameter sparsification is applied, where alignment and uniformity scores are used to measure the contribution of each parameter to the overall quality of sentence embeddings. Drawing from a preliminary study, we consider parameters with minimal contributions to be detrimental, as their sparsification results in improved model performance. To discuss the ubiquity of detrimental parameters and remove them, more experiments on the standard semantic textual similarity (STS) tasks and transfer learning tasks are conducted, and the results show that the proposed sparsified SimCSE (SparseCSE) has excellent performance in comparison with SimCSE. Furthermore, through in-depth analysis, we establish the validity and stability of our sparsification method, showcasing that the embedding space generated by SparseCSE exhibits improved alignment compared to that produced by SimCSE. Importantly, the uniformity yet remains uncompromised.",
    "authors": [
        "Ruize An",
        "Chen Zhang",
        "Dawei Song"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Through in-depth analysis, the validity and stability of the sparsification method is established, showcasing that the embedding space generated by SparseCSE exhibits improved alignment compared to that produced by SimCSE, and the uniformity yet remains uncompromised."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}