{
    "acronym": "cd3eaa3648cd0c2bee8294fd6cdbea5436c48ea1",
    "title": "HanDiffuser: Text-to-Image Generation With Realistic Hand Appearances",
    "seed_ids": [
        "classfreediffu",
        "15736f7c205d961c00378a938daffaacb5a0718d",
        "82482585e94192b4e9913727e461f89cd08e9725",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "cd3eaa3648cd0c2bee8294fd6cdbea5436c48ea1",
    "abstract": "Text-to-image generative models can generate high-quality humans, but realism is lost when generating hands. Common artifacts include irregular hand poses, shapes, incorrect numbers of fingers, and physically implausible finger orientations. To generate images with realistic hands, we propose a novel diffusion-based architecture called HanDiffuser that achieves realism by injecting hand embeddings in the generative process. HanDiffuser consists of two components: a Text-to-Hand-Params diffusion model to generate SMPL-Body and MANO-Hand parameters from input text prompts, and a Text-Guided Hand-Params-to-Image diffusion model to synthesize images by conditioning on the prompts and hand parameters generated by the previous component. We incorporate multiple aspects of hand representation, including 3D shapes and joint-level finger positions, orientations and articulations, for robust learning and reliable performance during inference. We conduct extensive quantitative and qualitative experiments and perform user studies to demonstrate the efficacy of our method in generating images with high-quality hands.",
    "authors": [
        "Supreeth Narasimhaswamy",
        "Uttaran Bhattacharya",
        "Xiang Chen",
        "Ishita Dasgupta",
        "Saayan Mitra",
        "Minh Hoai"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel diffusion-based architecture called HanDiffuser that achieves realism by injecting hand embeddings in the generative process, and incorporates multiple aspects of hand representation, including 3D shapes and joint-level finger positions, orientations and articulations, for robust learning and reliable performance during inference."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}