{
    "acronym": "cd6402234500f37286e52811dbdbfb87b557a437",
    "title": "Large Scale Foundation Models for Intelligent Manufacturing Applications: A Survey",
    "seed_ids": [
        "gpt3",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "cd6402234500f37286e52811dbdbfb87b557a437",
    "abstract": "Although the applications of artificial intelligence especially deep learning had greatly improved various aspects of intelligent manufacturing, they still face challenges for wide employment due to the poor generalization ability, difficulties to establish high-quality training datasets, and unsatisfactory performance of deep learning methods. The emergence of large scale foundational models(LSFMs) had triggered a wave in the field of artificial intelligence, shifting deep learning models from single-task, single-modal, limited data patterns to a paradigm encompassing diverse tasks, multimodal, and pre-training on massive datasets. Although LSFMs had demonstrated powerful generalization capabilities, automatic high-quality training dataset generation and superior performance across various domains, applications of LSFMs on intelligent manufacturing were still in their nascent stage. A systematic overview of this topic was lacking, especially regarding which challenges of deep learning can be addressed by LSFMs and how these challenges can be systematically tackled. To fill this gap, this paper systematically expounded current statue of LSFMs and their advantages in the context of intelligent manufacturing. and compared comprehensively with the challenges faced by current deep learning models in various intelligent manufacturing applications. We also outlined the roadmaps for utilizing LSFMs to address these challenges. Finally, case studies of applications of LSFMs in real-world intelligent manufacturing scenarios were presented to illustrate how LSFMs could help industries, improve their efficiency.",
    "authors": [
        "Haotian Zhang",
        "Stuart Dereck Semujju",
        "Zhicheng Wang",
        "Xianwei Lv",
        "Kang Xu",
        "Liang Wu",
        "Ye Jia",
        "Jing Wu",
        "Zhuo Long",
        "Wensheng Liang",
        "Xiaoguang Ma",
        "Ruiyan Zhuang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Current statue of LSFMs and their advantages in the context of intelligent manufacturing are expounded and compared comprehensively with the challenges faced by current deep learning models in various intelligent manufacturing applications."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}