{
    "acronym": "ce13bba037382e240411dcb16105012f42335387",
    "title": "CLHA: A Simple Yet Effective Contrastive Learning Framework for Human Alignment",
    "seed_ids": [
        "gpt3",
        "023edab4738690444e3924e224c2641017a0d794",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c"
    ],
    "s2id": "ce13bba037382e240411dcb16105012f42335387",
    "abstract": "Reinforcement learning from human feedback (RLHF) is a crucial technique in aligning large language models (LLMs) with human preferences, ensuring these LLMs behave in beneficial and comprehensible ways to users. However, a longstanding challenge in human alignment techniques based on reinforcement learning lies in their inherent complexity and difficulty in training. To address this challenge, we present a simple yet effective Contrastive Learning Framework for Human Alignment (CLHA) to align LLMs with human preferences directly. CLHA employs a novel rescoring strategy to evaluate the noise within the data by considering its inherent quality and dynamically adjusting the training process. Simultaneously, CLHA utilizes pairwise contrastive loss and adaptive supervised fine-tuning loss to adaptively modify the likelihood of generating responses, ensuring enhanced alignment with human preferences. Using advanced methods, CLHA surpasses other algorithms, showcasing superior performance in terms of reward model scores, automatic evaluations, and human assessments on the widely used “Helpful and Harmless” dataset.",
    "authors": [
        "Feiteng Fang",
        "Liang Zhu",
        "Min Yang",
        "Xi Feng",
        "Jinchang Hou",
        "Qixuan Zhao",
        "Chengming Li",
        "Xiping Hu",
        "Ruifeng Xu"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A simple yet effective Contrastive Learning Framework for Human Alignment (CLHA) to align LLMs with human preferences directly, showcasing superior performance in terms of reward model scores, automatic evaluations, and human assessments on the widely used “Helpful and Harmless” dataset."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}