{
    "acronym": "ce510c6cfeac703706460680e977c54554840830",
    "title": "Pop Music Transformer: Beat-based Modeling and Generation of Expressive Pop Piano Compositions",
    "seed_ids": [
        "transformerxl",
        "f51497f463566581874c941353dd9d80069c5b77",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "24a70db0bbb5f486126477e32a6a44ab917a4b11",
        "fb507ada871d1e8c29e376dbf7b7879689aa89f9"
    ],
    "s2id": "ce510c6cfeac703706460680e977c54554840830",
    "abstract": "A great number of deep learning based models have been recently proposed for automatic music composition. Among these models, the Transformer stands out as a prominent approach for generating expressive classical piano performance with a coherent structure of up to one minute. The model is powerful in that it learns abstractions of data on its own, without much human-imposed domain knowledge or constraints. In contrast with this general approach, this paper shows that Transformers can do even better for music modeling, when we improve the way a musical score is converted into the data fed to a Transformer model. In particular, we seek to impose a metrical structure in the input data, so that Transformers can be more easily aware of the beat-bar-phrase hierarchical structure in music. The new data representation maintains the flexibility of local tempo changes, and provides hurdles to control the rhythmic and harmonic structure of music. With this approach, we build a Pop Music Transformer that composes Pop piano music with better rhythmic structure than existing Transformer models.",
    "authors": [
        "Yu-Siang Huang",
        "Yi-Hsuan Yang"
    ],
    "venue": "ACM Multimedia",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Pop Music Transformer is built that composes Pop piano music with better rhythmic structure than existing Transformer models, when the way a musical score is converted into the data fed to a Transformer model is improved."
    },
    "citationCount": 195,
    "influentialCitationCount": 29,
    "code": null,
    "description": null,
    "url": null
}