{
    "acronym": "ce636ac559d3ef3100b28f81f6532057a487af12",
    "title": "LLM-Mediated Domain-Specific Voice Agents: The Case of TextileBot",
    "seed_ids": [
        "gpt3",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "da454295392cf4caaa39cc465734237ffe55392f",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "f9b91c369f4cae2486c23cd052ad7495a5ad2983",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "ce636ac559d3ef3100b28f81f6532057a487af12",
    "abstract": "Developing domain-specific conversational agents (CAs) has been challenged by the need for extensive domain-focused data. Recent advancements in Large Language Models (LLMs) make them a viable option as a knowledge backbone. LLMs behaviour can be enhanced through prompting, instructing them to perform downstream tasks in a zero-shot fashion (i.e. without training). To this end, we incorporated structural knowledge into prompts and used prompted LLMs to build domain-specific voice-based CAs. We demonstrate this approach for the specific domain of textile circularity in form of the design, development, and evaluation of TextileBot. We present the design and development of the voice agent TextileBot and also the insights from an in-person user study (N=30) evaluating three variations of TextileBots. We analyse the human-agent interactions, combining quantitative and qualitative methods. Our results suggest that participants engaged in multi-turn conversations, and their perceptions of the three variation agents and respective interactions varied demonstrating the effectiveness of our prompt-based LLM approach. We discuss the dynamics of these interactions and their implications for designing future voice-based CAs. The results show that our method's potential for building domain-specific CAs. Furthermore, most participants engaged in multi-turn conversations, and their perceptions of the three voice agents and respective interactions varied demonstrating the effectiveness of our prompt-based LLM approach. We discuss the dynamics of these interactions and their implications for designing future voice-based CAs.",
    "authors": [
        "Shu Zhong",
        "Elia Gatti",
        "James Hardwick",
        "Miriam Ribul",
        "Youngjun Cho",
        "Marianna Obrist"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work incorporated structural knowledge into prompts and used prompted LLMs to build domain-specific voice-based CAs for the specific domain of textile circularity in form of the design, development, and evaluation of TextileBot."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}