{
    "acronym": "cec7872b194aadf54140578b9be52939eb1112e9",
    "title": "LambdaNetworks: Modeling Long-Range Interactions Without Attention",
    "seed_ids": [
        "mqa",
        "performer",
        "lineartransformer",
        "reformer",
        "6fa1cfc4f97f03a8485692418c7aa1a06c574a85",
        "64b9be00f4eecd465b4e8e46e2ab7624d7eaeb2b",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06"
    ],
    "s2id": "cec7872b194aadf54140578b9be52939eb1112e9",
    "abstract": "We present lambda layers -- an alternative framework to self-attention -- for capturing long-range interactions between an input and structured contextual information (e.g. a pixel surrounded by other pixels). Lambda layers capture such interactions by transforming available contexts into linear functions, termed lambdas, and applying these linear functions to each input separately. Similar to linear attention, lambda layers bypass expensive attention maps, but in contrast, they model both content and position-based interactions which enables their application to large structured inputs such as images. The resulting neural network architectures, LambdaNetworks, significantly outperform their convolutional and attentional counterparts on ImageNet classification, COCO object detection and COCO instance segmentation, while being more computationally efficient. Additionally, we design LambdaResNets, a family of hybrid architectures across different scales, that considerably improves the speed-accuracy tradeoff of image classification models. LambdaResNets reach excellent accuracies on ImageNet while being 3.2 - 4.4x faster than the popular EfficientNets on modern machine learning accelerators. When training with an additional 130M pseudo-labeled images, LambdaResNets achieve up to a 9.5x speed-up over the corresponding EfficientNet checkpoints.",
    "authors": [
        "Irwan Bello"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The resulting neural network architectures, LambdaNetworks, significantly outperform their convolutional and attentional counterparts on ImageNet classification, C OCO object detection and COCO instance segmentation, while being more computationally efficient."
    },
    "citationCount": 162,
    "influentialCitationCount": 11,
    "code": null,
    "description": null,
    "url": null
}