{
    "acronym": "ced170992b7ab2c9f69966f780996533b0f423b4",
    "title": "Bridging the Gap between Position-Based and Content-Based Self-Attention for Neural Machine Translation",
    "seed_ids": [
        "lighdynconv",
        "1dbb523a6555d6e0c5727620e2b57daaa5b79dc0",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "84476fdf6ead3553f4493dff8e02308439d6222b"
    ],
    "s2id": "ced170992b7ab2c9f69966f780996533b0f423b4",
    "abstract": "Position-based token-mixing approaches, such as FNet and MLPMixer, have shown to be exciting attention alternatives for computer vision and natural language understanding. The motivation is usually to remove redundant operations for higher efficiency on consumer GPUs while maintaining Transformer quality. On the hardware side, research on memristive crossbar arrays shows the possibility of efficiency gains up to two orders of magnitude by performing in-memory computation with weights stored on device. While it is impossible to store dynamic attention weights based on token-token interactions on device, position-based weights represent a concrete alternative if they only lead to minimal degradation. In this paper, we propose position-based attention as a variant of multi-head attention where the attention weights are computed from position representations. A naive replacement of token vectors with position vectors in self-attention results in a significant loss in translation quality, which can be recovered by using relative position representations and a gating mechanism. We show analytically that this gating mechanism introduces some form of word dependency and validate its effectiveness experimentally under various conditions. The resulting network, rPosNet, outperforms previous position-based approaches and matches the quality of the Transformer with relative position embedding while requiring 20% less attention parameters after training.",
    "authors": [
        "Felix Schmidt",
        "Mattia Antonino Di Gangi"
    ],
    "venue": "Conference on Machine Translation",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": null
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}