{
    "acronym": "cf1c4f8a682b1869c58e969b4158f538898423a6",
    "title": "Automated Radiology Report Generation: A Review of Recent Advances",
    "seed_ids": [
        "bert",
        "25c7fa62d85c5d564f0b35471456e4ad4739c582",
        "461420c80d3bdc156e5db7af13264a955a6a2010",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "cf1c4f8a682b1869c58e969b4158f538898423a6",
    "abstract": "Increasing demands on medical imaging departments are taking a toll on the radiologist's ability to deliver timely and accurate reports. Recent technological advances in artificial intelligence have demonstrated great potential for automatic radiology report generation (ARRG), sparking an explosion of research. This survey paper conducts a methodological review of contemporary ARRG approaches by way of (i) assessing datasets based on characteristics, such as availability, size, and adoption rate, (ii) examining deep learning training methods, such as contrastive learning and reinforcement learning, (iii) exploring state-of-the-art model architectures, including variations of CNN and transformer models, (iv) outlining techniques integrating clinical knowledge through multimodal inputs and knowledge graphs, and (v) scrutinising current model evaluation techniques, including commonly applied NLP metrics and qualitative clinical reviews. Furthermore, the quantitative results of the reviewed models are analysed, where the top performing models are examined to seek further insights. Finally, potential new directions are highlighted, with the adoption of additional datasets from other radiological modalities and improved evaluation methods predicted as important areas of future development.",
    "authors": [
        "Phillip Sloan",
        "Philip Clatworthy",
        "Edwin Simpson",
        "Majid Mirmehdi"
    ],
    "venue": "IEEE Reviews in Biomedical Engineering",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A methodological review of contemporary ARRG approaches is conducted by assessing datasets based on characteristics, examining deep learning training methods, and scrutinising current model evaluation techniques, including commonly applied NLP metrics and qualitative clinical reviews."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}