{
    "acronym": "cf4e452d391797cdf3a8b31f2b2fcd9885a5858b",
    "title": "A Comparative Study of non-deep Learning, Deep Learning, and Ensemble Learning Methods for Sunspot Number Prediction",
    "seed_ids": [
        "sparsetransformer",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "cf4e452d391797cdf3a8b31f2b2fcd9885a5858b",
    "abstract": "ABSTRACT Solar activity has significant impacts on human activities and health. One most commonly used measure of solar activity is the sunspot number. This paper compares three important non-deep learning models, four popular deep learning models, and their five ensemble models in forecasting sunspot numbers. In particular, we propose an ensemble model called XGBoost-DL, which uses XGBoost as a two-level nonlinear ensemble method to combine the deep learning models. Our XGBoost-DL achieves the best forecasting performance (RMSE and MAE ) in the comparison, outperforming the best non-deep learning model SARIMA (RMSE and MAE ), the best deep learning model Informer (RMSE and MAE ) and the NASA’s forecast (RMSE and MAE ). Our XGBoost-DL forecasts a peak sunspot number of 133.47 in May 2025 for Solar Cycle 25 and 164.62 in November 2035 for Solar Cycle 26, similar to but later than the NASA’s at 137.7 in October 2024 and 161.2 in December 2034. An open-source Python package of our XGBoost-DL for the sunspot number prediction is available at https://github.com/yd1008/ts_ensemble_sunspot.",
    "authors": [
        "Yuchen Dang",
        "Ziqi Chen",
        "Heng Li",
        "Hai Shu"
    ],
    "venue": "Applied Artificial Intelligence",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed XGBoost-DL achieves the best forecasting performance in the comparison, outperforming the best non-deep learning model SARIMA, the best deep learning model Informer, and the NASA’s forecast (RMSE and MAE)."
    },
    "citationCount": 17,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}