{
    "acronym": "cf694df964caa156ec306b45d3a3127533cb458f",
    "title": "Pick-a-Pic: An Open Dataset of User Preferences for Text-to-Image Generation",
    "seed_ids": [
        "classfreediffu",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "14c3cf58192774b9b6fc6188df99efd6ab5fc739"
    ],
    "s2id": "cf694df964caa156ec306b45d3a3127533cb458f",
    "abstract": "The ability to collect a large dataset of human preferences from text-to-image users is usually limited to companies, making such datasets inaccessible to the public. To address this issue, we create a web app that enables text-to-image users to generate images and specify their preferences. Using this web app we build Pick-a-Pic, a large, open dataset of text-to-image prompts and real users' preferences over generated images. We leverage this dataset to train a CLIP-based scoring function, PickScore, which exhibits superhuman performance on the task of predicting human preferences. Then, we test PickScore's ability to perform model evaluation and observe that it correlates better with human rankings than other automatic evaluation metrics. Therefore, we recommend using PickScore for evaluating future text-to-image generation models, and using Pick-a-Pic prompts as a more relevant dataset than MS-COCO. Finally, we demonstrate how PickScore can enhance existing text-to-image models via ranking.",
    "authors": [
        "Yuval Kirstain",
        "Adam Polyak",
        "Uriel Singer",
        "Shahbuland Matiana",
        "Joe Penna",
        "Omer Levy"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work builds Pick-a-Pic, a large, open dataset of text-to-image prompts and real users' preferences over generated images, and uses it to train a CLIP-based scoring function, PickScore, which exhibits superhuman performance on the task of predicting human preferences."
    },
    "citationCount": 147,
    "influentialCitationCount": 43,
    "code": null,
    "description": null,
    "url": null
}