{
    "acronym": "cfafbe715ec01241758bb22d6872760fbe5cedee",
    "title": "Context-Former: Stitching via Latent Conditioned Sequence Modeling",
    "seed_ids": [
        "bert",
        "3fb0731538c59f8520a309996a0567b58965f0fe"
    ],
    "s2id": "cfafbe715ec01241758bb22d6872760fbe5cedee",
    "abstract": "Offline reinforcement learning (RL) algorithms can learn better decision-making compared to behavior policies by stitching the suboptimal trajectories to derive more optimal ones. Meanwhile, Decision Transformer (DT) abstracts the RL as sequence modeling, showcasing competitive performance on offline RL benchmarks. However, recent studies demonstrate that DT lacks of stitching capacity, thus exploiting stitching capability for DT is vital to further improve its performance. In order to endow stitching capability to DT, we abstract trajectory stitching as expert matching and introduce our approach, ContextFormer, which integrates contextual information-based imitation learning (IL) and sequence modeling to stitch sub-optimal trajectory fragments by emulating the representations of a limited number of expert trajectories. To validate our approach, we conduct experiments from two perspectives: 1) We conduct extensive experiments on D4RL benchmarks under the settings of IL, and experimental results demonstrate ContextFormer can achieve competitive performance in multiple IL settings. 2) More importantly, we conduct a comparison of ContextFormer with various competitive DT variants using identical training datasets. The experimental results unveiled ContextFormer's superiority, as it outperformed all other variants, showcasing its remarkable performance.",
    "authors": [
        "Ziqi Zhang",
        "Jingzehua Xu",
        "Zifeng Zhuang",
        "Jinxin Liu",
        "Donglin Wang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "ContextFormer is introduced, which integrates contextual information-based imitation learning (IL) and sequence modeling to stitch sub-optimal trajectory fragments by emulating the representations of a limited number of expert trajectories, and experimental results demonstrate ContextFormer can achieve competitive performance in multiple IL settings."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}