{
    "acronym": "cfc75c39b2f3e323a9174c39ece8a97a8925d2a3",
    "title": "Cold-Start-Aware Cloud-Native Parallel Service Function Chain Caching in Edge–Cloud Network",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "cfc75c39b2f3e323a9174c39ece8a97a8925d2a3",
    "abstract": "Virtualized network function (VNF) and service function chain (SFC) are the fundamental components in network functions virtualization (NFV) infrastructure, which supports the evolution of modern 5G networks. For online Internet of Things (IoT) applications, characterized by dynamic and diverse requirements, achieving optimal quality of service hinges on a resource-efficient yet performant SFC caching strategy, which is a critical challenge. Besides, despite the performance boost and flexibility brought by modern cloud-native technology, it brings the cold-start problem due to the requirement for runtime image transmission and booting-up, resulting in a nonnegligible launch latency. To tackle these challenges, this article proposes cloud-native parallel SFC caching (CPSC) framework, a novel approach to address the CPSC problem in edge–cloud networks leveraging deep reinforcement learning (DRL), seeking an efficient resource utilization of the edge–cloud network with consideration of SFC processing performance and cold-start suppressing. Graph convolutional network (GCN)-based embeddings are adopted for topology-aware feature extraction of the substrate edge–cloud network as well as the incoming SFC caching requests. Then, a pointer network (PN) is utilized for contextual information-aware caching decision making. Benefiting from the online capability of DRL, CPSC makes caching decisions in an online manner with no prior knowledge requirement on future incoming requests. Extensive simulations show that CPSC manages to outperform the state-of-the-art approaches in edge network acceptance ratio and launch latency, with minimal overhead on the SFC processing performance and decision-making duration.",
    "authors": [
        "Jiayin Zhang",
        "Huiqun Yu",
        "Guisheng Fan",
        "Qifeng Tang",
        "Zengpeng Li",
        "Jin Xu"
    ],
    "venue": "IEEE Internet of Things Journal",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This article proposes cloud-native parallel SFC caching (CPSC) framework, a novel approach to address the CPSC problem in edge–cloud networks leveraging deep reinforcement learning (DRL), seeking an efficient resource utilization of the edge–cloud network with consideration of SFC processing performance and cold-start suppressing."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}