{
    "acronym": "d0307662fe0c048d93f720e952861cb2a7cda47c",
    "title": "Linguistic Changes in Spontaneous Speech for Detecting Parkinsons Disease Using Large Language Models",
    "seed_ids": [
        "bert",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d0307662fe0c048d93f720e952861cb2a7cda47c",
    "abstract": "Parkinsons disease is the second most prevalent neurodegenerative disorder with over ten million active cases worldwide and one million new diagnoses per year. Detecting and subsequently diagnosing the disease is challenging because of symptom heterogeneity with respect to complexity, as well as the type and timing of phenotypic manifestations. Typically, language impairment can present in the prodromal phase and precede motor symptoms suggesting that a linguistic-based approach could serve as a diagnostic method for incipient Parkinsons disease. Additionally, improved linguistic models may enhance other approaches through ensemble techniques. The field of large language models is advancing rapidly, presenting the opportunity to explore the use of these new models for detecting Parkinsons disease and to improve on current linguistic approaches with high-dimensional representations of linguistics. We evaluate the application of state-of-the-art large language models to detect Parkinsons disease automatically from spontaneous speech with up to 73% accuracy.",
    "authors": [
        "Jonathan Crawford"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The application of state-of-the-art large language models are evaluated to detect Parkinsons disease automatically from spontaneous speech with up to 73% accuracy and to improve on current linguistic approaches with high-dimensional representations of linguistics."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}