{
    "acronym": "d034a77636c0b155eb3f752f161203f7891135cb",
    "title": "Data Diversity Matters for Robust Instruction Tuning",
    "seed_ids": [
        "gpt3",
        "11cf88dce827bd67cbfa60400306318022e736d5",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d034a77636c0b155eb3f752f161203f7891135cb",
    "abstract": "Recent works have shown that by curating high quality and diverse instruction tuning datasets, we can significantly improve instruction-following capabilities. However, creating such datasets is difficult and most works rely on manual curation or proprietary language models. Automatic data curation is difficult as it is still not clear how we can define diversity for instruction tuning, how diversity and quality depend on one other, and how we can optimize dataset quality and diversity. To resolve these issue, we propose a new algorithm, Quality-Diversity Instruction Tuning (QDIT). QDIT provides a simple method to simultaneously control dataset diversity and quality, allowing us to conduct an in-depth study on the effect of diversity and quality on instruction tuning performance. From this study we draw two key insights (1) there is a natural tradeoff between data diversity and quality and (2) increasing data diversity significantly improves the worst case instruction following performance, therefore improving robustness. We validate the performance of QDIT on several large scale instruction tuning datasets, where we find it can substantially improve worst and average case performance compared to quality-driven data selection.",
    "authors": [
        "Alexander Bukharin",
        "Tuo Zhao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "There is a natural tradeoff between data diversity and quality and increasing data diversity significantly improves the worst case instruction following performance, therefore improving robustness, and a new algorithm, Quality-Diversity Instruction Tuning (QDIT), is proposed."
    },
    "citationCount": 10,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}