{
    "acronym": "d078b6e88bc4749f4eb83f289537a88b4aaf54e6",
    "title": "On the Expressivity Role of LayerNorm in Transformers' Attention",
    "seed_ids": [
        "gpt2",
        "b45d656ac8cc2e940609580cf291ee76ffcac20a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d078b6e88bc4749f4eb83f289537a88b4aaf54e6",
    "abstract": "Layer Normalization (LayerNorm) is an inherent component in all Transformer-based models. In this paper, we show that LayerNorm is crucial to the expressivity of the multi-head attention layer that follows it. This is in contrast to the common belief that LayerNorm's only role is to normalize the activations during the forward pass, and their gradients during the backward pass. We consider a geometric interpretation of LayerNorm and show that it consists of two components: (a) projection of the input vectors to a $d-1$ space that is orthogonal to the $\\left[1,1,...,1\\right]$ vector, and (b) scaling of all vectors to the same norm of $\\sqrt{d}$. We show that each of these components is important for the attention layer that follows it in Transformers: (a) projection allows the attention mechanism to create an attention query that attends to all keys equally, offloading the need to learn this operation by the attention; and (b) scaling allows each key to potentially receive the highest attention, and prevents keys from being\"un-select-able\". We show empirically that Transformers do indeed benefit from these properties of LayeNorm in general language modeling and even in computing simple functions such as\"majority\". Our code is available at https://github.com/tech-srl/layer_norm_expressivity_role .",
    "authors": [
        "Shaked Brody",
        "Uri Alon",
        "Eran Yahav"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that LayerNorm is crucial to the expressivity of the multi-head attention layer that follows it in Transformers, and empirically that Transformers do indeed benefit from these properties of LayeNorm in general language modeling and even in computing simple functions such as\"majority\"."
    },
    "citationCount": 20,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}