{
    "acronym": "d08c7b5428a584f9da05c16a90a88dcc00a7c37e",
    "title": "Fine-grained Text Style Transfer with Diffusion-Based Language Models",
    "seed_ids": [
        "diffusionlm",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d08c7b5428a584f9da05c16a90a88dcc00a7c37e",
    "abstract": "Diffusion probabilistic models have shown great success in generating high-quality images controllably, and researchers have tried to utilize this controllability into text generation domain. Previous works on diffusion-based language models have shown that they can be trained without external knowledge (such as pre-trained weights) and still achieve stable performance and controllability. In this paper, we trained a diffusion-based model on StylePTB dataset, the standard benchmark for fine-grained text style transfers. The tasks in StylePTB requires much more refined control over the output text compared to tasks evaluated in previous works, and our model was able to achieve state-of-the-art performance on StylePTB on both individual and compositional transfers. Moreover, our model, trained on limited data from StylePTB without external knowledge, outperforms previous works that utilized pretrained weights, embeddings, and external grammar parsers, and this may indicate that diffusion-based language models have great potential under low-resource settings.",
    "authors": [
        "Yiwei Lyu",
        "Tiange Luo",
        "Jiacheng Shi",
        "Todd C. Hollon",
        "Ho Hin Lee"
    ],
    "venue": "Workshop on Representation Learning for NLP",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The model, trained on limited data from StylePTB without external knowledge, outperforms previous works that utilized pretrained weights, embeddings, and external grammar parsers, and this may indicate that diffusion-based language models have great potential under low-resource settings."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}