{
    "acronym": "d0a280002ec2d8864d378464031026825d9d994f",
    "title": "J-Guard: Journalism Guided Adversarially Robust Detection of AI-generated News",
    "seed_ids": [
        "gpt2",
        "1c13af186d1e177b85ef1ec3fc7b8d33ec314cfd",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "d972c9bccc5ccef16d71b450dd3ab4c77f67224a",
        "7845bfb55f5ce573b87d77bb76d4d38829b37620",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d0a280002ec2d8864d378464031026825d9d994f",
    "abstract": "The rapid proliferation of AI-generated text online is profoundly reshaping the information landscape. Among various types of AI-generated text, AI-generated news presents a significant threat as it can be a prominent source of misinformation online. While several recent efforts have focused on detecting AI-generated text in general, these methods require enhanced reliability, given concerns about their vulnerability to simple adversarial attacks. Furthermore, due to the eccentricities of news writing, applying these detection methods for AI-generated news can produce false positives, potentially damaging the reputation of news organizations. To address these challenges, we leverage the expertise of an interdisciplinary team to develop a framework, J-Guard, capable of steering existing supervised AI text detectors for detecting AI-generated news while boosting adversarial robustness. By incorporating stylistic cues inspired by the unique journalistic attributes, J-Guard effectively distinguishes between real-world journalism and AI-generated news articles. Our experiments on news articles generated by a vast array of AI models, including ChatGPT (GPT3.5), demonstrate the effectiveness of J-Guard in enhancing detection capabilities while maintaining an average performance decrease of as low as 7% when faced with adversarial attacks.",
    "authors": [
        "Tharindu Kumarage",
        "Amrita Bhattacharjee",
        "Djordje Padejski",
        "Kristy Roschke",
        "Dan Gillmor",
        "Scott W. Ruston",
        "Huan Liu",
        "Joshua Garland"
    ],
    "venue": "International Joint Conference on Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "J-Guard is a framework capable of steering existing supervised AI text detectors for detecting AI-generated news while boosting adversarial robustness, and effectively distinguishes between real-world journalism and AI- generated news articles."
    },
    "citationCount": 6,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}