{
    "acronym": "d0b04635d7c9602a1e8fd0b2df3a61bd68954f0b",
    "title": "InstructP2P: Learning to Edit 3D Point Clouds with Text Instructions",
    "seed_ids": [
        "gpt",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "d0b04635d7c9602a1e8fd0b2df3a61bd68954f0b",
    "abstract": "Enhancing AI systems to perform tasks following human instructions can significantly boost productivity. In this paper, we present InstructP2P, an end-to-end framework for 3D shape editing on point clouds, guided by high-level textual instructions. InstructP2P extends the capabilities of existing methods by synergizing the strengths of a text-conditioned point cloud diffusion model, Point-E, and powerful language models, enabling color and geometry editing using language instructions. To train InstructP2P, we introduce a new shape editing dataset, constructed by integrating a shape segmentation dataset, off-the-shelf shape programs, and diverse edit instructions generated by a large language model, ChatGPT. Our proposed method allows for editing both color and geometry of specific regions in a single forward pass, while leaving other regions unaffected. In our experiments, InstructP2P shows generalization capabilities, adapting to novel shape categories and instructions, despite being trained on a limited amount of data.",
    "authors": [
        "Jiale Xu",
        "Xintao Wang",
        "Yannan Cao",
        "Weihao Cheng",
        "Ying Shan",
        "Shenghua Gao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper presents InstructP2P, an end-to-end framework for 3D shape editing on point clouds, guided by high-level textual instructions, that extends the capabilities of existing methods by synergizing the strengths of a text-conditioned point cloud diffusion model, Point-E, and powerful language models, enabling color and geometry editing using language instructions."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}