{
    "acronym": "d0deaec3e1f74701ac43600d9e64c5c969be7391",
    "title": "TriForce: Lossless Acceleration of Long Sequence Generation with Hierarchical Speculative Decoding",
    "seed_ids": [
        "yarn",
        "f1a9e0830bc36c048fa4659beaa62609869895b5",
        "1165d59f765dcc629b2c4293c05d102527b26f86",
        "b085968c4362fb286ad6c5ef71a5db9630da0498",
        "fd2cb81c01d9ab51c78de69b53f8b337775e290c",
        "2b8439f319dfa73df62ca8957ff6d0c1f3c7a73c",
        "a9468d8bfa6bd016dfd3128c4e8408e30eb8549b",
        "4d76206515d6b33903937474273885476fc2771e",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "e586a4591ba0303b769f2c07cbddaf1899cb72e4",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77"
    ],
    "s2id": "d0deaec3e1f74701ac43600d9e64c5c969be7391",
    "abstract": "With large language models (LLMs) widely deployed in long content generation recently, there has emerged an increasing demand for efficient long-sequence inference support. However, key-value (KV) cache, which is stored to avoid re-computation, has emerged as a critical bottleneck by growing linearly in size with the sequence length. Due to the auto-regressive nature of LLMs, the entire KV cache will be loaded for every generated token, resulting in low utilization of computational cores and high latency. While various compression methods for KV cache have been proposed to alleviate this issue, they suffer from degradation in generation quality. We introduce TriForce, a hierarchical speculative decoding system that is scalable to long sequence generation. This approach leverages the original model weights and dynamic sparse KV cache via retrieval as a draft model, which serves as an intermediate layer in the hierarchy and is further speculated by a smaller model to reduce its drafting latency. TriForce not only facilitates impressive speedups for Llama2-7B-128K, achieving up to 2.31$\\times$ on an A100 GPU but also showcases scalability in handling even longer contexts. For the offloading setting on two RTX 4090 GPUs, TriForce achieves 0.108s/token$\\unicode{x2014}$only half as slow as the auto-regressive baseline on an A100, which attains 7.78$\\times$ on our optimized offloading system. Additionally, TriForce performs 4.86$\\times$ than DeepSpeed-Zero-Inference on a single RTX 4090 GPU. TriForce's robustness is highlighted by its consistently outstanding performance across various temperatures. The code is available at https://github.com/Infini-AI-Lab/TriForce.",
    "authors": [
        "Hanshi Sun",
        "Zhuoming Chen",
        "Xinyu Yang",
        "Yuandong Tian",
        "Beidi Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "TriForce is introduced, a hierarchical speculative decoding system that is scalable to long sequence generation that leverages the original model weights and dynamic sparse KV cache via retrieval as a draft model, which serves as an intermediate layer in the hierarchy and is further speculated by a smaller model to reduce its drafting latency."
    },
    "citationCount": 11,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}