{
    "acronym": "d17bddf9dc329bb9ff7883642699b84055db06fc",
    "title": "PLATO-K: Internal and External Knowledge Enhanced Dialogue Generation",
    "seed_ids": [
        "roformer",
        "2613734d0fcff478915ea61e702160cfe88311d8",
        "a3184d40d390793232c99c89b57b8f65c16320b2",
        "2d29e1e684f8db8a143b3313cee991c4c786d340",
        "319b84be7a843250bc81d7086f79a4126d550277",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "6ebfbc954b9975d2f2651f380b9bdf46ae963178"
    ],
    "s2id": "d17bddf9dc329bb9ff7883642699b84055db06fc",
    "abstract": "Recently, the practical deployment of open-domain dialogue systems has been plagued by the knowledge issue of information deficiency and factual inaccuracy. To this end, we introduce PLATO-K based on two-stage dialogic learning to strengthen internal knowledge memorization and external knowledge exploitation. In the first stage, PLATO-K learns through massive dialogue corpora and memorizes essential knowledge into model parameters. In the second stage, PLATO-K mimics human beings to search for external information and to leverage the knowledge in response generation. Extensive experiments reveal that the knowledge issue is alleviated significantly in PLATO-K with such comprehensive internal and external knowledge enhancement. Compared to the existing state-of-the-art Chinese dialogue model, the overall engagingness of PLATO-K is improved remarkably by 36.2% and 49.2% on chit-chat and knowledge-intensive conversations.",
    "authors": [
        "Siqi Bao",
        "H. He",
        "Jun Xu",
        "Hua Lu",
        "Fan Wang",
        "Hua Wu",
        "Han Zhou",
        "Wenquan Wu",
        "Zheng-Yu Niu",
        "Haifeng Wang"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Compared to the existing state-of-the-art Chinese dialogue model, the overall engagingness of PLATO-K is improved remarkably by 36."
    },
    "citationCount": 4,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}