{
    "acronym": "d19df751f5f16237c6d8ced0af46cb177c45e98a",
    "title": "InfoDiffusion: Information Entropy Aware Diffusion Process for Non-Autoregressive Text Generation",
    "seed_ids": [
        "diffusionlm",
        "diffuseq",
        "3a22aad6c18a9559be3bbb197494b434b872a05a",
        "5fa10872ef8037853ff7c8baf5f77fb55a918eca",
        "82f71eb5e9d19d958dc90f488f35c6285ad2c3dc",
        "020a50f6a7154850ac81e3cde69ad8198ded6751",
        "a1186d7d9a9ef258c76afef1177e4f348061a537",
        "a979742220a88b1d32e1fbe72c41e8ba3007053c",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "a77b69be7727f61b61d02bd0e03209c830267c0b",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d19df751f5f16237c6d8ced0af46cb177c45e98a",
    "abstract": "Diffusion models have garnered considerable interest in the field of text generation. Several studies have explored text diffusion models with different structures and applied them to various tasks, including named entity recognition and summarization. However, there exists a notable disparity between the\"easy-first\"text generation process of current diffusion models and the\"keyword-first\"natural text generation process of humans, which has received limited attention. To bridge this gap, we propose InfoDiffusion, a non-autoregressive text diffusion model. Our approach introduces a\"keyinfo-first\"generation strategy and incorporates a noise schedule based on the amount of text information. In addition, InfoDiffusion combines self-conditioning with a newly proposed partially noising model structure. Experimental results show that InfoDiffusion outperforms the baseline model in terms of generation quality and diversity, as well as exhibiting higher sampling efficiency.",
    "authors": [
        "Renzhi Wang",
        "Jing Li",
        "Piji Li"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "InformationDiffusion is proposed, a non-autoregressive text diffusion model that introduces a \"keyinfo-first\" generation strategy and incorporates a noise schedule based on the amount of text information and combines self-conditioning with a newly proposed partially noising model structure."
    },
    "citationCount": 1,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}