{
    "acronym": "d1faf356b2b36298522f8a753b3d8f3463980fd0",
    "title": "ProgGen: Generating Named Entity Recognition Datasets Step-by-step with Self-Reflexive Large Language Models",
    "seed_ids": [
        "bert",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "23c265ba884b92ecbd9d18641078d964697e4590"
    ],
    "s2id": "d1faf356b2b36298522f8a753b3d8f3463980fd0",
    "abstract": "Although Large Language Models (LLMs) exhibit remarkable adaptability across domains, these models often fall short in structured knowledge extraction tasks such as named entity recognition (NER). This paper explores an innovative, cost-efficient strategy to harness LLMs with modest NER capabilities for producing superior NER datasets. Our approach diverges from the basic class-conditional prompts by instructing LLMs to self-reflect on the specific domain, thereby generating domain-relevant attributes (such as category and emotions for movie reviews), which are utilized for creating attribute-rich training data. Furthermore, we preemptively generate entity terms and then develop NER context data around these entities, effectively bypassing the LLMs' challenges with complex structures. Our experiments across both general and niche domains reveal significant performance enhancements over conventional data generation methods while being more cost-effective than existing alternatives.",
    "authors": [
        "Yuzhao Heng",
        "Chun-Ying Deng",
        "Yitong Li",
        "Yue Yu",
        "Yinghao Li",
        "Rongzhi Zhang",
        "Chao Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper explores an innovative, cost-efficient strategy to harness LLMs with modest NER capabilities for producing superior NER datasets by instructing LLMs to self-reflect on the specific domain, thereby generating domain-relevant attributes, which are utilized for creating attribute-rich training data."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}