{
    "acronym": "d24274d19377d29608cdde83357b13055b554098",
    "title": "Speech Slytherin: Examining the Performance and Efficiency of Mamba for Speech Separation, Recognition, and Synthesis",
    "seed_ids": [
        "dualpathmamba",
        "36bbad8524cd83c257153909fb7376bccedce850",
        "d668f557b922d0cac746c8ec82f7975f06ac906b",
        "a2b0cb0673ce65810d832a1f6514442d2b862e66",
        "50244eb6d666cee4522979448071d34e2cc543cf",
        "5a11808dd8f18d177aba5637fd75982ad42dabc8",
        "b6c286ac8ecf52db774ed8066998a920eaf3d2a2",
        "cbaf689fd9ea9bc939510019d90535d6249b3367",
        "da9178eae82d1ca5492aaecd0151ba49481cb8b1",
        "0a32e6ff6eaac83ff325bae4557a8362222979aa",
        "319762c8841f8e1e413642bc551ed748add4777b",
        "95d6d5ecb6ec57cf913e955107070496450cfd4c"
    ],
    "s2id": "d24274d19377d29608cdde83357b13055b554098",
    "abstract": "It is too early to conclude that Mamba is a better alternative to transformers for speech before comparing Mamba with transformers in terms of both performance and efficiency in multiple speech-related tasks. To reach this conclusion, we propose and evaluate three models for three tasks: Mamba-TasNet for speech separation, ConMamba for speech recognition, and VALL-M for speech synthesis. We compare them with transformers of similar sizes in performance, memory, and speed. Our Mamba or Mamba-transformer hybrid models show comparable or higher performance than their transformer counterparts: Sepformer, Conformer, and VALL-E. They are more efficient than transformers in memory and speed for speech longer than a threshold duration, inversely related to the resolution of a speech token. Mamba for separation is the most efficient, and Mamba for recognition is the least. Further, we show that Mamba is not more efficient than transformer for speech shorter than the threshold duration and performs worse in models that require joint modeling of text and speech, such as cross or masked attention of two inputs. Therefore, we argue that the superiority of Mamba or transformer depends on particular problems and models. Code available at https://github.com/xi-j/Mamba-TasNet and https://github.com/xi-j/Mamba-ASR.",
    "authors": [
        "Xilin Jiang",
        "Yinghao Aaron Li",
        "Adrian Nicolas Florea",
        "Cong Han",
        "N. Mesgarani"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is too early to conclude that Mamba is a better alternative to transformers for speech before comparing Mamba with transformers in terms of both performance and efficiency in multiple speech-related tasks, but it is argued that the superiority of Mamba or transformer depends on particular problems and models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}