{
    "acronym": "d24adcc7393b657d2542e2311cb680639a9cca66",
    "title": "An LLM-Enhanced Adversarial Editing System for Lexical Simplification",
    "seed_ids": [
        "gpt3",
        "bert",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "d24adcc7393b657d2542e2311cb680639a9cca66",
    "abstract": "Lexical Simplification (LS) aims to simplify text at the lexical level. Existing methods rely heavily on annotated data, making it challenging to apply in low-resource scenarios. In this paper, we propose a novel LS method without parallel corpora. This method employs an Adversarial Editing System with guidance from a confusion loss and an invariance loss to predict lexical edits in the original sentences. Meanwhile, we introduce an innovative LLM-enhanced loss to enable the distillation of knowledge from Large Language Models (LLMs) into a small-size LS system. From that, complex words within sentences are masked and a Difficulty-aware Filling module is crafted to replace masked positions with simpler words. At last, extensive experimental results and analyses on three benchmark LS datasets demonstrate the effectiveness of our proposed method.",
    "authors": [
        "Keren Tan",
        "Kangyang Luo",
        "Yunshi Lan",
        "Zheng Yuan",
        "Jinlong Shu"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a novel LS method without parallel corpora that employs an Adversarial Editing System with guidance from a confusion loss and an invariance loss to predict lexical edits in the original sentences and introduces an innovative LLM-enhanced loss to enable the distillation of knowledge from Large Language Models into a small-size LS system."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}