{
    "acronym": "d27669c82faf78ea08cceaa0a171b540cccc304d",
    "title": "ETC: Encoding Long and Structured Inputs in Transformers",
    "seed_ids": [
        "longformer",
        "reformer",
        "routingtransformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "2e14e84ccec924ed770b58108ad1d9de6f0ca295",
        "f6390beca54411b06f3bde424fb983a451789733",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "f4238bd2385a52413ccbacfd9e409a650235bd13",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0",
        "2a31319e73d4486716168b65cdf7559baeda18ce",
        "fb507ada871d1e8c29e376dbf7b7879689aa89f9"
    ],
    "s2id": "d27669c82faf78ea08cceaa0a171b540cccc304d",
    "abstract": "Transformer models have advanced the state of the art in many Natural Language Processing (NLP) tasks. In this paper, we present a new Transformer architecture, Extended Transformer Construction (ETC), that addresses two key challenges of standard Transformer architectures, namely scaling input length and encoding structured inputs. To scale attention to longer inputs, we introduce a novel global-local attention mechanism between global tokens and regular input tokens. We also show that combining global-local attention with relative position encodings and a Contrastive Predictive Coding (CPC) pre-training objective allows ETC to encode structured inputs. We achieve state-of-the-art results on four natural language datasets requiring long and/or structured inputs.",
    "authors": [
        "J. Ainslie",
        "Santiago Ontañón",
        "Chris Alberti",
        "V. Cvicek",
        "Zachary Kenneth Fisher",
        "Philip Pham",
        "Anirudh Ravula",
        "Sumit K. Sanghai",
        "Qifan Wang",
        "Li Yang"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new Transformer architecture, Extended Transformer Construction (ETC), is presented that addresses two key challenges of standard Transformer architectures, namely scaling input length and encoding structured inputs."
    },
    "citationCount": 311,
    "influentialCitationCount": 28,
    "code": null,
    "description": null,
    "url": null
}