{
    "acronym": "d3443072a79d9875f39989f7561688fab9dab590",
    "title": "Multitask-based Evaluation of Open-Source LLM on Software Vulnerability",
    "seed_ids": [
        "gpt",
        "0b0debb710366cdff461938c80763eace1651af6",
        "9ada8fa11b1cdece31f253acae50b62df8d5f823",
        "e37155d21818513bd40d64ee212099aac82bd6f8",
        "4b27f18bff43d605805c92696a979714ced0b805",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "0646bb09db4d1ba24150e69b71edcd4aff691b3c",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "7a15950dc71079285a4eaf195de5aadd87c41b40"
    ],
    "s2id": "d3443072a79d9875f39989f7561688fab9dab590",
    "abstract": "This paper proposes a pipeline for quantitatively evaluating interactive Large Language Models (LLMs) using publicly available datasets. We carry out an extensive technical evaluation of LLMs using Big-Vul covering four different common software vulnerability tasks. This evaluation assesses the multi-tasking capabilities of LLMs based on this dataset. We find that the existing state-of-the-art approaches and pre-trained Language Models (LMs) are generally superior to LLMs in software vulnerability detection. However, in software vulnerability assessment and location, certain LLMs (e.g., CodeLlama and WizardCoder) have demonstrated superior performance compared to pre-trained LMs, and providing more contextual information can enhance the vulnerability assessment capabilities of LLMs. Moreover, LLMs exhibit strong vulnerability description capabilities, but their tendency to produce excessive output significantly weakens their performance compared to pre-trained LMs. Overall, though LLMs perform well in some aspects, they still need improvement in understanding the subtle differences in code vulnerabilities and the ability to describe vulnerabilities to fully realize their potential. Our evaluation pipeline provides valuable insights into the capabilities of LLMs in handling software vulnerabilities.",
    "authors": [
        "Xin Yin",
        "Chao Ni",
        "Shaohua Wang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An extensive technical evaluation of LLMs using Big-Vul covering four different common software vulnerability tasks and a pipeline for quantitatively evaluating interactive Large Language Models using publicly available datasets is proposed, providing valuable insights into the capabilities of LLMs in handling software vulnerabilities."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}