{
    "acronym": "d3f387fa3cbfcb6255ac93786b6027eb86eba580",
    "title": "Gen-Z: Generative Zero-Shot Text Classification with Contextualized Label Descriptions",
    "seed_ids": [
        "gpt3",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d3f387fa3cbfcb6255ac93786b6027eb86eba580",
    "abstract": "Language model (LM) prompting--a popular paradigm for solving NLP tasks--has been shown to be susceptible to miscalibration and brittleness to slight prompt variations, caused by its discriminative prompting approach, i.e., predicting the label given the input. To address these issues, we propose Gen-Z--a generative prompting framework for zero-shot text classification. GEN-Z is generative, as it measures the LM likelihood of input text, conditioned on natural language descriptions of labels. The framework is multivariate, as label descriptions allow us to seamlessly integrate additional contextual information about the labels to improve task performance. On various standard classification benchmarks, with six open-source LM families, we show that zero-shot classification with simple contextualization of the data source of the evaluation set consistently outperforms both zero-shot and few-shot baselines while improving robustness to prompt variations. Further, our approach enables personalizing classification in a zero-shot manner by incorporating author, subject, or reader information in the label descriptions.",
    "authors": [
        "Sachin Kumar",
        "Chan Young Park",
        "Yulia Tsvetkov"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Gen-Z--a generative prompting framework for zero-shot text classification with simple contextualization of the data source of the evaluation set consistently outperforms both zero- shot and few-shot baselines while improving robustness to prompt variations."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}