{
    "acronym": "d3fb4911f1064890c265a6102224a14743c6e801",
    "title": "Hierarchical Identiﬁability in Multi-layer Sparse Matrix Factorization",
    "seed_ids": [
        "butterfly",
        "60ab170ae89f7a38798263f4a1fedabfc9ddd967"
    ],
    "s2id": "d3fb4911f1064890c265a6102224a14743c6e801",
    "abstract": ". Many well-known matrices Z are associated to fast transforms corresponding to factorizations of the form Z = X ( J ) . . . X (1) , where each factor X ( (cid:96) ) is sparse and possibly structured. This paper investigates essential uniqueness of such factorizations. Our ﬁrst main contribution is to prove that any N × N matrix having the so-called butterﬂy structure admits a unique factorization into J butterﬂy factors (where N = 2 J ), and that the factors can be recovered by a hierarchical factorization method. This contrasts with existing approaches which ﬁt the product of the butterﬂy factors to a given matrix via gradient descent. The proposed method can be applied in particular to retrieve the factorizations of the Hadamard or the Discrete Fourier Transform matrices of size 2 J . Computing such factorizations costs O ( N 2 ), which is of the order of dense matrix-vector multiplication, while the obtained factorizations enable fast O ( N log N ) matrix-vector multiplications. This hierarchical identiﬁability property relies on a simple identiﬁability condition in the two-layer and ﬁxed-support setting that was recently established. While the butterﬂy structure corresponds to a ﬁxed prescribed support for each factor, our second contribution is to obtain identiﬁability results with more general families of allowed sparsity patterns, taking into account permutation ambiguities when they are unavoidable. Typically, we show through the hierarchical paradigm that the butterﬂy factorization of the Discrete Fourier Transform matrix of size 2 J admits a unique sparse factorization into J factors, when enforcing only 2-sparsity by column and a block-diagonal structure on each factor.",
    "authors": [
        "Léon Zheng",
        "E. Riccietti",
        "R. Gribonval"
    ],
    "venue": "",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proves that any N × N matrix having the so-called butterﬂy structure admits a unique factorization into J butterﬂy factors, and that the factors can be recovered by a hierarchical factorization method, and applies the proposed method to retrieve the factorizations of the Hadamard or the Discrete Fourier Transform matrices of size 2 J."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}