{
    "acronym": "d4793bcb3fd92b9da9a62b15e0dc93f64e452578",
    "title": "Decoder-Only or Encoder-Decoder? Interpreting Language Model as a Regularized Encoder-Decoder",
    "seed_ids": [
        "gpt2",
        "memcompress",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "7ade458d52d2dfe997b8a617a6b524bda12a619d",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d4793bcb3fd92b9da9a62b15e0dc93f64e452578",
    "abstract": "The sequence-to-sequence (seq2seq) task aims at generating the target sequence based on the given input source sequence. Traditionally, most of the seq2seq task is resolved by the Encoder-Decoder framework which requires an encoder to encode the source sequence and a decoder to generate the target text. Recently, a bunch of new approaches have emerged that apply decoder-only language models directly to the seq2seq task. Despite the significant advancements in applying language models to the seq2seq task, there is still a lack of thorough analysis on the effectiveness of the decoder-only language model architecture. This paper aims to address this gap by conducting a detailed comparison between the encoder-decoder architecture and the decoder-only language model framework through the analysis of a regularized encoder-decoder structure. This structure is designed to replicate all behaviors in the classical decoder-only language model but has an encoder and a decoder making it easier to be compared with the classical encoder-decoder structure. Based on the analysis, we unveil the attention degeneration problem in the language model, namely, as the generation step number grows, less and less attention is focused on the source sequence. To give a quantitative understanding of this problem, we conduct a theoretical sensitivity analysis of the attention output with respect to the source input. Grounded on our analysis, we propose a novel partial attention language model to solve the attention degeneration problem. Experimental results on machine translation, summarization, and data-to-text generation tasks support our analysis and demonstrate the effectiveness of our proposed model.",
    "authors": [
        "Z. Fu",
        "W. Lam",
        "Qian Yu",
        "A. M. So",
        "Shengding Hu",
        "Zhiyuan Liu",
        "Nigel Collier"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes a novel partial attention language model to solve the attention degeneration problem in the decoder-only language model framework through the analysis of a regularized encoder-decoder structure that has an encoder and a decoder making it easier to be compared with the classical Encoder-Decoder structure."
    },
    "citationCount": 22,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}