{
    "acronym": "d4d7966a7b4dbf4cd764e443392d22826618a293",
    "title": "Cheaply Evaluating Inference Efficiency Metrics for Autoregressive Transformer APIs",
    "seed_ids": [
        "flashattn",
        "bb15f3727f827a3cb88b5d3ca48415c09b40a88f",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad"
    ],
    "s2id": "d4d7966a7b4dbf4cd764e443392d22826618a293",
    "abstract": "Large language models (LLMs) power many state-of-the-art systems in natural language processing. However, these models are extremely computationally expensive, even at inference time, raising the natural question: when is the extra cost of deploying a larger model worth the anticipated boost in capabilities? Better understanding this tradeoff fundamentally could benefit from an inference efficiency metric that is both (i) easily comparable across models from different providers, and (ii) representative of the true cost of running queries in an isolated performance environment. Unfortunately, access to LLMs today is largely restricted to black-box text generation APIs and raw runtimes measured through this interface do not satisfy these desiderata: model providers can apply various software and hardware optimizations orthogonal to the model, and models served on shared infrastructure are susceptible to performance contention. To circumvent these problems, we propose a new metric for comparing inference efficiency across models. This metric puts models on equal footing as though they were served (i) on uniform hardware and software, and (ii) without performance contention. We call this metric the \\emph{idealized runtime}, and we propose a methodology to efficiently estimate this metric for autoregressive Transformer models. We also propose cost-aware variants that incorporate the number of accelerators needed to serve the model. Using these metrics, we compare ten state-of-the-art LLMs to provide the first analysis of inference efficiency-capability tradeoffs; we make several observations from this analysis, including the fact that the superior inference runtime performance of certain APIs is often a byproduct of optimizations within the API rather than the underlying model. Our methodology also facilitates the efficient comparison of different software and hardware stacks.",
    "authors": [
        "D. Narayanan",
        "Keshav Santhanam",
        "Peter Henderson",
        "Rishi Bommasani",
        "Tony Lee",
        "Percy Liang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new metric for comparing inference efficiency across models is proposed, which puts models on equal footing as though they were served on uniform hardware and software, and without performance contention, and a methodology to efficiently estimate this metric is proposed for autoregressive Transformer models."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}