{
    "acronym": "d5054c990d628c0f9865e57ad80eb9e59d0d5318",
    "title": "Aligning Programming Language and Natural Language: Exploring Design Choices in Multi-Modal Transformer-Based Embedding for Bug Localization",
    "seed_ids": [
        "longformer",
        "49e65b12d8d11f2ccb5ddd7be72a8f746b2d1bc2",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "8659bf379ca8756755125a487c43cfe8611ce842"
    ],
    "s2id": "d5054c990d628c0f9865e57ad80eb9e59d0d5318",
    "abstract": "Bug localization refers to the identification of source code files which is in a programming language and also responsible for the unexpected behavior of software using the bug report, which is a natural language. As bug localization is labor-intensive, bug localization models are employed to assist software developers. Due to the domain difference between source code files and bug reports, modern bug-localization systems, based on deep learning models, rely heavily on embedding techniques that project bug reports and source code files into a shared vector space. The creation of an embedding involves several design choices, but the impact of these choices on the quality of embedding and the performance of bug localization models remains unexplained in current research. To address this gap, our study evaluated 14 distinct embedding models to gain insights into the effects of various design choices. Subsequently, we developed bug localization models utilizing these embedding models to assess the influence of these choices on the performance of the localization models. Our findings indicate that the pre-training strategies significantly affect the quality of the embedding. Moreover, we discovered that the familiarity of the embedding models with the data has a notable impact on the bug localization model's performance. Notably, when the training and testing data are collected from different projects, the performance of the bug localization models exhibits substantial fluctuations.",
    "authors": [
        "Partha Chakraborty",
        "Venkatraman Arumugam",
        "M. Nagappan"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is discovered that the familiarity of the embedding models with the data has a notable impact on the bug localization model's performance, and when the training and testing data are collected from different projects, the performance of the bug localization models exhibits substantial fluctuations."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}