{
    "acronym": "d53bb4209c37121f6bbebdb423d93a4a2cfe4e13",
    "title": "αVIL: Learning to Leverage Auxiliary Tasks for Multitask Learning",
    "seed_ids": [
        "bert",
        "d9f6ada77448664b71128bb19df15765336974a6"
    ],
    "s2id": "d53bb4209c37121f6bbebdb423d93a4a2cfe4e13",
    "abstract": "Multitask Learning is a Machine Learning paradigm that aims to train a range of (usually related) tasks with the help of a shared model. While the goal is often to improve the joint performance of all training tasks, another approach is to focus on the performance of a specific target task, while treating the remaining ones as auxiliary data from which to possibly leverage positive transfer towards the target during training. In such settings, it becomes important to estimate the positive or negative influence auxiliary tasks will have on the target. While many ways have been proposed to estimate task weights before or during training they typically rely on heuristics or extensive search of the weighting space. We propose a novel method called $\\alpha$-Variable Importance Learning ($\\alpha$VIL) that is able to adjust task weights dynamically during model training, by making direct use of task-specific updates of the underlying model's parameters between training epochs. Experiments indicate that $\\alpha$VIL is able to outperform other Multitask Learning approaches in a variety of settings. To our knowledge, this is the first attempt at making direct use of model updates for task weight estimation.",
    "authors": [
        "Rafael Kourdis",
        "Gabriel Gordon-Hall",
        "P. Gorinski"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel method called $\\alpha$-Variable Importance Learning ($\\alpha$VIL) is proposed that is able to adjust task weights dynamically during model training, by making direct use of task-specific updates of the underlying model's parameters between training epochs."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}