{
    "acronym": "d58c87575a4e00da93be0d63af568ac10532aab4",
    "title": "Token-Scaled Logit Distillation for Ternary Weight Generative Language Models",
    "seed_ids": [
        "gpt",
        "gpt2",
        "31b81d8cff7551537a12a1a133c100f131baaa11",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "e4f82c0a13cae6739239ae0c25a554b6daff35af",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8264257f573696fc0a1ef7531c825041832197f8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d58c87575a4e00da93be0d63af568ac10532aab4",
    "abstract": "Generative Language Models (GLMs) have shown impressive performance in tasks such as text generation, understanding, and reasoning. However, the large model size poses challenges for practical deployment. To solve this problem, Quantization-Aware Training (QAT) has become increasingly popular. However, current QAT methods for generative models have resulted in a noticeable loss of accuracy. To counteract this issue, we propose a novel knowledge distillation method specifically designed for GLMs. Our method, called token-scaled logit distillation, prevents overfitting and provides superior learning from the teacher model and ground truth. This research marks the first evaluation of ternary weight quantization-aware training of large-scale GLMs with less than 1.0 degradation in perplexity and no loss of accuracy in a reasoning task.",
    "authors": [
        "Minsoo Kim",
        "Sihwa Lee",
        "Janghwan Lee",
        "S. Hong",
        "Duhyeuk Chang",
        "Wonyong Sung",
        "Jungwook Choi"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This research marks the first evaluation of ternary weight quantization-aware training of large-scale GLMs with less than 1.0 degradation in perplexity and no loss of accuracy in a reasoning task."
    },
    "citationCount": 8,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}