{
    "acronym": "d599dc40c9cb8d6d76554ee7d21d20c22cc7cdb5",
    "title": "ConsistI2V: Enhancing Visual Consistency for Image-to-Video Generation",
    "seed_ids": [
        "roformer",
        "classfreediffu",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4"
    ],
    "s2id": "d599dc40c9cb8d6d76554ee7d21d20c22cc7cdb5",
    "abstract": "Image-to-video (I2V) generation aims to use the initial frame (alongside a text prompt) to create a video sequence. A grand challenge in I2V generation is to maintain visual consistency throughout the video: existing methods often struggle to preserve the integrity of the subject, background, and style from the first frame, as well as ensure a fluid and logical progression within the video narrative. To mitigate these issues, we propose ConsistI2V, a diffusion-based method to enhance visual consistency for I2V generation. Specifically, we introduce (1) spatiotemporal attention over the first frame to maintain spatial and motion consistency, (2) noise initialization from the low-frequency band of the first frame to enhance layout consistency. These two approaches enable ConsistI2V to generate highly consistent videos. We also extend the proposed approaches to show their potential to improve consistency in auto-regressive long video generation and camera motion control. To verify the effectiveness of our method, we propose I2V-Bench, a comprehensive evaluation benchmark for I2V generation. Our automatic and human evaluation results demonstrate the superiority of ConsistI2V over existing methods.",
    "authors": [
        "Weiming Ren",
        "Harry Yang",
        "Ge Zhang",
        "Cong Wei",
        "Xinrun Du",
        "Stephen W. Huang",
        "Wenhu Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes ConsistI2V, a diffusion-based method to enhance visual consistency for I2V generation that introduces spatiotemporal attention over the first frame to maintain spatial and motion consistency and noise initialization from the low-frequency band of the first frame to enhance layout consistency."
    },
    "citationCount": 18,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}