{
    "acronym": "d5e7c9eb41061be87d770cca7730f47d69a0cef7",
    "title": "LongBoX: Evaluating Transformers on Long-Sequence Clinical Tasks",
    "seed_ids": [
        "longt5",
        "68adb03744692247fb834406798894db9fe77010",
        "44279244407a64431810f982be6d0c7da4429dd7",
        "f30e95be411456a709e7cb9a8b3a3e557bd0356a",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "bf80051ca9ae1e76e2bdbdcf44df559e7eb73cb1",
        "7e9ff94476f41041c75e253e84f487db00e9c861"
    ],
    "s2id": "d5e7c9eb41061be87d770cca7730f47d69a0cef7",
    "abstract": "Many large language models (LLMs) for medicine have largely been evaluated on short texts, and their ability to handle longer sequences such as a complete electronic health record (EHR) has not been systematically explored. Assessing these models on long sequences is crucial since prior work in the general domain has demonstrated performance degradation of LLMs on longer texts. Motivated by this, we introduce LongBoX, a collection of seven medical datasets in text-to-text format, designed to investigate model performance on long sequences. Preliminary experiments reveal that both medical LLMs (e.g., BioGPT) and strong general domain LLMs (e.g., FLAN-T5) struggle on this benchmark. We further evaluate two techniques designed for long-sequence handling: (i) local-global attention, and (ii) Fusion-in-Decoder (FiD). Our results demonstrate mixed results with long-sequence handling - while scores on some datasets increase, there is substantial room for improvement. We hope that LongBoX facilitates the development of more effective long-sequence techniques for the medical domain. Data and source code are available at https://github.com/Mihir3009/LongBoX.",
    "authors": [
        "Mihir Parmar",
        "Aakanksha Naik",
        "Himanshu Gupta",
        "Disha Agrawal",
        "Chitta Baral"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "LongBoX is introduced, a collection of seven medical datasets in text-to-text format designed to investigate model performance on long sequences, and two techniques designed for long-sequence handling are evaluated: local-global attention and Fusion-in-Decoder (FiD)."
    },
    "citationCount": 3,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}