{
    "acronym": "d5f8cd232b66942afd985e963bc66030b8049510",
    "title": "Needle in the Haystack for Memory Based Large Language Models",
    "seed_ids": [
        "infiniti",
        "89d786457591d39091cf6ef4831f2bbd72698caf",
        "3fd5bc3077d04965eaa3498372c39bbdd09d55e4",
        "817f5a9504e59a6afc83cc745dff758f59e0b0a4",
        "60b35c6d68acced19b0c66edcfc0ee0a2c11efed",
        "168fc3525f7b97695a97b04e257ee9bd1e832acb",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "d5f8cd232b66942afd985e963bc66030b8049510",
    "abstract": "Current large language models (LLMs) often perform poorly on simple fact retrieval tasks. Here we investigate if coupling a dynamically adaptable external memory to a LLM can alleviate this problem. For this purpose, we test Larimar, a recently proposed language model architecture which uses an external associative memory, on long-context recall tasks including passkey and needle-in-the-haystack tests. We demonstrate that the external memory of Larimar, which allows fast write and read of an episode of text samples, can be used at test time to handle contexts much longer than those seen during training. We further show that the latent readouts from the memory (to which long contexts are written) control the decoder towards generating correct outputs, with the memory stored off of the GPU. Compared to existing transformer-based LLM architectures for long-context recall tasks that use larger parameter counts or modified attention mechanisms, a relatively smaller size Larimar is able to maintain strong performance without any task-specific training or training on longer contexts.",
    "authors": [
        "Elliot Nelson",
        "Georgios Kollias",
        "Payel Das",
        "Subhajit Chaudhury",
        "Soham Dan"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Larimar, a recently proposed language model architecture which uses an external associative memory, is tested on long-context recall tasks including passkey and needle-in-the-haystack tests and it is demonstrated that the external memory of Larimar can be used at test time to handle contexts much longer than those seen during training."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}