{
    "acronym": "d64b680530f6d921937978303fc3b1aba8e5d9ec",
    "title": "Studying the impacts of pre-training using ChatGPT-generated text on downstream tasks",
    "seed_ids": [
        "gpt2",
        "4e644dd3bd1faf77ad3a063a49b7d0bca8c80e9f",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "76a786b1acd6d1aca56e12a8a1db34569fdf9f3a",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "b3c73de96640ee858f83c3f0eda2a3d15d59b847",
        "5d22b241836e30d5b0d852b463951ab7e3245ea4",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ad7129af0644dbcafa9aa2f111cb76526ea444a1",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d64b680530f6d921937978303fc3b1aba8e5d9ec",
    "abstract": "In recent times, significant advancements have been witnessed in the field of language models, particularly with the emergence of Large Language Models (LLMs) that are trained on vast amounts of data extracted from internet archives. These LLMs, such as ChatGPT, have become widely accessible, allowing users to generate text for various purposes including articles, essays, jokes, and poetry. Given that LLMs are trained on a diverse range of text sources, encompassing platforms like Reddit and Twitter, it is foreseeable that future training datasets will also incorporate text generated by previous iterations of the models themselves. In light of this development, our research aims to investigate the influence of artificial text in the pre-training phase of language models. Specifically, we conducted a comparative analysis between a language model, RoBERTa, pre-trained using CNN/DailyMail news articles, and ChatGPT, which employed the same articles for its training and evaluated their performance on three downstream tasks as well as their potential gender bias, using sentiment analysis as a metric. Through a series of experiments, we demonstrate that the utilization of artificial text during pre-training does not have a significant impact on either the performance of the models in downstream tasks or their gender bias. In conclusion, our findings suggest that the inclusion of text generated by LLMs in their own pre-training process does not yield substantial effects on the subsequent performance of the models in downstream tasks or their potential gender bias.",
    "authors": [
        "Sarthak Anand"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is suggested that the inclusion of text generated by LLMs in their own pre-training process does not yield substantial effects on the subsequent performance of the models in downstream tasks or their potential gender bias."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}