{
    "acronym": "d668f557b922d0cac746c8ec82f7975f06ac906b",
    "title": "An Empirical Study of Mamba-based Language Models",
    "seed_ids": [
        "mamba",
        "jamba",
        "3dd6bc488283f1e4cc967d98a6a6c3d7f1a6cf76",
        "d8b51d518f2dd62943762ceaa8961d3b1bfbcc1a",
        "cbaf689fd9ea9bc939510019d90535d6249b3367",
        "d53fe76bd2795a19ddf52d012917782f6f6f2c1e",
        "9da427202cc48370fd66359f5d72ff5ff3bc8b57",
        "189fde3f4dfa105bb51472a8945618f395919560",
        "5e0cb1c4b91a7486e1c2b15a44a0be56bd74bdc0",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "0a067fab18c67d4a386efa846c080f8afff5e8f3",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ec307b17f193b14292206b65a1bcc95bfd8f02ed",
        "4e3935ef7da6bcbb202ec7f8b285c313cadcd044",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "d668f557b922d0cac746c8ec82f7975f06ac906b",
    "abstract": "Selective state-space models (SSMs) like Mamba overcome some of the shortcomings of Transformers, such as quadratic computational complexity with sequence length and large inference-time memory requirements from the key-value cache. Moreover, recent studies have shown that SSMs can match or exceed the language modeling capabilities of Transformers, making them an attractive alternative. In a controlled setting (e.g., same data), however, studies so far have only presented small scale experiments comparing SSMs to Transformers. To understand the strengths and weaknesses of these architectures at larger scales, we present a direct comparison between 8B-parameter Mamba, Mamba-2, and Transformer models trained on the same datasets of up to 3.5T tokens. We also compare these models to a hybrid architecture consisting of 43% Mamba-2, 7% attention, and 50% MLP layers (Mamba-2-Hybrid). Using a diverse set of tasks, we answer the question of whether Mamba models can match Transformers at larger training budgets. Our results show that while pure SSMs match or exceed Transformers on many tasks, they lag behind Transformers on tasks which require strong copying or in-context learning abilities (e.g., 5-shot MMLU, Phonebook) or long-context reasoning. In contrast, we find that the 8B Mamba-2-Hybrid exceeds the 8B Transformer on all 12 standard tasks we evaluated (+2.65 points on average) and is predicted to be up to 8x faster when generating tokens at inference time. To validate long-context capabilities, we provide additional experiments evaluating variants of the Mamba-2-Hybrid and Transformer extended to support 16K, 32K, and 128K sequences. On an additional 23 long-context tasks, the hybrid model continues to closely match or exceed the Transformer on average. To enable further study, we release the checkpoints as well as the code used to train our models as part of NVIDIA's Megatron-LM project.",
    "authors": [
        "R. Waleffe",
        "Wonmin Byeon",
        "Duncan Riach",
        "Brandon Norick",
        "V. Korthikanti",
        "Tri Dao",
        "Albert Gu",
        "Ali Hatamizadeh",
        "Sudhakar Singh",
        "Deepak Narayanan",
        "Garvit Kulshreshtha",
        "Vartika Singh",
        "Jared Casper",
        "Jan Kautz",
        "M. Shoeybi",
        "Bryan Catanzaro"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "While pure SSMs match or exceed Transformers on many tasks, they lag behind Transformers on tasks which require strong copying or in-context learning abilities or long-context reasoning, and it is found that the 8B Mamba-2-Hybrid exceeds the 8B Transformer on all 12 standard tasks evaluated."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}