{
    "acronym": "d66eae82b5776e8a5c023d00d78c3a0fd2c6630b",
    "title": "DDSNet: Deep Dual-Branch Networks for Surface Defect Segmentation",
    "seed_ids": [
        "metaformer"
    ],
    "s2id": "d66eae82b5776e8a5c023d00d78c3a0fd2c6630b",
    "abstract": "Semantic segmentation of surface defects is essential to ensure product quality in intelligent manufacturing. However, due to the diversity and complexity of industrial scenarios and defects, existing defect semantic segmentation methods still suffer from inconsistent intraclass and indistinguishable interclass segmentation results. To overcome these problems, we propose a new dual-branch surface defect semantic segmentation network, DDSNet. First, we integrate semantic and border information to enrich the feature representation of defects and solve the problem of indistinguishable interclass segmentation results. Next, we introduce a global and local feature fusion (GLF) module based on similarity metrics to guide the network in further refining and highlighting the detail feature on defects to solve the problem of inconsistent intraclass segmentation results. In addition, to enrich the surface defect segmentation datasets, we collect datasets of steel foil surface defects, Ste-Seg, and aluminum block surface defects, Alu-Seg. Experimental results for five datasets of semantic segmentation of defects show that DDSNet outperforms the state-of-the-art methods in terms of mIoU (NEU-Seg: 85.12%, MT-Defect: 76.51%, MSD: 91.82%, Ste-Seg: 90.01%, and Alu-Seg: 84.77%). All our experiments were conducted on a NVIDIA GTX 3060Ti. The dataset and code are available at https://github.com/QinLi-STUDY/DDSNet.",
    "authors": [
        "Zhenyu Yin",
        "Li Qin",
        "Guangjie Han",
        "Xiaoqiang Shi",
        "Feiqing Zhang",
        "Guangyuan Xu",
        "Yuanguo Bi"
    ],
    "venue": "IEEE Transactions on Instrumentation and Measurement",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new dual-branch surface defect semantic segmentation network, DDSNet, is proposed that outperforms the state-of-the-art methods in terms of mIoU and introduces a global and local feature fusion (GLF) module based on similarity metrics to guide the network in further refining and highlighting the detail feature on defects."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}