{
    "acronym": "d6c0b747bc7968e8b4ebf3671b606a72c442c178",
    "title": "Advancing Graph Convolutional Networks via General Spectral Wavelets",
    "seed_ids": [
        "transformer",
        "59b7448f816908cfb49a2ab5e63b2fa5786387f7",
        "277dd73bfeb5c46513ce305136b0e71fcd2a311c",
        "8cef9900c04d7f661c08f4b5b1ed4337ace042a3"
    ],
    "s2id": "d6c0b747bc7968e8b4ebf3671b606a72c442c178",
    "abstract": "Spectral graph convolution, an important tool of data filtering on graphs, relies on two essential decisions; selecting spectral bases for signal transformation and parameterizing the kernel for frequency analysis. While recent techniques mainly focus on standard Fourier transform and vector-valued spectral functions, they fall short in flexibility to describe specific signal distribution for each node, and expressivity of spectral function. In this paper, we present a novel wavelet-based graph convolution network, namely WaveGC, which integrates multi-resolution spectral bases and a matrix-valued filter kernel. Theoretically, we establish that WaveGC can effectively capture and decouple short-range and long-range information, providing superior filtering flexibility, surpassing existing graph convolutional networks and graph Transformers (GTs). To instantiate WaveGC, we introduce a novel technique for learning general graph wavelets by separately combining odd and even terms of Chebyshev polynomials. This approach strictly satisfies wavelet admissibility criteria. Our numerical experiments showcase the capabilities of the new network. By replacing the Transformer part in existing architectures with WaveGC, we consistently observe improvements in both short-range and long-range tasks. This underscores the effectiveness of the proposed model in handling different scenarios. Our code is available at https://github.com/liun-online/WaveGC.",
    "authors": [
        "Nian Liu",
        "Xiaoxin He",
        "T. Laurent",
        "Francesco Di Giovanni",
        "Michael M. Bronstein",
        "Xavier Bresson"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel wavelet-based graph convolution network, namely WaveGC, which integrates multi-resolution spectral bases and a matrix-valued filter kernel, providing superior filtering flexibility, surpassing existing graph convolutional networks and graph Transformers (GTs)."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}