{
    "acronym": "d702194616ca9c0f28dd05815fc30c353eddd594",
    "title": "Misuse of large language models: Exploiting weaknesses for target-specific outputs",
    "seed_ids": [
        "transformer",
        "d62c4d00b277e948956b6610ce2644e88fe1577b",
        "da1d6445b6b64ce9eb4587ba8abbdc490f648ec1"
    ],
    "s2id": "d702194616ca9c0f28dd05815fc30c353eddd594",
    "abstract": "Prompt engineering in large language models (LLMs) in combination with external context can be misused for jailbreaks in order to generate malicious outputs. In the process, jailbreak prompts are apparently amplified in such a way that LLMs can generate malicious outputs on a large scale despite their initial training. As social bots, these can contribute to the dissemination of misinformation, hate speech, and discriminatory content. Using GPT4-x-Vicuna-13b-4bit from NousResearch, we demonstrate in this article the effectiveness of jailbreak prompts and external contexts via Jupyter Notebook based on the Python programming language. In addition, we highlight the methodological foundations of prompt engineering and its potential to create malicious content in order to sensitize researchers, practitioners, and policymakers to the importance of responsible development and deployment of LLMs.",
    "authors": [
        "Dennis Klinkhammer"
    ],
    "venue": "TATuP Zeitschrift für Technikfolgenabschätzung in Theorie und Praxis",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The effectiveness of jailbreak prompts and external contexts via Jupyter Notebook based on the Python programming language is demonstrated and the methodological foundations of prompt engineering and its potential to create malicious content are highlighted to sensitize researchers, practitioners, and policymakers to the importance of responsible development and deployment of LLMs."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}