{
    "acronym": "d70a1f45665fcef448ce4daedeac34f5f4befaa2",
    "title": "On the Role of Entity and Event Level Conceptualization in Generalizable Reasoning: A Survey of Tasks, Methods, Applications, and Future Directions",
    "seed_ids": [
        "gpt3",
        "b842b83a7ff5dff8e3b83915d8c15423b6085728",
        "5aec6865043cb7c7f281699ae95652e0ff680f09",
        "fa21e97718ca94d8967521e22aa3f18e19582faa",
        "11396462f5f5d709ac84ac2a44a1e5f9fba2dacb",
        "5d7a7dfcc73d2d245b9eb3662e9f4e390b2486db",
        "12daedd80a4f860960c5b50314d09d6827f4fd4a",
        "5d733042a5185a97eb80e4c665eaeaf71f9d1bba",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d70a1f45665fcef448ce4daedeac34f5f4befaa2",
    "abstract": "Entity- and event-level conceptualization, as fundamental elements of human cognition, plays a pivotal role in generalizable reasoning. This process involves abstracting specific instances into higher-level concepts and forming abstract knowledge that can be applied in unfamiliar or novel situations, which can enhance models' inferential capabilities and support the effective transfer of knowledge across various domains. Despite its significance, there is currently a lack of a systematic overview that comprehensively examines existing works in the definition, execution, and application of conceptualization to enhance reasoning tasks. In this paper, we address this gap by presenting the first comprehensive survey of 150+ papers, categorizing various definitions, resources, methods, and downstream applications related to conceptualization into a unified taxonomy, with a focus on the entity and event levels. Furthermore, we shed light on potential future directions in this field and hope to garner more attention from the community.",
    "authors": [
        "Weiqi Wang",
        "Tianqing Fang",
        "Haochen Shi",
        "Baixuan Xu",
        "Wenxuan Ding",
        "Liyu Zhang",
        "Wei Fan",
        "Jiaxin Bai",
        "Haoran Li",
        "Xin Liu",
        "Yangqiu Song"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper presents the first comprehensive survey of 150+ papers, categorizing various definitions, resources, methods, and downstream applications related to conceptualization into a unified taxonomy, with a focus on the entity and event levels."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}