{
    "acronym": "d77942dde428c5a7dfe0b7991f4cbdc5d1f1f42d",
    "title": "Less than One-shot: Named Entity Recognition via Extremely Weak Supervision",
    "seed_ids": [
        "gpt2",
        "15a6ae89b2bc959d4a5b48a8ce590526b50f1c98",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d77942dde428c5a7dfe0b7991f4cbdc5d1f1f42d",
    "abstract": "We study the named entity recognition (NER) problem under the extremely weak supervision (XWS) setting, where only one example entity per type is given in a context-free way. While one can see that XWS is lighter than one-shot in terms of the amount of supervision, we propose a novel method X-NER that can outperform the state-of-the-art one-shot NER methods. We first mine entity spans that are similar to the example entities from an unlabelled training corpus. Instead of utilizing entity span representations from language models, we find it more effective to compare the context distributions before and after the span is replaced by the entity example. We then leverage the top-ranked spans as pseudo-labels to train an NER tagger. Extensive experiments and analyses on 4 NER datasets show the superior end-to-end NER performance of X-NER, outperforming the state-of-the-art few-shot methods with 1-shot supervision and ChatGPT annotations significantly. Finally, our X-NER possesses several notable properties, such as inheriting the cross-lingual abilities of the underlying language models.",
    "authors": [
        "Letian Peng",
        "Zihan Wang",
        "Jingbo Shang"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel method X-NER is proposed that can outperform the state-of-the-art one-shot NER methods, and possesses several notable properties, such as inheriting the cross-lingual abilities of the underlying language models."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}