{
    "acronym": "d7a7f9e95465abfb35b51b120644db71c935c307",
    "title": "Self-explaining Hierarchical Model for Intraoperative Time Series",
    "seed_ids": [
        "performer",
        "0d508600d77d8a7e6a655cdb6d139779732f649f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d"
    ],
    "s2id": "d7a7f9e95465abfb35b51b120644db71c935c307",
    "abstract": "Major postoperative complications are devastating to surgical patients. Some of these complications are potentially preventable via early predictions based on intraoperative data. However, intraoperative data comprise long and fine-grained multivariate time series, prohibiting the effective learning of accurate models. The large gaps associated with clinical events and protocols are usually ignored. Moreover, deep models generally lack transparency. Nevertheless, the interpretability is crucial to assist clinicians in planning for and delivering postoperative care and timely interventions. Towards this end, we propose a hierarchical model combining the strength of both attention and recurrent models for intraoperative time series. We further develop an explanation module for the hierarchical model to interpret the predictions by providing contributions of intraoperative data in a fine-grained manner. Experiments on a large dataset of 111,888 surgeries with multiple outcomes and an external high-resolution ICU dataset show that our model can achieve strong predictive performance (i.e., high accuracy) and offer robust interpretations (i.e., high transparency) for predicted outcomes based on intraoperative time series.",
    "authors": [
        "Dingwen Li",
        "Bing Xue",
        "C. King",
        "Bradley A. Fritz",
        "M. Avidan",
        "Joanna Abraham",
        "Chenyang Lu"
    ],
    "venue": "Industrial Conference on Data Mining",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a hierarchical model combining the strength of both attention and recurrent models for intraoperative time series and develops an explanation module for the hierarchical model to interpret the predictions by providing contributions of intraoperative data in a fine-grained manner."
    },
    "citationCount": 2,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}