{
    "acronym": "d7f13d33c36c2b41d80914766c123b4fc06a2960",
    "title": "Alzheimer's Disease Detection Using Acoustic And Linguistic Features",
    "seed_ids": [
        "transformerxl",
        "228896a28b18ef3ad956dd8000b5ea3b8a0bfd7e",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef"
    ],
    "s2id": "d7f13d33c36c2b41d80914766c123b4fc06a2960",
    "abstract": "Alzheimer's is a neurodegenerative syndrome that leads to cognitive decline, behavior disorder, and incoherent or illogical thoughts and speech. There is currently no cure for Alzheimer's disease. However if diagnosed early and treated in time, its progression can be slowed down. Therefore, automatic detection with high accuracy is of the essence. In this work, we propose an approach to detect Alzheimer's based on spontaneous speech. We investigate the possibility of using each acoustic and linguistic modality, and finally employ modal fusion to increase the accuracy. The results show that the language model is superior to the acoustic model in dementia detection, and acoustic and linguistic features can provide complementary information. The best result is from the ensemble of the acoustic model and the language model, with an accuracy of 87.5% on the INTERSPEECH 2020 ADReSS Challenge dataset.",
    "authors": [
        "Hongshun Deng",
        "Hongqing Liu",
        "Yi Zhou",
        "Gan Lu"
    ],
    "venue": "2022 IEEE 24th Int Conf on High Performance Computing & Communications; 8th Int Conf on Data Science & Systems; 20th Int Conf on Smart City; 8th Int Conf on Dependability in Sensor, Cloud & Big Data Systems & Application (HPCC/DSS/SmartCity/DependSys)",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes an approach to detect Alzheimer's based on spontaneous speech by investigating the possibility of using each acoustic and linguistic modality, and employing modal fusion to increase the accuracy."
    },
    "citationCount": 1,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}