{
    "acronym": "d85d9531cc749b46ec6c2e59d58b1edd17669d0e",
    "title": "VividDreamer: Invariant Score Distillation For Hyper-Realistic Text-to-3D Generation",
    "seed_ids": [
        "classfreediffu",
        "2078ff863ad47339d4cf1a167c2ea63da260f127",
        "4e21879b564cc2e803b16edf0dda9f1edb91b497",
        "85a70c0a048cba4f53dcf332ee73f6032a2e53bc",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "d85d9531cc749b46ec6c2e59d58b1edd17669d0e",
    "abstract": "This paper presents Invariant Score Distillation (ISD), a novel method for high-fidelity text-to-3D generation. ISD aims to tackle the over-saturation and over-smoothing problems in Score Distillation Sampling (SDS). In this paper, SDS is decoupled into a weighted sum of two components: the reconstruction term and the classifier-free guidance term. We experimentally found that over-saturation stems from the large classifier-free guidance scale and over-smoothing comes from the reconstruction term. To overcome these problems, ISD utilizes an invariant score term derived from DDIM sampling to replace the reconstruction term in SDS. This operation allows the utilization of a medium classifier-free guidance scale and mitigates the reconstruction-related errors, thus preventing the over-smoothing and over-saturation of results. Extensive experiments demonstrate that our method greatly enhances SDS and produces realistic 3D objects through single-stage optimization.",
    "authors": [
        "Wenjie Zhuo",
        "Fan Ma",
        "Hehe Fan",
        "Yi Yang"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Invariant Score Distillation is presented, a novel method for high-fidelity text-to-3D generation that utilizes an invariant score term derived from DDIM sampling to replace the reconstruction term in SDS and greatly enhances SDS and produces realistic 3D objects through single-stage optimization."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}