{
    "acronym": "d899e26d0e7c0ffcf6149fb21e6561c613f97a10",
    "title": "Transformers are Provably Optimal In-context Estimators for Wireless Communications",
    "seed_ids": [
        "gpt2",
        "f5e9337477d7a9eb6267d0310549fdefafbb7fe2",
        "525d93a382f6e7873b5d8a2e0713eb3dff7fb250",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d899e26d0e7c0ffcf6149fb21e6561c613f97a10",
    "abstract": "Pre-trained transformers exhibit the capability of adapting to new tasks through in-context learning (ICL), where they efficiently utilize a limited set of prompts without explicit model optimization. The canonical communication problem of estimating transmitted symbols from received observations can be modelled as an in-context learning problem: Received observations are essentially a noisy function of transmitted symbols, and this function can be represented by an unknown parameter whose statistics depend on an (also unknown) latent context. This problem, which we term in-context estimation (ICE), has significantly greater complexity than the extensively studied linear regression problem. The optimal solution to the ICE problem is a non-linear function of the underlying context. In this paper, we prove that, for a subclass of such problems, a single layer softmax attention transformer (SAT) computes the optimal solution of the above estimation problem in the limit of large prompt length. We also prove that the optimal configuration of such transformer is indeed the minimizer of the corresponding training loss. Further, we empirically demonstrate the proficiency of multi-layer transformers in efficiently solving broader in-context estimation problems. Through extensive simulations, we show that solving ICE problems using transformers significantly outperforms standard approaches. Moreover, just with a few context examples, it achieves the same performance as an estimator with perfect knowledge of the latent context.",
    "authors": [
        "Vishnu Teja Kunde",
        "Vicram Rajagopalan",
        "Chandra Shekhara Kaushik Valmeekam",
        "Krishna Narayanan",
        "S. Shakkottai",
        "D. Kalathil",
        "J. Chamberland"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proves that, for a subclass of in-context estimation problems, a single layer softmax attention transformer (SAT) computes the optimal solution of the above estimation problem in the limit of large prompt length, and proves that the optimal configuration of such transformer is indeed the minimizer of the corresponding training loss."
    },
    "citationCount": 4,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}