{
    "acronym": "d96bfe79014861c62b54103da38baa71d77f717e",
    "title": "Pretrained Embeddings for Stance Detection with Hierarchical Capsule Network on Social Media",
    "seed_ids": [
        "gpt",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "f392f8c05692b49d3294be28f50c3fede9820f46",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d96bfe79014861c62b54103da38baa71d77f717e",
    "abstract": "Stance detection on social media aims to identify the stance of social media users toward a topic or claim, which can provide powerful information for various downstream tasks. Many existing stance detection approaches neglect to model the deep semantic representation information in tweets and do not explore aggregating the hierarchical features among words, thus degrading performance. To address these issues, this article proposes a novel deep learning approach Pretrained Embeddings for Stance Detection with Hierarchical Capsule Network (PE-HCN) without complicated preprocessing. Specifically, PE-HCN first adopts a pretrained language model and then uses a related textual entailment task for fine-tuning to obtain the deep textual representations of tweets. The PE-HCN approach extends the dynamic routing scheme to cope with these deep textual representations by utilizing primary capsules for routing the information among words in each tweet and applying secondary capsules to transmit the aggregated features to each category capsule accordingly. Moreover, to improve the confidences of the category capsules, we design an adaptive feedback mechanism to dynamically strengthen the routing signals. Through experiments on three benchmark datasets, compared with the state-of-the-art baselines, the extensive results exhibit that PE-HCN achieves competitive improvements of up to 6.32%, 2.09%, and 1.8%, respectively.",
    "authors": [
        "Guangzhen Zhao",
        "Peng Yang"
    ],
    "venue": "ACM Trans. Inf. Syst.",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Stance detection on social media aims to identify the stance of social media users toward a topic or claim, which can provide powerful information for various downstream tasks."
    },
    "citationCount": 16,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}