{
    "acronym": "d98b5c1d0f9a4e39dc79ea7a3f74e54789df5e13",
    "title": "Structured State Space Models for In-Context Reinforcement Learning",
    "seed_ids": [
        "s4",
        "s5",
        "bfe6fd05f09647b001c7eb6e333a95c881c88344",
        "860bc4f071f35d6d8529a52c2c1858d030779a6a",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "59a916cdc943f0282908e6f3fa0360f4c5fb78d0"
    ],
    "s2id": "d98b5c1d0f9a4e39dc79ea7a3f74e54789df5e13",
    "abstract": "Structured state space sequence (S4) models have recently achieved state-of-the-art performance on long-range sequence modeling tasks. These models also have fast inference speeds and parallelisable training, making them potentially useful in many reinforcement learning settings. We propose a modification to a variant of S4 that enables us to initialise and reset the hidden state in parallel, allowing us to tackle reinforcement learning tasks. We show that our modified architecture runs asymptotically faster than Transformers in sequence length and performs better than RNN's on a simple memory-based task. We evaluate our modified architecture on a set of partially-observable environments and find that, in practice, our model outperforms RNN's while also running over five times faster. Then, by leveraging the model's ability to handle long-range sequences, we achieve strong performance on a challenging meta-learning task in which the agent is given a randomly-sampled continuous control environment, combined with a randomly-sampled linear projection of the environment's observations and actions. Furthermore, we show the resulting model can adapt to out-of-distribution held-out tasks. Overall, the results presented in this paper show that structured state space models are fast and performant for in-context reinforcement learning tasks. We provide code at https://github.com/luchris429/popjaxrl.",
    "authors": [
        "Chris Xiaoxuan Lu",
        "Yannick Schroecker",
        "Albert Gu",
        "Emilio Parisotto",
        "J. Foerster",
        "Satinder Singh",
        "Feryal M. P. Behbahani"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results presented in this paper show that structured state space models are fast and performant for in-context reinforcement learning tasks."
    },
    "citationCount": 46,
    "influentialCitationCount": 6,
    "code": null,
    "description": null,
    "url": null
}