{
    "acronym": "d9964ab436eefd21f923a4bc833c6b66692c7f00",
    "title": "RecurrentGPT: Interactive Generation of (Arbitrarily) Long Text",
    "seed_ids": [
        "rmt",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "c7c6d338e47b236edea76790d2997333f497319e",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "94846f838853539e2ddf9440c09342cdb5b7a2c9",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "d9964ab436eefd21f923a4bc833c6b66692c7f00",
    "abstract": "The fixed-size context of Transformer makes GPT models incapable of generating arbitrarily long text. In this paper, we introduce RecurrentGPT, a language-based simulacrum of the recurrence mechanism in RNNs. RecurrentGPT is built upon a large language model (LLM) such as ChatGPT and uses natural language to simulate the Long Short-Term Memory mechanism in an LSTM. At each timestep, RecurrentGPT generates a paragraph of text and updates its language-based long-short term memory stored on the hard drive and the prompt, respectively. This recurrence mechanism enables RecurrentGPT to generate texts of arbitrary length without forgetting. Since human users can easily observe and edit the natural language memories, RecurrentGPT is interpretable and enables interactive generation of long text. RecurrentGPT is an initial step towards next-generation computer-assisted writing systems beyond local editing suggestions. In addition to producing AI-generated content (AIGC), we also demonstrate the possibility of using RecurrentGPT as an interactive fiction that directly interacts with consumers. We call this usage of generative models by ``AI As Contents'' (AIAC), which we believe is the next form of conventional AIGC. We further demonstrate the possibility of using RecurrentGPT to create personalized interactive fiction that directly interacts with readers instead of interacting with writers. More broadly, RecurrentGPT demonstrates the utility of borrowing ideas from popular model designs in cognitive science and deep learning for prompting LLMs. Our code is available at https://github.com/aiwaves-cn/RecurrentGPT and an online demo is available at https://www.aiwaves.org/recurrentgpt.",
    "authors": [
        "Wangchunshu Zhou",
        "Yuchen Jiang",
        "Peng Cui",
        "Tiannan Wang",
        "Zhenxin Xiao",
        "Yifan Hou",
        "Ryan Cotterell",
        "Mrinmaya Sachan"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "RecurrentGPT is a language-based simulacrum of the recurrence mechanism in RNNs that uses natural language to simulate the Long Short-Term Memory mechanism in an LSTM and demonstrates the utility of borrowing ideas from popular model designs in cognitive science and deep learning for prompting LLMs."
    },
    "citationCount": 34,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}