{
    "acronym": "d9d3df9aa6ee2cfea2ea02831b0de5d9204648cd",
    "title": "Collaborative Attention Guided Multi-Scale Feature Fusion Network for Medical Image Segmentation",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "d9d3df9aa6ee2cfea2ea02831b0de5d9204648cd",
    "abstract": "Medical image segmentation is an important and complex task in clinical practices, but the widely used U-Net usually cannot achieve satisfactory performances in some clinical challenging cases. Therefore, some advanced variants of U-Net are proposed using multi-scale and attention mechanisms. Different from the existing works where multi-scale and attention are usually used independently, in this work, we integrate them together and propose a collaborative attention guided multi-scale feature fusion with enhanced convolution based U-Net (EC-CaM-UNet) model for more accurate medical image segmentation, where a novel collaborative attention guided multi-scale feature fusion (CoAG-MuSFu) module is proposed to highlight important (but small and unremarkable) multi-scale features and suppress irrelevant ones in model learning. Specifically, CoAG-MuSF uses a multi-dimensional collaborative attention (CoA) block to estimate the local and global self-attention, which is then deeply fused with the multi-scale feature maps generated by a multi-scale (MuS) block to better highlight the important multi-scale features and suppress the irrelevant ones. Furthermore, an additional supervision path and enhanced convolution blocks are used to enhance the deep model's feature learning ability in both deep and shallow features, respectively. Experimental results on three public medical image datasets show that EC-CaM-UNet greatly outperforms the state-of-the-art medical image segmentation baselines. The codes will be released after acceptance.",
    "authors": [
        "Zhenghua Xu",
        "Biao Tian",
        "Shijie Liu",
        "Xiang-Fei Wang",
        "Di Yuan",
        "Junhua Gu",
        "Junyang Chen",
        "Thomas Lukasiewicz",
        "Victor C. M. Leung"
    ],
    "venue": "IEEE Transactions on Network Science and Engineering",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Experimental results show that EC-CaM-UNet greatly outperforms the state-of-the-art medical image segmentation baselines and an additional supervision path and enhanced convolution blocks are used to enhance the deep model's feature learning ability in both deep and shallow features, respectively."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}