{
    "acronym": "da0d8f8b9e039f907ce5edb47c545dfe3e0df4f4",
    "title": "Explaining pretrained language models' understanding of linguistic structures using construction grammar",
    "seed_ids": [
        "gpt2",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "5a2263092f49540fd0e049050a96882ff29b00c3",
        "e2587eddd57bc4ba286d91b27c185083f16f40ee",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "da0d8f8b9e039f907ce5edb47c545dfe3e0df4f4",
    "abstract": "Construction Grammar (CxG) is a paradigm from cognitive linguistics emphasizing the connection between syntax and semantics. Rather than rules that operate on lexical items, it posits constructions as the central building blocks of language, i.e., linguistic units of different granularity that combine syntax and semantics. As a first step toward assessing the compatibility of CxG with the syntactic and semantic knowledge demonstrated by state-of-the-art pretrained language models (PLMs), we present an investigation of their capability to classify and understand one of the most commonly studied constructions, the English comparative correlative (CC). We conduct experiments examining the classification accuracy of a syntactic probe on the one hand and the models' behavior in a semantic application task on the other, with BERT, RoBERTa, and DeBERTa as the example PLMs. Our results show that all three investigated PLMs, as well as OPT, are able to recognize the structure of the CC but fail to use its meaning. While human-like performance of PLMs on many NLP tasks has been alleged, this indicates that PLMs still suffer from substantial shortcomings in central domains of linguistic knowledge.",
    "authors": [
        "Leonie Weissweiler",
        "Valentin Hofmann",
        "Abdullatif Köksal",
        "Hinrich Schütze"
    ],
    "venue": "Frontiers Artif. Intell.",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An investigation of PLMs' capability to classify and understand one of the most commonly studied constructions, the English comparative correlative, shows that all three investigated PLMs, as well as OPT, are able to recognize the structure of the CC but fail to use its meaning."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}