{
    "acronym": "da18398274bec87d3568acfd6aba6977be7ba6b8",
    "title": "Transferability in Deep Learning: A Survey",
    "seed_ids": [
        "gpt",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "1c1a69d5b4aba343515c69464e4fc8da969ac61e",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc"
    ],
    "s2id": "da18398274bec87d3568acfd6aba6977be7ba6b8",
    "abstract": "The success of deep learning algorithms generally depends on large-scale data, while humans appear to have inherent ability of knowledge transfer, by recognizing and applying relevant knowledge from previous learning experiences when encountering and solving unseen tasks. Such an ability to acquire and reuse knowledge is known as transferability in deep learning. It has formed the long-term quest towards making deep learning as data-efficient as human learning, and has been motivating fruitful design of more powerful deep learning algorithms. We present this survey to connect different isolated areas in deep learning with their relation to transferability, and to provide a unified and complete view to investigating transferability through the whole lifecycle of deep learning. The survey elaborates the fundamental goals and challenges in parallel with the core principles and methods, covering recent cornerstones in deep architectures, pre-training, task adaptation and domain adaptation. This highlights unanswered questions on the appropriate objectives for learning transferable knowledge and for adapting the knowledge to new tasks and domains, avoiding catastrophic forgetting and negative transfer. Finally, we implement a benchmark and an open-source library, enabling a fair evaluation of deep learning methods in terms of transferability.",
    "authors": [
        "Junguang Jiang",
        "Yang Shu",
        "Jianmin Wang",
        "Mingsheng Long"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey connects different isolated areas in deep learning with their relation to transferability, and provides a unified and complete view to investigating transferability through the whole lifecycle of deep learning."
    },
    "citationCount": 79,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}