{
    "acronym": "da3933baa7d6f340acdb932ed722878d8477b47b",
    "title": "A General Purpose Neural Architecture for Geospatial Systems",
    "seed_ids": [
        "perceiverio"
    ],
    "s2id": "da3933baa7d6f340acdb932ed722878d8477b47b",
    "abstract": "Geospatial Information Systems are used by researchers and Humanitarian Assistance and Disaster Response (HADR) practitioners to support a wide variety of important applications. However, collaboration between these actors is difficult due to the heterogeneous nature of geospatial data modalities (e.g., multi-spectral images of various resolutions, timeseries, weather data) and diversity of tasks (e.g., regression of human activity indicators or detecting forest fires). In this work, we present a roadmap towards the construction of a general-purpose neural architecture (GPNA) with a geospatial inductive bias, pre-trained on large amounts of unlabelled earth observation data in a self-supervised manner. We envision how such a model may facilitate cooperation between members of the community. We show preliminary results on the first step of the roadmap, where we instantiate an architecture that can process a wide variety of geospatial data modalities and demonstrate that it can achieve competitive performance with domain-specific architectures on tasks relating to the U.N.'s Sustainable Development Goals.",
    "authors": [
        "Nasim Rahaman",
        "Martin Weiss",
        "Frederik Trauble",
        "Francesco Locatello",
        "Alexandre Lacoste",
        "Y. Bengio",
        "C. Pal",
        "Li Erran Li",
        "B. Scholkopf"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents a roadmap towards the construction of a general-purpose neural architecture (GPNA) with a geospatial inductive bias, pre-trained on large amounts of unlabelled earth observation data in a self-supervised manner and envision how such a model may facilitate cooperation between members of the community."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}