{
    "acronym": "da9178eae82d1ca5492aaecd0151ba49481cb8b1",
    "title": "Dual-path Mamba: Short and Long-term Bidirectional Selective Structured State Space Models for Speech Separation",
    "seed_ids": [
        "mamba",
        "319762c8841f8e1e413642bc551ed748add4777b",
        "b9646f057887825d7471ec01664494b0b7ca5a83",
        "21ddc4fc3551619b8a64db6ae124acc72aaae2c2",
        "1df04f33a8ef313cc2067147dbb79c3ca7c5c99f",
        "38c48a1cd296d16dc9c56717495d6e44cc354444",
        "95d6d5ecb6ec57cf913e955107070496450cfd4c",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2"
    ],
    "s2id": "da9178eae82d1ca5492aaecd0151ba49481cb8b1",
    "abstract": "Transformers have been the most successful architecture for various speech modeling tasks, including speech separation. However, the self-attention mechanism in transformers with quadratic complexity is inefficient in computation and memory. Recent models incorporate new layers and modules along with transformers for better performance but also introduce extra model complexity. In this work, we replace transformers with Mamba, a selective state space model, for speech separation. We propose dual-path Mamba, which models short-term and long-term forward and backward dependency of speech signals using selective state spaces. Our experimental results on the WSJ0-2mix data show that our dual-path Mamba models of comparably smaller sizes outperform state-of-the-art RNN model DPRNN, CNN model WaveSplit, and transformer model Sepformer. Code: https://github.com/xi-j/Mamba-TasNet",
    "authors": [
        "Xilin Jiang",
        "Cong Han",
        "N. Mesgarani"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work replaces transformers with Mamba, a selective state space model, for speech separation, which models short-term and long-term forward and backward dependency of speech signals using selective state spaces."
    },
    "citationCount": 13,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}