{
    "acronym": "da95808017755e3e869f7bb71eb1582d119ce6a5",
    "title": "On Difficulties of Attention Factorization through Shared Memory",
    "seed_ids": [
        "luna",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "53c3940f35b8b45d55ed49056282e1961954513d",
        "af679d69fcc1d0fcf0f039aba937853bcb50a8de",
        "b3bf9fe13195e9aa70e1dac04e01fcff7008e812",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "67ee20536c30a225b86902af2f091e28e5e19b40"
    ],
    "s2id": "da95808017755e3e869f7bb71eb1582d119ce6a5",
    "abstract": "Transformers have revolutionized deep learning in numerous fields, including natural language processing, computer vision, and audio processing. Their strength lies in their attention mechanism, which allows for the discovering of complex input relationships. However, this mechanism's quadratic time and memory complexity pose challenges for larger inputs. Researchers are now investigating models like Linear Unified Nested Attention (Luna) or Memory Augmented Transformer, which leverage external learnable memory to either reduce the attention computation complexity down to linear, or to propagate information between chunks in chunk-wise processing. Our findings challenge the conventional thinking on these models, revealing that interfacing with the memory directly through an attention operation is suboptimal, and that the performance may be considerably improved by filtering the input signal before communicating with memory.",
    "authors": [
        "Uladzislau Yorsh",
        "Martin Holevna",
        "Ondrej Bojar",
        "David Herel"
    ],
    "venue": "Tiny Papers @ ICLR",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "These findings challenge the conventional thinking on these models, revealing that interfacing with the memory directly through an attention operation is suboptimal, and that the performance may be considerably improved by filtering the input signal before communicating with memory."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}