{
    "acronym": "daa41c777708ee9b446402cbe6f067ffa96aa59f",
    "title": "The Stable Entropy Hypothesis and Entropy-Aware Decoding: An Analysis and Algorithm for Robust Natural Language Generation",
    "seed_ids": [
        "gpt2",
        "23447f473cd240494b0a20ea008038aaef7e3391",
        "e96493b4181de6c60b761dc66492db8e66fd784f",
        "f51497f463566581874c941353dd9d80069c5b77",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "daa41c777708ee9b446402cbe6f067ffa96aa59f",
    "abstract": "State-of-the-art language generation models can degenerate when applied to open-ended generation problems such as text completion, story generation, or dialog modeling. This degeneration usually shows up in the form of incoherence, lack of vocabulary diversity, and self-repetition or copying from the context. In this paper, we postulate that ``human-like'' generations usually lie in a narrow and nearly flat entropy band, and violation of these entropy bounds correlates with degenerate behavior. Our experiments show that this stable narrow entropy zone exists across models, tasks, and domains and confirm the hypothesis that violations of this zone correlate with degeneration. We then use this insight to propose an entropy-aware decoding algorithm that respects these entropy bounds resulting in less degenerate, more contextual, and\"human-like\"language generation in open-ended text generation settings.",
    "authors": [
        "Kushal Arora",
        "T. O’Donnell",
        "Doina Precup",
        "J. Weston",
        "Jackie C.K.Cheung"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper postulates that ``human-like'' generations usually lie in a narrow and nearly flat entropy band, and violation of these entropy bounds correlates with degenerate behavior, and proposes an entropy-aware decoding algorithm that respectsThese entropy bounds resulting in less degenerate, more contextual, and\" human-like\"language generation in open-ended text generation settings."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}