{
    "acronym": "daadc5409e524dce9171f4579b595878a17e4887",
    "title": "Transforming Dutch: Debiasing Dutch Coreference Resolution Systems for Non-binary Pronouns",
    "seed_ids": [
        "bert"
    ],
    "s2id": "daadc5409e524dce9171f4579b595878a17e4887",
    "abstract": "Gender-neutral pronouns are increasingly being introduced across Western languages. Recent evaluations have however demonstrated that English NLP systems are unable to correctly process gender-neutral pronouns, with the risk of erasing and misgendering non-binary individuals. This paper examines a Dutch coreference resolution system’s performance on gender-neutral pronouns, specifically hen and die. In Dutch, these pronouns were only introduced in 2016, compared to the longstanding existence of singular they in English. We additionally compare two debiasing techniques for coreference resolution systems in non-binary contexts: Counterfactual Data Augmentation (CDA) and delexicalisation. Moreover, because pronoun performance can be hard to interpret from a general evaluation metric like lea, we introduce an innovative evaluation metric, the pronoun score, which directly represents the portion of correctly processed pronouns. Our results reveal diminished performance on gender-neutral pronouns compared to gendered counterparts. Nevertheless, although delexicalisation fails to yield improvements, CDA substantially reduces the performance gap between gendered and gender-neutral pronouns. We further show that CDA remains effective in low-resource settings, in which a limited set of debiasing documents is used. This efficacy extends to previously unseen neopronouns, which are currently infrequently used but may gain popularity in the future, underscoring the viability of effective debiasing with minimal resources and low computational costs.",
    "authors": [
        "Goya van Boven",
        "Yupei Du",
        "Dong Nguyen"
    ],
    "venue": "Conference on Fairness, Accountability and Transparency",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper examines a Dutch coreference resolution system’s performance on gender-neutral pronouns, specifically hen and die, and introduces an innovative evaluation metric, the pronoun score, which directly represents the portion of correctly processed pronouns."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}