{
    "acronym": "dac4fc27e5942710f0a9258bc3ad8c18b9c0cc13",
    "title": "How often are errors in natural language reasoning due to paraphrastic variability?",
    "seed_ids": [
        "gpt3",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "dac4fc27e5942710f0a9258bc3ad8c18b9c0cc13",
    "abstract": "Large language models have been shown to behave inconsistently in response to meaning-preserving paraphrastic inputs. At the same time, researchers evaluate the knowledge and reasoning abilities of these models with test evaluations that do not disaggregate the effect of paraphrastic variability on performance. We propose a metric for evaluating the paraphrastic consistency of natural language reasoning models based on the probability of a model achieving the same correctness on two paraphrases of the same problem. We mathematically connect this metric to the proportion of a model's variance in correctness attributable to paraphrasing. To estimate paraphrastic consistency, we collect ParaNLU, a dataset of 7,782 human-written and validated paraphrased reasoning problems constructed on top of existing benchmark datasets for defeasible and abductive natural language inference. Using ParaNLU, we measure the paraphrastic consistency of several model classes and show that consistency dramatically increases with pretraining but not finetuning. All models tested exhibited room for improvement in paraphrastic consistency.",
    "authors": [
        "Neha Srikanth",
        "Marine Carpuat",
        "Rachel Rudinger"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A metric for evaluating the paraphrastic consistency of natural language reasoning models based on the probability of a model achieving the same correctness on two paraphrases of the same problem is proposed and mathematically connected to the proportion of a model's variance in correctness attributable to paraphrasing."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}