{
    "acronym": "dacc604afd110f44f1dcd4451f887fbad20117a6",
    "title": "DesignAID: Using Generative AI and Semantic Diversity for Design Inspiration",
    "seed_ids": [
        "gpt3",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "65ccc1c6f45b8f9054578deb419557df9ec9f1f9",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "dacc604afd110f44f1dcd4451f887fbad20117a6",
    "abstract": "Designers often struggle to sufficiently explore large design spaces, which can lead to design fixation and suboptimal outcomes. Here we introduce DesignAID, a generative AI tool that supports broader design space exploration by first using large language models to produce a range of diverse ideas expressed in words, and then using image generation software to create images from these words. This innovative combination of AI-based capabilities allows human-computer pairs to rapidly create a diverse set of visual concepts without time-consuming drawing. In a study with 87 crowd-sourced designers, we found that designers rated the automatic generation of images from words as significantly more inspirational, enjoyable, and useful than a conventional baseline condition of image search using Pinterest. Surprisingly, however, we found that automatically generating highly diverse ideas had less value. For image generation, the high diversity condition was somewhat better in inspiration but no better in the other dimensions, and for image search it was significantly worse in all dimensions.",
    "authors": [
        "Alice Cai",
        "Steven R. Rick",
        "Jennifer L. Heyman",
        "Yanxia Zhang",
        "Alexandre L. S. Filipowicz",
        "Matthew K. Hong",
        "Matt Klenk",
        "Thomas W. Malone"
    ],
    "venue": "International Conference on Climate Informatics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "DesignAID is introduced, a generative AI tool that supports broader design space exploration by first using large language models to produce a range of diverse ideas expressed in words, and then using image generation software to create images from these words."
    },
    "citationCount": 13,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}