{
    "acronym": "dad8259d1afaccfa6a7e8c7fafc0715a58f611f4",
    "title": "Query-Guided Refinement and Dynamic Spans Network for Video Highlight Detection and Temporal Grounding in Online Information Systems",
    "seed_ids": [
        "metaformer",
        "485c08025157973bb52a935c6aa3bee74f990c01",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530"
    ],
    "s2id": "dad8259d1afaccfa6a7e8c7fafc0715a58f611f4",
    "abstract": "With the surge in online video content, finding highlights and key video segments have garnered widespread attention. Given a textual query, video highlight detection (HD) and temporal grounding (TG) aim to predict frame-wise saliency scores from a video while concurrently locating all relevant spans. Despite recent progress in DETR-based works, these methods crudely fuse different inputs in the encoder, which limits effective cross-modal interaction. To solve this challenge, the authors design QD-Net (query-guided refinement and dynamic spans network) tailored for HD&TG. Specifically, they propose a query-guided refinement module to decouple the feature encoding from the interaction process. Furthermore, they present a dynamic span decoder that leverages learnable 2D spans as decoder queries, which accelerates training convergence for TG. On QVHighlights dataset, the proposed QD-Net achieves 61.87 HD-HIT@1 and 61.88 TG-mAP@0.5, yielding a significant improvement of +1.88 and +8.05, respectively, compared to the state-of-the-art method.",
    "authors": [
        "Yifang Xu",
        "Yunzhuo Sun",
        "Zien Xie",
        "Benxiang Zhai",
        "Youyao Jia",
        "Sidan Du"
    ],
    "venue": "International Journal on Semantic Web and Information Systems (IJSWIS)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The authors design QD-Net (query-guided refinement and dynamic spans network) tailored for HD&TG and present a dynamic span decoder that leverages learnable 2D spans as decoder queries, which accelerates training convergence for TG."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}