{
    "acronym": "db5dc8a44511654dc7e0bbebd44f7b502e5e90be",
    "title": "Generative AI for Medical Imaging: extending the MONAI Framework",
    "seed_ids": [
        "classfreediffu",
        "82482585e94192b4e9913727e461f89cd08e9725",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "db5dc8a44511654dc7e0bbebd44f7b502e5e90be",
    "abstract": "Recent advances in generative AI have brought incredible breakthroughs in several areas, including medical imaging. These generative models have tremendous potential not only to help safely share medical data via synthetic datasets but also to perform an array of diverse applications, such as anomaly detection, image-to-image translation, denoising, and MRI reconstruction. However, due to the complexity of these models, their implementation and reproducibility can be difficult. This complexity can hinder progress, act as a use barrier, and dissuade the comparison of new methods with existing works. In this study, we present MONAI Generative Models, a freely available open-source platform that allows researchers and developers to easily train, evaluate, and deploy generative models and related applications. Our platform reproduces state-of-art studies in a standardised way involving different architectures (such as diffusion models, autoregressive transformers, and GANs), and provides pre-trained models for the community. We have implemented these models in a generalisable fashion, illustrating that their results can be extended to 2D or 3D scenarios, including medical images with different modalities (like CT, MRI, and X-Ray data) and from different anatomical areas. Finally, we adopt a modular and extensible approach, ensuring long-term maintainability and the extension of current applications for future features.",
    "authors": [
        "W. H. Pinaya",
        "M. Graham",
        "E. Kerfoot",
        "Petru-Daniel Tudosiu",
        "J. Dafflon",
        "Virginia Fernandez",
        "Pedro Sanchez",
        "Julia Wolleb",
        "P. F. D. Costa",
        "Ashay Patel",
        "Hyungjin Chung",
        "Can Zhao",
        "Wei Peng",
        "Zelong Liu",
        "X. Mei",
        "Oeslle Lucena",
        "Jong-Chul Ye",
        "S. Tsaftaris",
        "Prerna Dogra",
        "Andrew Feng",
        "M. Modat",
        "P. Nachev",
        "S. Ourselin",
        "M. Cardoso"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study presents MONAI Generative Models, a freely available open-source platform that allows researchers and developers to easily train, evaluate, and deploy generative models and related applications, and provides pre-trained models for the community."
    },
    "citationCount": 27,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}