{
    "acronym": "db6675f2029506560a593fff11aaf4aa63ab7df5",
    "title": "How much reliable is ChatGPT's prediction on Information Extraction under Input Perturbations?",
    "seed_ids": [
        "bert",
        "293499319bdd460cb3fca1f0f5eb330e64bf3ff9",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "db6675f2029506560a593fff11aaf4aa63ab7df5",
    "abstract": "In this paper, we assess the robustness (reliability) of ChatGPT under input perturbations for one of the most fundamental tasks of Information Extraction (IE) i.e. Named Entity Recognition (NER). Despite the hype, the majority of the researchers have vouched for its language understanding and generation capabilities; a little attention has been paid to understand its robustness: How the input-perturbations affect 1) the predictions, 2) the confidence of predictions and 3) the quality of rationale behind its prediction. We perform a systematic analysis of ChatGPT's robustness (under both zero-shot and few-shot setup) on two NER datasets using both automatic and human evaluation. Based on automatic evaluation metrics, we find that 1) ChatGPT is more brittle on Drug or Disease replacements (rare entities) compared to the perturbations on widely known Person or Location entities, 2) the quality of explanations for the same entity considerably differ under different types of\"Entity-Specific\"and\"Context-Specific\"perturbations and the quality can be significantly improved using in-context learning, and 3) it is overconfident for majority of the incorrect predictions, and hence it could lead to misguidance of the end-users.",
    "authors": [
        "Ishani Mondal",
        "Abhilasha Sancheti"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A systematic analysis of ChatGPT's robustness under input perturbations for Named Entity Recognition using both automatic and human evaluation finds that ChatGPT is more brittle on Drug or Disease replacements (rare entities) compared to the perturbations on widely known Person or Location entities."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}