{
    "acronym": "db7c53eb98729c7f1b20eadcfdd79e4b93ec1f82",
    "title": "Studying LLM Performance on Closed- and Open-source Data",
    "seed_ids": [
        "gpt3",
        "0b0debb710366cdff461938c80763eace1651af6",
        "d3de0bac5703825796c240bfab8dc3c8e0a90222",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "db7c53eb98729c7f1b20eadcfdd79e4b93ec1f82",
    "abstract": "Large Language models (LLMs) are finding wide use in software engineering practice. These models are extremely data-hungry, and are largely trained on open-source (OSS) code distributed with permissive licenses. In terms of actual use however, a great deal of software development still occurs in the for-profit/proprietary sphere, where the code under development is not, and never has been, in the public domain; thus, many developers, do their work, and use LLMs, in settings where the models may not be as familiar with the code under development. In such settings, do LLMs work as well as they do for OSS code? If not, what are the differences? When performance differs, what are the possible causes, and are there work-arounds? In this paper, we examine this issue using proprietary, closed-source software data from Microsoft, where most proprietary code is in C# and C++. We find that performance for C# changes little from OSS -->proprietary code, but does significantly reduce for C++; we find that this difference is attributable to differences in identifiers. We also find that some performance degradation, in some cases, can be ameliorated efficiently by in-context learning.",
    "authors": [
        "Toufique Ahmed",
        "Christian Bird",
        "Prem Devanbu",
        "Saikat Chakraborty"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is found that performance for C# changes little from OSS -->proprietary code, but does significantly reduce for C++, and it is found that this difference is attributable to differences in identifiers."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}