{
    "acronym": "dbe05ab53d0afa900633df965aaaf5bed8bacd86",
    "title": "APoLLo : Unified Adapter and Prompt Learning for Vision Language Models",
    "seed_ids": [
        "gpt3",
        "2c0fdb6b380b7e12c3245482f288889d898e3d19",
        "dce62170e8be820bcec51aae2eceed3943ca6c9a",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "22312f763328cf540791de8c2449ea1e7436f476",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "dbe05ab53d0afa900633df965aaaf5bed8bacd86",
    "abstract": "The choice of input text prompt plays a critical role in the performance of Vision-Language Pretrained (VLP) models such as CLIP. We present APoLLo, a unified multi-modal approach that combines Adapter and Prompt learning for Vision-Language models. Our method is designed to substantially improve the generalization capabilities of VLP models when they are fine-tuned in a few-shot setting. We introduce trainable cross-attention-based adapter layers in conjunction with vision and language encoders to strengthen the alignment between the two modalities. We enforce consistency between the respective encoder branches (receiving augmented inputs) to prevent overfitting in downstream tasks. Our method is evaluated on three representative tasks: generalization to novel classes, cross-dataset evaluation, and unseen domain shifts. In practice, APoLLo achieves a relative gain up to 6.03% over MaPLe (SOTA) on novel classes for 10 diverse image recognition datasets.",
    "authors": [
        "Sanjoy Chowdhury",
        "Sayan Nag",
        "Dinesh Manocha"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "APoLLo, a unified multi-modal approach that combines Adapter and Prompt learning for Vision-Language models is presented, designed to substantially improve the generalization capabilities of VLP models when they are fine-tuned in a few-shot setting."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}