{
    "acronym": "dc688bda050d568a3771d2c2d11d5e1fd8912560",
    "title": "MM-AU:Towards Multimodal Understanding of Advertisement Videos",
    "seed_ids": [
        "perceiverio",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d"
    ],
    "s2id": "dc688bda050d568a3771d2c2d11d5e1fd8912560",
    "abstract": "Advertisement videos (ads) play an integral part in the domain of Internet e-commerce, as they amplify the reach of particular products to a broad audience or can serve as a medium to raise awareness about specific issues through concise narrative structures. The narrative structures of advertisements involve several elements like reasoning about the broad content (topic and the underlying message) and examining fine-grained details involving the transition of perceived tone due to the sequence of events and interaction among characters. In this work, to facilitate the understanding of advertisements along the three dimensions of topic categorization, perceived tone transition, and social message detection, we introduce a multimodal multilingual benchmark called MM-AU comprised of 8.4 K videos (147hrs) curated from multiple web-based sources. We explore multiple zero-shot reasoning baselines through the application of large language models on the ads transcripts. Further, we demonstrate that leveraging signals from multiple modalities, including audio, video, and text, in multimodal transformer-based supervised models leads to improved performance compared to unimodal approaches.",
    "authors": [
        "Digbalay Bose",
        "Rajat Hebbar",
        "Tiantian Feng",
        "Krishna Somandepalli",
        "Anfeng Xu",
        "Shrikanth S. Narayanan"
    ],
    "venue": "ACM Multimedia",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a multimodal multilingual benchmark called MM-AU comprised of 8.4 K videos curated from multiple web-based sources and explores multiple zero-shot reasoning baselines through the application of large language models on the ads transcripts to facilitate the understanding of advertisements along the three dimensions of topic categorization, perceived tone transition, and social message detection."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}