{
    "acronym": "dcb74fb63acd87d3db0a77de89720300fb28b50a",
    "title": "A survey on efficient vision transformers: algorithms, techniques, and performance benchmarking",
    "seed_ids": [
        "soft",
        "f35016b3180808fa97d59acbdecf47d6e2ed2819",
        "977351c92f156db27592e88b14dee2c22d4b312a",
        "2475b38a76a9c2dc67f74446e2e686815764b0f2",
        "ec139916edd6feb9b3cb3a0325ca96e21dbb0147",
        "7bffc157b3b3626a3912a3b0ef74ce5904630fce",
        "2e644c67a697073d561da4f4dad35e5ad5316cfd",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "dcb74fb63acd87d3db0a77de89720300fb28b50a",
    "abstract": "Vision Transformer (ViT) architectures are becoming increasingly popular and widely employed to tackle computer vision applications. Their main feature is the capacity to extract global information through the self-attention mechanism, outperforming earlier convolutional neural networks. However, ViT deployment and performance have grown steadily with their size, number of trainable parameters, and operations. Furthermore, self-attention's computational and memory cost quadratically increases with the image resolution. Generally speaking, it is challenging to employ these architectures in real-world applications due to many hardware and environmental restrictions, such as processing and computational capabilities. Therefore, this survey investigates the most efficient methodologies to ensure sub-optimal estimation performances. More in detail, four efficient categories will be analyzed: compact architecture, pruning, knowledge distillation, and quantization strategies. Moreover, a new metric called Efficient Error Rate has been introduced in order to normalize and compare models' features that affect hardware devices at inference time, such as the number of parameters, bits, FLOPs, and model size. Summarizing, this paper firstly mathematically defines the strategies used to make Vision Transformer efficient, describes and discusses state-of-the-art methodologies, and analyzes their performances over different application scenarios. Toward the end of this paper, we also discuss open challenges and promising research directions.",
    "authors": [
        "Lorenzo Papa",
        "Paolo Russo",
        "Irene Amerini",
        "Luping Zhou"
    ],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The strategies used to make Vision Transformer efficient are mathematically defined, state-of-the-art methodologies are described, and their performances over different application scenarios are analyzed."
    },
    "citationCount": 8,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}