{
    "acronym": "dce62170e8be820bcec51aae2eceed3943ca6c9a",
    "title": "TTIDA: Controllable Generative Data Augmentation via Text-to-Text and Text-to-Image Models",
    "seed_ids": [
        "gpt2",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "dce62170e8be820bcec51aae2eceed3943ca6c9a",
    "abstract": "Data augmentation has been established as an efficacious approach to supplement useful information for low-resource datasets. Traditional augmentation techniques such as noise injection and image transformations have been widely used. In addition, generative data augmentation (GDA) has been shown to produce more diverse and flexible data. While generative adversarial networks (GANs) have been frequently used for GDA, they lack diversity and controllability compared to text-to-image diffusion models. In this paper, we propose TTIDA (Text-to-Text-to-Image Data Augmentation) to leverage the capabilities of large-scale pre-trained Text-to-Text (T2T) and Text-to-Image (T2I) generative models for data augmentation. By conditioning the T2I model on detailed descriptions produced by T2T models, we are able to generate photo-realistic labeled images in a flexible and controllable manner. Experiments on in-domain classification, cross-domain classification, and image captioning tasks show consistent improvements over other data augmentation baselines. Analytical studies in varied settings, including few-shot, long-tail, and adversarial, further reinforce the effectiveness of TTIDA in enhancing performance and increasing robustness.",
    "authors": [
        "Yuwei Yin",
        "Jean Kaddour",
        "Xiang Zhang",
        "Yixin Nie",
        "Zhenguang Liu",
        "Lingpeng Kong",
        "Qi Liu"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "By conditioning the T2I model on detailed descriptions produced by T2T models, TTIDA is able to generate photo-realistic labeled images in a flexible and controllable manner, and shows consistent improvements over other data augmentation baselines."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}