{
    "acronym": "dcfd0ad2c25e6b0d5943993421a6df4b28fb9e04",
    "title": "A Survey on Automatic Generation of Figurative Language: From Rule-based Systems to Large Language Models",
    "seed_ids": [
        "gpt3",
        "6f20583c257370fca28e3b3a850d841f2d7062ad",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "dcfd0ad2c25e6b0d5943993421a6df4b28fb9e04",
    "abstract": "Figurative language generation (FLG) is the task of reformulating a given text to include a desired figure of speech, such as a hyperbole, a simile, and several others, while still being faithful to the original context. This is a fundamental, yet challenging task in Natural Language Processing (NLP), which has recently received increased attention due to the promising performance brought by pre-trained language models. Our survey provides a systematic overview of the development of FLG, mostly in English, starting with the description of some common figures of speech, their corresponding generation tasks, and datasets. We then focus on various modelling approaches and assessment strategies, leading us to discussing some challenges in this field, and suggesting some potential directions for future research. To the best of our knowledge, this is the first survey that summarizes the progress of FLG including the most recent development in NLP. We also organize corresponding resources, e.g., article lists and datasets, and make them accessible in an open repository. We hope this survey can help researchers in NLP and related fields to easily track the academic frontier, providing them with a landscape and a roadmap of this area.",
    "authors": [
        "Huiyuan Lai",
        "Malvina Nissim"
    ],
    "venue": "ACM Computing Surveys",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey provides a systematic overview of the development of FLG, mostly in English, starting with the description of some common figures of speech, their corresponding generation tasks, and datasets, and suggests some potential directions for future research."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}