{
    "acronym": "dd06b331be3e72f5e7b74275aa4065b76b4df5dc",
    "title": "Supersonic: Learning to Generate Source Code Optimizations in C/C++",
    "seed_ids": [
        "gpt",
        "9ada8fa11b1cdece31f253acae50b62df8d5f823",
        "bb58f2f63888456a3e04a56a18996ab8dacdb257",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "dd06b331be3e72f5e7b74275aa4065b76b4df5dc",
    "abstract": "Software optimization refines programs for resource efficiency while preserving functionality. Traditionally, it is a process done by developers and compilers. This paper introduces a third option, automated optimization at the source code level. We present Supersonic, a neural approach targeting minor source code modifications for optimization. Using a seq2seq model, Supersonic is trained on C/C++ program pairs ($x_{t}$, $x_{t+1}$), where $x_{t+1}$ is an optimized version of $x_{t}$, and outputs a diff. Supersonic's performance is benchmarked against OpenAI's GPT-3.5-Turbo and GPT-4 on competitive programming tasks. The experiments show that Supersonic not only outperforms both models on the code optimization task but also minimizes the extent of the change with a model more than 600x smaller than GPT-3.5-Turbo and 3700x smaller than GPT-4.",
    "authors": [
        "Zimin Chen",
        "Sen Fang",
        "Monperrus Martin"
    ],
    "venue": "IEEE Transactions on Software Engineering",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Supersonic is presented, a neural approach targeting minor source code modifications for optimization at the source code level, and shows that Supersonic not only outperforms both models on the code optimization task but also minimizes the extent of the change with a model more than 600x smaller than GPT-3.5-Turbo."
    },
    "citationCount": 4,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}