{
    "acronym": "dd10bbdc3f570c983780eba965e4e09310c5d571",
    "title": "RECIPE4U: Student-ChatGPT Interaction Dataset in EFL Writing Education",
    "seed_ids": [
        "bert"
    ],
    "s2id": "dd10bbdc3f570c983780eba965e4e09310c5d571",
    "abstract": "The integration of generative AI in education is expanding, yet empirical analyses of large-scale and real-world interactions between students and AI systems still remain limited. Addressing this gap, we present RECIPE4U (RECIPE for University), a dataset sourced from a semester-long experiment with 212 college students in English as Foreign Language (EFL) writing courses. During the study, students engaged in dialogues with ChatGPT to revise their essays. RECIPE4U includes comprehensive records of these interactions, including conversation logs, students’ intent, students’ self-rated satisfaction, and students’ essay edit histories. In particular, we annotate the students’ utterances in RECIPE4U with 13 intention labels based on our coding schemes. We establish baseline results for two subtasks in task-oriented dialogue systems within educational contexts: intent detection and satisfaction estimation. As a foundational step, we explore student-ChatGPT interaction patterns through RECIPE4U and analyze them by focusing on students’ dialogue, essay data statistics, and students’ essay edits. We further illustrate potential applications of RECIPE4U dataset for enhancing the incorporation of LLMs in educational frameworks. RECIPE4U is publicly available at https://zeunie.github.io/RECIPE4U/.",
    "authors": [
        "Jieun Han",
        "Haneul Yoo",
        "Jun-Hee Myung",
        "Minsun Kim",
        "Tak Yeon Lee",
        "So-Yeon Ahn",
        "Alice Oh"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "RecIPE4U (RECIPE for University), a dataset sourced from a semester-long experiment with 212 college students in English as Foreign Language (EFL) writing courses, is presented and baseline results for two subtasks in task-oriented dialogue systems within educational contexts are established."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}