{
    "acronym": "dd1c7d2528159120595e9d5e401310f152718068",
    "title": "MOSAIC: Multi-Object Segmented Arbitrary Stylization Using CLIP",
    "seed_ids": [
        "gpt",
        "e342165a614588878ad0f4bc9bacf3905df34d08",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "dd1c7d2528159120595e9d5e401310f152718068",
    "abstract": "Style transfer driven by text prompts paved a new path for creatively stylizing the images without collecting an actual style image. Despite having promising results, with text-driven stylization, the user has no control over the stylization. If a user wants to create an artistic image, the user requires fine control over the stylization of various entities individually in the content image, which is not addressed by the current state-of-the-art approaches. On the other hand, diffusion style transfer methods also suffer from the same issue because the regional stylization control over the stylized output is ineffective. To address this problem, We propose a new method Multi-Object Segmented Arbitrary Stylization Using CLIP (MOSAIC), that can apply styles to different objects in the image based on the context extracted from the input prompt. Text-based segmentation and stylization modules which are based on vision transformer architecture, were used to segment and stylize the objects. Our method can extend to any arbitrary objects, styles and produce high-quality images compared to the current state of art methods. To our knowledge, this is the first attempt to perform text-guided arbitrary object-wise stylization. We demonstrate the effectiveness of our approach through qualitative and quantitative analysis, showing that it can generate visually appealing stylized images with enhanced control over stylization and the ability to generalize to unseen object classes.",
    "authors": [
        "Prajwal Ganugula",
        "Y. Kumar",
        "N. Reddy",
        "Prabhath Chellingi",
        "A. Thakur",
        "Neeraj Kasera",
        "C. S. Anand"
    ],
    "venue": "2023 IEEE/CVF International Conference on Computer Vision Workshops (ICCVW)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a new method Multi-Object Segmented Arbitrary Stylization Using CLIP (MOSAIC), that can apply styles to different objects in the image based on the context extracted from the input prompt and can generate visually appealing stylized images with enhanced control over stylization and the ability to generalize to unseen object classes."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}