{
    "acronym": "ddceacc4165bb8a31c22618586a05c2b472655c5",
    "title": "Recent Advances in Text Analysis",
    "seed_ids": [
        "gpt",
        "bert"
    ],
    "s2id": "ddceacc4165bb8a31c22618586a05c2b472655c5",
    "abstract": "Text analysis is an interesting research area in data science and has various applications, such as in artificial intelligence, biomedical research, and engineering. We review popular methods for text analysis, ranging from topic modeling to the recent neural language models. In particular, we review Topic-SCORE, a statistical approach to topic modeling, and discuss how to use it to analyze the Multi-Attribute Data Set on Statisticians (MADStat), a data set on statistical publications that we collected and cleaned. The application of Topic-SCORE and other methods to MADStat leads to interesting findings. For example, we identified 11 representative topics in statistics. For each journal, the evolution of topic weights over time can be visualized, and these results are used to analyze the trends in statistical research. In particular, we propose a new statistical model for ranking the citation impacts of 11 topics, and we also build a cross-topic citation graph to illustrate how research results on different topics spread to one another. The results on MADStat provide a data-driven picture of the statistical research from 1975 to 2015, from a text analysis perspective. Expected final online publication date for the Annual Review of Statistics and Its Application, Volume 11 is March 2024. Please see http://www.annualreviews.org/page/journal/pubdates for revised estimates.",
    "authors": [
        "Z. Ke",
        "Pengsheng Ji",
        "Jiashun Jin",
        "Wanshan Li"
    ],
    "venue": "Annual Review of Statistics and Its Application",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new statistical model is proposed for ranking the citation impacts of 11 topics in statistics, and a cross-topic citation graph is built to illustrate how research results on different topics spread to one another."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}