{
    "acronym": "de3e8a9bf62bfe52adcfea026393d9fc4c6e16c6",
    "title": "TextBox 2.0: A Text Generation Library with Pre-trained Language Models",
    "seed_ids": [
        "gpt2",
        "42117d01d498eb9f8c21b788c3565bc6855d620b",
        "b99c61f6957c1b04ec1376b74f82dd1e83559695",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "de3e8a9bf62bfe52adcfea026393d9fc4c6e16c6",
    "abstract": "To facilitate research on text generation, this paper presents a comprehensive and unified library, TextBox 2.0, focusing on the use of pre-trained language models (PLMs). To be comprehensive, our library covers $13$ common text generation tasks and their corresponding $83$ datasets and further incorporates $45$ PLMs covering general, translation, Chinese, dialogue, controllable, distilled, prompting, and lightweight PLMs. We also implement $4$ efficient training strategies and provide $4$ generation objectives for pre-training new PLMs from scratch. To be unified, we design the interfaces to support the entire research pipeline (from data loading to training and evaluation), ensuring that each step can be fulfilled in a unified way. Despite the rich functionality, it is easy to use our library, either through the friendly Python API or command line. To validate the effectiveness of our library, we conduct extensive experiments and exemplify four types of research scenarios. The project is released at the link: https://github.com/RUCAIBox/TextBox.",
    "authors": [
        "Tianyi Tang",
        "Junyi Li",
        "Z. Chen",
        "Yiwen Hu",
        "Zhuohao Yu",
        "Wen-Dao Dai",
        "Zican Dong",
        "Xiaoxue Cheng",
        "Yuhao Wang",
        "Wayne Xin Zhao",
        "J. Nie",
        "Ji-rong Wen"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper presents a comprehensive and unified library, TextBox 2.0, focusing on the use of pre-trained language models (PLMs), and designs the interfaces to support the entire research pipeline (from data loading to training and evaluation), ensuring that each step can be fulfilled in a unified way."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}