{
    "acronym": "de75ddcb9fb13372a31ee08af8dd80b5913d70f3",
    "title": "Omni-Dimensional Frequency Learner for General Time Series Analysis",
    "seed_ids": [
        "s4",
        "9297502c3b1eaa528e8a8fb85a83842d0577fdc6",
        "5b7f5488c380cf5085a5dd93e993ad293b225eee",
        "240300b1da360f22bf0b82c6817eacebba6deed4",
        "3aa2c10dd6c72267ea8a622c8f30b3c9240d5fab",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "9b6af0e358e76d22f209c75b1702c3e6ea7815b1",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "f7890aaf985b001e9226da375f8c2289a323db90",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "de75ddcb9fb13372a31ee08af8dd80b5913d70f3",
    "abstract": "Frequency domain representation of time series feature offers a concise representation for handling real-world time series data with inherent complexity and dynamic nature. However, current frequency-based methods with complex operations still fall short of state-of-the-art time domain methods for general time series analysis. In this work, we present Omni-Dimensional Frequency Learner (ODFL) model based on a in depth analysis among all the three aspects of the spectrum feature: channel redundancy property among the frequency dimension, the sparse and un-salient frequency energy distribution among the frequency dimension, and the semantic diversity among the variable dimension. Technically, our method is composed of a semantic-adaptive global filter with attention to the un-salient frequency bands and partial operation among the channel dimension. Empirical results show that ODFL achieves consistent state-of-the-art in five mainstream time series analysis tasks, including short- and long-term forecasting, imputation, classification, and anomaly detection, offering a promising foundation for time series analysis.",
    "authors": [
        "Xianing Chen.Hanting Chen",
        "Hanting Chen",
        "Hailin Hu"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Omni-Dimensional Frequency Learner model based on a in depth analysis among all the three aspects of the spectrum feature: channel redundancy property among the frequency dimension, the sparse and un-salient frequency energy distribution among the frequency dimension, and the semantic diversity among the variable dimension is presented."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}