{
    "acronym": "de920d2db8a5c7bf091023de920786e755378226",
    "title": "Summarizing User Comments on Social Media Using Transformers",
    "seed_ids": [
        "transformer",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "de920d2db8a5c7bf091023de920786e755378226",
    "abstract": "Social media and smart technology have invaded our daily lives. They are increasingly used to express feelings and opinions, to publish news, to support public debates on various issues and events. User comments under each post are a key factor in making economic, political and business decisions. Managing their sheer volume is an almost impossible task. Therefore, summarization seems crucial. Recent years have shown that abstractive summarization has achieved great results in the field of document summarization by producing more human-like summaries. Unlike formal documents, social media conversations face four challenges: 1) tend to be informal, consisting of slang expressions and special characters, 2) show deviations from the original theme and dependencies on previous opinions, 3) since they are short, they lack lexical richness and, 4) contain redundant and repetitive information, resulting in confusion among readers. We address these challenges by developing a system that generates abstractive summaries from pools of user comments under a specific social media post, using Transformers. Unlike previous works that do not rely on user comment pools and draw data from Reddit, Twitter or “Sina Weibo” platforms only, we use a Facebook dataset. We first reshape the raw dataset in a meaningful way for summary generation and we apply some basic pre-processing.  Then, we define a task that deals with grouping comments according to the post title. A summary is generated for each group (pool) of comments. Our model is evaluated using ROUGE scores between the generated summary and each comment on the thread.",
    "authors": [
        "A. Papagiannopoulou",
        "C. Angeli"
    ],
    "venue": "European Conference on Social Media",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work develops a system that generates abstractive summaries from pools of user comments under a specific social media post, using Transformers, and uses a Facebook dataset to do so."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}