{
    "acronym": "dea3ec0e4c530bff00075ec47477e0ad03382593",
    "title": "Abstractive Multi-Document Summarization: Exploiting Maximal Marginal Relevance and Pretrained Models",
    "seed_ids": [
        "gpt2",
        "longformer",
        "023354e6834780bbf591a000fa895f70d5370f05",
        "eeb1079fb4b3ac7b022c524dcc8943d5ac026d26",
        "6e6a2fe517b33e1f29d761ae31fb37ddccb9a213",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "dea3ec0e4c530bff00075ec47477e0ad03382593",
    "abstract": "The increasing demand for effective multi-document summarization (MDS) due to the rapid expansion of information availability has triggered this investigation. Focused on the fusion of Maximal Marginal Relevance (MMR) with pretrained models, we circumvented the often-cumbersome fine-tuning process, and introduced a novel methodology. We applied this to various text datasets like Multi-News and WCEP, and it resulted in significant improvement of ROUGE scores, illustrating promising results. For example, the ROUGE-1 score of our method on the Multi-News dataset was 46.23, and the ROUGE-1 score on the WCEP dataset was 30.74.In this discussion, the research implications, including better n-gram optimization and model selection strategies, were brought forward. This study had substantial implications for natural language processing, propelling us toward more advanced text summarization applications, presenting potential avenues for future research, such as refining the role of n-grams in summaries and optimizing model selection processes.",
    "authors": [
        "Abdulrahman Mohsen Ahmed Zeyad",
        "Arun Biradar"
    ],
    "venue": "International Conference on Computing Communication and Networking Technologies",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study circumvented the often-cumbersome fine-tuning process, and introduced a novel methodology focused on the fusion of Maximal Marginal Relevance with pretrained models, which resulted in significant improvement of ROUGE scores."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}