{
    "acronym": "dec69765fc6c188897b09c8282d32db788e2c261",
    "title": "Improving Pre-Trained Multilingual Model with Vocabulary Expansion",
    "seed_ids": [
        "gpt"
    ],
    "s2id": "dec69765fc6c188897b09c8282d32db788e2c261",
    "abstract": "Recently, pre-trained language models have achieved remarkable success in a broad range of natural language processing tasks. However, in multilingual setting, it is extremely resource-consuming to pre-train a deep language model over large-scale corpora for each language. Instead of exhaustively pre-training monolingual language models independently, an alternative solution is to pre-train a powerful multilingual deep language model over large-scale corpora in hundreds of languages. However, the vocabulary size for each language in such a model is relatively small, especially for low-resource languages. This limitation inevitably hinders the performance of these multilingual models on tasks such as sequence labeling, wherein in-depth token-level or sentence-level understanding is essential. In this paper, inspired by previous methods designed for monolingual settings, we investigate two approaches (i.e., joint mapping and mixture mapping) based on a pre-trained multilingual model BERT for addressing the out-of-vocabulary (OOV) problem on a variety of tasks, including part-of-speech tagging, named entity recognition, machine translation quality estimation, and machine reading comprehension. Experimental results show that using mixture mapping is more promising. To the best of our knowledge, this is the first work that attempts to address and discuss the OOV issue in multilingual settings.",
    "authors": [
        "Hai Wang",
        "Dian Yu",
        "Kai Sun",
        "Jianshu Chen",
        "Dong Yu"
    ],
    "venue": "Conference on Computational Natural Language Learning",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work investigates two approaches (i.e., joint mapping and mixture mapping) based on a pre-trained multilingual model BERT for addressing the out-of-vocabulary (OOV) problem on a variety of tasks, including part- of-speech tagging, named entity recognition, machine translation quality estimation, and machine reading comprehension."
    },
    "citationCount": 35,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}