{
    "acronym": "df186dc32216004808dad519c5869e660ed8ff06",
    "title": "Automatic Geo-alignment of Artwork in Children's Story Books",
    "seed_ids": [
        "classfreediffu",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "5dd7bc394e032eb0e982699a5f0c781fab9e3111",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "94bcd712aed610b8eaeccc57136d65ec988356f2",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c"
    ],
    "s2id": "df186dc32216004808dad519c5869e660ed8ff06",
    "abstract": "A study was conducted to prove AI software could be used to translate and generate illustrations without any human intervention. This was done with the purpose of showing and distributing it to the external customer, Pratham Books. The project aligns with the company's vision by leveraging the generalisation and scalability of Machine Learning algorithms, offering significant cost efficiency increases to a wide range of literary audiences in varied geographical locations. A comparative study methodology was utilised to determine the best performant method out of the 3 devised, Prompt Augmentation using Keywords, CLIP Embedding Mask, and Cross Attention Control with Editorial Prompts. A thorough evaluation process was completed using both quantitative and qualitative measures. Each method had its own strengths and weaknesses, but through the evaluation, method 1 was found to have the best yielding results. Promising future advancements may be made to further increase image quality by incorporating Large Language Models and personalised stylistic models. The presented approach can also be adapted to Video and 3D sculpture generation for novel illustrations in digital webbooks.",
    "authors": [
        "Jakub J Dylag",
        "V. Suarez",
        "James Wald",
        "Aneesha Amodini Uvara"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A study was conducted to prove AI software could be used to translate and generate illustrations without any human intervention, offering significant cost efficiency increases to a wide range of literary audiences in varied geographical locations."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}