{
    "acronym": "dfa7120276a0a5d36c40de13278c9884305b7c7d",
    "title": "DocPedia: Unleashing the Power of Large Multimodal Model in the Frequency Domain for Versatile Document Understanding",
    "seed_ids": [
        "gpt3",
        "1436ee75f8dded44de157cf778a96bdaf6b20a76",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "dfa7120276a0a5d36c40de13278c9884305b7c7d",
    "abstract": "This work presents DocPedia, a novel large multimodal model (LMM) for versatile OCR-free document understanding, capable of parsing images up to 2,560$\\times$2,560 resolution. Unlike existing work either struggle with high-resolution documents or give up the large language model thus vision or language ability constrained, our DocPedia directly processes visual input in the frequency domain rather than the pixel space. The unique characteristic enables DocPedia to capture a greater amount of visual and textual information using a limited number of visual tokens. To consistently enhance both perception and comprehension abilities of our model, we develop a dual-stage training strategy and enrich instructions/annotations of all training tasks covering multiple document types. Extensive quantitative and qualitative experiments conducted on various publicly available benchmarks confirm the mutual benefits of jointly learning perception and comprehension tasks. The results provide further evidence of the effectiveness and superior performance of our DocPedia over other methods.",
    "authors": [
        "Hao Feng",
        "Qi Liu",
        "Hao Liu",
        "Wen-gang Zhou",
        "Houqiang Li",
        "Can Huang"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents DocPedia, a novel large multimodal model for versatile OCR-free document understanding, capable of parsing images up to 2,560$\\times$2,560 resolution, and develops a dual-stage training strategy and enrich instructions/annotations of all training tasks covering multiple document types."
    },
    "citationCount": 21,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}