{
    "acronym": "e030fe3a67d91e85f7da6a599b7fde7289062a25",
    "title": "Leveraging Passage Embeddings for Efficient Listwise Reranking with Large Language Models",
    "seed_ids": [
        "bert",
        "e22ae34ea102a781d0494e115639e8d081bf6920",
        "2f7364d8e5cf94315bf8905f57de9c5543e9a4bf",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "9bbdcc03d872987eef9165f4a63c3878a5b05189"
    ],
    "s2id": "e030fe3a67d91e85f7da6a599b7fde7289062a25",
    "abstract": "Recent studies have demonstrated the effectiveness of using large language language models (LLMs) in passage ranking. The listwise approaches, such as RankGPT, have become new state-of-the-art in this task. However, the efficiency of RankGPT models is limited by the maximum context length and relatively high latency of LLM inference. To address these issues, in this paper, we propose PE-Rank, leveraging the single passage embedding as a good context compression for efficient listwise passage reranking. By treating each passage as a special token, we can directly input passage embeddings into LLMs, thereby reducing input length. Additionally, we introduce an inference method that dynamically constrains the decoding space to these special tokens, accelerating the decoding process. For adapting the model to reranking, we employ listwise learning to rank loss for training. Evaluation results on multiple benchmarks demonstrate that PE-Rank significantly improves efficiency in both prefilling and decoding, while maintaining competitive ranking effectiveness. {The Code is available at \\url{https://github.com/liuqi6777/pe_rank}.}",
    "authors": [
        "Qi Liu",
        "Bo Wang",
        "Nan Wang",
        "Jiaxin Mao"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes PE-Rank, leveraging the single passage embedding as a good context compression for efficient listwise passage reranking, and introduces an inference method that dynamically constrains the decoding space to these special tokens, accelerating the decoding process."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}