{
    "acronym": "e04a80263d252a3d8a382ba37a249b9345620570",
    "title": "Plug and Play Language Models: A Simple Approach to Controlled Text Generation",
    "seed_ids": [
        "gpt",
        "cae07d4d7552cd67a495de1c6c26eec0d2802f09",
        "1805d83416c37e5b56c20f157fdcd411976d1da4",
        "7a15950dc71079285a4eaf195de5aadd87c41b40",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e04a80263d252a3d8a382ba37a249b9345620570",
    "abstract": "Large transformer-based language models (LMs) trained on huge text corpora have shown unparalleled generation capabilities. However, controlling attributes of the generated language (e.g. switching topic or sentiment) is difficult without modifying the model architecture or fine-tuning on attribute-specific data and entailing the significant cost of retraining. We propose a simple alternative: the Plug and Play Language Model (PPLM) for controllable language generation, which combines a pretrained LM with one or more simple attribute classifiers that guide text generation without any further training of the LM. In the canonical scenario we present, the attribute models are simple classifiers consisting of a user-specified bag of words or a single learned layer with 100,000 times fewer parameters than the LM. Sampling entails a forward and backward pass in which gradients from the attribute model push the LM's hidden activations and thus guide the generation. Model samples demonstrate control over a range of topics and sentiment styles, and extensive automated and human annotated evaluations show attribute alignment and fluency. PPLMs are flexible in that any combination of differentiable attribute models may be used to steer text generation, which will allow for diverse and creative applications beyond the examples given in this paper.",
    "authors": [
        "Sumanth Dathathri",
        "Andrea Madotto",
        "Janice Lan",
        "Jane Hung",
        "Eric Frank",
        "Piero Molino",
        "J. Yosinski",
        "Rosanne Liu"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Plug and Play Language Model (PPLM) for controllable language generation is proposed, which combines a pretrained LM with one or more simple attribute classifiers that guide text generation without any further training of the LM."
    },
    "citationCount": 804,
    "influentialCitationCount": 179,
    "code": null,
    "description": null,
    "url": null
}