{
    "acronym": "e0d9d80dd0ef1a9996feac61d3315f44ec31aca3",
    "title": "Fast-FNet: Accelerating Transformer Encoder Models via Efficient Fourier Layers",
    "seed_ids": [
        "fnet",
        "ae32d3a4445355891d424c9ca1c12f6f402094e2",
        "a2fc77f075f666b462d9350e7576f0ba9845c61b",
        "b7acfe1c9d709d6d14b96e45cd3d7c7703471a58",
        "4b0541eccd8f98852d6807a14fbac17f775c7b40",
        "37abe53ed31caa23ae833b2e67bb4aa1892e8d25",
        "9b6af0e358e76d22f209c75b1702c3e6ea7815b1",
        "72f207c777e4a17180cc54ccc6a743d5f43227af",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "6fa1cfc4f97f03a8485692418c7aa1a06c574a85",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "07a9f47885cae97efb7b4aa109392128532433da",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e0d9d80dd0ef1a9996feac61d3315f44ec31aca3",
    "abstract": "Transformer-based language models utilize the attention mechanism for substantial performance improvements in almost all natural language processing (NLP) tasks. Similar attention structures are also extensively studied in several other areas. Although the attention mechanism enhances the model performances significantly, its quadratic complexity prevents efficient processing of long sequences. Recent works focused on eliminating the disadvantages of computational inefficiency and showed that transformer-based models can still reach competitive results without the attention layer. A pioneering study proposed the FNet, which replaces the attention layer with the Fourier Transform (FT) in the transformer encoder architecture. FNet achieves competitive performances concerning the original transformer encoder model while accelerating training process by removing the computational burden of the attention mechanism. However, the FNet model ignores essential properties of the FT from the classical signal processing that can be leveraged to increase model efficiency further. We propose different methods to deploy FT efficiently in transformer encoder models. Our proposed architectures have smaller number of model parameters, shorter training times, less memory usage, and some additional performance improvements. We demonstrate these improvements through extensive experiments on common benchmarks.",
    "authors": [
        "Nurullah Sevim",
        "Ege Ozan Özyedek",
        "Furkan Şahinuç",
        "Aykut Koç"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Different methods to deploy FT efficiently in transformer encoder models are proposed, which have smaller number of model parameters, shorter training times, less memory usage, and some additional performance improvements."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}