{
    "acronym": "e192334ecb01191a874f5f08ca16ac2d334e16dc",
    "title": "Adaptive Feature Learning for Unbiased Scene Graph Generation",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "e192334ecb01191a874f5f08ca16ac2d334e16dc",
    "abstract": "Scene Graph Generation (SGG) aims to detect all objects and identify their pairwise relationships in the scene. Recently, tremendous progress has been made in exploring better context relationship representations. Previous work mainly focuses on contextual information aggregation and uses de-biasing strategies on samples to eliminate the preference for head predicates. However, there remain challenges caused by indeterminate feature training. Overlooking the label confusion problem in feature training easily results in a messy feature distribution among the confused categories, thereby affecting the prediction of predicates. To alleviate the aforementioned problem, in this paper, we focus on enhancing predicate representation learning. Firstly, we propose a novel Adaptive Message Passing (AMP) network to dynamically conduct information propagation among neighbors. AMP provides discriminating representations for neighbor nodes under the view of de-noising and adaptive aggregation. Furthermore, we construct a feature-assisted training paradigm alongside the predicate classification branch, guiding predicate feature learning to the corresponding feature space. Moreover, to alleviate biased prediction caused by the long-tailed class distribution and the interference of confused labels, we design a Bi-level Curriculum learning scheme (BiC). The BiC separately considers the training from the feature learning and de-biasing levels, preserving discriminating representations of different predicates while resisting biased predictions. Results on multiple SGG datasets show that our proposed method AMP-BiC has superior comprehensive performance, demonstrating its effectiveness.",
    "authors": [
        "Jiarui Yang",
        "Chuan Wang",
        "Liang Yang",
        "Yuchen Jiang",
        "Angelina Cao"
    ],
    "venue": "IEEE Transactions on Image Processing",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel Adaptive Message Passing (AMP) network to dynamically conduct information propagation among neighbors and a Bi-level Curriculum learning scheme (BiC) to alleviate biased prediction caused by the long-tailed class distribution and the interference of confused labels are proposed."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}