{
    "acronym": "e1b719a445639e5fe67da3588ed4effa73fc7a9f",
    "title": "COV-STFormer for Short-Term Passenger Flow Prediction During COVID-19 in Urban Rail Transit Systems",
    "seed_ids": [
        "transformer",
        "35a9749df07a2ab97c51af4d260b095b00da7676"
    ],
    "s2id": "e1b719a445639e5fe67da3588ed4effa73fc7a9f",
    "abstract": "Accurate passenger flow prediction of urban rail transit systems (URT) is essential for improving the performance of intelligent transportation systems, especially during the epidemic. How to dynamically model the complex spatiotemporal dependencies of passenger flow is the main issue in achieving accurate passenger flow prediction during the epidemic. To solve this issue, this paper proposes a brand-new transformer-based architecture called COVID-19 Spatial-Temporal Transformer Network (COV-STFormer) under the encoder-decoder framework specifically for COVID-19. Concretely, a modified self-attention mechanism named Causal-Convolution ProbSparse Self-Attention (CPSA) is developed to model the complex temporal dependencies of passenger flow. A novel Adaptive Multi-Graph Convolution Network (AMGCN) is introduced to capture the complex and dynamic spatial dependencies by leveraging multiple graphs in a self-adaptive manner. Additionally, the Multi-source Data Fusion block fuses the passenger flow data, COVID-19 confirmed case data, and the relevant social media data to study the impact of COVID-19 to passenger flow. Experiments on real-world passenger flow datasets demonstrate the superiority of COV-STFormer over the other thirteen state-of-the-art methods. Several ablation studies are carried out to verify the effectiveness and reliability of our model structure. Results can provide critical insights for the operation of URT systems.",
    "authors": [
        "Shuxin Zhang",
        "Jinlei Zhang",
        "Lixing Yang",
        "Chengcheng Wang",
        "Z. Gao"
    ],
    "venue": "IEEE transactions on intelligent transportation systems (Print)",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A brand-new transformer-based architecture called COVID-19 Spatial-Temporal Transformer Network (COV-STFormer) under the encoder-decoder framework specifically for COVID-19 is proposed and a modified self-attention mechanism named Causal-Convolution ProbSparse Self-Attention (CPSA) is developed to model the complex temporal dependencies of passenger flow."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}