{
    "acronym": "e1f4b94479bfcb735a1a0add178a2337def07c9b",
    "title": "Adapters: A Unified Library for Parameter-Efficient and Modular Transfer Learning",
    "seed_ids": [
        "bert",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e1f4b94479bfcb735a1a0add178a2337def07c9b",
    "abstract": "We introduce Adapters, an open-source library that unifies parameter-efficient and modular transfer learning in large language models. By integrating 10 diverse adapter methods into a unified interface, Adapters offers ease of use and flexible configuration. Our library allows researchers and practitioners to leverage adapter modularity through composition blocks, enabling the design of complex adapter setups. We demonstrate the library's efficacy by evaluating its performance against full fine-tuning on various NLP tasks. Adapters provides a powerful tool for addressing the challenges of conventional fine-tuning paradigms and promoting more efficient and modular transfer learning. The library is available via https://adapterhub.ml/adapters.",
    "authors": [
        "Clifton A. Poth",
        "Hannah Sterz",
        "Indraneil Paul",
        "Sukannya Purkayastha",
        "Leon Arne Engländer",
        "Timo Imhof",
        "Ivan Vuli'c",
        "Sebastian Ruder",
        "Iryna Gurevych",
        "Jonas Pfeiffer"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Adapters, an open-source library that unifies parameter-efficient and modular transfer learning in large language models and allows researchers and practitioners to leverage adapter modularity through composition blocks, enabling the design of complex adapter setups, is introduced."
    },
    "citationCount": 20,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}