{
    "acronym": "e22ae34ea102a781d0494e115639e8d081bf6920",
    "title": "Jina Embeddings 2: 8192-Token General-Purpose Text Embeddings for Long Documents",
    "seed_ids": [
        "alibi",
        "9bbdcc03d872987eef9165f4a63c3878a5b05189",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "b47381e04739ea3f392ba6c8faaf64105493c196"
    ],
    "s2id": "e22ae34ea102a781d0494e115639e8d081bf6920",
    "abstract": "Text embedding models have emerged as powerful tools for transforming sentences into fixed-sized feature vectors that encapsulate semantic information. While these models are essential for tasks like information retrieval, semantic clustering, and text re-ranking, most existing open-source models, especially those built on architectures like BERT, struggle to represent lengthy documents and often resort to truncation. One common approach to mitigate this challenge involves splitting documents into smaller paragraphs for embedding. However, this strategy results in a much larger set of vectors, consequently leading to increased memory consumption and computationally intensive vector searches with elevated latency. To address these challenges, we introduce Jina Embeddings 2, an open-source text embedding model capable of accommodating up to 8192 tokens. This model is designed to transcend the conventional 512-token limit and adeptly process long documents. Jina Embeddings 2 not only achieves state-of-the-art performance on a range of embedding-related tasks in the MTEB benchmark but also matches the performance of OpenAI's proprietary ada-002 model. Additionally, our experiments indicate that an extended context can enhance performance in tasks such as NarrativeQA.",
    "authors": [
        "Michael Günther",
        "Jackmin Ong",
        "Isabelle Mohr",
        "Alaeddine Abdessalem",
        "Tanguy Abel",
        "Mohammad Kalim Akram",
        "Susana Guzman",
        "Georgios Mastrapas",
        "Saba Sturua",
        "Bo Wang",
        "Maximilian Werk",
        "Nan Wang",
        "Han Xiao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Jina Embeddings 2 is introduced, an open-source text embedding model capable of accommodating up to 8192 tokens that achieves state-of-the-art performance on a range of embedding-related tasks in the MTEB benchmark and matches the performance of OpenAI's proprietary ada-002 model."
    },
    "citationCount": 21,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}