{
    "acronym": "e244ed6bb506f1fc40990ebf2b30831c40231d09",
    "title": "CLseg: Contrastive Learning of Story Ending Generation",
    "seed_ids": [
        "gpt2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "4d16457cded23bce6eaa91cd17aefd22af2279f0",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e244ed6bb506f1fc40990ebf2b30831c40231d09",
    "abstract": "Story Ending Generation (SEG) is a challenging task in natural language generation. Recently, methods based on Pre-trained Language Models (PLM) have achieved great prosperity, which can produce fluent and coherent story endings. However, the pre-training objective of PLM-based methods is unable to model the consistency between story context and ending. The goal of this paper is to adopt contrastive learning to generate endings more consistent with story context, while there are two main challenges in contrastive learning of SEG. First is the negative sampling of wrong endings inconsistent with story contexts. The second challenge is the adaptation of contrastive learning for SEG. To address these two issues, we propose a novel Contrastive Learning framework for Story Ending Generation (CLseg)†, which has two steps: multi-aspect sampling and story-specific contrastive learning. Particularly, for the first issue, we utilize novel multi-aspect sampling mechanisms to obtain wrong endings considering the consistency of order, causality, and sentiment. To solve the second issue, we well-design a story-specific contrastive training strategy that is adapted for SEG. Experiments show that CLseg outperforms baselines and can produce story endings with stronger consistency and rationality.",
    "authors": [
        "Yuqiang Xie",
        "Yue Hu",
        "Luxi Xing",
        "Yunpeng Li",
        "Wei Peng",
        "Ping Guo"
    ],
    "venue": "IEEE International Conference on Acoustics, Speech, and Signal Processing",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel Contrastive Learning framework for Story Ending Generation (CLseg)† is proposed, which has two steps: multi-aspect sampling and story-specific contrastive learning."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}