{
    "acronym": "e25fe26f8097da694e66d7a3c98e3c8c4962a281",
    "title": "Research on power system applications based on ChatGPT",
    "seed_ids": [
        "gpt",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e25fe26f8097da694e66d7a3c98e3c8c4962a281",
    "abstract": "This article aims to explore the potential applications of GPT technology in the emerging power systems, with the hope of driving the power industry towards a more intelligent and sustainable future. The article begins by tracing the historical development of natural language processing technology to introduce the technical origins of the ChatGPT model. By examining the evolution of human-machine dialogues, it becomes evident that ChatGPT represents an innovative technological advancement. Subsequently, the article delves into the generation process of ChatGPT, its current applications, and the envisioned future directions for its development. Furthermore, it elaborates on the prospects of applying GPT technology in the power industry. To conclude, the article presents the current status of the new power systems and provides insights into the potential utilization of ChatGPT within this context. In summary, ChatGPT technology offers the power industry innovative opportunities to enhance the efficiency, sustainability, and level of intelligence within power systems. However, to fully unlock the potential of this technology, further research and collaboration are essential to ensure the stability and security of power systems.",
    "authors": [
        "Bochu Li",
        "Yang Jiang",
        "Xueying Song",
        "Zhiqiang Sheng",
        "Yining Wei"
    ],
    "venue": "Other Conferences",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "ChatGPT technology offers the power industry innovative opportunities to enhance the efficiency, sustainability, and level of intelligence within power systems, however, to fully unlock the potential of this technology, further research and collaboration are essential to ensure the stability and security of power systems."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}