{
    "acronym": "e2a0d50a3392cc55e8c58a503da45aa4f062d29c",
    "title": "Divide and Compose with Score Based Generative Models",
    "seed_ids": [
        "classfreediffu",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "94bcd712aed610b8eaeccc57136d65ec988356f2"
    ],
    "s2id": "e2a0d50a3392cc55e8c58a503da45aa4f062d29c",
    "abstract": "While score based generative models, or diffusion models, have found success in image synthesis, they are often coupled with text data or image label to be able to manipulate and conditionally generate images. Even though manipulation of images by changing the text prompt is possible, our understanding of the text embedding and our ability to modify it to edit images is quite limited. Towards the direction of having more control over image manipulation and conditional generation, we propose to learn image components in an unsupervised manner so that we can compose those components to generate and manipulate images in informed manner. Taking inspiration from energy based models, we interpret different score components as the gradient of different energy functions. We show how score based learning allows us to learn interesting components and we can visualize them through generation. We also show how this novel decomposition allows us to compose, generate and modify images in interesting ways akin to dreaming. We make our code available at https://github.com/sandeshgh/Score-based-disentanglement",
    "authors": [
        "S. Ghimire",
        "Armand Comas",
        "Davin Hill",
        "A. Masoomi",
        "O. Camps",
        "Jennifer G. Dy"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes to learn image components in an unsupervised manner so that they can compose those components to generate and manipulate images in informed manner and shows how score based learning allows us to learn interesting components and the authors can visualize them through generation."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}