{
    "acronym": "e302914bf04e36207f38f632d8d57cf9d387a97e",
    "title": "CoSe-Co: Text Conditioned Generative CommonSense Contextualizer",
    "seed_ids": [
        "gpt",
        "9fa9d5dd481400b2f3904b33d542d70a6affccb9",
        "710d183174844da5b7f392667f3cc25d2b098dde",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47"
    ],
    "s2id": "e302914bf04e36207f38f632d8d57cf9d387a97e",
    "abstract": "Pre-trained Language Models (PTLMs) have been shown to perform well on natural language tasks. Many prior works have leveraged structured commonsense present in the form of entities linked through labeled relations in Knowledge Graphs (KGs) to assist PTLMs. Retrieval approaches use KG as a separate static module which limits coverage since KGs contain finite knowledge. Generative methods train PTLMs on KG triples to improve the scale at which knowledge can be obtained. However, training on symbolic KG entities limits their applicability in tasks involving natural language text where they ignore overall context. To mitigate this, we propose a CommonSense Contextualizer (CoSe-Co) conditioned on sentences as input to make it generically usable in tasks for generating knowledge relevant to the overall context of input text. To train CoSe-Co, we propose a novel dataset comprising of sentence and commonsense knowledge pairs. The knowledge inferred by CoSe-Co is diverse and contain novel entities not present in the underlying KG. We augment generated knowledge in Multi-Choice QA and Open-ended CommonSense Reasoning tasks leading to improvements over current best methods on CSQA, ARC, QASC and OBQA datasets. We also demonstrate its applicability in improving performance of a baseline model for paraphrase generation task.",
    "authors": [
        "Rachit Bansal",
        "Milan Aggarwal",
        "S. Bhatia",
        "Jivat Neet Kaur",
        "Balaji Krishnamurthy"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A CommonSense Contextualizer conditioned on sentences as input is proposed to make it generically usable in tasks for generating knowledge relevant to the overall context of input text and demonstrates its applicability in improving performance of a baseline model for paraphrase generation task."
    },
    "citationCount": 4,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}