{
    "acronym": "e34868427f607bd35f11576963c36b95673e5a75",
    "title": "Mastering Memory Tasks with World Models",
    "seed_ids": [
        "s4",
        "s4d",
        "7177fcb8e0311eeebd4070b62312a4bec1432ea3",
        "d98b5c1d0f9a4e39dc79ea7a3f74e54789df5e13",
        "661e8d555c4424b5953f17434f2ba910bfcf3afe",
        "eaef083b9d661f42cc0d89d9d8156218f33a91d9",
        "ca444821352a4bd91884413d8070446e2960715a",
        "82ec4a03a945f18bae23f8c5224d6495ec6cd1b0",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "59a916cdc943f0282908e6f3fa0360f4c5fb78d0"
    ],
    "s2id": "e34868427f607bd35f11576963c36b95673e5a75",
    "abstract": "Current model-based reinforcement learning (MBRL) agents struggle with long-term dependencies. This limits their ability to effectively solve tasks involving extended time gaps between actions and outcomes, or tasks demanding the recalling of distant observations to inform current actions. To improve temporal coherence, we integrate a new family of state space models (SSMs) in world models of MBRL agents to present a new method, Recall to Imagine (R2I). This integration aims to enhance both long-term memory and long-horizon credit assignment. Through a diverse set of illustrative tasks, we systematically demonstrate that R2I not only establishes a new state-of-the-art for challenging memory and credit assignment RL tasks, such as BSuite and POPGym, but also showcases superhuman performance in the complex memory domain of Memory Maze. At the same time, it upholds comparable performance in classic RL tasks, such as Atari and DMC, suggesting the generality of our method. We also show that R2I is faster than the state-of-the-art MBRL method, DreamerV3, resulting in faster wall-time convergence.",
    "authors": [
        "Mohammad Reza Samsami",
        "Artem Zholus",
        "Janarthanan Rajendran",
        "Sarath Chandar"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work integrates a new family of state space models (SSMs) in world models of MBRL agents to present a new method, Recall to Imagine (R2I), which aims to enhance both long-term memory and long-horizon credit assignment."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}