{
    "acronym": "e36dfa8078c211ca9420f86b0dff2480150d5374",
    "title": "HotProtein: A Novel Framework for Protein Thermostability Prediction and Editing",
    "seed_ids": [
        "scatterbrain",
        "90b21dbad8969b74d704eed15a3d98722a88e464",
        "5f895e84c1fea75de07b4f90da518273c2e57291",
        "83b8108014e3db4f46354a28ae68193f143c4e7e",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "e36dfa8078c211ca9420f86b0dff2480150d5374",
    "abstract": "The molecular basis of protein thermal stability is only partially understood and has major significance for drug and vaccine discovery. The lack of datasets and standardized benchmarks considerably limits learning-based discovery methods. We present HotProtein , a large-scale protein dataset with growth temperature annotations of thermostability, containing 182 K amino acid sequences and 3 K folded structures from 230 different species with a wide temperature range − 20 ◦ C ∼ 120 ◦ C . Due to functional domain differences and data scarcity within each species, existing methods fail to generalize well on our dataset. We address this problem through a novel learning framework, consisting of ( 1 ) Protein structure-aware pre-training (SAP) which leverages 3D information to enhance sequence-based pre-training; ( 2 ) Factorized sparse tuning (FST) that utilizes low-rank and sparse priors as an implicit regularization, together with feature augmentations. Extensive empirical studies demonstrate that our framework improves thermostability prediction compared to other deep learning models. Finally, we introduce a novel editing algorithm to efficiently generate positive amino acid mutations that improve thermostability. Codes are available in https://github.com/VITA-Group/HotProtein .",
    "authors": [
        "Tianlong Chen",
        "Chengyue Gong",
        "Daniel J. Diaz",
        "Xuxi Chen",
        "Jordan Wells",
        "Qiang Liu",
        "Zhangyang Wang",
        "A. Ellington",
        "Alex Dimakis",
        "Adam R. Klivans"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents HotProtein, a large-scale protein dataset with growth temperature annotations of thermostability, containing 182 K amino acid sequences and 3 K folded structures from 230 different species with a wide temperature range, and introduces a novel editing algorithm to efficiently generate positive amino acid mutations that improve thermostability."
    },
    "citationCount": 12,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}