{
    "acronym": "e3961d1cdd163e39d63e944ceeaad27afb1329e1",
    "title": "Evaluating Audience Loyalty and Authenticity in Influencer Marketing via Multi-task Multi-relational Learning",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "e3961d1cdd163e39d63e944ceeaad27afb1329e1",
    "abstract": "Since influencer marketing has become an essential marketing method, influencer fraud behavior such as buying fake followers and engagements to manipulate the popularity is under the spotlight. To address this issue, we propose a multi-task audience evaluation model that can assess both the loyalty and authenticity of influencers’ audiences. More specifically, the proposed model takes engagement information of an influencer’s audience, including likes and comments on social media posts, and predicts (i) the retention rate of the audience of the influencer and (ii) how the influencer is associated with fake audiences (or engagement bots). To learn the social interaction between influencers and their audiences, we build multi-relational networks based on the diverse engagement behavior such as commenting. Our model further utilizes the contextualized information captured in user comments to learn distinct engagement behavior of genuine and fake users. Based on the predicted loyalty and authenticity scores, we rank influencers to find those who are followed by loyal and authentic audiences. By using a large-scale Instagram influencer-audience dataset which contains 14,221 influencers, 9,290,895 audiences, and 65,848,717 engagements, we evaluate ranking performance, and show that the proposed framework outperforms other baseline methods.",
    "authors": [
        "Seungbae Kim",
        "Xiusi Chen",
        "Jyun-Yu Jiang",
        "Jinyoung Han",
        "Wei Wang"
    ],
    "venue": "International Conference on Web and Social Media",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A multi-task audience evaluation model that takes engagement information of an influencer’s audience, including likes and comments on social media posts, and predicts the retention rate of the audience of the influencers and how the influencer is associated with fake audiences (or engagement bots)."
    },
    "citationCount": 3,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}