{
    "acronym": "e3ba1e6f2a4352a9eab798c864cd28dbe9316af0",
    "title": "Gated Temporal Diffusion for Stochastic Long-Term Dense Anticipation",
    "seed_ids": [
        "analogbits",
        "81621c53c6aa421deb81bb1359138ded0fb4e258",
        "8f48171bf05474449777d9bbf6766d480332e09f",
        "b64537bdf7a103aa01972ba06ea24a9c08f7cd74",
        "e9b9a47cd81c66603c827f0f2bc4fba0d9ae77c4",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "3b2a675bb617ae1a920e8e29d535cdf27826e999",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "e3ba1e6f2a4352a9eab798c864cd28dbe9316af0",
    "abstract": "Long-term action anticipation has become an important task for many applications such as autonomous driving and human-robot interaction. Unlike short-term anticipation, predicting more actions into the future imposes a real challenge with the increasing uncertainty in longer horizons. While there has been a significant progress in predicting more actions into the future, most of the proposed methods address the task in a deterministic setup and ignore the underlying uncertainty. In this paper, we propose a novel Gated Temporal Diffusion (GTD) network that models the uncertainty of both the observation and the future predictions. As generator, we introduce a Gated Anticipation Network (GTAN) to model both observed and unobserved frames of a video in a mutual representation. On the one hand, using a mutual representation for past and future allows us to jointly model ambiguities in the observation and future, while on the other hand GTAN can by design treat the observed and unobserved parts differently and steer the information flow between them. Our model achieves state-of-the-art results on the Breakfast, Assembly101 and 50Salads datasets in both stochastic and deterministic settings. Code: https://github.com/olga-zats/GTDA .",
    "authors": [
        "Olga Zatsarynna",
        "Emad Bahrami",
        "Yazan Abu Farha",
        "Gianpiero Francesca",
        "Juergen Gall"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel Gated Temporal Diffusion (GTD) network that models the uncertainty of both the observation and the future predictions and achieves state-of-the-art results on the Breakfast, Assembly101 and 50Salads datasets in both stochastic and deterministic settings."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}