{
    "acronym": "e4b8556443d90e273da2d8ce848953f7c08f7d0c",
    "title": "Planting and Mitigating Memorized Content in Predictive-Text Language Models",
    "seed_ids": [
        "gpt2",
        "4b7215ebc0457a7e171bb3007c1e11623eef6615",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e4b8556443d90e273da2d8ce848953f7c08f7d0c",
    "abstract": "Language models are widely deployed to provide automatic text completion services in user products. However, recent research has revealed that language models (especially large ones) bear considerable risk of memorizing private training data, which is then vulnerable to leakage and extraction by adversaries. In this study, we test the efficacy of a range of privacy-preserving techniques to mitigate unintended memorization of sensitive user text, while varying other factors such as model size and adversarial conditions. We test both\"heuristic\"mitigations (those without formal privacy guarantees) and Differentially Private training, which provides provable levels of privacy at the cost of some model performance. Our experiments show that (with the exception of L2 regularization), heuristic mitigations are largely ineffective in preventing memorization in our test suite, possibly because they make too strong of assumptions about the characteristics that define\"sensitive\"or\"private\"text. In contrast, Differential Privacy reliably prevents memorization in our experiments, despite its computational and model-performance costs.",
    "authors": [
        "C.M. Downey",
        "Wei Dai",
        "Huseyin A. Inan",
        "Kim Laine",
        "Saurabh Naik",
        "Tomasz Religa"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study test the efficacy of a range of privacy-preserving techniques to mitigate unintended memorization of sensitive user text, while varying other factors such as model size and adversarial conditions."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}