{
    "acronym": "e4c886fb04932bf6521d6ae4f3adc01ff2b18961",
    "title": "Uncertainty Guided Global Memory Improves Multi-Hop Question Answering",
    "seed_ids": [
        "longformer",
        "6a3e13d7926a4aaa0ddcd3acc7c08e8d24c330e5",
        "67ee20536c30a225b86902af2f091e28e5e19b40",
        "168fc3525f7b97695a97b04e257ee9bd1e832acb",
        "63857190aaf5aab1d94b54bb257b7b03b8cb5a50",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "e4c886fb04932bf6521d6ae4f3adc01ff2b18961",
    "abstract": "Transformers have become the gold standard for many natural language processing tasks and, in particular, for multi-hop question answering (MHQA). This task includes processing a long document and reasoning over the multiple parts of it. The landscape of MHQA approaches can be classified into two primary categories. The first group focuses on extracting supporting evidence, thereby constraining the QA model's context to predicted facts. Conversely, the second group relies on the attention mechanism of the long input encoding model to facilitate multi-hop reasoning. However, attention-based token representations lack explicit global contextual information to connect reasoning steps. To address these issues, we propose GEMFormer, a two-stage method that first collects relevant information over the entire document to the memory and then combines it with local context to solve the task. Our experimental results show that fine-tuning a pre-trained model with memory-augmented input, including the most certain global elements, improves the model's performance on three MHQA datasets compared to the baseline. We also found that the global explicit memory contains information from supporting facts required for the correct answer.",
    "authors": [
        "Alsu Sagirova",
        "Mikhail Burtsev"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "GEMFormer is proposed, a two-stage method that first collects relevant information over the entire document to the memory and then combines it with local context to solve the task, and fine-tuning a pre-trained model with memory-augmented input improves the model's performance on three MHQA datasets compared to the baseline."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}