{
    "acronym": "e4f84dd1e904df940a5564be1c6f4fd940f5e90e",
    "title": "Addressing Challenges in Hate Speech Detection using BERT-based Models: A Review",
    "seed_ids": [
        "bert",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530",
        "a022bda79947d1f656a1164003c1b3ae9a843df9"
    ],
    "s2id": "e4f84dd1e904df940a5564be1c6f4fd940f5e90e",
    "abstract": " The rapid growth of social media platforms has led to an increase in hate speech. This has promptedthe development of effective detection mechanisms that aim to mitigate the potential hazards and threats it poses tosociety. BERT (Bidirectional Encoder Representations from Transformers) has produced cutting-edge results inthis field. This review paper aims to identify and analyze the whole process of using the BERT model to tackle thechallenges associated with the hate speech detection problem. This academic discussion will begin by addressingthe training datasets and the preprocessing methods involved. Subsequently, the use of the BERT model will beexplored, followed by an examination of the contributions made to address the issues encountered. Finally, we willdiscuss the evaluation phase. The use of BERT included the application of two primary approaches. In the featurebased approach, BERT accepts textual input and generates its corresponding representation as output. The resultingoutput is then used as input for any classification model. The second approach involves the process of fine-tuningBERT using labeled datasets and then employing it directly for classification purposes. The controversial issuesand open challenges that appeared at each stage were discussed. The results indicate that in both approaches,BERT has shown its efficacy relative to other models under contention. However, there is a need for greaterattention and advancement to effectively solve the existing issues and constraints in the future.",
    "authors": [
        "Jinan Aljawazeri",
        "M. Jasim"
    ],
    "venue": "Iraqi Journal for Computer Science and Mathematics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This review paper aims to identify and analyze the whole process of using the BERT model to tackle the challenges associated with the hate speech detection problem and indicates that in both approaches, BERT has shown its efficacy relative to other models under contention."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}