{
    "acronym": "e53412b4f0f15330f8efa84e3c8f649bbe5e26f7",
    "title": "An Empirical Categorization of Prompting Techniques for Large Language Models: A Practitioner's Guide",
    "seed_ids": [
        "gpt2",
        "0b0debb710366cdff461938c80763eace1651af6",
        "aade40af0d85b0b4fe15c97f6222d5c2e4d6d9b3",
        "94ce1d5924e05e8d75e43ce70044293ddcef850a",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "83edcfbb206ddad38a971d605da09390604248ea",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "3d473cbb7a377cf960abff31748a1a39bb6c7d7c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e53412b4f0f15330f8efa84e3c8f649bbe5e26f7",
    "abstract": "Due to rapid advancements in the development of Large Language Models (LLMs), programming these models with prompts has recently gained significant attention. However, the sheer number of available prompt engineering techniques creates an overwhelming landscape for practitioners looking to utilize these tools. For the most efficient and effective use of LLMs, it is important to compile a comprehensive list of prompting techniques and establish a standardized, interdisciplinary categorization framework. In this survey, we examine some of the most well-known prompting techniques from both academic and practical viewpoints and classify them into seven distinct categories. We present an overview of each category, aiming to clarify their unique contributions and showcase their practical applications in real-world examples in order to equip fellow practitioners with a structured framework for understanding and categorizing prompting techniques tailored to their specific domains. We believe that this approach will help simplify the complex landscape of prompt engineering and enable more effective utilization of LLMs in various applications. By providing practitioners with a systematic approach to prompt categorization, we aim to assist in navigating the intricacies of effective prompt design for conversational pre-trained LLMs and inspire new possibilities in their respective fields.",
    "authors": [
        "Oluwole Fagbohun",
        "Rachel M. Harrison",
        "Anton Dereventsov"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey examines some of the most well-known prompting techniques from both academic and practical viewpoints and classify them into seven distinct categories, aiming to equip fellow practitioners with a structured framework for understanding and categorizing prompting techniques tailored to their specific domains."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}