{
    "acronym": "e541fb54b8b9f2b4d8253f678a28830cd4f52d86",
    "title": "A Survey of Text Representation Methods and Their Genealogy",
    "seed_ids": [
        "reformer",
        "a554a0aae55be5597de8f6ece0a4dd0bd5a0e5f4",
        "270f3bea8ca801870a6cc56b4d36f7f2019c9ed0",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "3410e91c55ec78e4ec94b6a56897945e136d7cd8",
        "12aa5c0c9fa3077f41f153cdccfa2aacf8940be3",
        "25db56fc85fe15625c3375064a35e908ba6dfd2a",
        "f51497f463566581874c941353dd9d80069c5b77",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e541fb54b8b9f2b4d8253f678a28830cd4f52d86",
    "abstract": "In recent years, with the advent of highly scalable artificial-neural-network-based text representation methods the field of natural language processing has seen unprecedented growth and sophistication. It has become possible to distill complex linguistic information of text into multidimensional dense numeric vectors with the use of the distributional hypothesis. As a consequence, text representation methods have been evolving at such a quick pace that the research community is struggling to retain knowledge of the methods and their interrelations. We contribute threefold to this lack of compilation, composition, and systematization by providing a survey of current approaches, by arranging them in a genealogy, and by conceptualizing a taxonomy of text representation methods to examine and explain the state-of-the-art. Our research is a valuable guide and reference for artificial intelligence researchers and practitioners interested in natural language processing applications such as recommender systems, chatbots, and sentiment analysis.",
    "authors": [
        "Philipp Siebers",
        "Christian Janiesch",
        "Patrick Zschech"
    ],
    "venue": "IEEE Access",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work contributes threefold to this lack of compilation, composition, and systematization by providing a survey of current approaches, arranging them in a genealogy, and conceptualizing a taxonomy of text representation methods to examine and explain the state-of-the-art."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}