{
    "acronym": "e5481d7b936569040220867f533696af46017b3a",
    "title": "Comparison of Prompt Engineering and Fine-Tuning Strategies in Large Language Models in the Classification of Clinical Notes",
    "seed_ids": [
        "bert",
        "94ce1d5924e05e8d75e43ce70044293ddcef850a",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda"
    ],
    "s2id": "e5481d7b936569040220867f533696af46017b3a",
    "abstract": "The emerging large language models (LLMs) are actively evaluated in various fields including healthcare. Most studies have focused on established benchmarks and standard parameters; however, the variation and impact of prompt engineering and fine-tuning strategies have not been fully explored. This study benchmarks GPT-3.5 Turbo, GPT-4, and Llama-7B against BERT models and medical fellows' annotations in identifying patients with metastatic cancer from discharge summaries. Results revealed that clear, concise prompts incorporating reasoning steps significantly enhanced performance. GPT-4 exhibited superior performance among all models. Notably, one-shot learning and fine-tuning provided no incremental benefit. The model's accuracy sustained even when keywords for metastatic cancer were removed or when half of the input tokens were randomly discarded. These findings underscore GPT-4's potential to substitute specialized models, such as PubMedBERT, through strategic prompt engineering, and suggest opportunities to improve open-source models, which are better suited to use in clinical settings.",
    "authors": [
        "Xiaodan Zhang",
        "Nabasmita Talukdar",
        "Sandeep Vemulapalli",
        "Sumyeong Ahn",
        "Jiankun Wang",
        "Han Meng",
        "Sardar Mehtab Bin Murtaza",
        "Dmitry Leshchiner",
        "Aakash Ajay Dave",
        "Dimitri F. Joseph",
        "Martin Witteveen-Lane",
        "Dave Chesla",
        "Jiayu Zhou",
        "Bin Chen"
    ],
    "venue": "medRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Findings underscore GPT-4's potential to substitute specialized models, such as PubMedBERT, through strategic prompt engineering, and suggest opportunities to improve open-source models, which are better suited to use in clinical settings."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}