{
    "acronym": "e586a4591ba0303b769f2c07cbddaf1899cb72e4",
    "title": "H2O: Heavy-Hitter Oracle for Efficient Generative Inference of Large Language Models",
    "seed_ids": [
        "hyperattention",
        "93e58491830abe1eb965ab37ec64fa97263f6048",
        "ffd97533ac66b7d02ca58c1d5951d5427da0ffd6",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "761af20e7966e8a7d899975a332ac7eee3f92116",
        "c193eb176985a81ae64f63c5e50b2f11cfb7c4e6",
        "14c44df22b0d5361b61181fbf2ec0977ad189abf",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "148011adfae37b821407aae84fcbbf7fb4619eb6",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "f51497f463566581874c941353dd9d80069c5b77",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "4b56eef2862f7f553686f1dd190c56017122a6a0",
        "e3aa232577bb427b1f3a34acbdef84bd85734042",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47",
        "9405cc0d6169988371b2755e573cc28650d14dfe",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "e586a4591ba0303b769f2c07cbddaf1899cb72e4",
    "abstract": "Large Language Models (LLMs), despite their recent impressive accomplishments, are notably cost-prohibitive to deploy, particularly for applications involving long-content generation, such as dialogue systems and story writing. Often, a large amount of transient state information, referred to as the KV cache, is stored in GPU memory in addition to model parameters, scaling linearly with the sequence length and batch size. In this paper, we introduce a novel approach for implementing the KV cache which significantly reduces its memory footprint. Our approach is based on the noteworthy observation that a small portion of tokens contributes most of the value when computing attention scores. We call these tokens Heavy Hitters (H$_2$). Through a comprehensive investigation, we find that (i) the emergence of H$_2$ is natural and strongly correlates with the frequent co-occurrence of tokens in the text, and (ii) removing them results in significant performance degradation. Based on these insights, we propose Heavy Hitter Oracle (H$_2$O), a KV cache eviction policy that dynamically retains a balance of recent and H$_2$ tokens. We formulate the KV cache eviction as a dynamic submodular problem and prove (under mild assumptions) a theoretical guarantee for our novel eviction algorithm which could help guide future work. We validate the accuracy of our algorithm with OPT, LLaMA, and GPT-NeoX across a wide range of tasks. Our implementation of H$_2$O with 20% heavy hitters improves the throughput over three leading inference systems DeepSpeed Zero-Inference, Hugging Face Accelerate, and FlexGen by up to 29$\\times$, 29$\\times$, and 3$\\times$ on OPT-6.7B and OPT-30B. With the same batch size, H2O can reduce the latency by up to 1.9$\\times$. The code is available at https://github.com/FMInference/H2O.",
    "authors": [
        "Zhenyu (Allen) Zhang",
        "Ying Sheng",
        "Tianyi Zhou",
        "Tianlong Chen",
        "Lianmin Zheng",
        "Ruisi Cai",
        "Zhao Song",
        "Yuandong Tian",
        "Christopher Ré",
        "Clark W. Barrett",
        "Zhangyang Wang",
        "Beidi Chen"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel approach for implementing the KV cache eviction policy that dynamically retains a balance of recent and H$_2$ tokens is introduced and a theoretical guarantee for the novel eviction algorithm is proved."
    },
    "citationCount": 53,
    "influentialCitationCount": 11,
    "code": null,
    "description": null,
    "url": null
}