{
    "acronym": "e5f29e2800537c171af725f6c781d6a4a84c33cd",
    "title": "Exploring connections between auditory hallucinations and language model structures and functions",
    "seed_ids": [
        "transformer",
        "bert",
        "7b49bcd9fd53158a57d158550461bcb72ac83fbc",
        "8cd4054b41936ba0889edc26be8969c3dc8491d8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e5f29e2800537c171af725f6c781d6a4a84c33cd",
    "abstract": "Auditory hallucinations are a hallmark symptom of mental disorders such as schizophrenia, psychosis, and bipolar disorder. The biological basis for auditory perceptions and hallucinations, however, is not well understood. Understanding hallucinations may broadly reflect how our brains work — namely, by making predictions about stimuli and the environments that we navigate. In this work, we would like to use a recently developed language model to help the understanding of auditory hallucinations. Bio-inspired Large Language Models (LLMs) such as Bidirectional Encoder Representations from Transformers (BERT) and Generative Pre-trained Transformer (GPT) can generate next words based on previously generated words from the embedded space and their pre-trained library with or without inputs. The generative nature of neural networks in GPT (like self-attention) can be analogously associated with the neurophysiological sources of hallucinations. Functional imaging studies have revealed that the hyperactivity of the auditory cortex and the disruption between auditory and verbal network activity may underlie auditory hallucinations’ etiology. Key areas involved in auditory processing suggest that regions involved in verbal working memory and language processing are also associated with hallucinations. Auditory hallucinations reflect decreased activity in verbal working memory and language processing regions, including the superior temporal and inferior parietal regions. Parallels between auditory processing and LLM transformer architecture may help to decode brain functions on meaning assignment, contextual embedding, and hallucination mechanisms. Furthermore, an improved understanding of neurophysiological functions and brain architecture would bring us one step closer to creating human-like intelligence.",
    "authors": [
        "Janerra Allen",
        "Luke Xia",
        "L. E. Hong",
        "Fow-Sen Choa"
    ],
    "venue": "Defense + Commercial Sensing",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Parallels between auditory processing and LLM transformer architecture may help to decode brain functions on meaning assignment, contextual embedding, and hallucination mechanisms."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}