{
    "acronym": "e676f0cfb7ef47d65457deadf3a351dbf7114a86",
    "title": "JobSkape: A Framework for Generating Synthetic Job Postings to Enhance Skill Matching",
    "seed_ids": [
        "gpt3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e676f0cfb7ef47d65457deadf3a351dbf7114a86",
    "abstract": "Recent approaches in skill matching, employing synthetic training data for classification or similarity model training, have shown promising results, reducing the need for time-consuming and expensive annotations. However, previous synthetic datasets have limitations, such as featuring only one skill per sentence and generally comprising short sentences. In this paper, we introduce JobSkape, a framework to generate synthetic data that tackles these limitations, specifically designed to enhance skill-to-taxonomy matching. Within this framework, we create SkillSkape, a comprehensive open-source synthetic dataset of job postings tailored for skill-matching tasks. We introduce several offline metrics that show that our dataset resembles real-world data. Additionally, we present a multi-step pipeline for skill extraction and matching tasks using large language models (LLMs), benchmarking against known supervised methodologies. We outline that the downstream evaluation results on real-world data can beat baselines, underscoring its efficacy and adaptability.",
    "authors": [
        "Antoine Magron",
        "Anna Dai",
        "Mike Zhang",
        "Syrielle Montariol",
        "Antoine Bosselut"
    ],
    "venue": "NLP4HR",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces JobSkape, a framework to generate synthetic data that tackles limitations in skill matching, specifically designed to enhance skill-to-taxonomy matching, and creates SkillSkape, a comprehensive open-source synthetic dataset of job postings tailored for skill-matching tasks."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}