{
    "acronym": "e6917b14918f90e8fb89ad4debebd3937e57a123",
    "title": "Multi-Dimensional Hyena for Spatial Inductive Bias",
    "seed_ids": [
        "hyena",
        "s4",
        "mega",
        "bfd2b76998a0521c12903ef5ced517adf70ad2ba",
        "debbb47abc9fb757857f7c06aa86ca558d37c2d7",
        "2d01b6afbc86cba1cb895dbcd9396b13952bf0e5",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "d98b5c1d0f9a4e39dc79ea7a3f74e54789df5e13",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "54155c2977a977bf129849455dcae3a2b79b3f41",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "a128b1c47e6842605fb95bceae930d2135fc38fc",
        "240300b1da360f22bf0b82c6817eacebba6deed4",
        "70e91e16eb321067d9402710e14a40cf28311f73",
        "eaef083b9d661f42cc0d89d9d8156218f33a91d9",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "1d5c8c6e5a774d2fef8d92bd28670a6345a97f7a",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "e6917b14918f90e8fb89ad4debebd3937e57a123",
    "abstract": "In recent years, Vision Transformers have attracted increasing interest from computer vision researchers. However, the advantage of these transformers over CNNs is only fully manifested when trained over a large dataset, mainly due to the reduced inductive bias towards spatial locality within the transformer's self-attention mechanism. In this work, we present a data-efficient vision transformer that does not rely on self-attention. Instead, it employs a novel generalization to multiple axes of the very recent Hyena layer. We propose several alternative approaches for obtaining this generalization and delve into their unique distinctions and considerations from both empirical and theoretical perspectives. Our empirical findings indicate that the proposed Hyena N-D layer boosts the performance of various Vision Transformer architectures, such as ViT, Swin, and DeiT across multiple datasets. Furthermore, in the small dataset regime, our Hyena-based ViT is favorable to ViT variants from the recent literature that are specifically designed for solving the same challenge, i.e., working with small datasets or incorporating image-specific inductive bias into the self-attention mechanism. Finally, we show that a hybrid approach that is based on Hyena N-D for the first layers in ViT, followed by layers that incorporate conventional attention, consistently boosts the performance of various vision transformer architectures.",
    "authors": [
        "Itamar Zimerman",
        "Lior Wolf"
    ],
    "venue": "International Conference on Artificial Intelligence and Statistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A data-efficient vision transformer that does not rely on self-attention and employs a novel generalization to multiple axes of the very recent Hyena layer, which boosts the performance of various Vision Transformer architectures across multiple datasets."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}