{
    "acronym": "e730b92e41f4530f4e93d496299891ff3bfb0762",
    "title": "Epistemological Bias As a Means for the Automated Detection of Injustices in Text",
    "seed_ids": [
        "bert",
        "ff3d445da7847f9f212118328c5cdb6246f1fe3d",
        "2ea64b7c7617f6cc1768373124ca0243d772a90f"
    ],
    "s2id": "e730b92e41f4530f4e93d496299891ff3bfb0762",
    "abstract": "Injustice occurs when someone experiences unfair treatment or their rights are violated and is often due to the presence of implicit biases and prejudice such as stereotypes. The automated identification of injustice in text has received little attention, due in part to the fact that underlying implicit biases or stereotypes are rarely explicitly stated and that instances often occur unconsciously due to the pervasive nature of prejudice in society. Here, we describe a novel framework that combines the use of a fine-tuned BERT-based bias detection model, two stereotype detection models, and a lexicon-based approach to show that epistemological biases (i.e., words, which presupposes, entails, asserts, hedges, or boosts text to erode or assert a person's capacity as a knower) can assist with the automatic detection of injustice in text. The news media has many instances of injustice (i.e. discriminatory narratives), thus it is our use case here. We conduct and discuss an empirical qualitative research study which shows how the framework can be applied to detect injustices, even at higher volumes of data.",
    "authors": [
        "Kenya Andrews",
        "Lamogha Chiazor"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel framework is described that combines the use of a fine-tuned BERT-based bias detection model, two stereotype detection models, and a lexicon-based approach to show that epistemological biases can assist with the automatic detection of injustice in text."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}