{
    "acronym": "e780c246672ff2f4ae8c444be78dbef22a8f5049",
    "title": "Language Model Adaptation to Specialized Domains through Selective Masking based on Genre and Topical Characteristics",
    "seed_ids": [
        "bert",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "fd33e77884e69f6bc099990fc2790248af2749d9",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3"
    ],
    "s2id": "e780c246672ff2f4ae8c444be78dbef22a8f5049",
    "abstract": "Recent advances in pre-trained language modeling have facilitated significant progress across various natural language processing (NLP) tasks. Word masking during model training constitutes a pivotal component of language modeling in architectures like BERT. However, the prevalent method of word masking relies on random selection, potentially disregarding domain-specific linguistic attributes. In this article, we introduce an innovative masking approach leveraging genre and topicality information to tailor language models to specialized domains. Our method incorporates a ranking process that prioritizes words based on their significance, subsequently guiding the masking procedure. Experiments conducted using continual pre-training within the legal domain have underscored the efficacy of our approach on the LegalGLUE benchmark in the English language. Pre-trained language models and code are freely available for use.",
    "authors": [
        "Anas Belfathi",
        "Ygor Gallina",
        "Nicolas Hernandez",
        "Richard Dufour",
        "Laura Monceaux"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An innovative masking approach leveraging genre and topicality information to tailor language models to specialized domains is introduced, which incorporates a ranking process that prioritizes words based on their significance, subsequently guiding the masking procedure."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}