{
    "acronym": "e79fcb92b28a41e364545d66bf28b16583b6b231",
    "title": "BERT-based Models for Arabic Long Document Classification",
    "seed_ids": [
        "longformer",
        "33d15b2d2a434ab33a2a88585604f4728a324baf",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "f4238bd2385a52413ccbacfd9e409a650235bd13",
        "a022bda79947d1f656a1164003c1b3ae9a843df9",
        "cc2d1a66c701e9be9124eb95431b6c3dd79a61d3"
    ],
    "s2id": "e79fcb92b28a41e364545d66bf28b16583b6b231",
    "abstract": "Given the number of Arabic speakers worldwide and the notably large amount of content in the web today in some fields such as law, medicine, or even news, documents of considerable length are produced regularly. Classifying those documents using traditional learning models is often impractical since extended length of the documents increases computational requirements to an unsustainable level. Thus, it is necessary to customize these models specifically for long textual documents. In this paper we propose two simple but effective models to classify long length Arabic documents. We also fine-tune two different models-namely, Longformer and RoBERT, for the same task and compare their results to our models. Both of our models outperform the Longformer and RoBERT in this task over two different datasets.",
    "authors": [
        "Muhammad Al-Qurishi",
        "R. Souissi"
    ],
    "venue": "SDU@AAAI",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes two simple but effective models to classify long length Arabic documents and fine-tune two different models-namely, Longformer and RoBERT, for the same task and compares their results to these models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}