{
    "acronym": "e7a49be26ebcc4e16fdec44d5579635158584992",
    "title": "A Multilingual Neural Coaching Model with Enhanced Long-term Dialogue Structure",
    "seed_ids": [
        "gpt2",
        "ba2a423d8c7ae6cfa3424fb13bdbe3a35e5f2273",
        "9967faaec2ada5e9c638b6dc9ff577bc28bbd04c",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c",
        "791c3c30f2af10ac06f4fbc5b1e8960064aacbc7",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e7a49be26ebcc4e16fdec44d5579635158584992",
    "abstract": "In this work we develop a fully data driven conversational agent capable of carrying out motivational coaching sessions in Spanish, French, Norwegian, and English. Unlike the majority of coaching, and in general well-being related conversational agents that can be found in the literature, ours is not designed by hand-crafted rules. Instead, we directly model the coaching strategy of professionals with end users. To this end, we gather a set of virtual coaching sessions through a Wizard of Oz platform, and apply state of the art Natural Language Processing techniques. We employ a transfer learning approach, pretraining GPT2 neural language models and fine-tuning them on our corpus. However, since these only take as input a local dialogue history, a simple fine-tuning procedure is not capable of modeling the long-term dialogue strategies that appear in coaching sessions. To alleviate this issue, we first propose to learn dialogue phase and scenario embeddings in the fine-tuning stage. These indicate to the model at which part of the dialogue it is and which kind of coaching session it is carrying out. Second, we develop a global deep learning system which controls the long-term structure of the dialogue. We also show that this global module can be used to visualize and interpret the decisions taken by the the conversational agent, and that the learnt representations are comparable to dialogue acts. Automatic and human evaluation show that our proposals serve to improve the baseline models. Finally, interaction experiments with coaching experts indicate that the system is usable and gives rise to positive emotions in Spanish, French and English, while the results in Norwegian point out that there is still work to be done in fully data driven approaches with very low resource languages.",
    "authors": [
        "Asier López Zorrilla",
        "M. Inés Torres"
    ],
    "venue": "ACM Trans. Interact. Intell. Syst.",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work develops a fully data driven conversational agent capable of carrying out motivational coaching sessions in Spanish, French, Norwegian, and English and develops a global deep learning system which controls the long-term structure of the dialogue."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}