{
    "acronym": "e8123fa1633cf1d14031ed96de9087ba3623c830",
    "title": "Convergence Analysis of Discrete Diffusion Model: Exact Implementation through Uniformization",
    "seed_ids": [
        "sedd",
        "ce806f8d32f6fb1eaa821248a1bc4fa2cd949fbb",
        "1f898d66acabff511a3871b82799aa73c0055402",
        "33433e9103b00aa0c42597cbfe13a429fbf5abdf",
        "e9b9a47cd81c66603c827f0f2bc4fba0d9ae77c4",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1"
    ],
    "s2id": "e8123fa1633cf1d14031ed96de9087ba3623c830",
    "abstract": "Diffusion models have achieved huge empirical success in data generation tasks. Recently, some efforts have been made to adapt the framework of diffusion models to discrete state space, providing a more natural approach for modeling intrinsically discrete data, such as language and graphs. This is achieved by formulating both the forward noising process and the corresponding reversed process as Continuous Time Markov Chains (CTMCs). In this paper, we investigate the theoretical properties of the discrete diffusion model. Specifically, we introduce an algorithm leveraging the uniformization of continuous Markov chains, implementing transitions on random time points. Under reasonable assumptions on the learning of the discrete score function, we derive Total Variation distance and KL divergence guarantees for sampling from any distribution on a hypercube. Our results align with state-of-the-art achievements for diffusion models in $\\mathbb{R}^d$ and further underscore the advantages of discrete diffusion models in comparison to the $\\mathbb{R}^d$ setting.",
    "authors": [
        "Hongrui Chen",
        "Lexing Ying"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces an algorithm leveraging the uniformization of continuous Markov chains, implementing transitions on random time points, and derives Total Variation distance and KL divergence guarantees for sampling from any distribution on a hypercube."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}