{
    "acronym": "e83241e1c6e7f47fadc39d3506baebf157ad8cae",
    "title": "IvCDS: An End-to-End Driver Simulator for Personal In-Vehicle Conversational Assistant",
    "seed_ids": [
        "gpt2",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "25db56fc85fe15625c3375064a35e908ba6dfd2a",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e83241e1c6e7f47fadc39d3506baebf157ad8cae",
    "abstract": "An advanced driver simulator methodology facilitates a well-connected interaction between the environment and drivers. Multiple traffic information environment language processing aims to help drivers accommodate travel demand: safety prewarning, destination navigation, hotel/restaurant reservation, and so on. Task-oriented dialogue systems generally aim to assist human users in achieving these specific goals by a conversation in the form of natural language. The development of current neural network based dialogue systems relies on relevant datasets, such as KVRET. These datasets are generally used for training and evaluating a dialogue agent (e.g., an in-vehicle assistant). Therefore, a simulator for the human user side is necessarily required for assessing an agent system if no real person is involved. We propose a new end-to-end simulator to operate as a human driver that is capable of understanding and responding to assistant utterances. This proposed driver simulator enables one to interact with an in-vehicle assistant like a real person, and the diversity of conversations can be simply controlled by changing the assigned driver profile. Results of our experiment demonstrate that this proposed simulator achieves the best performance on all tasks compared with other models.",
    "authors": [
        "Tianbo Ji",
        "Xuanhua Yin",
        "Peng Cheng",
        "Liting Zhou",
        "Siyou Liu",
        "Wei Bao",
        "Chenyang Lyu"
    ],
    "venue": "International Journal of Environmental Research and Public Health",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This proposed driver simulator enables one to interact with an in-vehicle assistant like a real person, and the diversity of conversations can be simply controlled by changing the assigned driver profile."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}