{
    "acronym": "e892df325c03dc837c3974f58f93027cd7e2693e",
    "title": "Multimodal Analysis of Acoustic and Linguistic Features in Entrepreneurial Pitches using Deep Learning",
    "seed_ids": [
        "longformer",
        "b0ea8d8afabd625b54417a924484c32bc2d82f47",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "e892df325c03dc837c3974f58f93027cd7e2693e",
    "abstract": "Multimodal Analysis of Acoustic and Linguistic Features in Entrepreneurial Pitches using Deep Learning by Pepijn van Aken Acquiring early-stage investments for the purpose of developing a business is a fundamental aspect of the entrepreneurial process, which regularly entails pitching the business proposal to potential investors. Previous research suggests that business viability data and the perception of the entrepreneur play an important role in the investment decision-making process. This perception of the entrepreneur is shaped by verbal and non-verbal behavioural cues produced in investor-entrepreneur interactions. This study explores the impact of such cues on decisions that involve investing in a startup on the basis of a pitch. A multimodal approach is developed in which acoustic and linguistic features are extracted from recordings of entrepreneurial pitches to predict the likelihood of investment. The acoustic and linguistic modalities are represented using both hand-crafted and deep features. The capabilities of deep learning models are exploited to capture the temporal dynamics of the inputs. The findings show promising results for the prediction of the likelihood of investment using a multimodal architecture consisting of acoustic and linguistic features. Models based on deep features generally outperform hand-crafted representations. Across multiple explainable models, consistent features are found to be important predictors. An early fusion multimodal model consisting of deep representations of the two modalities has been proven to be most predictive.",
    "authors": [
        "Pepijn van Aken"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study explores the impact of verbal and non-verbal behavioural cues produced in investor-entrepreneur interactions on decisions that involve investing in a startup on the basis of a pitch and shows promising results for the prediction of the likelihood of investment using a multimodal architecture consisting of acoustic and linguistic features."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}