{
    "acronym": "e8f5e9e7deeff8d9544b0daba723372892a98d4e",
    "title": "Towards Fine-Grained Information: Identifying the Type and Location of Translation Errors",
    "seed_ids": [
        "gpt2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e8f5e9e7deeff8d9544b0daba723372892a98d4e",
    "abstract": "Fine-grained information on translation errors is helpful for the translation evaluation community. Existing approaches can not synchronously consider error position and type, failing to integrate the error information of both. In this paper, we propose Fine-Grained Translation Error Detection (FG-TED) task, aiming at identifying both the position and the type of translation errors on given source-hypothesis sentence pairs. Besides, we build an FG-TED model to predict the \\textbf{addition} and \\textbf{omission} errors -- two typical translation accuracy errors. First, we use a word-level classification paradigm to form our model and use the shortcut learning reduction to relieve the influence of monolingual features. Besides, we construct synthetic datasets for model training, and relieve the disagreement of data labeling in authoritative datasets, making the experimental benchmark concordant. Experiments show that our model can identify both error type and position concurrently, and gives state-of-the-art results on the restored dataset. Our model also delivers more reliable predictions on low-resource and transfer scenarios than existing baselines. The related datasets and the source code will be released in the future.",
    "authors": [
        "Keqin Bao",
        "Yu Wan",
        "Dayiheng Liu",
        "Baosong Yang",
        "Wenqiang Lei",
        "Xiangnan He",
        "Derek F.Wong",
        "Jun Xie"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper proposes Fine-Grained Translation Error Detection (FG-TED) task, aiming at identifying both the position and the type of translation errors on given source-hypothesis sentence pairs, and builds an FG-TED model, which can identify both error type and position concurrently."
    },
    "citationCount": 4,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}