{
    "acronym": "e9826beea3e4b3eb1874fb33b84c8d0a75c20b00",
    "title": "System-Initiated Transitions from Chit-Chat to Task-Oriented Dialogues with Transition Info Extractor and Transition Sentence Generator",
    "seed_ids": [
        "gpt2",
        "8498daeeb893870524ffaa63086f8528795003d4",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "e9826beea3e4b3eb1874fb33b84c8d0a75c20b00",
    "abstract": "In this work, we study dialogue scenarios that start from chit-chat but eventually switch to task-related services, and investigate how a unified dialogue model, which can engage in both chit-chat and task-oriented dialogues, takes the initiative during the dialogue mode transition from chit-chat to task-oriented in a coherent and cooperative manner. We firstly build a transition info extractor (TIE) that keeps track of the preceding chit-chat interaction and detects the potential user intention to switch to a task-oriented service. Meanwhile, in the unified model, a transition sentence generator (TSG) is extended through efficient Adapter tuning and transition prompt learning. When the TIE successfully finds task-related information from the preceding chit-chat, such as a transition domain (“train” in Figure fig: system-initiated transition from chit-chat to task-oriented.), then the TSG is activated automatically in the unified model to initiate this transition by generating a transition sentence under the guidance of transition information extracted by TIE. The experimental results show promising performance regarding the proactive transitions. We achieve an additional large improvement on TIE model by utilizing Conditional Random Fields (CRF). The TSG can flexibly generate transition sentences while maintaining the unified capabilities of normal chit-chat and task-oriented response generation.",
    "authors": [
        "Ye Liu",
        "Stefan Ultes",
        "W. Minker",
        "Wolfgang Maier"
    ],
    "venue": "International Conference on Natural Language Generation",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work builds a transition info extractor (TIE) that keeps track of the preceding chit-chat interaction and detects the potential user intention to switch to a task-oriented service, and achieves an additional large improvement on TIE model by utilizing Conditional Random Fields (CRF)."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}