{
    "acronym": "ea0ea0da2e774bc0b73c4470de6cbd1fc979b265",
    "title": "So Cloze Yet So Far: N400 Amplitude Is Better Predicted by Distributional Information Than Human Predictability Judgements",
    "seed_ids": [
        "transformerxl",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "ea0ea0da2e774bc0b73c4470de6cbd1fc979b265",
    "abstract": "More predictable words are easier to process—they are read faster and elicit smaller neural signals associated with processing difficulty, most notably, the N400 component of the event-related brain potential. Thus, it has been argued that the prediction of upcoming words is a key component of language comprehension, and that studying the amplitude of the N400 is a valuable way to investigate the predictions we make. In this study, we investigate whether the linguistic predictions of computational language models (LMs) or humans better reflect the way in which natural language stimuli modulate the amplitude of the N400. One important difference in the linguistic predictions of humans versus computational LMs is that while LMs base their predictions exclusively on the preceding linguistic context, humans may rely on other factors. We find that the predictions of three top-of-the-line contemporary LMs—1) GPT-3; 2) RoBERTa; and 3) ALBERT—match the N400 more closely than human predictions. This suggests that the predictive processes underlying the N400 may be more sensitive to the statistics of language than previously thought.",
    "authors": [
        "J. Michaelov",
        "S. Coulson",
        "B. Bergen"
    ],
    "venue": "IEEE Transactions on Cognitive and Developmental Systems",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is found that the predictions of three top-ofthe-line contemporary language models—GPT-3, RoBERTa, and ALBERT—match the N400 more closely than human predictions, suggesting that the predictive processes underlying the N 400 may be more sensitive to the surface-level statistics of language than previously thought."
    },
    "citationCount": 32,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}