{
    "acronym": "ea4fa9e7155cf064de19862e41a6e63738770012",
    "title": "Enhancing Dialogue Generation via Dynamic Graph Knowledge Aggregation",
    "seed_ids": [
        "gpt2",
        "d3a95b0727ef67ef9264cd20da10a545977ace51",
        "58b8da3821affc426895a85dbac5556322e6e2a9",
        "9aacdbc8b04fa63e6fe93f62a737a11c613f08fb",
        "4a6c5f0e7f0c2b47b9024c4cc13a59a31597b2ff",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "ea4fa9e7155cf064de19862e41a6e63738770012",
    "abstract": "Incorporating external graph knowledge into neural chatbot models has been proven effective for enhancing dialogue generation. However, in conventional graph neural networks (GNNs), message passing on a graph is independent from text, resulting in the graph representation hidden space differing from that of the text. This training regime of existing models therefore leads to a semantic gap between graph knowledge and text. In this study, we propose a novel framework for knowledge graph enhanced dialogue generation. We dynamically construct a multi-hop knowledge graph with pseudo nodes to involve the language model in feature aggregation within the graph at all steps. To avoid the semantic biases caused by learning on vanilla subgraphs, the proposed framework applies hierarchical graph attention to aggregate graph features on pseudo nodes and then attains a global feature. Therefore, the framework can better utilise the heterogeneous features from both the post and external graph knowledge. Extensive experiments demonstrate that our framework outperforms state-of-the-art (SOTA) baselines on dialogue generation. Further analysis also shows that our representation learning framework can fill the semantic gap by coagulating representations of both text and graph knowledge. Moreover, the language model also learns how to better select knowledge triples for a more informative response via exploiting subgraph patterns within our feature aggregation process. Our code and resources are available at https://github.com/tangg555/SaBART.",
    "authors": [
        "Chen Tang",
        "Hongbo Zhang",
        "Tyler Loakman",
        "Chenghua Lin",
        "Frank Guerin"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel framework for knowledge graph enhanced dialogue generation that outperforms state-of-the-art (SOTA) baselines on dialogue generation and can fill the semantic gap by coagulating representations of both text and graph knowledge."
    },
    "citationCount": 12,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}