{
    "acronym": "eb11e409c70308ff48720b181318d437331084d6",
    "title": "Stock Price Prediction Using Time Embedding and Attention Mechanism in Transformers",
    "seed_ids": [
        "bert"
    ],
    "s2id": "eb11e409c70308ff48720b181318d437331084d6",
    "abstract": "Predicting stock prices accurately is a complex task that involves analyzing a wide range of factors such as company performance, industry trends, market conditions, and even global events. Recently, transformer-based models have shown promising results for sequential data analysis, including stock price prediction. However, predicting stock prices accurately requires considering the temporal patterns in the data, which can be achieved by incorporating time embedding techniques into the model. Here in this paper a transformer-based model was proposed for stock price prediction that incorporates time embedding and the moving average technique. The proposed model uses historical stock prices and financial indicators as input, and the output is the predicted stock prices. Time embedding is used to capture the temporal patterns in the stock prices, and the moving average technique is used to remove the noise in the input data and improve the models accuracy. The performance of proposed model which is based on transformer is evaluated on publicly available dataset of various companies i.e IBM, APPLE and TATAMOTORS. The results we achieved is really good and transformer-based models have really proven to be suited for Stock price prediction.",
    "authors": [
        "Sourav Das",
        "Bharti Nagpal"
    ],
    "venue": "2023 International Conference on Data Science, Agents & Artificial Intelligence (ICDSAAI)",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A transformer-based model was proposed for stock price prediction that incorporates time embedding and the moving average technique and is evaluated on publicly available dataset of various companies i.e IBM, APPLE and TATAMOTORS."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}