{
    "acronym": "eb184e970c40f6b06dee499e2f6aed7205c8d5d9",
    "title": "Unsupervised Document Embedding via Contrastive Augmentation",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "eb184e970c40f6b06dee499e2f6aed7205c8d5d9",
    "abstract": "We present a contrasting learning approach with data augmentation techniques to learn document representations in an unsupervised manner. Inspired by recent contrastive self-supervised learning algorithms used for image and NLP pretraining, we hypothesize that high-quality document embedding should be invariant to diverse paraphrases that preserve the semantics of the original document. With different backbones and contrastive learning frameworks, our study reveals the enormous benefits of contrastive augmentation for document representation learning with two additional insights: 1) including data augmentation in a contrastive way can substantially improve the embedding quality in unsupervised document representation learning, and 2) in general, stochastic augmentations generated by simple word-level manipulation work much better than sentence-level and document-level ones. We plug our method into a classifier and compare it with a broad range of baseline methods on six benchmark datasets. Our method can decrease the classification error rate by up to 6.4% over the SOTA approaches on the document classification task, matching or even surpassing fully-supervised methods.",
    "authors": [
        "Dongsheng Luo",
        "Wei Cheng",
        "Jingchao Ni",
        "Wenchao Yu",
        "Xuchao Zhang",
        "Bo Zong",
        "Yanchi Liu",
        "Zhengzhang Chen",
        "Dongjin Song",
        "Haifeng Chen",
        "Xiang Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study reveals the enormous benefits of contrastive augmentation for document representation learning with two additional insights: 1) including data augmentation in a contrastive way can substantially improve the embedding quality in unsupervised document representationLearning, and 2) in general, stochastic augmentations generated by simple word-level manipulation work much better than sentence-level and document-level ones."
    },
    "citationCount": 10,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}