{
    "acronym": "eb425f7baaea5c986ff6c0d7aaa4633dd8ecd51a",
    "title": "From unified phrase representation to bilingual phrase alignment in an unsupervised manner",
    "seed_ids": [
        "gpt2",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "eb425f7baaea5c986ff6c0d7aaa4633dd8ecd51a",
    "abstract": "Abstract Significant advances have been achieved in bilingual word-level alignment, yet the challenge remains for phrase-level alignment. Moreover, the need for parallel data is a critical drawback for the alignment task. This work proposes a system that alleviates these two problems: a unified phrase representation model using cross-lingual word embeddings as input and an unsupervised training algorithm inspired by recent works on neural machine translation. The system consists of a sequence-to-sequence architecture where a short sequence encoder constructs cross-lingual representations of phrases of any length, then an LSTM network decodes them w.r.t their contexts. After training with comparable corpora and existing key phrase extraction, our encoder provides cross-lingual phrase representations that can be compared without further transformation. Experiments on five data sets show that our method obtains state-of-the-art results on the bilingual phrase alignment task and improves the results of different length phrase alignment by a mean of 8.8 points in MAP.",
    "authors": [
        "Jingshu Liu",
        "E. Morin",
        "Sebastián Peña Saldarriaga",
        "Joseph Lark"
    ],
    "venue": "Natural Language Engineering",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A unified phrase representation model using cross-lingual word embeddings as input and an unsupervised training algorithm inspired by recent works on neural machine translation is proposed, which obtains state-of-the-art results on the bilingual phrase alignment task."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}