{
    "acronym": "eb6309dd0e70fe68ba2c97629f9091eae3cbf8b4",
    "title": "Conv-Transformer Transducer: Low Latency, Low Frame Rate, Streamable End-to-End Speech Recognition",
    "seed_ids": [
        "transformerxl",
        "09e2c7adbed37440d4a339852cfa34e5b660f768",
        "d02bdac2e1abafcb0116862eb358da72a189fdfa"
    ],
    "s2id": "eb6309dd0e70fe68ba2c97629f9091eae3cbf8b4",
    "abstract": "Transformer has achieved competitive performance against state-of-the-art end-to-end models in automatic speech recognition (ASR), and requires significantly less training time than RNN-based models. The original Transformer, with encoder-decoder architecture, is only suitable for offline ASR. It relies on an attention mechanism to learn alignments, and encodes input audio bidirectionally. The high computation cost of Transformer decoding also limits its use in production streaming systems. To make Transformer suitable for streaming ASR, we explore Transducer framework as a streamable way to learn alignments. For audio encoding, we apply unidirectional Transformer with interleaved convolution layers. The interleaved convolution layers are used for modeling future context which is important to performance. To reduce computation cost, we gradually downsample acoustic input, also with the interleaved convolution layers. Moreover, we limit the length of history context in self-attention to maintain constant computation cost for each decoding step. We show that this architecture, named Conv-Transformer Transducer, achieves competitive performance on LibriSpeech dataset (3.6\\% WER on test-clean) without external language models. The performance is comparable to previously published streamable Transformer Transducer and strong hybrid streaming ASR systems, and is achieved with smaller look-ahead window (140~ms), fewer parameters and lower frame rate.",
    "authors": [
        "WenYong Huang",
        "Wenchao Hu",
        "Y. Yeung",
        "Xiao Chen"
    ],
    "venue": "Interspeech",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Conv-Transformer Transducer architecture, named Conv- transducer, achieves competitive performance on LibriSpeech dataset (3.6\\% WER on test-clean) without external language models."
    },
    "citationCount": 43,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}