{
    "acronym": "eba0c5a99ffc576313da0a962cb68d37541c4fd4",
    "title": "Graph Contrastive Learning as a Versatile Foundation for Advanced scRNA-seq Data Analysis",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "eba0c5a99ffc576313da0a962cb68d37541c4fd4",
    "abstract": "Single-cell RNA sequencing (scRNA-seq) offers unprecedented insights into transcriptome-wide gene expression at the single-cell level. Cell clustering has been long established in the analysis of scRNA-seq data to identify the groups of cells with similar expression profiles. However, cell clustering is technically challenging, as raw scRNA-seq data have various analytical issues, including high dimensionality and dropout values. Existing research has developed deep learning models, such as graph machine learning models and contrastive learning-based models, for cell clustering using scRNA-seq data and has summarized the unsupervised learning of cell clustering into a human-interpretable format. While advances in cell clustering have been profound, we are no closer to finding a simple yet effective framework for learning high-quality representations necessary for robust clustering. In this study, we propose scSimGCL, a novel framework based on the graph contrastive learning paradigm for self-supervised pretraining of graph neural networks. This framework facilitates the generation of high-quality representations crucial for cell clustering. Our scSimGCL incorporates cell-cell graph structure and contrastive learning to enhance the performance of cell clustering. Extensive experimental results on simulated and real scRNA-seq datasets suggest the superiority of the proposed scSimGCL. Moreover, clustering assignment analysis confirms the general applicability of scSimGCL, including state-of-the-art clustering algorithms. Further, ablation study and hyperparameter analysis suggest the efficacy of our network architecture with the robustness of decisions in the self-supervised learning setting. The proposed scSimGCL can serve as a foundation model for practitioners developing tools for cell clustering. The source code of scSimGCL is publicly available at https://github.com/zhangzh1328/scSimGCL.",
    "authors": [
        "Zhenhao Zhang",
        "Yuxi Liu",
        "Meichen Xiao",
        "Kun Wang",
        "Yu Huang",
        "Jiang Bian",
        "Ruolin Yang",
        "Fuyi Li"
    ],
    "venue": "bioRxiv",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed scSimGCL incorporates cell-cell graph structure and contrastive learning to enhance the performance of cell clustering, a novel framework based on the graph contrastive learning paradigm for self-supervised pretraining of graph neural networks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}