{
    "acronym": "ebc9eddaddfd27309919807e4ea8485071bc8b14",
    "title": "Improving the Diagnosis of Psychiatric Disorders with Self-Supervised Graph State Space Models",
    "seed_ids": [
        "s4",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "35a9749df07a2ab97c51af4d260b095b00da7676"
    ],
    "s2id": "ebc9eddaddfd27309919807e4ea8485071bc8b14",
    "abstract": "Single subject prediction of brain disorders from neuroimaging data has gained increasing attention in recent years. Yet, for some heterogeneous disorders such as major depression disorder (MDD) and autism spectrum disorder (ASD), the performance of prediction models on large-scale multi-site datasets remains poor. We present a two-stage framework to improve the diagnosis of heterogeneous psychiatric disorders from resting-state functional magnetic resonance imaging (rs-fMRI). First, we propose a self-supervised mask prediction task on data from healthy individuals that can exploit differences between healthy controls and patients in clinical datasets. Next, we train a supervised classifier on the learned discriminative representations. To model rs-fMRI data, we develop Graph-S4; an extension to the recently proposed state-space model S4 to graph settings where the underlying graph structure is not known in advance. We show that combining the framework and Graph-S4 can significantly improve the diagnostic performance of neuroimaging-based single subject prediction models of MDD and ASD on three open-source multi-center rs-fMRI clinical datasets.",
    "authors": [
        "A. E. Gazzar",
        "R. Thomas",
        "G. Wingen"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that combining the framework and Graph-S4 can significantly improve the diagnostic performance of neuroimaging-based single subject prediction models of MDD and ASD on three open-source multi-center rs-fMRI clinical datasets."
    },
    "citationCount": 5,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}