{
    "acronym": "ebf6c2716b64c10bce3f557ff8a36e073d111ada",
    "title": "External Knowledge Acquisition for End-to-End Document-Oriented Dialog Systems",
    "seed_ids": [
        "longt5",
        "aa55f4bafba03b7d2f7314fed61b924438d1a62c",
        "3dfb1f50f2a34a699c339dabaa6f9b3a977973de",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "ebf6c2716b64c10bce3f557ff8a36e073d111ada",
    "abstract": "End-to-end neural models for conversational AI often assume that a response can be generated by considering only the knowledge acquired by the model during training. Document-oriented conversational models make a similar assumption by conditioning the input on the document and assuming that any other knowledge is captured in the model’s weights. However, a conversation may refer to external knowledge sources. In this work, we present EKo-Doc, an architecture for document-oriented conversations with access to external knowledge: we assume that a conversation is centered around a topic document and that external knowledge is needed to produce responses. EKo-Doc includes a dense passage retriever, a re-ranker, and a response generation model. We train the model end-to-end by using silver labels for the retrieval and re-ranking components that we automatically acquire from the attention signals of the response generation model. We demonstrate with automatic and human evaluations that incorporating external knowledge improves response generation in document-oriented conversations. Our architecture achieves new state-of-the-art results on the Wizard of Wikipedia dataset, outperforming a competitive baseline by 10.3% in Recall@1 and 7.4% in ROUGE-L.",
    "authors": [
        "T. Lai",
        "Giuseppe Castellucci",
        "Saar Kuzi",
        "Heng Ji",
        "Oleg Rokhlenko"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "EKo-Doc is presented, an architecture for document-oriented conversations with access to external knowledge: it is assumed that a conversation is centered around a topic document and that external knowledge is needed to produce responses."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}