{
    "acronym": "ec139916edd6feb9b3cb3a0325ca96e21dbb0147",
    "title": "Hydra Attention: Efficient Attention with Many Heads",
    "seed_ids": [
        "performer",
        "rfa",
        "lineartransformer",
        "aft",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "4990f7542f0600e0501a7e7a931b32eb7cb804d5",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "d5e999aae76d5270ef272076979c809817458212",
        "9ed25f101f19ea735ca300848948ed64064b97ca",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "ec139916edd6feb9b3cb3a0325ca96e21dbb0147",
    "abstract": "While transformers have begun to dominate many tasks in vision, applying them to large images is still computationally difficult. A large reason for this is that self-attention scales quadratically with the number of tokens, which in turn, scales quadratically with the image size. On larger images (e.g., 1080p), over 60% of the total computation in the network is spent solely on creating and applying attention matrices. We take a step toward solving this issue by introducing Hydra Attention, an extremely efficient attention operation for Vision Transformers (ViTs). Paradoxically, this efficiency comes from taking multi-head attention to its extreme: by using as many attention heads as there are features, Hydra Attention is computationally linear in both tokens and features with no hidden constants, making it significantly faster than standard self-attention in an off-the-shelf ViT-B/16 by a factor of the token count. Moreover, Hydra Attention retains high accuracy on ImageNet and, in some cases, actually improves it.",
    "authors": [
        "Daniel Bolya",
        "Cheng-Yang Fu",
        "Xiaoliang Dai",
        "Peizhao Zhang",
        "Judy Hoffman"
    ],
    "venue": "ECCV Workshops",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces Hydra Attention, an extremely efficient attention operation for Vision Transformers (ViTs), which is computationally linear in both tokens and features with no hidden constants, making it significantly faster than standard self-attention in an off-the-shelf ViT-B/16 by a factor of the token count."
    },
    "citationCount": 48,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}