{
    "acronym": "ec5722239f25ddfaece8a539f142f314e4180106",
    "title": "Instance-Conditioned Adaptation for Large-scale Generalization of Neural Combinatorial Optimization",
    "seed_ids": [
        "aft",
        "647369ee45ecead812991f860caa8a96c6617063",
        "5f90d43e6ece5c6ee6e8186e4b57d46c85377713",
        "72da01c00ef44b039cefe7e9701da2b3d3412f71",
        "d5e999aae76d5270ef272076979c809817458212"
    ],
    "s2id": "ec5722239f25ddfaece8a539f142f314e4180106",
    "abstract": "The neural combinatorial optimization (NCO) approach has shown great potential for solving routing problems without the requirement of expert knowledge. However, existing constructive NCO methods cannot directly solve large-scale instances, which significantly limits their application prospects. To address these crucial shortcomings, this work proposes a novel Instance-Conditioned Adaptation Model (ICAM) for better large-scale generalization of neural combinatorial optimization. In particular, we design a powerful yet lightweight instance-conditioned adaptation module for the NCO model to generate better solutions for instances across different scales. In addition, we develop an efficient three-stage reinforcement learning-based training scheme that enables the model to learn cross-scale features without any labeled optimal solution. Experimental results show that our proposed method is capable of obtaining excellent results with a very fast inference time in solving Traveling Salesman Problems (TSPs) and Capacitated Vehicle Routing Problems (CVRPs) across different scales. To the best of our knowledge, our model achieves state-of-the-art performance among all RL-based constructive methods for TSP and CVRP with up to 1,000 nodes.",
    "authors": [
        "Changliang Zhou",
        "Xi Lin",
        "Zhenkun Wang",
        "Xialiang Tong",
        "Mingxuan Yuan",
        "Qingfu Zhang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel Instance-Conditioned Adaptation Model (ICAM) is proposed for better large-scale generalization of neural combinatorial optimization and achieves state-of-the-art performance among all RL-based constructive methods for TSP and CVRP with up to 1,000 nodes."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}