{
    "acronym": "ec93095046b3f49741cd29aff34bfc24ac2dea8d",
    "title": "Deep Activity Model: A Generative Approach for Human Mobility Pattern Synthesis",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "ec93095046b3f49741cd29aff34bfc24ac2dea8d",
    "abstract": "Human mobility significantly impacts various aspects of society, including transportation, urban planning, and public health. The increasing availability of diverse mobility data and advancements in deep learning have revolutionized mobility modeling. Existing deep learning models, however, mainly study spatio-temporal patterns using trajectories and often fall short in capturing the underlying semantic interdependency among activities. Moreover, they are also constrained by the data source. These two factors thereby limit their realism and adaptability, respectively. Meanwhile, traditional activity-based models (ABMs) in transportation modeling rely on rigid assumptions and are costly and time-consuming to calibrate, making them difficult to adapt and scale to new regions, especially those regions with limited amount of required conventional travel data. To address these limitations, we develop a novel generative deep learning approach for human mobility modeling and synthesis, using ubiquitous and open-source data. Additionally, the model can be fine-tuned with local data, enabling adaptable and accurate representations of mobility patterns across different regions. The model is evaluated on a nationwide dataset of the United States, where it demonstrates superior performance in generating activity chains that closely follow ground truth distributions. Further tests using state- or city-specific datasets from California, Washington, and Mexico City confirm its transferability. This innovative approach offers substantial potential to advance mobility modeling research, especially in generating human activity chains as input for downstream activity-based mobility simulation models and providing enhanced tools for urban planners and policymakers.",
    "authors": [
        "Xishun Liao",
        "Brian Yueshuai He",
        "Qinhua Jiang",
        "Chenchen Kuai",
        "Jiaqi Ma"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work develops a novel generative deep learning approach for human mobility modeling and synthesis, using ubiquitous and open-source data that demonstrates superior performance in generating activity chains that closely follow ground truth distributions."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}