{
    "acronym": "ecdc3b00321dc6dea7ba9c15797dd5fed6280a43",
    "title": "Extended Mind Transformers",
    "seed_ids": [
        "transformerxl",
        "memorizingtrans",
        "f5afaccfe90268485a9961c5771ec5e71e9b806c",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "0e802c0739771acf70e60d59c2df51cd7e8c50c0",
        "c1a4278f969acfc6682a924e31b95e1ade9703ee",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "f51497f463566581874c941353dd9d80069c5b77"
    ],
    "s2id": "ecdc3b00321dc6dea7ba9c15797dd5fed6280a43",
    "abstract": "Pre-trained language models demonstrate general intelligence and common sense, but long inputs quickly become a bottleneck for memorizing information at inference time. We resurface a simple method, Memorizing Transformers (Wu et al., 2022), that gives the model access to a bank of pre-computed memories. We show that it is possible to fix many of the shortcomings of the original method, such as the need for fine-tuning, by critically assessing how positional encodings should be updated for the keys and values retrieved. This intuitive method uses the model's own key/query system to select and attend to the most relevant memories at each generation step, rather than using external embeddings. We demonstrate the importance of external information being retrieved in a majority of decoder layers, contrary to previous work. We open source a new counterfactual long-range retrieval benchmark, and show that Extended Mind Transformers outperform today's state of the art by 6% on average.",
    "authors": [
        "Phoebe Klett",
        "Thomas Ahle"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work resurface a simple method, Memorizing Transformers, that gives the model access to a bank of pre-computed memories, and shows that it is possible to fix many of the shortcomings of the original method by critically assessing how positional encodings should be updated for the keys and values retrieved."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}