{
    "acronym": "ecf0f4f94ab215c2da098b0ea2cb3a49d124e27c",
    "title": "Deep Graph-Based Character-Level Chinese Dependency Parsing",
    "seed_ids": [
        "transformerxl",
        "a022bda79947d1f656a1164003c1b3ae9a843df9",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "ecf0f4f94ab215c2da098b0ea2cb3a49d124e27c",
    "abstract": "Character-level Chinese dependency parsing has been a concern of several studies that naturally handle word segmentation, POS (Part of Speech) tagging and dependency parsing jointly in an end-to-end way. Previous work mostly concentrates on a transition-based framework for this task because of its easy adaption, which is extremely important when feature representation relies heavily on the decoding strategy, particularly under the traditional statistical setting. Recently, on the one hand, sophisticated deep neural networks and deep contextualized word representations have greatly weakened the dependence between feature representation and decoding. On the other hand, (first-order) graph-based models, especially the biaffine parsers, are straightforward for dependency parsing, and meanwhile they can yield competitive parsing performance. In this paper, we make a comprehensive investigation of the deep graph-based character-level dependency parsing for Chinese. We start from an extension of a standard graph-based biaffine parser, and then exploit Chinese BERT as well as our improved encoders based on transformers to enhance the character-level dependency parsing model. We conduct a series of experiments on the Chinese benchmark datasets, showing the performances of various graph-based character-level models and analyzing the advantages of the character-level dependency parsing under the deep neural setting.",
    "authors": [
        "Linzhi Wu",
        "Meishan Zhang"
    ],
    "venue": "IEEE/ACM Transactions on Audio Speech and Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper starts from an extension of a standard graph-based biaffine parser, and then exploits Chinese BERT as well as improved encoders based on transformers to enhance the character-level dependency parsing model."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}