{
    "acronym": "ed1aaad1beac180a33d74a539300a1fcb62a15ec",
    "title": "Uniform Memory Retrieval with Larger Capacity for Modern Hopfield Models",
    "seed_ids": [
        "hopfield",
        "9a169c3f4b86bfd4b5c2c6825a6ca652fbd6c9a0",
        "b44e41fcaaead1b50f20fda0c78d395b51002f7f",
        "eede8ab9a9cf3b71b61cff7a3bc6fcc9bcf1f2a1",
        "faf7488da821133dbf34fe006676adfda4a764a0",
        "aa085ed9a77d815d3c1d19a468be1d9a8d3efd13",
        "fefce2a7218815734cefeab724e7b69adea1df9a",
        "28863db0ed342b2a465a718fe835ccbd2e54c3e3",
        "ca04700240c273a4ca237607ef5a1cbf9163fa16",
        "e788a19d344f95bca85ac505786938f32edce7e2",
        "4b0541eccd8f98852d6807a14fbac17f775c7b40",
        "5f895e84c1fea75de07b4f90da518273c2e57291",
        "eb95b02edfaeb28f528b5ee8b705388bb9a933be",
        "35a9749df07a2ab97c51af4d260b095b00da7676",
        "562bf6d0aac2c6362086ef4c80503de8ea56b340",
        "b1c39d042fdf8f00a407b0df734764beb6c3b062",
        "f6390beca54411b06f3bde424fb983a451789733",
        "56cec7ad226600cba536a25590c488888e20db96"
    ],
    "s2id": "ed1aaad1beac180a33d74a539300a1fcb62a15ec",
    "abstract": "We propose a two-stage memory retrieval dynamics for modern Hopfield models, termed $\\mathtt{U\\text{-}Hop}$, with enhanced memory capacity. Our key contribution is a learnable feature map $\\Phi$ which transforms the Hopfield energy function into kernel space. This transformation ensures convergence between the local minima of energy and the fixed points of retrieval dynamics within the kernel space. Consequently, the kernel norm induced by $\\Phi$ serves as a novel similarity measure. It utilizes the stored memory patterns as learning data to enhance memory capacity across all modern Hopfield models. Specifically, we accomplish this by constructing a separation loss $\\mathcal{L}_\\Phi$ that separates the local minima of kernelized energy by separating stored memory patterns in kernel space. Methodologically, $\\mathtt{U\\text{-}Hop}$ memory retrieval process consists of: (Stage I) minimizing separation loss for a more uniform memory (local minimum) distribution, followed by (Stage II) standard Hopfield energy minimization for memory retrieval. This results in a significant reduction of possible metastable states in the Hopfield energy function, thus enhancing memory capacity by preventing memory confusion. Empirically, with real-world datasets, we demonstrate that $\\mathtt{U\\text{-}Hop}$ outperforms all existing modern Hopfield models and state-of-the-art similarity measures, achieving substantial improvements in both associative memory retrieval and deep learning tasks. Code is available at https://github.com/MAGICS-LAB/UHop ; future updates are on arXiv:2404.03827",
    "authors": [
        "Dennis Wu",
        "Jerry Yao-Chieh Hu",
        "Teng-Yun Hsiao",
        "Han Liu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Empirically, with real-world datasets, the proposed two-stage memory retrieval dynamics for modern Hopfield models outperforms all existing modern Hopfield models and state-of-the-art similarity measures, achieving substantial improvements in both associative memory retrieval and deep learning tasks."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}