{
    "acronym": "ed38c6b157c11476939c426ec6871c926f2f3524",
    "title": "Leveraging Large Language Models for Multiple Choice Question Answering",
    "seed_ids": [
        "gpt2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "04f4e55e14150b7c48b0287ba77c7443df76ed45",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "8b0f27bb594b1eaaf493eaf1e2ee723a2b0a19ad",
        "f6fbb6809374ca57205bd2cf1421d4f4fa04f975",
        "6ff68b34a5f78bdd14437fe5a79aebbc42c26467",
        "9405cc0d6169988371b2755e573cc28650d14dfe",
        "c21a4d70d83e0f6eb2a9e1c41d034842dd561e47",
        "92e121c6e114fe3cfb89370df03847c66a9b4e28"
    ],
    "s2id": "ed38c6b157c11476939c426ec6871c926f2f3524",
    "abstract": "While large language models (LLMs) like GPT-3 have achieved impressive results on multiple choice question answering (MCQA) tasks in the zero, one, and few-shot settings, they generally lag behind the MCQA state of the art (SOTA). MCQA tasks have traditionally been presented to LLMs like cloze tasks. An LLM is conditioned on a question (without the associated answer options) and its chosen option is the one assigned the highest probability after normalization (for length, etc.). A more natural prompting approach is to present the question and answer options to the LLM jointly and have it output the symbol (e.g.,\"A\") associated with its chosen answer option. This approach allows the model to explicitly compare answer options, reduces computational costs, and mitigates the effects of tokenization scheme and answer option representations on answer selection. For the natural approach to be effective, the LLM it is used with must be able to associate answer options with the symbols that represent them. The LLM needs what we term multiple choice symbol binding (MCSB) ability. This ability varies greatly by model. We show that a model with high MCSB ability performs much better with the natural approach than with the traditional approach across 20 diverse datasets and largely closes the gap with the SOTA, suggesting that the MCQA ability of LLMs has been previously underestimated.",
    "authors": [
        "Joshua Robinson",
        "Christopher Rytting",
        "D. Wingate"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is shown that a model with high MCSB ability performs much better with the natural approach than with the traditional approach across 20 diverse datasets and largely closes the gap with the SOTA, suggesting that the MCQA ability of LLMs has been previously underestimated."
    },
    "citationCount": 125,
    "influentialCitationCount": 13,
    "code": null,
    "description": null,
    "url": null
}