{
    "acronym": "ed535e93d5b5a8b689e861e9c6083a806d1535c2",
    "title": "The Devil is in the Detail: Simple Tricks Improve Systematic Generalization of Transformers",
    "seed_ids": [
        "transformerxl",
        "universaltrans",
        "49e65b12d8d11f2ccb5ddd7be72a8f746b2d1bc2",
        "86589b6286ef3c55b8b4fccfb41a3b30b7afdf61",
        "1a703f08da01cf737cce3fb9064259b3f4b44e9c",
        "5cdab78acc4f3aab429a0dd41c3ec7e605d42e7b",
        "4cf963e5fd88825ac62ad6cce364447e5d2dfb2b",
        "07fa8c8a703abd7496f4781e9dee53d5de9c8717"
    ],
    "s2id": "ed535e93d5b5a8b689e861e9c6083a806d1535c2",
    "abstract": "Recently, many datasets have been proposed to test the systematic generalization ability of neural networks. The companion baseline Transformers, typically trained with default hyper-parameters from standard tasks, are shown to fail dramatically. Here we demonstrate that by revisiting model configurations as basic as scaling of embeddings, early stopping, relative positional embedding, and Universal Transformer variants, we can drastically improve the performance of Transformers on systematic generalization. We report improvements on five popular datasets: SCAN, CFQ, PCFG, COGS, and Mathematics dataset. Our models improve accuracy from 50% to 85% on the PCFG productivity split, and from 35% to 81% on COGS. On SCAN, relative positional embedding largely mitigates the EOS decision problem (Newman et al., 2020), yielding 100% accuracy on the length split with a cutoff at 26. Importantly, performance differences between these models are typically invisible on the IID data split. This calls for proper generalization validation sets for developing neural networks that generalize systematically. We publicly release the code to reproduce our results.",
    "authors": [
        "R. Csordás",
        "Kazuki Irie",
        "J. Schmidhuber"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "By revisiting model configurations as basic as scaling of embeddings, early stopping, relative positional embedding, and Universal Transformer variants, this work can drastically improve the performance of Transformers on systematic generalization."
    },
    "citationCount": 111,
    "influentialCitationCount": 16,
    "code": null,
    "description": null,
    "url": null
}