{
    "acronym": "ed57ee53b8bf289c46b588198e281c9ad73182fb",
    "title": "Two-Stage Aggregation with Dynamic Local Attention for Irregular Time Series",
    "seed_ids": [
        "gmlp",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "ed57ee53b8bf289c46b588198e281c9ad73182fb",
    "abstract": "Irregular multivariate time series data is characterized by varying time intervals between consecutive observations of measured variables/signals (i.e., features) and varying sampling rates (i.e., recordings/measurement) across these features. Modeling time series while taking into account these irregularities is still a challenging task for machine learning methods. Here, we introduce TADA, a Two-stageAggregation process with Dynamic local Attention to harmonize time-wise and feature-wise irregularities in multivariate time series. In the first stage, the irregular time series undergoes temporal embedding (TE) using all available features at each time step. This process preserves the contribution of each available feature and generates a fixed-dimensional representation per time step. The second stage introduces a dynamic local attention (DLA) mechanism with adaptive window sizes. DLA aggregates time recordings using feature-specific windows to harmonize irregular time intervals capturing feature-specific sampling rates. Then hierarchical MLP mixer layers process the output of DLA through multiscale patching to leverage information at various scales for the downstream tasks. TADA outperforms state-of-the-art methods on three real-world datasets, including the latest MIMIC IV dataset, and highlights its effectiveness in handling irregular multivariate time series and its potential for various real-world applications.",
    "authors": [
        "Xingyu Chen",
        "Xiaochen Zheng",
        "Amina Mollaysa",
        "Manuel Schurch",
        "Ahmed Allam",
        "Michael Krauthammer"
    ],
    "venue": "",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "TADA outperforms state-of-the-art methods on three real-world datasets, including the latest MIMIC IV dataset, and highlights its effectiveness in handling irregular multivariate time series and its potential for various real-world applications."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}