{
    "acronym": "ed6190903e1ac5f29aef1e096f1e998df1db1dfc",
    "title": "Deep Neural Network-based Voting Assistant",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "ed6190903e1ac5f29aef1e096f1e998df1db1dfc",
    "abstract": "Voting Advice Applications (VAA) have become an integral part of today’s elections and voting procedures. They seemingly have not evolved a lot since their rise to popularity. Smartvote, a popular VAA in Switzerland, provided us with a large amount of data. With this data, from the Swiss national council elections of 2019, we push for innovation in the field of VAAs. Despite the large amounts of data available, machine learning has not yet established itself in the area of voting advice. In this thesis, we explore the possibilities given such data. In order to achieve our goals, we apply natural language processing techniques to solve both existing and new tasks. A common task is to recommend to voters the party with which they have the most overlapping political opinions. This is our starting task to ensure our understanding and the functionality of NLP methods for this data set. Most interestingly, we tackle tasks that could push democracy as well as VAAs forward, given the arising opportunities. We are able to finetune a Transformer based model, called Longformer[1], to predict answers for questions with very high testing accuracy, if the question is seen during training. The significantly more difficult task of predicting answers to questions unknown at the time of training also shows very promising results. We find the latter task to be very dependent on the chosen input context as well as the questions to be predicted. Therefore, the task outlines limitations of the data we use. Thus, encouraging the application of a model like ours for design choices when planning a questionnaire for voting advice. Our findings pave the way for new exiting possibilities in the domain of politics and advice systems, as we present a model that is able to learn political contexts and profiles, allowing it to predict future opinions.",
    "authors": [
        "Matthias Alexander Kleiner"
    ],
    "venue": "",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The findings pave the way for new exiting possibilities in the domain of politics and advice systems, as a model that is able to learn political contexts and profiles is presented, allowing it to predict future opinions."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}