{
    "acronym": "ed98ae2c7aec315488372476e964da3e3846360d",
    "title": "Low-Resource Dialogue Summarization with Domain-Agnostic Multi-Source Pretraining",
    "seed_ids": [
        "lighdynconv",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0"
    ],
    "s2id": "ed98ae2c7aec315488372476e964da3e3846360d",
    "abstract": "With the rapid increase in the volume of dialogue data from daily life, there is a growing demand for dialogue summarization. Unfortunately, training a large summarization model is generally infeasible due to the inadequacy of dialogue data with annotated summaries. Most existing works for low-resource dialogue summarization directly pretrain models in other domains, e.g., the news domain, but they generally neglect the huge difference between dialogues and conventional articles. To bridge the gap between out-of-domain pretraining and in-domain fine-tuning, in this work, we propose a multi-source pretraining paradigm to better leverage the external summary data. Specifically, we exploit large-scale in-domain non-summary data to separately pretrain the dialogue encoder and the summary decoder. The combined encoder-decoder model is then pretrained on the out-of-domain summary data using adversarial critics, aiming to facilitate domain-agnostic summarization. The experimental results on two public datasets show that with only limited training data, our approach achieves competitive performance and generalizes well in different dialogue scenarios.",
    "authors": [
        "Yicheng Zou",
        "Bolin Zhu",
        "Xingwu Hu",
        "Tao Gui",
        "Qi Zhang"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work exploits large-scale in-domain non-summary data to separately pretrain the dialogue encoder and the summary decoder and pretrained on the out-of-domain summary data using adversarial critics, aiming to facilitate domain-agnostic summarization."
    },
    "citationCount": 28,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}