{
    "acronym": "edfdd5c047ed4cabbde2e876046ed2a9d4ed0164",
    "title": "Surfer100: Generating Surveys From Web Resources, Wikipedia-style",
    "seed_ids": [
        "memcompress",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "0bd5beed98675a63f9207851674d478009549900",
        "7cc730da554003dda77796d2cb4f06da5dfd5592"
    ],
    "s2id": "edfdd5c047ed4cabbde2e876046ed2a9d4ed0164",
    "abstract": "Fast-developing fields such as Artificial Intelligence (AI) often outpace the efforts of encyclopedic sources such as Wikipedia, which either do not completely cover recently-introduced topics or lack such content entirely. As a result, methods for automatically producing content are valuable tools to address this information overload. We show that recent advances in pretrained language modeling can be combined for a two-stage extractive and abstractive approach for Wikipedia lead paragraph generation. We extend this approach to generate longer Wikipedia-style summaries with sections and examine how such methods struggle in this application through detailed studies with 100 reference human-collected surveys. This is the first study on utilizing web resources for long Wikipedia-style summaries to the best of our knowledge.",
    "authors": [
        "Irene Li",
        "Alexander R. Fabbri",
        "Rina Kawamura",
        "Yixin Liu",
        "Xiangru Tang",
        "Jaesung Tae",
        "Chang Shen",
        "Sally Ma",
        "Tomoe Mizutani",
        "Dragomir R. Radev"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study shows that recent advances in pretrained language modeling can be combined for a two-stage extractive and abstractive approach for Wikipedia lead paragraph generation, and extends this approach to generate longer Wikipedia-style summaries with sections."
    },
    "citationCount": 4,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}