{
    "acronym": "edfedeb1e9cf26b3537f87926d6f6cd3a05efcaf",
    "title": "Spatio-Spectral Graph Neural Networks",
    "seed_ids": [
        "hyena",
        "2dda6da7375bf5e8bcf60f87b17ba10757f3bc57",
        "59b7448f816908cfb49a2ab5e63b2fa5786387f7",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "3ea31f9b80bb69537f11f2c0e7d39c97d0742e3b",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "277dd73bfeb5c46513ce305136b0e71fcd2a311c"
    ],
    "s2id": "edfedeb1e9cf26b3537f87926d6f6cd3a05efcaf",
    "abstract": "Spatial Message Passing Graph Neural Networks (MPGNNs) are widely used for learning on graph-structured data. However, key limitations of l-step MPGNNs are that their\"receptive field\"is typically limited to the l-hop neighborhood of a node and that information exchange between distant nodes is limited by over-squashing. Motivated by these limitations, we propose Spatio-Spectral Graph Neural Networks (S$^2$GNNs) -- a new modeling paradigm for Graph Neural Networks (GNNs) that synergistically combines spatially and spectrally parametrized graph filters. Parameterizing filters partially in the frequency domain enables global yet efficient information propagation. We show that S$^2$GNNs vanquish over-squashing and yield strictly tighter approximation-theoretic error bounds than MPGNNs. Further, rethinking graph convolutions at a fundamental level unlocks new design spaces. For example, S$^2$GNNs allow for free positional encodings that make them strictly more expressive than the 1-Weisfeiler-Lehman (WL) test. Moreover, to obtain general-purpose S$^2$GNNs, we propose spectrally parametrized filters for directed graphs. S$^2$GNNs outperform spatial MPGNNs, graph transformers, and graph rewirings, e.g., on the peptide long-range benchmark tasks, and are competitive with state-of-the-art sequence modeling. On a 40 GB GPU, S$^2$GNNs scale to millions of nodes.",
    "authors": [
        "Simon Geisler",
        "Arthur Kosmala",
        "Daniel Herbst",
        "Stephan Gunnemann"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A new modeling paradigm for Graph Neural Networks (GNNs) that synergistically combines spatially and spectrally parametrized graph filters that outperform spatial MPGNNs, graph transformers, and graph rewirings, and are competitive with state-of-the-art sequence modeling."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}