{
    "acronym": "ee1c4b8549d6d94ddd6b25741eaeac27931b72d3",
    "title": "Toward Unified Controllable Text Generation via Regular Expression Instruction",
    "seed_ids": [
        "diffusionlm",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "12daedd80a4f860960c5b50314d09d6827f4fd4a",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "b21670e8061a06ab97e7d6052c9345a326e84ff8",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "4a6a65968a8eb8c09ffb57a7774ddabb596565b1",
        "b6c4a96e09b9f11e7c70e7f1fbe3f3971b92762d",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "75acc731bdd2b626edc74672a30da3bc51010ae8"
    ],
    "s2id": "ee1c4b8549d6d94ddd6b25741eaeac27931b72d3",
    "abstract": "Controllable text generation is a fundamental aspect of natural language generation, with numerous methods proposed for different constraint types. However, these approaches often require significant architectural or decoding modifications, making them challenging to apply to additional constraints or resolve different constraint combinations. To address this, our paper introduces Regular Expression Instruction (REI), which utilizes an instruction-based mechanism to fully exploit regular expressions' advantages to uniformly model diverse constraints. Specifically, our REI supports all popular fine-grained controllable generation constraints, i.e., lexical, positional, and length, as well as their complex combinations, via regular expression-style instructions. Our method only requires fine-tuning on medium-scale language models or few-shot, in-context learning on large language models, and requires no further adjustment when applied to various constraint combinations. Experiments demonstrate that our straightforward approach yields high success rates and adaptability to various constraints while maintaining competitiveness in automatic metrics and outperforming most previous baselines.",
    "authors": [
        "Xin Zheng",
        "Hongyu Lin",
        "Xianpei Han",
        "Le Sun"
    ],
    "venue": "International Joint Conference on Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper introduces Regular Expression Instruction (REI), which utilizes an instruction-based mechanism to fully exploit regular expressions' advantages to uniformly model diverse constraints and yields high success rates and adaptability to various constraints while maintaining competitiveness in automatic metrics and outperforming most previous baselines."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}