{
    "acronym": "ee6a83a6127a9292700cbb1d6d81dae88514cf22",
    "title": "Enhancing Arabic offensive language detection with BERT-BiGRU model",
    "seed_ids": [
        "bert"
    ],
    "s2id": "ee6a83a6127a9292700cbb1d6d81dae88514cf22",
    "abstract": "With the advent of Web 2.0, various platforms and tools have been developed to allow internet users to express their opinions and thoughts on diverse topics and occurrences. Nevertheless, certain users misuse these platforms by sharing hateful and offensive speeches, which has a negative impact on the mental health of internet society. Thus, the detection of offensive language has become an active area of research in the field of natural language processing. Rapidly detecting offensive language on the internet and preventing it from spreading is of great practical significance in reducing cyberbullying and self-harm behaviors. Despite the crucial importance of this task, limited work has been done in this field for nonEnglish languages such as Arabic. Therefore, in this paper, we aim to improve the results of Arabic offensive language detection without the need for laborious preprocessing or feature engineering work. To achieve this, we combine the bidirectional encoder representations from transformers (BERT) model model with a bidirectional gated recurrent unit (BiGRU) layer to further enhance the extracted context and semantic features. The experiments were conducted on the Arabic dataset provided by the SemEval 2020 Task 12. The evaluation results show the effectiveness of our model compared to the baseline and related work models by achieving a macro F1- score of 93.16%.",
    "authors": [
        "Rajae Bensoltane",
        "Taher Zaki"
    ],
    "venue": "Bulletin of Electrical Engineering and Informatics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A bidirectional encoder representations from transformers (BERT) model model with a bidirectional gated recurrent unit (BiGRU) layer is combined to further enhance the extracted context and semantic features of Arabic offensive language detection without the need for laborious preprocessing or feature engineering work."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}