{
    "acronym": "eeefff7329f84c2393585bbaa941eadb86037a55",
    "title": "Multilevel Intrusion Detection Based on Transformer and Wavelet Transform for IoT Data Security",
    "seed_ids": [
        "transformer",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06"
    ],
    "s2id": "eeefff7329f84c2393585bbaa941eadb86037a55",
    "abstract": "The Internet of Things (IoT) technology and systems have penetrated every aspect of our lives and generated enormous economic benefits. At the same time, research on the data security of IoT systems has been one of the key topics in IoT fields. Network attacks and intrusions have become the main threats to the data security of the IoTs, which have become the main obstacles to the development and application of the IoTs. In this article, we propose an intrusions and attack detection model to ensure the data security of IoT systems by using the Transformer model and multiwavelets learning. Based on the architecture of IoT systems, we first proposed a multilevel intrusion detection model to detect attack data in the cloud layer and edge terminal layer. In this detection model, a Transformer model and discrete wavelet transform (DWT)-based approach are proposed to ensure the effectiveness and accuracy of the model. To extract and make full use of frequency information of traffic data in an IoT network, we embed DWT technique and multiwavelets learning into the Transformer model to propose a novel DWT-based Transformer architecture, which achieves outstanding performance in detecting intrusion actions. Simulating on IoT system in the laboratory environment, the proposed security prediction model achieves pretty good performance in predicting intrusion actions.",
    "authors": [
        "Peifeng Liang",
        "Lina Yang",
        "Z. Xiong",
        "Xuemin Zhang",
        "Gang Liu"
    ],
    "venue": "IEEE Internet of Things Journal",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An intrusions and attack detection model to ensure the data security of IoT systems by using the Transformer model and multiwavelets learning and a novel DWT-based Transformer architecture is proposed, which achieves outstanding performance in detecting intrusion actions."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}