{
    "acronym": "ef4814b9a39291f08cc172b6fe4b1f7365125afc",
    "title": "Scenario-Aware Recurrent Transformer for Goal-Directed Video Captioning",
    "seed_ids": [
        "transformerxl",
        "70557ea6b65846fc30729ceed224acd4ac64ca5d",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "ef4814b9a39291f08cc172b6fe4b1f7365125afc",
    "abstract": "Fully mining visual cues to aid in content understanding is crucial for video captioning. However, most state-of-the-art video captioning methods are limited to generating captions purely based on straightforward information while ignoring the scenario and context information. To fill the gap, we propose a novel, simple but effective scenario-aware recurrent transformer (SART) model to execute video captioning. Our model contains a “scenario understanding” module to obtain a global perspective across multiple frames, providing a specific scenario to guarantee a goal-directed description. Moreover, for the sake of achieving narrative continuity in the generated paragraph, a unified recurrent transformer is adopted. To demonstrate the effectiveness of our proposed SART, we have conducted comprehensive experiments on various large-scale video description datasets, including ActivityNet, YouCookII, and VideoStory. Additionally, we extend a story-oriented evaluation framework for assessing the quality of the generated caption more precisely. The superior performance has shown that SART has a strong ability to generate correct, deliberative, and narrative coherent video descriptions.",
    "authors": [
        "Xin Man",
        "Deqiang Ouyang",
        "Xiangpeng Li",
        "Jingkuan Song",
        "Jie Shao"
    ],
    "venue": "ACM Trans. Multim. Comput. Commun. Appl.",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a novel, simple but effective scenario-aware recurrent transformer (SART) model to execute video captioning, containing a “scenario understanding” module to obtain a global perspective across multiple frames, providing a specific scenario to guarantee a goal-directed description."
    },
    "citationCount": 25,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}