{
    "acronym": "ef5a085e4e94e97994673eaa06fb095ca306f9dc",
    "title": "Real-time emotion generation in human-robot dialogue using large language models",
    "seed_ids": [
        "gpt3"
    ],
    "s2id": "ef5a085e4e94e97994673eaa06fb095ca306f9dc",
    "abstract": "Affective behaviors enable social robots to not only establish better connections with humans but also serve as a tool for the robots to express their internal states. It has been well established that emotions are important to signal understanding in Human-Robot Interaction (HRI). This work aims to harness the power of Large Language Models (LLM) and proposes an approach to control the affective behavior of robots. By interpreting emotion appraisal as an Emotion Recognition in Conversation (ERC) tasks, we used GPT-3.5 to predict the emotion of a robot’s turn in real-time, using the dialogue history of the ongoing conversation. The robot signaled the predicted emotion using facial expressions. The model was evaluated in a within-subjects user study (N = 47) where the model-driven emotion generation was compared against conditions where the robot did not display any emotions and where it displayed incongruent emotions. The participants interacted with the robot by playing a card sorting game that was specifically designed to evoke emotions. The results indicated that the emotions were reliably generated by the LLM and the participants were able to perceive the robot’s emotions. It was found that the robot expressing congruent model-driven facial emotion expressions were perceived to be significantly more human-like, emotionally appropriate, and elicit a more positive impression. Participants also scored significantly better in the card sorting game when the robot displayed congruent facial expressions. From a technical perspective, the study shows that LLMs can be used to control the affective behavior of robots reliably in real-time. Additionally, our results could be used in devising novel human-robot interactions, making robots more effective in roles where emotional interaction is important, such as therapy, companionship, or customer service.",
    "authors": [
        "Chinmaya Mishra",
        "Rinus G. Verdonschot",
        "P. Hagoort",
        "G. Skantze"
    ],
    "venue": "Frontiers Robotics AI",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The study shows that LLMs can be used to control the affective behavior of robots reliably in real-time and could be used in devising novel human-robot interactions, making robots more effective in roles where emotional interaction is important, such as therapy, companionship, or customer service."
    },
    "citationCount": 10,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}