{
    "acronym": "ef7c03ccd3a044d92a8c457c9bb969c6344f9d5c",
    "title": "GhostBERT: Generate More Features with Cheap Operations for BERT",
    "seed_ids": [
        "lighdynconv",
        "2a218786f4615b82389f78472e7ff22e6ce57490",
        "b0cd93e95fb6885db47d755a4c631158b0198047",
        "8af925f4edf45131b5b6fed8aa655089d58692fa",
        "2573af4e13d9a5dddb257d22cd38a600528d9a8b",
        "80cf2a6af4200ecfca1c18fc89de16148f1cd4bf",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c"
    ],
    "s2id": "ef7c03ccd3a044d92a8c457c9bb969c6344f9d5c",
    "abstract": "Transformer-based pre-trained language models like BERT, though powerful in many tasks, are expensive in both memory and computation, due to their large number of parameters. Previous works show that some parameters in these models can be pruned away without severe accuracy drop. However, these redundant features contribute to a comprehensive understanding of the training data and removing them weakens the model’s representation ability. In this paper, we propose GhostBERT, which generates more features with very cheap operations from the remaining features. In this way, GhostBERT has similar memory and computational cost as the pruned model, but enjoys much larger representation power. The proposed ghost module can also be applied to unpruned BERT models to enhance their performance with negligible additional parameters and computation. Empirical results on the GLUE benchmark on three backbone models (i.e., BERT, RoBERTa and ELECTRA) verify the efficacy of our proposed method.",
    "authors": [
        "Zhiqi Huang",
        "Lu Hou",
        "Lifeng Shang",
        "Xin Jiang",
        "Xiao Chen",
        "Qun Liu"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "GhostBERT is proposed, which generates more features with very cheap operations from the remaining features of BERT, and has similar memory and computational cost as the pruned model, but enjoys much larger representation power."
    },
    "citationCount": 22,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}