{
    "acronym": "efbcb368bdc1f27ec13584d65034321837169ae1",
    "title": "Practical Real Time Recurrent Learning with a Sparse Approximation",
    "seed_ids": [
        "transformerxl"
    ],
    "s2id": "efbcb368bdc1f27ec13584d65034321837169ae1",
    "abstract": "Recurrent neural networks are usually trained with backpropagation through time, which requires storing a complete history of network states, and prohibits updating the weights ‘online’ (after every timestep). Real Time Recurrent Learning (RTRL) eliminates the need for history storage and allows for online weight updates, but does so at the expense of computational costs that are quartic in the state size. This renders RTRL training intractable for all but the smallest networks, even ones that are made highly sparse. We introduce the Sparse n-step Approximation (SnAp) to the RTRL inﬂuence matrix. SnAp only tracks the inﬂuence of a parameter on hidden units that are reached by the computation graph within n timesteps of the recurrent core. SnAp with n = 1 is no more expensive than backpropagation but allows training on arbitrarily long sequences. We ﬁnd that it substantially outperforms other RTRL approximations with comparable costs such as Unbiased Online Recurrent Optimization. For highly sparse networks, SnAp with n = 2 remains tractable and can outperform backpropagation through time in terms of learning speed when updates are done online.",
    "authors": [
        "Jacob Menick",
        "Erich Elsen",
        "Utku Evci",
        "Simon Osindero",
        "K. Simonyan",
        "Alex Graves"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Sparse n-step Approximation (SnAp) is introduced to the RTRL inﬂuence matrix and substantially outperforms other RTRL approximations with comparable costs such as Unbiased Online Recurrent Optimization."
    },
    "citationCount": 13,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}