{
    "acronym": "efc50d7ee5bcd8039ba5d686d7d943be3ff199b0",
    "title": "Efficient Multimodal Large Language Models: A Survey",
    "seed_ids": [
        "s4",
        "mamba",
        "rwkv4",
        "gqa",
        "mqa",
        "funneltransformer",
        "linformer",
        "reformer",
        "dssm",
        "e66f54d35d7218dc2d4de380981f49e7e32648ac",
        "24354722e36c358b69893ab05220d6f2291989d1",
        "6d49ed0ea24b9c218f5ec6731cd261ce618df2ac",
        "dcb74fb63acd87d3db0a77de89720300fb28b50a",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "f35016b3180808fa97d59acbdecf47d6e2ed2819",
        "dd1139cfc609c2f3263d02e97176d5275caebc0a",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "0b991a1a5bcdb13646ac0b6873d09bde4cc36fb5"
    ],
    "s2id": "efc50d7ee5bcd8039ba5d686d7d943be3ff199b0",
    "abstract": "In the past year, Multimodal Large Language Models (MLLMs) have demonstrated remarkable performance in tasks such as visual question answering, visual understanding and reasoning. However, the extensive model size and high training and inference costs have hindered the widespread application of MLLMs in academia and industry. Thus, studying efficient and lightweight MLLMs has enormous potential, especially in edge computing scenarios. In this survey, we provide a comprehensive and systematic review of the current state of efficient MLLMs. Specifically, we summarize the timeline of representative efficient MLLMs, research state of efficient structures and strategies, and the applications. Finally, we discuss the limitations of current efficient MLLM research and promising future directions. Please refer to our GitHub repository for more details: https://github.com/lijiannuist/Efficient-Multimodal-LLMs-Survey.",
    "authors": [
        "Yizhang Jin",
        "Jian Li",
        "Yexin Liu",
        "Tianjun Gu",
        "Kai Wu",
        "Zhengkai Jiang",
        "Muyang He",
        "Bo Zhao",
        "Xin Tan",
        "Zhenye Gan",
        "Yabiao Wang",
        "Chengjie Wang",
        "Lizhuang Ma"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey provides a comprehensive and systematic review of the current state of efficient MLLMs, including the timeline of representative efficient MLLMs, research state of efficient structures and strategies, and the applications."
    },
    "citationCount": 6,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}