{
    "acronym": "f04634963ae7237a4e7b1c74c5eb7d80b1d0d4b6",
    "title": "A novel feature integration method for named entity recognition model in product titles",
    "seed_ids": [
        "transformer",
        "d6b414487787d0b6efd735a3236a690ad13aae70",
        "80f9f109d1564cb8f82aa440a5f6f3fbe220c9ef"
    ],
    "s2id": "f04634963ae7237a4e7b1c74c5eb7d80b1d0d4b6",
    "abstract": "Entity recognition of product titles is essential for retrieving and recommending product information. Due to the irregularity of product title text, such as informal sentence structure, a large number of professional attribute words, a large number of unrelated independent entities of various combinations, the existing general named entity recognition model is limited in the e‐commerce field of product title entity recognition. Most of the current studies focus on only one of the two challenges instead of considering the two challenges together. Our approach proposes NEZHA‐CNN‐GlobalPointer architecture with the addition of label semantic network, and uses multigranularity contextual and label semantic information to fully capture the internal structure and category information of words and texts to improve the entity recognition accuracy. Through a series of experiments, we proved the efficiency of our approach over a dataset of Chinese product titles from JD.com, improving the F1‐value by 5.98%, when compared to the BERT‐LSTM‐CRF model on the product title corpus.",
    "authors": [
        "Shiqi Sun",
        "Kun Zhang",
        "Jingyuan Li",
        "Xinghang Sun",
        "Jianhe Cen",
        "Yuanzhuo Wang"
    ],
    "venue": "International Conference on Climate Informatics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The approach proposes NEZHA‐CNN‐GlobalPointer architecture with the addition of label semantic network, and uses multigranularity contextual and label semantic information to fully capture the internal structure and category information of words and texts to improve the entity recognition accuracy."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}