{
    "acronym": "f057b7955cea8df587dead2512ccabdb514c24a7",
    "title": "Narrating Routines through Game Dynamics: Impact of a Gamified Routine Management App for Autistic Individuals",
    "seed_ids": [
        "bert"
    ],
    "s2id": "f057b7955cea8df587dead2512ccabdb514c24a7",
    "abstract": "Maintaining a daily routine has profound implications for physical, emotional, and social well-being. Autistic individuals may experience various challenges in establishing and maintaining a healthy daily routine due to their tendency to be inactive in daily life combined with their characteristics and preferences. Previous studies employing mobile technology to support autistic individuals have primarily focused on self-help functions, with limited exploration into the detailed needs of these individuals to develop and maintain personalized routines. In this study, we conducted a nine-week field study with 18 autistic individuals using RoutineAid, a gamified app designed to support key routines of autistic individuals (i.e., physical activity, diet, mindfulness, and sleep). Our analysis incorporated five measures of self-evaluation on daily life, app usage logs, Fitbit physical activity data, and interviews. Our findings demonstrate the effectiveness of RoutineAid and highlight its two primary affordances for autistic individuals: (1) promoting self-efficacy and embedding health behavior and (2) refining daily routines for healthier outcomes. We discuss salient design insights for developing daily routine management systems for autistic individuals.",
    "authors": [
        "Bogoan Kim",
        "Dayoung Jeong",
        "Hwajung Hong",
        "Kyungsik Han"
    ],
    "venue": "International Conference on Human Factors in Computing Systems",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The effectiveness of RoutineAid is demonstrated and its two primary affordances for autistic individuals are highlighted: promoting self-efficacy and embedding health behavior and refining daily routines for healthier outcomes."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}