{
    "acronym": "f0d37c2af188ec448eaa0ffd729b8bc8724dc17a",
    "title": "MeshXL: Neural Coordinate Field for Generative 3D Foundation Models",
    "seed_ids": [
        "gpt2",
        "13d12b26db345f62e8e512db181b96a7f8763b47",
        "830ed65d226a337088d6d97c3c3b068155bf10ec",
        "026b3396a63ed5772329708b7580d633bb86bec9",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f0d37c2af188ec448eaa0ffd729b8bc8724dc17a",
    "abstract": "The polygon mesh representation of 3D data exhibits great flexibility, fast rendering speed, and storage efficiency, which is widely preferred in various applications. However, given its unstructured graph representation, the direct generation of high-fidelity 3D meshes is challenging. Fortunately, with a pre-defined ordering strategy, 3D meshes can be represented as sequences, and the generation process can be seamlessly treated as an auto-regressive problem. In this paper, we validate the Neural Coordinate Field (NeurCF), an explicit coordinate representation with implicit neural embeddings, is a simple-yet-effective representation for large-scale sequential mesh modeling. After that, we present MeshXL, a family of generative pre-trained auto-regressive models, which addresses the process of 3D mesh generation with modern large language model approaches. Extensive experiments show that MeshXL is able to generate high-quality 3D meshes, and can also serve as foundation models for various down-stream applications.",
    "authors": [
        "Sijin Chen",
        "Xin Chen",
        "Anqi Pang",
        "Xianfang Zeng",
        "Wei Cheng",
        "Yijun Fu",
        "Fukun Yin",
        "Yanru Wang",
        "Zhibin Wang",
        "C. Zhang",
        "Jingyi Yu",
        "Gang Yu",
        "Bin Fu",
        "Tao Chen"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The Neural Coordinate Field (NeurCF), an explicit coordinate representation with implicit neural embeddings, is a simple-yet-effective representation for large-scale sequential mesh modeling and MeshXL, a family of generative pre-trained auto-regressive models, which addresses the process of 3D mesh generation with modern large language model approaches."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}