{
    "acronym": "f0f0b680ac74960922634e3da5cf1e6f6883c840",
    "title": "Protein generation with evolutionary diffusion: sequence is all you need",
    "seed_ids": [
        "d3pms",
        "9b2df9a5d91db2154a41d6e1887d335c5a62e3fe",
        "c51192d7440807dc98cc4374fb5d919390d70b0b",
        "7b14cef8a08519d7ea33800d52aba8410f48a3f7",
        "d55b69a533dea69c8b2673cde8de90c6626ee789",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "599bc7cfe98c2b57ddbe111412203a636da57be0"
    ],
    "s2id": "f0f0b680ac74960922634e3da5cf1e6f6883c840",
    "abstract": "Deep generative models are increasingly powerful tools for the in silico design of novel proteins. Recently, a family of generative models called diffusion models has demonstrated the ability to generate biologically plausible proteins that are dissimilar to any actual proteins seen in nature, enabling unprecedented capability and control in de novo protein design. However, current state-of-the-art models generate protein structures, which limits the scope of their training data and restricts generations to a small and biased subset of protein design space. Here, we introduce a general-purpose diffusion framework, EvoDiff, that combines evolutionary-scale data with the distinct conditioning capabilities of diffusion models for controllable protein generation in sequence space. EvoDiff generates high-fidelity, diverse, and structurally-plausible proteins that cover natural sequence and functional space. Critically, EvoDiff can generate proteins inaccessible to structure-based models, such as those with disordered regions, while maintaining the ability to design scaffolds for functional structural motifs, demonstrating the universality of our sequence-based formulation. We envision that EvoDiff will expand capabilities in protein engineering beyond the structure-function paradigm toward programmable, sequence-first design.",
    "authors": [
        "Sarah Alamdari",
        "Nitya Thakkar",
        "Rianne van den Berg",
        "Alex X. Lu",
        "Nicolo Fusi",
        "Ava P. Amini",
        "Kevin Kaichuang Yang"
    ],
    "venue": "bioRxiv",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A general-purpose diffusion framework that combines evolutionary-scale data with the distinct conditioning capabilities of diffusion models for controllable protein generation in sequence space, and envision that EvoDiff will expand capabilities in protein engineering beyond the structure-function paradigm toward programmable, sequence-first design."
    },
    "citationCount": 39,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}