{
    "acronym": "f144e2a41f3b657831b1885fa3922124a68675b9",
    "title": "Securing Reliability: A Brief Overview on Enhancing In-Context Learning for Foundation Models",
    "seed_ids": [
        "bert",
        "5c30033ef4ae122da51b466cc537126e3c2d7b7b",
        "4ea5ca620122e6a9a2b000444d36491cebf49c7c",
        "f8b8f926bbfa327c86c40796131fe2695db81126",
        "2be910eb19f2f8f2e8038d2a835bc48f868ccbf1",
        "aade40af0d85b0b4fe15c97f6222d5c2e4d6d9b3",
        "d62c4d00b277e948956b6610ce2644e88fe1577b",
        "1d26c947406173145a4665dd7ab255e03494ea28",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f144e2a41f3b657831b1885fa3922124a68675b9",
    "abstract": "As foundation models (FMs) continue to shape the landscape of AI, the in-context learning (ICL) paradigm thrives but also encounters issues such as toxicity, hallucination, disparity, adversarial vulnerability, and inconsistency. Ensuring the reliability and responsibility of FMs is crucial for the sustainable development of the AI ecosystem. In this concise overview, we investigate recent advancements in enhancing the reliability and trustworthiness of FMs within ICL frameworks, focusing on four key methodologies, each with its corresponding subgoals. We sincerely hope this paper can provide valuable insights for researchers and practitioners endeavoring to build safe and dependable FMs and foster a stable and consistent ICL environment, thereby unlocking their vast potential.",
    "authors": [
        "Yunpeng Huang",
        "Yaonan Gu",
        "Jingwei Xu",
        "Zhihong Zhu",
        "Zhaorun Chen",
        "Xiaoxing Ma"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This concise overview of recent advancements in enhancing the reliability and trustworthiness of FMs within ICL frameworks is investigated, focusing on four key methodologies, each with its corresponding subgoals."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}