{
    "acronym": "f1d39175484e58db627c0dcdbe96ebdfa6d22da1",
    "title": "SambaNova SN40L: Scaling the AI Memory Wall with Dataflow and Composition of Experts",
    "seed_ids": [
        "flashfftconv",
        "4c14b1c41cb0aaa68f5d3f4a432f55e7199657ea",
        "5c104f905fcacf390270f619f232a2ba4eb873f2",
        "0b0debb710366cdff461938c80763eace1651af6",
        "87c5b281fa43e6f27191b20a8dd694eda1126336"
    ],
    "s2id": "f1d39175484e58db627c0dcdbe96ebdfa6d22da1",
    "abstract": "Monolithic large language models (LLMs) like GPT-4 have paved the way for modern generative AI applications. Training, serving, and maintaining monolithic LLMs at scale, however, remains prohibitively expensive and challenging. The disproportionate increase in compute-to-memory ratio of modern AI accelerators have created a memory wall, necessitating new methods to deploy AI. Composition of Experts (CoE) is an alternative modular approach that lowers the cost and complexity of training and serving. However, this approach presents two key challenges when using conventional hardware: (1) without fused operations, smaller models have lower operational intensity, which makes high utilization more challenging to achieve; and (2) hosting a large number of models can be either prohibitively expensive or slow when dynamically switching between them. In this paper, we describe how combining CoE, streaming dataflow, and a three-tier memory system scales the AI memory wall. We describe Samba-CoE, a CoE system with 150 experts and a trillion total parameters. We deploy Samba-CoE on the SambaNova SN40L Reconfigurable Dataflow Unit (RDU) - a commercial dataflow accelerator architecture that has been co-designed for enterprise inference and training applications. The chip introduces a new three-tier memory system with on-chip distributed SRAM, on-package HBM, and off-package DDR DRAM. A dedicated inter-RDU network enables scaling up and out over multiple sockets. We demonstrate speedups ranging from 2x to 13x on various benchmarks running on eight RDU sockets compared with an unfused baseline. We show that for CoE inference deployments, the 8-socket RDU Node reduces machine footprint by up to 19x, speeds up model switching time by 15x to 31x, and achieves an overall speedup of 3.7x over a DGX H100 and 6.6x over a DGX A100.",
    "authors": [
        "R. Prabhakar",
        "R. Sivaramakrishnan",
        "Darshan Gandhi",
        "Yun Du",
        "Mingran Wang",
        "Xiangyu Song",
        "Kejie Zhang",
        "Tianren Gao",
        "Angela Wang",
        "Karen Li",
        "Yongning Sheng",
        "Joshua Brot",
        "Denis Sokolov",
        "Apurv Vivek",
        "Calvin Leung",
        "Arjun Sabnis",
        "Jiayu Bai",
        "Tuowen Zhao",
        "Mark Gottscho",
        "David Jackson",
        "Mark Luttrell",
        "Manish Shah",
        "Edison Chen",
        "Kaizhao Liang",
        "Swayambhoo Jain",
        "Urmish Thakker",
        "Dawei Huang",
        "Sumti Jairath",
        "Kevin J. Brown",
        "K. Olukotun"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Samba-CoE, a CoE system with 150 experts and a trillion total parameters is described and deployed on the SambaNova SN40L Reconfigurable Dataflow Unit (RDU) - a commercial dataflow accelerator architecture that has been co-designed for enterprise inference and training applications."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}