{
    "acronym": "f1f78bbb3e146874501e3c52b56cff6abf731842",
    "title": "Deep representation learning: Fundamentals, Perspectives, Applications, and Open Challenges",
    "seed_ids": [
        "lineartransformer",
        "9b069ba5259d229bfd4fe3ac3768148e2d1092f8",
        "6c761cfdb031701072582e434d8f64d436255da6",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530",
        "bf80051ca9ae1e76e2bdbdcf44df559e7eb73cb1",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "d27669c82faf78ea08cceaa0a171b540cccc304d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "3410e91c55ec78e4ec94b6a56897945e136d7cd8",
        "366244acdd930e488ae224ab6e2a92dc24aa7e06",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "d9f6ada77448664b71128bb19df15765336974a6",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "f1f78bbb3e146874501e3c52b56cff6abf731842",
    "abstract": "Machine Learning algorithms have had a profound impact on the field of computer science over the past few decades. These algorithms performance is greatly influenced by the representations that are derived from the data in the learning process. The representations learned in a successful learning process should be concise, discrete, meaningful, and able to be applied across a variety of tasks. A recent effort has been directed toward developing Deep Learning models, which have proven to be particularly effective at capturing high-dimensional, non-linear, and multi-modal characteristics. In this work, we discuss the principles and developments that have been made in the process of learning representations, and converting them into desirable applications. In addition, for each framework or model, the key issues and open challenges, as well as the advantages, are examined.",
    "authors": [
        "K. T. Baghaei",
        "A. Payandeh",
        "Pooya Fayyazsanavi",
        "Shahram Rahimi",
        "Zhiqian Chen",
        "Somayeh Bakhtiari Ramezani"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work discusses the principles and developments that have been made in the process of learning representations, and converting them into desirable applications, and for each framework or model, the key issues and open challenges are examined."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}