{
    "acronym": "f215148420a5be22282e9d136af693df52677adb",
    "title": "When Giant Language Brains Just Aren't Enough! Domain Pizzazz with Knowledge Sparkle Dust",
    "seed_ids": [
        "gpt",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "fd1b829261ba04bb92e0ab60c4f6e7cea0d99fbf",
        "7a15950dc71079285a4eaf195de5aadd87c41b40",
        "d9f6ada77448664b71128bb19df15765336974a6"
    ],
    "s2id": "f215148420a5be22282e9d136af693df52677adb",
    "abstract": "Large language models (LLMs) have significantly advanced the field of natural language processing, with GPT models at the forefront. While their remarkable performance spans a range of tasks, adapting LLMs for real-world business scenarios still poses challenges warranting further investigation. This paper presents an empirical analysis aimed at bridging the gap in adapting LLMs to practical use cases. To do that, we select the question answering (QA) task of insurance as a case study due to its challenge of reasoning. Based on the task we design a new model relied on LLMs which are empowered by additional knowledge extracted from insurance policy rulebooks and DBpedia. The additional knowledge helps LLMs to understand new concepts of insurance for domain adaptation. Preliminary results on two QA datasets show that knowledge enhancement significantly improves the reasoning ability of GPT-3.5 (55.80% and 57.83% in terms of accuracy). The analysis also indicates that existing public knowledge bases, e.g., DBPedia is beneficial for knowledge enhancement. Our findings reveal that the inherent complexity of business scenarios often necessitates the incorporation of domain-specific knowledge and external resources for effective problem-solving.",
    "authors": [
        "Minh Le Nguyen",
        "Duy-Hung Nguyen",
        "Shahab Sabahi",
        "Hung Lê",
        "Jeffrey Yang",
        "H. Hotta"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An empirical analysis aimed at bridging the gap in adapting LLMs to practical use cases selects the question answering task of insurance as a case study and designs a new model relied on LLMs which are empowered by additional knowledge extracted from insurance policy rulebooks and DBpedia."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}