{
    "acronym": "f258d48f3a05bc2a7c04511d8c3aca736be9b99f",
    "title": "Popular Tag Recommendation by Neural Network in Social Media",
    "seed_ids": [
        "gpt2",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f258d48f3a05bc2a7c04511d8c3aca736be9b99f",
    "abstract": "Although “a picture is worth a thousand words,” this may not be enough to get your post seen on social media. This study's main objective was to determine the best ways to characterize a photo in terms of viral marketing and public appealing. We have to obtain this dataset for this reason from the social media site such as Instagram. A total of 1.4 million hashtags were used in the 570,000 photos that we crawled. Prior to training the text generation module to produce such popular hashtags, we had to determine the components and features of the photo. We trained a multilabel image classification module using a ResNet neural network model for the first section. In order to create hashtags pertaining to their popularity, we trained a cutting-edge GPT-2 language model for the second portion. This work differs from others in that, and it initially offered a cutting-edge GPT-2 model for hashtag generation using a combination of the multilabel image classification module. The popularity issues and ways to make an Instagram post popular are also highlighted in our essay. Social science and marketing research can both be conducted on this subject. Which content can be considered popular from the perspective of consumers can be researched in the social science setting. As a marketing strategy, end users can help by offering such well-liked hashtags for social media accounts. This essay adds to the body of knowledge by demonstrating the two possible uses of popularity. Compared to the base model, our popular hashtag generating algorithm creates 11% more relevant, acceptable, and trending hashtags, according to the evaluation that was carried out.",
    "authors": [
        "Mohammad Jafari Sadr",
        "Seyedeh Leili Mirtaheri",
        "S. Greco",
        "K. Borna"
    ],
    "venue": "Computational Intelligence and Neuroscience",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The main objective was to determine the best ways to characterize a photo in terms of viral marketing and public appealing to create hashtags pertaining to their popularity, and a cutting-edge GPT-2 language model was offered for hashtag generation."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}