{
    "acronym": "f2a60db57db73f218c59d7d08563ab4c6867385e",
    "title": "DP-TBART: A Transformer-based Autoregressive Model for Differentially Private Tabular Data Generation",
    "seed_ids": [
        "gpt2",
        "394bd431e522b86581086bcb5cd9be161cf1cdf4",
        "25d3a4e048d0020ba9cffc6442ebd4e7bb548a55",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f2a60db57db73f218c59d7d08563ab4c6867385e",
    "abstract": "The generation of synthetic tabular data that preserves differential privacy is a problem of growing importance. While traditional marginal-based methods have achieved impressive results, recent work has shown that deep learning-based approaches tend to lag behind. In this work, we present Differentially-Private TaBular AutoRegressive Transformer (DP-TBART), a transformer-based autoregressive model that maintains differential privacy and achieves performance competitive with marginal-based methods on a wide variety of datasets, capable of even outperforming state-of-the-art methods in certain settings. We also provide a theoretical framework for understanding the limitations of marginal-based approaches and where deep learning-based approaches stand to contribute most. These results suggest that deep learning-based techniques should be considered as a viable alternative to marginal-based methods in the generation of differentially private synthetic tabular data.",
    "authors": [
        "Rodrigo Castellon",
        "Achintya Gopal",
        "Brian Bloniarz",
        "D. Rosenberg"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Differentially-Private TaBular AutoRegressive Transformer is presented, a transformer-based autoregressive model that maintains differential privacy and achieves performance competitive with marginal-based methods on a wide variety of datasets, capable of even outperforming state-of-the-art methods in certain settings."
    },
    "citationCount": 2,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}