{
    "acronym": "f2b5fb4f8318d17b8f4d99a5c778990b19ef5a09",
    "title": "A Survey of using Large Language Models for Generating Infrastructure as Code",
    "seed_ids": [
        "gpt3",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "0646bb09db4d1ba24150e69b71edcd4aff691b3c",
        "053b1d7b97eb2c91fc3921d589c160b0923c70b1",
        "3bcb17559ce96eb20fa79af8194f4af0380d194a",
        "0fe2636446cd686830da3d971b31a004d6094b3c"
    ],
    "s2id": "f2b5fb4f8318d17b8f4d99a5c778990b19ef5a09",
    "abstract": "Infrastructure as Code (IaC) is a revolutionary approach which has gained significant prominence in the Industry. IaC manages and provisions IT infrastructure using machinereadable code by enabling automation, consistency across the environments, reproducibility, version control, error reduction and enhancement in scalability. However, IaC orchestration is often a painstaking effort which requires specialised skills as well as a lot of manual effort. Automation of IaC is a necessity in the present conditions of the Industry and in this survey, we study the feasibility of applying Large Language Models (LLM) to address this problem. LLMs are large neural network-based models which have demonstrated significant language processing abilities and shown to be capable of following a range of instructions within a broad scope. Recently, they have also been adapted for code understanding and generation tasks successfully, which makes them a promising choice for the automatic generation of IaC configurations. In this survey, we delve into the details of IaC, usage of IaC in different platforms, their challenges, LLMs in terms of code-generation aspects and the importance of LLMs in IaC along with our own experiments. Finally, we conclude by presenting the challenges in this area and highlighting the scope for future research.",
    "authors": [
        "Kalahasti Ganesh Srivatsa",
        "Sabyasachi Mukhopadhyay",
        "Ganesh Katrapati",
        "Manish Shrivastava"
    ],
    "venue": "ICON",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The feasibility of applying Large Language Models (LLM) to address the problem of automation of Infrastructure as Code is studied and the challenges are presented by presenting the challenges in this area and highlighting the scope for future research."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}