{
    "acronym": "f2f68ed280d27bd25d61782224f8a465db8f43bd",
    "title": "Sumformer: Universal Approximation for Efficient Transformers",
    "seed_ids": [
        "performer",
        "linformer",
        "148011adfae37b821407aae84fcbbf7fb4619eb6",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "40ca4fcfffa7ca9aa9b7ff06ecf3cd0436712d78",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "f2f68ed280d27bd25d61782224f8a465db8f43bd",
    "abstract": "Natural language processing (NLP) made an impressive jump with the introduction of Transformers. ChatGPT is one of the most famous examples, changing the perception of the possibilities of AI even outside the research community. However, besides the impressive performance, the quadratic time and space complexity of Transformers with respect to sequence length pose significant limitations for handling long sequences. While efficient Transformer architectures like Linformer and Performer with linear complexity have emerged as promising solutions, their theoretical understanding remains limited. In this paper, we introduce Sumformer, a novel and simple architecture capable of universally approximating equivariant sequence-to-sequence functions. We use Sumformer to give the first universal approximation results for Linformer and Performer. Moreover, we derive a new proof for Transformers, showing that just one attention layer is sufficient for universal approximation.",
    "authors": [
        "Silas Alberti",
        "Niclas Dern",
        "L. Thesing",
        "Gitta Kutyniok"
    ],
    "venue": "TAG-ML",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Sumformer is introduced, a novel and simple architecture capable of universally approximating equivariant sequence-to-sequence functions and derived a new proof for Transformers, showing that just one attention layer is sufficient for universal approximation."
    },
    "citationCount": 9,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}