{
    "acronym": "f2f85068c9e22a4d8fe6b58e2d92e2d30bc10578",
    "title": "Can Diffusion Model Achieve Better Performance in Text Generation? Bridging the Gap between Training and Inference!",
    "seed_ids": [
        "diffusionlm",
        "diffuseq",
        "a979742220a88b1d32e1fbe72c41e8ba3007053c",
        "2c6ac935c826002976722ca8d3319f691975687e",
        "0b9770a377b3f96cef9f268cee1791d39a0d4893",
        "69144d537f90f214d5b07a7c79121d16afd7da16",
        "e342165a614588878ad0f4bc9bacf3905df34d08",
        "1386b8a11929cf02da291c56aca353e33bbc22ed",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "b6c4a96e09b9f11e7c70e7f1fbe3f3971b92762d",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e04a80263d252a3d8a382ba37a249b9345620570",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280",
        "e512964293671abbdc409f313d127cbe85ffe5cd",
        "24425954960ce968e5f14360fbdd0605abcadfcf",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f2f85068c9e22a4d8fe6b58e2d92e2d30bc10578",
    "abstract": "Diffusion models have been successfully adapted to text generation tasks by mapping the discrete text into the continuous space. However, there exist nonnegligible gaps between training and inference, owing to the absence of the forward process during inference. Thus, the model only predicts based on the previously generated reverse noise rather than the noise computed by the forward process. Besides, the widely-used downsampling strategy in speeding up the inference will cause the mismatch of diffusion trajectories between training and inference. To understand and mitigate the above two types of training-inference discrepancies, we launch a thorough preliminary study. Based on our observations, we propose two simple yet effective methods to bridge the gaps mentioned above, named Distance Penalty and Adaptive Decay Sampling. Extensive experiments on \\textbf{6} generation tasks confirm the superiority of our methods, which can achieve $100\\times \\rightarrow 200\\times$ speedup with better performance.",
    "authors": [
        "Zecheng Tang",
        "Pinzheng Wang",
        "Keyan Zhou",
        "Juntao Li",
        "Ziqiang Cao",
        "M. Zhang"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes two simple yet effective methods to bridge the gaps between training and inference, named Distance Penalty and Adaptive Decay Sampling, which can achieve 100-times speedup with better performance."
    },
    "citationCount": 9,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}