{
    "acronym": "f34c0d2e10737531ac028cf7de8a01e0db9d4728",
    "title": "XC-Cache: Cross-Attending to Cached Context for Efficient LLM Inference",
    "seed_ids": [
        "bert",
        "longformer",
        "4c69d79c0ee7ac964284a75135b317d1ce7fb2d6",
        "e9576198e9ee767ede4b1ac6a739267aa52a9832",
        "fdc53c2c10742464087c0525f77e32604827a21d",
        "9ada8fa11b1cdece31f253acae50b62df8d5f823",
        "465471bb5bf1a945549d6291c2d23367966b4957",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f34c0d2e10737531ac028cf7de8a01e0db9d4728",
    "abstract": "In-context learning (ICL) approaches typically leverage prompting to condition decoder-only language model generation on reference information. Just-in-time processing of a context is inefficient due to the quadratic cost of self-attention operations, and caching is desirable. However, caching transformer states can easily require almost as much space as the model parameters. When the right context isn't known in advance, caching ICL can be challenging. This work addresses these limitations by introducing models that, inspired by the encoder-decoder architecture, use cross-attention to condition generation on reference text without the prompt. More precisely, we leverage pre-trained decoder-only models and only train a small number of added layers. We use Question-Answering (QA) as a testbed to evaluate the ability of our models to perform conditional generation and observe that they outperform ICL, are comparable to fine-tuned prompted LLMs, and drastically reduce the space footprint relative to standard KV caching by two orders of magnitude.",
    "authors": [
        "Jo˜ao Monteiro",
        "Étienne Marcotte",
        "Pierre-André Noël",
        "Valentina Zantedeschi",
        "David Vázquez",
        "Nicolas Chapados",
        "Christopher Pal",
        "Perouz Taslakian"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work uses Question-Answering as a testbed to evaluate the ability of the models to perform conditional generation and observe that they outperform ICL, are comparable to fine-tuned prompted LLMs, and drastically reduce the space footprint relative to standard KV caching by two orders of magnitude."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}