{
    "acronym": "f35f5aedc30e2c5ded210d9c91ba6e84bd029425",
    "title": "Toeplitz Neural Network for Sequence Modeling",
    "seed_ids": [
        "s4",
        "alibi",
        "eaef083b9d661f42cc0d89d9d8156218f33a91d9",
        "dc0102a51a9d33e104a4a3808a18cf17f057228c",
        "c49ac1f916d6d2edeb187e6619c8d23acd95eb21",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "4b0541eccd8f98852d6807a14fbac17f775c7b40",
        "1a883522f3c0051d70be1f8cbdb8989a77395006",
        "9b6af0e358e76d22f209c75b1702c3e6ea7815b1",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "6f68e1bb253925d8431588555d3010419f322e04"
    ],
    "s2id": "f35f5aedc30e2c5ded210d9c91ba6e84bd029425",
    "abstract": "Sequence modeling has important applications in natural language processing and computer vision. Recently, the transformer-based models have shown strong performance on various sequence modeling tasks, which rely on attention to capture pairwise token relations, and position embedding to inject positional information. While showing good performance, the transformer models are inefficient to scale to long input sequences, mainly due to the quadratic space-time complexity of attention. To overcome this inefficiency, we propose to model sequences with a relative position encoded Toeplitz matrix and use a Toeplitz matrix-vector production trick to reduce the space-time complexity of the sequence modeling to log linear. A lightweight sub-network called relative position encoder is proposed to generate relative position coefficients with a fixed budget of parameters, enabling the proposed Toeplitz neural network to deal with varying sequence lengths. In addition, despite being trained on 512-token sequences, our model can extrapolate input sequence length up to 14K tokens in inference with consistent performance. Extensive experiments on autoregressive and bidirectional language modeling, image modeling, and the challenging Long-Range Arena benchmark show that our method achieves better performance than its competitors in most downstream tasks while being significantly faster. The code is available at https://github.com/OpenNLPLab/Tnn.",
    "authors": [
        "Zhen Qin",
        "Xiaodong Han",
        "Weixuan Sun",
        "Bowen He",
        "Dong Li",
        "Dongxu Li",
        "Yuchao Dai",
        "Lingpeng Kong",
        "Yiran Zhong"
    ],
    "venue": "International Conference on Learning Representations",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A lightweight sub-network called relative position encoder is proposed to generate relative position coefficients with a fixed budget of parameters, enabling the proposed Toeplitz neural network to deal with varying sequence lengths."
    },
    "citationCount": 27,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}