{
    "acronym": "f3734f4caa531a7ef38061c022cb0446a892d579",
    "title": "LLMEmbed: Rethinking Lightweight LLM's Genuine Function in Text Classification",
    "seed_ids": [
        "gpt3",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "e7ad08848d5d7c5c47673ffe0da06af443643bda",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "319b84be7a843250bc81d7086f79a4126d550277",
        "da454295392cf4caaa39cc465734237ffe55392f"
    ],
    "s2id": "f3734f4caa531a7ef38061c022cb0446a892d579",
    "abstract": "With the booming of Large Language Models (LLMs), prompt-learning has become a promising method mainly researched in various research areas. Recently, many attempts based on prompt-learning have been made to improve the performance of text classification. However, most of these methods are based on heuristic Chain-of-Thought (CoT), and tend to be more complex but less efficient. In this paper, we rethink the LLM-based text classification methodology, propose a simple and effective transfer learning strategy, namely LLMEmbed, to address this classical but challenging task. To illustrate, we first study how to properly extract and fuse the text embeddings via various lightweight LLMs at different network depths to improve their robustness and discrimination, then adapt such embeddings to train the classifier. We perform extensive experiments on publicly available datasets, and the results show that LLMEmbed achieves strong performance while enjoys low training overhead using lightweight LLM backbones compared to recent methods based on larger LLMs, i.e. GPT-3, and sophisticated prompt-based strategies. Our LLMEmbed achieves adequate accuracy on publicly available benchmarks without any fine-tuning while merely use 4% model parameters, 1.8% electricity consumption and 1.5% runtime compared to its counterparts. Code is available at: https://github.com/ChunLiu-cs/LLMEmbed-ACL2024.",
    "authors": [
        "Chun Liu",
        "Hongguang Zhang",
        "Kainan Zhao",
        "Xinghai Ju",
        "Lin Yang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper rethink the LLM-based text classification methodology, proposes a simple and effective transfer learning strategy, namely LLMEmbed, to address this classical but challenging task."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}