{
    "acronym": "f39f24210d413b6cc785d029851b59b54ce47d88",
    "title": "Draft-and-Revise: Effective Image Generation with Contextual RQ-Transformer",
    "seed_ids": [
        "classfreediffu",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "6351ebb4a3287f5f3e1273464b3b91e5df5a16d7",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "f39f24210d413b6cc785d029851b59b54ce47d88",
    "abstract": "Although autoregressive models have achieved promising results on image generation, their unidirectional generation process prevents the resultant images from fully reflecting global contexts. To address the issue, we propose an effective image generation framework of Draft-and-Revise with Contextual RQ-transformer to consider global contexts during the generation process. As a generalized VQ-VAE, RQ-VAE first represents a high-resolution image as a sequence of discrete code stacks. After code stacks in the sequence are randomly masked, Contextual RQ-Transformer is trained to infill the masked code stacks based on the unmasked contexts of the image. Then, Contextual RQ-Transformer uses our two-phase decoding, Draft-and-Revise, and generates an image, while exploiting the global contexts of the image during the generation process. Specifically. in the draft phase, our model first focuses on generating diverse images despite rather low quality. Then, in the revise phase, the model iteratively improves the quality of images, while preserving the global contexts of generated images. In experiments, our method achieves state-of-the-art results on conditional image generation. We also validate that the Draft-and-Revise decoding can achieve high performance by effectively controlling the quality-diversity trade-off in image generation.",
    "authors": [
        "Doyup Lee",
        "Chiheon Kim",
        "Saehoon Kim",
        "Minsu Cho",
        "Wook-Shin Han"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An effective image generation framework of Draft-and-Revise with Contextual RQ-transformer to consider global contexts during the generation process to achieve state-of-the-art results on conditional image generation."
    },
    "citationCount": 20,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}