{
    "acronym": "f3ca1515d610ec8811d3b4f9a209eae099523048",
    "title": "Attractor Memory for Long-Term Time Series Forecasting: A Chaos Perspective",
    "seed_ids": [
        "hippo",
        "hopfield",
        "de7f235452bec5304290f6faa54b9ff36a27e592",
        "dba88f9a59ad816ce14d93b2c8bfda5917adc196",
        "b8e57155bbcc1ce8a112482c85b3a3bb25f3fe52",
        "afeeb8f5018eebb1a1d334b94dbbfc48d167efef",
        "6b655b74da908e2e0d7c37996d36d5ff4a28f030",
        "5b7f5488c380cf5085a5dd93e993ad293b225eee",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "8064d3873c646dc9ff949d72c54c634a906fc092",
        "defecf3dc299214f4cb76a093c6eed2297eaa46f",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f"
    ],
    "s2id": "f3ca1515d610ec8811d3b4f9a209eae099523048",
    "abstract": "In long-term time series forecasting (LTSF) tasks, an increasing number of models have acknowledged that discrete time series originate from continuous dynamic systems and have attempted to model their dynamical structures. Recognizing the chaotic nature of real-world data, our model, \\textbf{\\textit{Attraos}}, incorporates chaos theory into LTSF, perceiving real-world time series as observations from unknown high-dimensional chaotic dynamic systems. Under the concept of attractor invariance, Attraos utilizes non-parametric Phase Space Reconstruction embedding and the proposed multi-scale dynamic memory unit to memorize historical dynamics structure and predicts by a frequency-enhanced local evolution strategy. Detailed theoretical analysis and abundant empirical evidence consistently show that Attraos outperforms various LTSF methods on mainstream LTSF datasets and chaotic datasets with only one-twelfth of the parameters compared to PatchTST.",
    "authors": [
        "Jiaxi Hu",
        "Yuehong Hu",
        "Wei Chen",
        "Ming Jin",
        "Shirui Pan",
        "Qingsong Wen",
        "Yuxuan Liang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Detailed theoretical analysis and abundant empirical evidence consistently show that Attraos outperforms various LTSF methods on mainstream LTSF datasets and chaotic datasets with only one-twelfth of the parameters compared to PatchTST."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}