{
    "acronym": "f3fb1ccd2735245c58784411b6b51b2da64734f5",
    "title": "Effective Token Graph Modeling using a Novel Labeling Strategy for Structured Sentiment Analysis",
    "seed_ids": [
        "roformer",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4"
    ],
    "s2id": "f3fb1ccd2735245c58784411b6b51b2da64734f5",
    "abstract": "The state-of-the-art model for structured sentiment analysis casts the task as a dependency parsing problem, which has some limitations: (1) The label proportions for span prediction and span relation prediction are imbalanced. (2) The span lengths of sentiment tuple components may be very large in this task, which will further exacerbates the imbalance problem. (3) Two nodes in a dependency graph cannot have multiple arcs, therefore some overlapped sentiment tuples cannot be recognized. In this work, we propose nichetargeting solutions for these issues. First, we introduce a novel labeling strategy, which contains two sets of token pair labels, namely essential label set and whole label set. The essential label set consists of the basic labels for this task, which are relatively balanced and applied in the prediction layer. The whole label set includes rich labels to help our model capture various token relations, which are applied in the hidden layer to softly influence our model. Moreover, we also propose an effective model to well collaborate with our labeling strategy, which is equipped with the graph attention networks to iteratively refine token representations, and the adaptive multi-label classifier to dynamically predict multiple relations between token pairs. We perform extensive experiments on 5 benchmark datasets in four languages. Experimental results show that our model outperforms previous SOTA models by a large margin.",
    "authors": [
        "Wenxuan Shi",
        "Fei Li",
        "Jingye Li",
        "Hao Fei",
        "Donghong Ji"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel labeling strategy is introduced, which contains two sets of token pair labels, namely essential label set and whole label set, which is equipped with the graph attention networks to iteratively refine token representations, and the adaptive multi-label classifier to dynamically predict multiple relations between token pairs."
    },
    "citationCount": 41,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}