{
    "acronym": "f406e4e3750949fadb3473d34a1497433cff87b2",
    "title": "Pretrained Mobility Transformer: A Foundation Model for Human Mobility",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "f406e4e3750949fadb3473d34a1497433cff87b2",
    "abstract": "Ubiquitous mobile devices are generating vast amounts of location-based service data that reveal how individuals navigate and utilize urban spaces in detail. In this study, we utilize these extensive, unlabeled sequences of user trajectories to develop a foundation model for understanding urban space and human mobility. We introduce the \\textbf{P}retrained \\textbf{M}obility \\textbf{T}ransformer (PMT), which leverages the transformer architecture to process user trajectories in an autoregressive manner, converting geographical areas into tokens and embedding spatial and temporal information within these representations. Experiments conducted in three U.S. metropolitan areas over a two-month period demonstrate PMT's ability to capture underlying geographic and socio-demographic characteristics of regions. The proposed PMT excels across various downstream tasks, including next-location prediction, trajectory imputation, and trajectory generation. These results support PMT's capability and effectiveness in decoding complex patterns of human mobility, offering new insights into urban spatial functionality and individual mobility preferences.",
    "authors": [
        "Xinhua Wu",
        "Haoyu He",
        "Yanchao Wang",
        "Qi Wang"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed PMT excels across various downstream tasks, including next-location prediction, trajectory imputation, and trajectory generation, support PMT's capability and effectiveness in decoding complex patterns of human mobility, offering new insights into urban spatial functionality and individual mobility preferences."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}