{
    "acronym": "f46140d6992d983cfa1607b9fb1762d43defffcf",
    "title": "On Synthetic Data for Back Translation",
    "seed_ids": [
        "gpt",
        "2c7d213b2230dea4ff88f0e50631089d513e9528",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280"
    ],
    "s2id": "f46140d6992d983cfa1607b9fb1762d43defffcf",
    "abstract": "Back translation (BT) is one of the most significant technologies in NMT research fields. Existing attempts on BT share a common characteristic: they employ either beam search or random sampling to generate synthetic data with a backward model but seldom work studies the role of synthetic data in the performance of BT. This motivates us to ask a fundamental question: what kind of synthetic data contributes to BT performance?Through both theoretical and empirical studies, we identify two key factors on synthetic data controlling the back-translation NMT performance, which are quality and importance. Furthermore, based on our findings, we propose a simple yet effective method to generate synthetic data to better trade off both factors so as to yield the better performance for BT. We run extensive experiments on WMT14 DE-EN, EN-DE, and RU-EN benchmark tasks. By employing our proposed method to generate synthetic data, our BT model significantly outperforms the standard BT baselines (i.e., beam and sampling based methods for data generation), which proves the effectiveness of our proposed methods.",
    "authors": [
        "Jiahao Xu",
        "Yubin Ruan",
        "Wei Bi",
        "Guoping Huang",
        "Shuming Shi",
        "Lihui Chen",
        "Lemao Liu"
    ],
    "venue": "North American Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "By employing the proposed method to generate synthetic data, the BT model significantly outperforms the standard BT baselines (i.e., beam and sampling based methods for data generation), which proves the effectiveness of the proposed methods."
    },
    "citationCount": 10,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}