{
    "acronym": "f4af78b4ab451bf23c3331f19011fcc84f9daa0e",
    "title": "Comparative Analysis of Bail Judgements",
    "seed_ids": [
        "neurallegal",
        "fd33e77884e69f6bc099990fc2790248af2749d9"
    ],
    "s2id": "f4af78b4ab451bf23c3331f19011fcc84f9daa0e",
    "abstract": "The judicial system is complex and often unpredictable. In a single case, the actions of the police, the prosecutor, and the defendant can lead to a multitude of possible outcomes. The field of law is increasingly being shaped by technology. Courts are using machine learning, a branch of artificial intelligence, to better comprehend the background of cases and create better legal precedents. Our research involves the implementation of three models CNN, CNN + LSTM and ML classifiers. It can be inferred from our research that we did a comparative analysis of the CNN + LSTM model having the highest accuracy of 95.33% as compared with other traditionally used ML classifiers such as Support Vector Machine, Xtreme Gradient Boosting (X Gradient Boost) and Random Forest. To facilitate sequence prediction we apply Convolutional Neural Network (CNN) layers on input data for feature extraction that are paired with LSTMs in the CNN LSTM architecture. By first adding CNN layers, followed by LSTM layers, and then a dense layer at the output, a CNN LSTM structure can be produced. The CNN Model for feature extraction and the LSTM Model for feature interpretation across time steps are two sub-models that can be thought of as being defined by this architecture. In our proposed CNN-LSTM model, LSTMs are utilized to assist sequence prediction for the prediction of bail able and non-bail able cases while layers of a convolutional neural network (CNN) are used to extract features from input data.",
    "authors": [
        "Arunita Bansal",
        "Sunidhi Chaudhary",
        "Ritu Rani",
        "Inderdeep Kaur",
        "Nidhi Goel",
        "A. Dev"
    ],
    "venue": "International Joint Conference on the Analysis of Images, Social Networks and Texts",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "In the proposed CNN-LSTM model, LSTMs are utilized to assist sequence prediction for the prediction of bail able and non-bail able cases while layers of a convolutional neural network are used to extract features from input data."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}