{
    "acronym": "f51690b7d78cfdde372281c0dff584db876553d2",
    "title": "Towards Understanding the Relationship between In-context Learning and Compositional Generalization",
    "seed_ids": [
        "transformer",
        "gpt2",
        "universaltrans",
        "ed535e93d5b5a8b689e861e9c6083a806d1535c2",
        "49e65b12d8d11f2ccb5ddd7be72a8f746b2d1bc2",
        "5cdab78acc4f3aab429a0dd41c3ec7e605d42e7b",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f51690b7d78cfdde372281c0dff584db876553d2",
    "abstract": "According to the principle of compositional generalization, the meaning of a complex expression can be understood as a function of the meaning of its parts and of how they are combined. This principle is crucial for human language processing and also, arguably, for NLP models in the face of out-of-distribution data. However, many neural network models, including Transformers, have been shown to struggle with compositional generalization. In this paper, we hypothesize that forcing models to in-context learn can provide an inductive bias to promote compositional generalization. To test this hypothesis, we train a causal Transformer in a setting that renders ‘ordinary’ learning very difficult: we present it with different orderings of the training instance and shuffle instance labels. This corresponds to training the model on all possible few-shot learning problems attainable from the dataset. The model can solve the task, however, by utilizing earlier examples to generalize to later ones – i.e., in-context learning. In evaluations on the datasets, SCAN, COGS, and GeoQuery, models trained in this manner indeed show improved compositional generalization. This indicates the usefulness of in-context learning problems as an inductive bias for generalization.",
    "authors": [
        "Sungjun Han",
        "Sebastian Pad'o"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is hypothesize that forcing models to in-context learn can provide an inductive bias to promote compositional generalization and indicates the usefulness of in-context learning problems as an inductive bias for generalization."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}