{
    "acronym": "f52d15c1dcc7299bd100cbe0127c0983dffa1cab",
    "title": "Quantum Natural Language Processing",
    "seed_ids": [
        "transformer",
        "998ac3e945857cf2676ee7efdbaf443a0c6f820a",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2"
    ],
    "s2id": "f52d15c1dcc7299bd100cbe0127c0983dffa1cab",
    "abstract": "Language processing is at the heart of current developments in artificial intelligence, and quantum computers are becoming available at the same time. This has led to great interest in quantum natural language processing, and several early proposals and experiments. This paper surveys the state of this area, showing how NLP-related techniques have been used in quantum language processing. We examine the art of word embeddings and sequential models, proposing some avenues for future investigation and discussing the tradeoffs present in these directions. We also highlight some recent methods to compute attention in transformer models, and perform grammatical parsing. We also introduce a new quantum design for the basic task of text encoding (representing a string of characters in memory), which has not been addressed in detail before. Quantum theory has contributed toward quantifying uncertainty and explaining\"What is intelligence?\"In this context, we argue that\"hallucinations\"in modern artificial intelligence systems are a misunderstanding of the way facts are conceptualized: language can express many plausible hypotheses, of which only a few become actual.",
    "authors": [
        "Dominic Widdows",
        "Willie Aboumrad",
        "Dohun Kim",
        "Sayonee Ray",
        "Jonathan Mei"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The state of NLP-related techniques in quantum language processing is surveyed, showing how NLP-related techniques have been used in quantum language processing, and the art of word embeddings and sequential models is examined."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}