{
    "acronym": "f564bb8ebb5990bb38d2f9ffbadb2e4b2eff5faf",
    "title": "Re-pseudonymization Strategies for Smart Meter Data Are Not Robust to Deep Learning Profiling Attacks",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "f564bb8ebb5990bb38d2f9ffbadb2e4b2eff5faf",
    "abstract": "Smart meters, devices measuring the electricity and gas consumption of a household, are currently being deployed at a fast rate throughout the world. The data they collect are extremely useful, including in the fight against climate change. However, these data and the information that can be inferred from them are highly sensitive. Re-pseudonymization, i.e., the frequent replacement of random identifiers over time, is widely used to share smart meter data while mitigating the risk of re-identification. We here show how, in spite of re-pseudonymization, households' consumption records can be pieced together with high accuracy in large-scale datasets. More specifically, we propose the first deep learning-based profiling attack against re-pseudonymized smart meter data. Our attack combines neural network embeddings, which are used to extract features from weekly consumption records and are tailored to the smart meter identification task, with a nearest neighbor classifier. We evaluate six neural networks architectures as the embedding model. Our results suggest that the Transformer and CNN-LSTM architectures vastly outperform previous methods as well as other architectures, successfully identifying the correct household 73.4% of the time among 5139 households based on electricity and gas consumption records (54.5% for electricity only). We further show that the features extracted by the embedding model maintain their effectiveness when transferred to a set of users disjoint from the one used to train the model. Finally, we extensively evaluate the robustness of our results. In particular, we show that the accuracy of the attack only slowly decreases with the size of the dataset, how less frequent re-pseudonymization will further increase accuracy, and how an attacker can evaluate the likelihood of a match to be correct. Taken together, our results strongly suggest that even frequent re-pseudonymization strategies can be reversed, strongly limiting their ability to prevent re-identification in practice.",
    "authors": [
        "Ana-Maria Creţu",
        "Miruna Rusu",
        "Y. de Montjoye"
    ],
    "venue": "Conference on Data and Application Security and Privacy",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes the first deep learning-based profiling attack against re-pseudonymized smart meter data, and suggests that even frequent re-pseudonymization strategies can be reversed, strongly limiting their ability to prevent re-identification in practice."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}