{
    "acronym": "f582d7ed1cf4bda84d6075e948630940f8445cfa",
    "title": "Automatic Detection of Bot-generated Tweets",
    "seed_ids": [
        "gpt2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f582d7ed1cf4bda84d6075e948630940f8445cfa",
    "abstract": "Deep neural networks have the capacity to generate textual content which is increasingly difficult to distinguish from that produced by humans. Such content can be used in disinformation campaigns and its detrimental effects are amplified if it spreads on social networks. Here, we study the automatic detection of bot-generated Twitter messages. This task is difficult due to combination between the strong performance of recent deep language models and the limited length of tweets. In this study, we propose a challenging definition of the problem by making no assumption regarding the bot account, its network or the method used to generate the text. We devise two approaches for bot detection based on pretrained language models and create a new dataset of generated tweets to improve the performance of our classifier on recent text generation algorithms. The obtained results show that the generalization capabilities of the proposed classifier heavily depends on the dataset used to trained the model. Interestingly, the two automatic dataset augmentation proposed here show promising results. Their introduction leads to consistent performance gains compared to the use of the original dataset alone.",
    "authors": [
        "Julien Tourille",
        "Babacar Sow",
        "Adrian-Stefan Popescu"
    ],
    "venue": "MAD@ICMR",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study devise two approaches for bot detection based on pretrained language models and create a new dataset of generated tweets to improve the performance of the proposed classifier on recent text generation algorithms."
    },
    "citationCount": 15,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}