{
    "acronym": "f5c8d4bf68d4b6992712e04e3d54dbae41855db1",
    "title": "Every Problem, Every Step, All in Focus: Learning to Solve Vision-Language Problems With Integrated Attention",
    "seed_ids": [
        "bert",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d"
    ],
    "s2id": "f5c8d4bf68d4b6992712e04e3d54dbae41855db1",
    "abstract": "Integrating information from vision and language modalities has sparked interesting applications in the fields of computer vision and natural language processing. Existing methods, though promising in tasks like image captioning and visual question answering, face challenges in understanding real-life issues and offering step-by-step solutions. In particular, they typically limit their scope to solutions with a sequential structure, thus ignoring complex inter-step dependencies. To bridge this gap, we propose a graph-based approach to vision-language problem solving. It leverages a novel integrated attention mechanism that jointly considers the importance of features within each step as well as across multiple steps. Together with a graph neural network method, this attention mechanism can be progressively learned to predict sequential and non-sequential solution graphs depending on the characterization of the problem-solving process. To tightly couple attention with the problem-solving procedure, we further design new learning objectives with attention metrics that quantify this integrated attention, which better aligns visual and language information within steps, and more accurately captures information flow between steps. Experimental results on VisualHow, a comprehensive dataset of varying solution structures, show significant improvements in predicting steps and dependencies, demonstrating the effectiveness of our approach in tackling various vision-language problems.",
    "authors": [
        "Xianyu Chen",
        "Jinhui Yang",
        "Shi Chen",
        "Louis Wang",
        "Ming Jiang",
        "Qi Zhao"
    ],
    "venue": "IEEE Transactions on Pattern Analysis and Machine Intelligence",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a graph-based approach to vision-language problem solving that leverages a novel integrated attention mechanism that jointly considers the importance of features within each step as well as across multiple steps, and designs new learning objectives with attention metrics that quantify this integrated attention."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}