{
    "acronym": "f5d156b6bfaaf5a830e5b72b0dd0fc3251e78b83",
    "title": "Italian Crossword Generator: Enhancing Education through Interactive Word Puzzles",
    "seed_ids": [
        "gpt3"
    ],
    "s2id": "f5d156b6bfaaf5a830e5b72b0dd0fc3251e78b83",
    "abstract": "Educational crosswords offer numerous benefits for students, including increased engagement, improved understanding, critical thinking, and memory retention. Creating high-quality educational crosswords can be challenging, but recent advances in natural language processing and machine learning have made it possible to use language models to generate nice wordplays. The exploitation of cutting-edge language models like GPT3-DaVinci, GPT3-Curie, GPT3-Babbage, GPT3-Ada, and BERT-uncased has led to the development of a comprehensive system for generating and verifying crossword clues. A large dataset of clue-answer pairs was compiled to fine-tune the models in a supervised manner to generate original and challenging clues from a given keyword. On the other hand, for generating crossword clues from a given text, Zero/Few-shot learning techniques were used to extract clues from the input text, adding variety and creativity to the puzzles. We employed the fine-tuned model to generate data and labeled the acceptability of clue-answer parts with human supervision. To ensure quality, we developed a classifier by fine-tuning existing language models on the labeled dataset. Conversely, to assess the quality of clues generated from the given text using zero/few-shot learning, we employed a zero-shot learning approach to check the quality of generated clues. The results of the evaluation have been very promising, demonstrating the effectiveness of the approach in creating high-standard educational crosswords that offer students engaging and rewarding learning experiences.",
    "authors": [
        "Kamyar Zeinalipour",
        "Tommaso Iaquinta",
        "Asya Zanollo",
        "Giovanni Angelini",
        "Leonardo Rigutini",
        "Marco Maggini",
        "Marco Gori"
    ],
    "venue": "Italian Conference on Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The results of the evaluation have been very promising, demonstrating the effectiveness of the zero/few-shot learning approach in creating high-standard educational crosswords that offer students engaging and rewarding learning experiences."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}