{
    "acronym": "f5d35779f90b8b8dcf798787bf68b4c294c6b5a4",
    "title": "Should ChatGPT and Bard Share Revenue with Their Data Providers? A New Business Model for the AI Era",
    "seed_ids": [
        "gpt",
        "83edcfbb206ddad38a971d605da09390604248ea",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e",
        "914254fac74a2da051cccf6ca16afcaad416a079",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "a3184d40d390793232c99c89b57b8f65c16320b2",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f5d35779f90b8b8dcf798787bf68b4c294c6b5a4",
    "abstract": "With various AI tools such as ChatGPT becoming increasingly convenient and popular, we are entering a true AI era. We can foresee that exceptional AI tools will soon reap considerable profits. A crucial question arise: should AI tools share revenue with their training data providers in additional to traditional stakeholders and shareholders? The answer is Yes. Large AI tools, such as large language models, always require more and better quality data to continuously improve, but current copyright laws limit their access to various types of data. Sharing revenue between AI tools and their data providers could transform the current hostile zero-sum game relationship between AI tools and a majority of copyrighted data owners into a collaborative and mutually beneficial one, which is necessary to facilitate the development of a virtuous cycle among AI tools, their users and data providers that drives forward AI technology and builds a healthy AI ecosystem. However, current revenue-sharing business models do not work for AI tools in the forthcoming AI era, since the most widely used metrics for website-based traffic and action, such as clicks, will be replaced by new metrics such as prompts and cost per prompt for generative AI tools. Therefore, a completely new revenue-sharing business model must be established. This new business model, which must be independent of AI tools and be easily explained to data providers, needs to establish a prompt-based scoring system to measure data engagement of each data provider. This paper systematically discusses how to build such a scoring system for all data providers for AI tools based on classification and content similarity models, and outlines the requirements for AI tools or third parties to build it. AI tools can share revenue with data providers using such a scoring system, which would encourage more data owners to participate in the revenuesharing program. This will be a utilitarian AI era where all parties benefit.",
    "authors": [
        "Dong Zhang"
    ],
    "venue": "Advances in Artificial Intelligence and Machine Learning",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper systematically discusses how to build a prompt-based scoring system for all data providers for AI tools based on classification and content similarity models, and outlines the requirements forAI tools or third parties to build it."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}