{
    "acronym": "f5e9337477d7a9eb6267d0310549fdefafbb7fe2",
    "title": "Transformers learn to implement preconditioned gradient descent for in-context learning",
    "seed_ids": [
        "deltanet",
        "7368c3cdf7cbed194e96dc4da53ed61f185e3d82",
        "525d93a382f6e7873b5d8a2e0713eb3dff7fb250",
        "1a703f08da01cf737cce3fb9064259b3f4b44e9c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f5e9337477d7a9eb6267d0310549fdefafbb7fe2",
    "abstract": "Several recent works demonstrate that transformers can implement algorithms like gradient descent. By a careful construction of weights, these works show that multiple layers of transformers are expressive enough to simulate iterations of gradient descent. Going beyond the question of expressivity, we ask: Can transformers learn to implement such algorithms by training over random problem instances? To our knowledge, we make the first theoretical progress on this question via an analysis of the loss landscape for linear transformers trained over random instances of linear regression. For a single attention layer, we prove the global minimum of the training objective implements a single iteration of preconditioned gradient descent. Notably, the preconditioning matrix not only adapts to the input distribution but also to the variance induced by data inadequacy. For a transformer with $L$ attention layers, we prove certain critical points of the training objective implement $L$ iterations of preconditioned gradient descent. Our results call for future theoretical studies on learning algorithms by training transformers.",
    "authors": [
        "Kwangjun Ahn",
        "Xiang Cheng",
        "Hadi Daneshmand",
        "S. Sra"
    ],
    "venue": "Neural Information Processing Systems",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work makes the first theoretical progress on this question via an analysis of the loss landscape for linear transformers trained over random instances of linear regression, and proves the global minimum of the training objective implements a single iteration of preconditioned gradient descent."
    },
    "citationCount": 73,
    "influentialCitationCount": 14,
    "code": null,
    "description": null,
    "url": null
}