{
    "acronym": "f6174154cf4f241321b7b42be39afdd252204995",
    "title": "MambaLRP: Explaining Selective State Space Sequence Models",
    "seed_ids": [
        "mamba",
        "hiddenattnmamba",
        "d8b51d518f2dd62943762ceaa8961d3b1bfbcc1a",
        "26e6cd121c5fdb147df83cb848e4813c926737c8",
        "2dda6da7375bf5e8bcf60f87b17ba10757f3bc57",
        "1df04f33a8ef313cc2067147dbb79c3ca7c5c99f",
        "3169a2478154e26fd7f63fdf43cf3a24f1007962",
        "a6e2dca754f3dc625a9da5f10f9b7a57079bfd27",
        "b24e899ec0f77eef2fc87a9b8e50516367aa1f97",
        "38c48a1cd296d16dc9c56717495d6e44cc354444",
        "745594bd0dc3e9dc86f74e100cd2c98ed36256c0",
        "b31a5884a8ebe96b6300839b28608b97f8f8ef76",
        "debbb47abc9fb757857f7c06aa86ca558d37c2d7",
        "60b35c6d68acced19b0c66edcfc0ee0a2c11efed",
        "d98b5c1d0f9a4e39dc79ea7a3f74e54789df5e13",
        "5a77b508302771fc083bf24e0bcda8553c9b5421",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "eaef083b9d661f42cc0d89d9d8156218f33a91d9",
        "1ec16018e9152c50bbaed1d49c3077b9fb6d2838",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "ca9047c78d48b606c4e4f0c456b1dda550de28b2",
        "35a9749df07a2ab97c51af4d260b095b00da7676"
    ],
    "s2id": "f6174154cf4f241321b7b42be39afdd252204995",
    "abstract": "Recent sequence modeling approaches using Selective State Space Sequence Models, referred to as Mamba models, have seen a surge of interest. These models allow efficient processing of long sequences in linear time and are rapidly being adopted in a wide range of applications such as language modeling, demonstrating promising performance. To foster their reliable use in real-world scenarios, it is crucial to augment their transparency. Our work bridges this critical gap by bringing explainability, particularly Layer-wise Relevance Propagation (LRP), to the Mamba architecture. Guided by the axiom of relevance conservation, we identify specific components in the Mamba architecture, which cause unfaithful explanations. To remedy this issue, we propose MambaLRP, a novel algorithm within the LRP framework, which ensures a more stable and reliable relevance propagation through these components. Our proposed method is theoretically sound and excels in achieving state-of-the-art explanation performance across a diverse range of models and datasets. Moreover, MambaLRP facilitates a deeper inspection of Mamba architectures, uncovering various biases and evaluating their significance. It also enables the analysis of previous speculations regarding the long-range capabilities of Mamba models.",
    "authors": [
        "F. Jafari",
        "G. Montavon",
        "Klaus-Robert Müller",
        "Oliver Eberle"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work identifies specific components in the Mamba architecture, which cause unfaithful explanations and proposes MambaLRP, a novel algorithm within the LRP framework, which ensures a more stable and reliable relevance propagation through these components."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}