{
    "acronym": "f65f1413f77f326723600bb4148b060184543cf3",
    "title": "JASS: Japanese-specific Sequence to Sequence Pre-training for Neural Machine Translation",
    "seed_ids": [
        "gpt",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "145b8b5d99a2beba6029418ca043585b90138d12",
        "ec4eba83f6b3266d9ae7cabb2b2cb1518f727edc"
    ],
    "s2id": "f65f1413f77f326723600bb4148b060184543cf3",
    "abstract": "Neural machine translation (NMT) needs large parallel corpora for state-of-the-art translation quality. Low-resource NMT is typically addressed by transfer learning which leverages large monolingual or parallel corpora for pre-training. Monolingual pre-training approaches such as MASS (MAsked Sequence to Sequence) are extremely effective in boosting NMT quality for languages with small parallel corpora. However, they do not account for linguistic information obtained using syntactic analyzers which is known to be invaluable for several Natural Language Processing (NLP) tasks. To this end, we propose JASS, Japanese-specific Sequence to Sequence, as a novel pre-training alternative to MASS for NMT involving Japanese as the source or target language. JASS is joint BMASS (Bunsetsu MASS) and BRSS (Bunsetsu Reordering Sequence to Sequence) pre-training which focuses on Japanese linguistic units called bunsetsus. In our experiments on ASPEC Japanese–English and News Commentary Japanese–Russian translation we show that JASS can give results that are competitive with if not better than those given by MASS. Furthermore, we show for the first time that joint MASS and JASS pre-training gives results that significantly surpass the individual methods indicating their complementary nature. We will release our code, pre-trained models and bunsetsu annotated data as resources for researchers to use in their own NLP tasks.",
    "authors": [
        "Zhuoyuan Mao",
        "Fabien Cromierès",
        "Raj Dabre",
        "Haiyue Song",
        "S. Kurohashi"
    ],
    "venue": "International Conference on Language Resources and Evaluation",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "JASS, Japanese-specific Sequence to Sequence, is proposed as a novel pre-training alternative to MASS for NMT involving Japanese as the source or target language and it is shown for the first time that joint MASS and JASS pre- training gives results that significantly surpass the individual methods indicating their complementary nature."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}