{
    "acronym": "f6b12800ee20b8fd2e61da05cd2c7ef698c23d95",
    "title": "Rethinking Decision Transformer via Hierarchical Reinforcement Learning",
    "seed_ids": [
        "gpt2",
        "f11044596cf2eaf59f83d82b8167b16ba6a08617",
        "860bc4f071f35d6d8529a52c2c1858d030779a6a",
        "5f19ae1135a9500940978104ec15a5b8751bc7d2",
        "2cd605106b88c85d7d8b865b1ef0f8c8293debf1",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f6b12800ee20b8fd2e61da05cd2c7ef698c23d95",
    "abstract": "Decision Transformer (DT) is an innovative algorithm leveraging recent advances of the transformer architecture in reinforcement learning (RL). However, a notable limitation of DT is its reliance on recalling trajectories from datasets, losing the capability to seamlessly stitch sub-optimal trajectories together. In this work we introduce a general sequence modeling framework for studying sequential decision making through the lens of Hierarchical RL. At the time of making decisions, a high-level policy first proposes an ideal prompt for the current state, a low-level policy subsequently generates an action conditioned on the given prompt. We show DT emerges as a special case of this framework with certain choices of high-level and low-level policies, and discuss the potential failure of these choices. Inspired by these observations, we study how to jointly optimize the high-level and low-level policies to enable the stitching ability, which further leads to the development of new offline RL algorithms. Our empirical results clearly show that the proposed algorithms significantly surpass DT on several control and navigation benchmarks. We hope our contributions can inspire the integration of transformer architectures within the field of RL.",
    "authors": [
        "Yi Ma",
        "Chenjun Xiao",
        "Hebin Liang",
        "Jianye Hao"
    ],
    "venue": "arXiv.org",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces a general sequence modeling framework for studying sequential decision making through the lens of Hierarchical RL, and shows DT emerges as a special case of this framework with certain choices of high-level and low-level policies, and discusses the potential failure of these choices."
    },
    "citationCount": 3,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}