{
    "acronym": "f70f9f9c0187fc830081124f984560057891dad7",
    "title": "Nonlinear Initialization Methods for Low-Rank Neural Networks",
    "seed_ids": [
        "performer",
        "5f895e84c1fea75de07b4f90da518273c2e57291",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "a68c3412e60560290400d2707596f82a914b7c00",
        "2c5a8950cf0a13e229ad19093ba064495fda8de7",
        "b1ac64438608aac1a8dfd0adf8fec8c6220f6bfd",
        "b745b5512ad3b1f652dc0cbb5ddf5a940f397f7d",
        "d918d3193981bd2c2b21e68ef076b0d98c829dc7"
    ],
    "s2id": "f70f9f9c0187fc830081124f984560057891dad7",
    "abstract": "We propose a novel low-rank initialization framework for training low-rank deep neural networks -- networks where the weight parameters are re-parameterized by products of two low-rank matrices. The most successful prior existing approach, spectral initialization, draws a sample from the initialization distribution for the full-rank setting and then optimally approximates the full-rank initialization parameters in the Frobenius norm with a pair of low-rank initialization matrices via singular value decomposition. Our method is inspired by the insight that approximating the function corresponding to each layer is more important than approximating the parameter values. We provably demonstrate that there is a significant gap between these two approaches for ReLU networks, particularly as the desired rank of the approximating weights decreases, or as the dimension of the inputs to the layer increases (the latter point holds when the network width is super-linear in dimension). Along the way, we provide the first provably efficient algorithm for solving the ReLU low-rank approximation problem for fixed parameter rank $r$ -- previously, it was unknown that the problem was computationally tractable to solve even for rank $1$. We also provide a practical algorithm to solve this problem which is no more expensive than the existing spectral initialization approach, and validate our theory by training ResNet and EfficientNet models (He et al., 2016; Tan&Le, 2019) on ImageNet (Russakovsky et al., 2015).",
    "authors": [
        "Kiran Vodrahalli",
        "Rakesh Shivanna",
        "M. Sathiamoorthy",
        "Sagar Jain",
        "Ed H. Chi"
    ],
    "venue": "",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Along the way, this work provides the first provably efficient algorithm for solving the ReLU low-rank approximation problem for fixed parameter rank $r$ -- previously, it was unknown that the problem was computationally tractable to solve even for rank $1."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}