{
    "acronym": "f733a8280d5da71f7046460e7e6b9eae863376ac",
    "title": "Guiding a Diffusion Model with a Bad Version of Itself",
    "seed_ids": [
        "classfreediffu",
        "9b91b3031ea159e4964d18b2ce703168660ecf46",
        "bb857c72e7c75fc3d4b44b1dcaa66c62ea10a2e1",
        "6e3a3b7a8a0376d867cad72eedf2f9b746f29a33",
        "7acc71fad70c4c65203739f156bcb440587df901",
        "498ac9b2e494601d20a3d0211c16acf2b7954a54",
        "3ff7153fd6bd47d08084c7f50f8fd70026c126e7",
        "2f4c451922e227cbbd4f090b74298445bbd900d0",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "82482585e94192b4e9913727e461f89cd08e9725",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "de18baa4964804cf471d85a5a090498242d2e79f"
    ],
    "s2id": "f733a8280d5da71f7046460e7e6b9eae863376ac",
    "abstract": "The primary axes of interest in image-generating diffusion models are image quality, the amount of variation in the results, and how well the results align with a given condition, e.g., a class label or a text prompt. The popular classifier-free guidance approach uses an unconditional model to guide a conditional model, leading to simultaneously better prompt alignment and higher-quality images at the cost of reduced variation. These effects seem inherently entangled, and thus hard to control. We make the surprising observation that it is possible to obtain disentangled control over image quality without compromising the amount of variation by guiding generation using a smaller, less-trained version of the model itself rather than an unconditional model. This leads to significant improvements in ImageNet generation, setting record FIDs of 1.01 for 64x64 and 1.25 for 512x512, using publicly available networks. Furthermore, the method is also applicable to unconditional diffusion models, drastically improving their quality.",
    "authors": [
        "Tero Karras",
        "M. Aittala",
        "T. Kynkäänniemi",
        "J. Lehtinen",
        "Timo Aila",
        "S. Laine"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is made the surprising observation that it is possible to obtain disentangled control over image quality without compromising the amount of variation by guiding generation using a smaller, less-trained version of the model itself rather than an unconditional model."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}