{
    "acronym": "f73c70994599030511cce7248514bd39ceeebb8e",
    "title": "Goal-LBP: Goal-Based Local Behavior Guided Trajectory Prediction for Autonomous Driving",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "f73c70994599030511cce7248514bd39ceeebb8e",
    "abstract": "In recent years, the design of models for performing the trajectory prediction task, one of the critical tasks in autonomous driving, has received great attention from researchers. However, accurately predicting future locations is challenging due to the difficulty of learning accurate intentions and modeling multimodality. Historical paths at a certain location can help predict the future trajectory of an agent currently located in that position and address these limitations. In this work, we propose a goal-based local behavior guided model, Goal-LBP, using such information (referred to as local behavior data) to generate potential goals and guide the prediction of trajectories conditioned on such goals. Goal-LBP uses Transformer encoders to extract homogeneous features and attention mechanism to represent the heterogeneous interactions and subsequently uses an encoder-decoder Gated Recurrent Unit (GRU) model to generate predictions. We evaluate our Goal-LBP using two large-scale real-world autonomous driving datasets, namely nuScenes and Argoverse. Our results show that compared to several SOTA models, Goal-LBP achieves the best ADE/FDE performance and it ranked #2 on the leaderboard of the nuScenes trajectory benchmark in June 2023. In addition, we also demonstrate that our local behavior estimator block can be easily added to two existing SOTA methods, namely AgentFormer and LaPred. Adding this LBE block improves the original AgentFormer and LaPred performance by at least 10%.",
    "authors": [
        "Zhen Yao",
        "Xin Li",
        "Bo Lang",
        "Mooi Choo Choo Chuah"
    ],
    "venue": "IEEE transactions on intelligent transportation systems (Print)",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A goal-based local behavior guided model, Goal-LBP, which achieves the best ADE/FDE performance and it ranked #2 on the leaderboard of the nuScenes trajectory benchmark in June 2023 and can be easily added to two existing SOTA methods, namely AgentFormer and LaPred."
    },
    "citationCount": 4,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}