{
    "acronym": "f740a2474b52675287166a003bd1313f8aabcd68",
    "title": "BioT5+: Towards Generalized Biological Understanding with IUPAC Integration and Multi-task Tuning",
    "seed_ids": [
        "gpt3",
        "c3382fd533b9dd7f8ed7ba7766159079bc1d3935",
        "d55b69a533dea69c8b2673cde8de90c6626ee789",
        "1d26c947406173145a4665dd7ab255e03494ea28"
    ],
    "s2id": "f740a2474b52675287166a003bd1313f8aabcd68",
    "abstract": "Recent research trends in computational biology have increasingly focused on integrating text and bio-entity modeling, especially in the context of molecules and proteins. However, previous efforts like BioT5 faced challenges in generalizing across diverse tasks and lacked a nuanced understanding of molecular structures, particularly in their textual representations (e.g., IUPAC). This paper introduces BioT5+, an extension of the BioT5 framework, tailored to enhance biological research and drug discovery. BioT5+ incorporates several novel features: integration of IUPAC names for molecular understanding, inclusion of extensive bio-text and molecule data from sources like bioRxiv and PubChem, the multi-task instruction tuning for generality across tasks, and a numerical tokenization technique for improved processing of numerical data. These enhancements allow BioT5+ to bridge the gap between molecular representations and their textual descriptions, providing a more holistic understanding of biological entities, and largely improving the grounded reasoning of bio-text and bio-sequences. The model is pre-trained and fine-tuned with a large number of experiments, including \\emph{3 types of problems (classification, regression, generation), 15 kinds of tasks, and 21 total benchmark datasets}, demonstrating the remarkable performance and state-of-the-art results in most cases. BioT5+ stands out for its ability to capture intricate relationships in biological data, thereby contributing significantly to bioinformatics and computational biology. Our code is available at \\url{https://github.com/QizhiPei/BioT5}.",
    "authors": [
        "Qizhi Pei",
        "Lijun Wu",
        "Kaiyuan Gao",
        "Xiaozhuan Liang",
        "Yin Fang",
        "Jinhua Zhu",
        "Shufang Xie",
        "Tao Qin",
        "Rui Yan"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "BioT5+ is introduced, an extension of the BioT5 framework, tailored to enhance biological research and drug discovery, and stands out for its ability to capture intricate relationships in biological data, thereby contributing significantly to bioinformatics and computational biology."
    },
    "citationCount": 7,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}