{
    "acronym": "f7768c6aa322f1b70ec31fbcd59bae22f25cf367",
    "title": "Generative AI for End-to-End Limit Order Book Modelling: A Token-Level Autoregressive Generative Model of Message Flow Using a Deep State Space Network",
    "seed_ids": [
        "s5",
        "a7d68b1702af08ce4dbbf2cd0b083e744ae5c6be",
        "6d7d141c75af752ffc0d8a6184cca3f9323d6c74",
        "ca444821352a4bd91884413d8070446e2960715a",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51",
        "7e9ff94476f41041c75e253e84f487db00e9c861"
    ],
    "s2id": "f7768c6aa322f1b70ec31fbcd59bae22f25cf367",
    "abstract": "Developing a generative model of realistic order flow in financial markets is a challenging open problem, with numerous applications for market participants. Addressing this, we propose the first end-to-end autoregressive generative model that generates tokenized limit order book (LOB) messages. These messages are interpreted by the JAX-LOB simulator, which updates the LOB state. To handle long sequences efficiently, the model employs simplified structured state-space layers to process sequences of order book states and tokenized messages. Using LOBSTER data of NASDAQ equity LOBs, we develop a custom tokenizer for message data, converting groups of successive digits to tokens, similar to tokenization in large language models. Out-of-sample results show promising performance in approximating the data distribution, as evidenced by low model perplexity. Furthermore, the mid-price returns calculated from the generated order flow exhibit a significant correlation with the data, indicating impressive conditional forecast performance. Due to the granularity of generated data, and the accuracy of the model, it offers new application areas for future work beyond forecasting, e.g. acting as a world model in high-frequency financial reinforcement learning applications. Overall, our results invite the use and extension of the model in the direction of autoregressive large financial models for the generation of high-frequency financial data. 1",
    "authors": [
        "Peer Nagy",
        "Sascha Frey",
        "Silvia Sapora",
        "Kang Li",
        "Anisoara Calinescu",
        "Stefan Zohren",
        "Jakob Foerster"
    ],
    "venue": "International Conference on AI in Finance",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The first end-to-end autoregressive generative model that generates tokenized limit order book (LOB) messages is proposed, and the mid-price returns calculated from the generated order flow exhibit a significant correlation with the data, indicating impressive conditional forecast performance."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}