{
    "acronym": "f786dec6d3fcf49e9234a097f7045cf9950271dd",
    "title": "ST-Mamba: Spatial-Temporal Selective State Space Model for Traffic Flow Prediction",
    "seed_ids": [
        "transformer",
        "hippo",
        "d74047f9cb1b96ba9557724620d419e08048d90b",
        "38c48a1cd296d16dc9c56717495d6e44cc354444",
        "ac2618b2ce5cdcf86f9371bcca98bc5e37e46f51"
    ],
    "s2id": "f786dec6d3fcf49e9234a097f7045cf9950271dd",
    "abstract": "Traffic flow prediction, a critical aspect of intelligent transportation systems, has been increasingly popular in the field of artificial intelligence, driven by the availability of extensive traffic data. The current challenges of traffic flow prediction lie in integrating diverse factors while balancing the trade-off between computational complexity and the precision necessary for effective long-range and large-scale predictions. To address these challenges, we introduce a Spatial-Temporal Selective State Space (ST-Mamba) model, which is the first to leverage the power of spatial-temporal learning in traffic flow prediction without using graph modeling. The ST-Mamba model can effectively capture the long-range dependency for traffic flow data, thereby avoiding the issue of over-smoothing. The proposed ST-Mamba model incorporates an effective Spatial-Temporal Mixer (ST-Mixer) to seamlessly integrate spatial and temporal data processing into a unified framework and employs a Spatial-Temporal Selective State Space (ST-SSM) block to improve computational efficiency. The proposed ST-Mamba model, specifically designed for spatial-temporal data, simplifies processing procedure and enhances generalization capabilities, thereby significantly improving the accuracy of long-range traffic flow prediction. Compared to the previous state-of-the-art (SOTA) model, the proposed ST-Mamba model achieves a 61.11\\% improvement in computational speed and increases prediction accuracy by 0.67\\%. Extensive experiments with real-world traffic datasets demonstrate that the \\textsf{ST-Mamba} model sets a new benchmark in traffic flow prediction, achieving SOTA performance in computational efficiency for both long- and short-range predictions and significantly improving the overall efficiency and effectiveness of traffic management.",
    "authors": [
        "Zhiqi Shao",
        "Michael G. H. Bell",
        "Ze Wang",
        "D. Geers",
        "Haoning Xi",
        "Junbin Gao"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Spatial-Temporal Selective State Space (ST-Mamba) model is introduced, which is the first to leverage the power of spatial-temporal learning in traffic flow prediction without using graph modeling, and significantly improving the overall efficiency and effectiveness of traffic management."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}