{
    "acronym": "f7bc5be4cc305f70b36456a959d7b95669b48ac2",
    "title": "Memory Is All You Need: An Overview of Compute-in-Memory Architectures for Accelerating Large Language Model Inference",
    "seed_ids": [
        "transformer",
        "gpt3",
        "e8ad063c3ba3e9bd4aa75ee2bc89629a77532caa",
        "c3dda6382a7682a5bad969f32adc29329ae5c4b5",
        "3695739b3a8b0e92b8ae90081124d098ae33b15c",
        "2463dedcd8e3fe806e561b88899ca593400d7019",
        "523537c15fa4adaa884bbad40075b8ddbf003b9a",
        "47596705a00601eca040d82b8fe25457f2683bd1",
        "78bb909c314784ff345fe2bea997e74ca08ee0e5",
        "25fd8b80c0808868b6834e2967c9de786dfb3fda",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a"
    ],
    "s2id": "f7bc5be4cc305f70b36456a959d7b95669b48ac2",
    "abstract": "Large language models (LLMs) have recently transformed natural language processing, enabling machines to generate human-like text and engage in meaningful conversations. This development necessitates speed, efficiency, and accessibility in LLM inference as the computational and memory requirements of these systems grow exponentially. Meanwhile, advancements in computing and memory capabilities are lagging behind, exacerbated by the discontinuation of Moore's law. With LLMs exceeding the capacity of single GPUs, they require complex, expert-level configurations for parallel processing. Memory accesses become significantly more expensive than computation, posing a challenge for efficient scaling, known as the memory wall. Here, compute-in-memory (CIM) technologies offer a promising solution for accelerating AI inference by directly performing analog computations in memory, potentially reducing latency and power consumption. By closely integrating memory and compute elements, CIM eliminates the von Neumann bottleneck, reducing data movement and improving energy efficiency. This survey paper provides an overview and analysis of transformer-based models, reviewing various CIM architectures and exploring how they can address the imminent challenges of modern AI computing systems. We discuss transformer-related operators and their hardware acceleration schemes and highlight challenges, trends, and insights in corresponding CIM designs.",
    "authors": [
        "Christopher Wolters",
        "Xiaoxuan Yang",
        "Ulf Schlichtmann",
        "T. Suzumura"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An overview and analysis of transformer-based models of compute-in-memory (CIM) technologies is provided, reviewing various CIM architectures and exploring how they can address the imminent challenges of modern AI computing systems."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}