{
    "acronym": "f7e755443d665ebc215e7caeda8aa3154466bddc",
    "title": "A Philosophical Introduction to Language Models - Part I: Continuity With Classic Debates",
    "seed_ids": [
        "gpt3",
        "94ce1d5924e05e8d75e43ce70044293ddcef850a",
        "68850153b0210615c86f9a72624f34e2913bcddf",
        "b1f33e956e36bf25e118c0d537dcc519cfe52e60",
        "c57293882b2561e1ba03017902df9fc2f289dea2",
        "ada81a4de88a6ce474df2e2446ad11fea480616e",
        "49e65b12d8d11f2ccb5ddd7be72a8f746b2d1bc2",
        "5cdab78acc4f3aab429a0dd41c3ec7e605d42e7b"
    ],
    "s2id": "f7e755443d665ebc215e7caeda8aa3154466bddc",
    "abstract": "Large language models like GPT-4 have achieved remarkable proficiency in a broad spectrum of language-based tasks, some of which are traditionally associated with hallmarks of human intelligence. This has prompted ongoing disagreements about the extent to which we can meaningfully ascribe any kind of linguistic or cognitive competence to language models. Such questions have deep philosophical roots, echoing longstanding debates about the status of artificial neural networks as cognitive models. This article -- the first part of two companion papers -- serves both as a primer on language models for philosophers, and as an opinionated survey of their significance in relation to classic debates in the philosophy cognitive science, artificial intelligence, and linguistics. We cover topics such as compositionality, language acquisition, semantic competence, grounding, world models, and the transmission of cultural knowledge. We argue that the success of language models challenges several long-held assumptions about artificial neural networks. However, we also highlight the need for further empirical investigation to better understand their internal mechanisms. This sets the stage for the companion paper (Part II), which turns to novel empirical methods for probing the inner workings of language models, and new philosophical questions prompted by their latest developments.",
    "authors": [
        "Raphael Milliere",
        "Cameron Buckner"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": null,
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}