{
    "acronym": "f841f3d912be52a621aab1a979632e9daeab6599",
    "title": "Sparse Attention Acceleration with Synergistic In-Memory Pruning and On-Chip Recomputation",
    "seed_ids": [
        "gpt2",
        "b97c3c370401dc34d2adbeb24f34de5180a14be6",
        "2b38ddff8e24a07597c8d042ea7b8b85a678e9b2",
        "5af69480a7ae3b571df6782a11ec4437b386a7d9",
        "6da4b231148bf26677233d1f778d08a5d26f4313",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "657329c633709dd1ac34a30d57341b186b1a47c2",
        "f51497f463566581874c941353dd9d80069c5b77",
        "2e14e84ccec924ed770b58108ad1d9de6f0ca295",
        "2cf3bd0cc1382f35384e259d99e4f9744eeaed28",
        "83b8108014e3db4f46354a28ae68193f143c4e7e",
        "f6390beca54411b06f3bde424fb983a451789733",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f841f3d912be52a621aab1a979632e9daeab6599",
    "abstract": "As its core computation, a self-attention mechanism gauges pairwise correlations across the entire input sequence. Despite favorable performance, calculating pairwise correlations is prohibitively costly. While recent work has shown the benefits of runtime pruning of elements with low attention scores, the quadratic complexity of self-attention mechanisms and their on-chip memory capacity demands are overlooked. This work addresses these constraints by architecting an accelerator, called SPRINT1, which leverages the inherent parallelism of ReRAM crossbar arrays to compute attention scores in an approximate manner. Our design prunes the low attention scores using a lightweight analog thresholding circuitry within ReRAM, enabling SPRINT to fetch only a small subset of relevant data to on-chip memory. To mitigate potential negative repercussions for model accuracy, SPRINT re-computes the attention scores for the few fetched data in digital. The combined in-memory pruning and on-chip recompute of the relevant attention scores enables SPRINT to transform quadratic complexity to a merely linear one. In addition, we identify and leverage a dynamic spatial locality between the adjacent attention operations even after pruning, which eliminates costly yet redundant data fetches. We evaluate our proposed technique on a wide range of state-of-the-art transformer models. On average, SPRINT yields 7.5× speedup and 19.6× energy reduction when total l6KB on-chip memory is used, while virtually on par with iso-accuracy of the baseline models (on average 0.36% degradation).",
    "authors": [
        "A. Yazdanbakhsh",
        "Ashkan Moradifirouzabadi",
        "Zheng Li",
        "Mingu Kang"
    ],
    "venue": "Micro",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The design prunes the low attention scores using a lightweight analog thresholding circuitry within ReRAM, enabling SPRINT to fetch only a small subset of relevant data to on-chip memory, and identifies and leverage a dynamic spatial locality between the adjacent attention operations even after pruning, which eliminates costly yet redundant data fetches."
    },
    "citationCount": 18,
    "influentialCitationCount": 2,
    "code": null,
    "description": null,
    "url": null
}