{
    "acronym": "f84485ee73b75a1bbf64b03a239b1a7a2057da87",
    "title": "Towards Mitigating Perceived Unfairness in Contracts from a Non-Legal Stakeholder’s Perspective",
    "seed_ids": [
        "bert"
    ],
    "s2id": "f84485ee73b75a1bbf64b03a239b1a7a2057da87",
    "abstract": "Commercial contracts are known to be a valuable source for deriving project-specific requirements. However, contract negotiations mainly occur among the legal counsel of the parties involved. The participation of non-legal stakeholders, including requirement analysts, engineers, and solution architects, whose primary responsibility lies in ensuring the seamless implementation of contractual terms, is often indirect and inadequate. Consequently, a significant number of sentences in contractual clauses, though legally accurate, can appear unfair from an implementation perspective to non-legal stakeholders. This perception poses a problem since requirements indicated in the clauses are obligatory and can involve punitive measures and penalties if not implemented as committed in the contract. Therefore, the identification of potentially unfair clauses in contracts becomes crucial. In this work, we conduct an empirical study to analyze the perspectives of different stakeholders regarding contractual fairness. We then investigate the ability of Pre-trained Language Models (PLMs) to identify unfairness in contractual sentences by comparing chain of thought prompting and semi-supervised fine-tuning approaches. Using BERT-based fine-tuning, we achieved an accuracy of 84% on a dataset consisting of proprietary contracts. It outperformed chain of thought prompting using Vicuna-13B by a margin of 9%.",
    "authors": [
        "Anmol Singhal",
        "Preethu Rose Anish",
        "S. Karande",
        "S. Ghaisas"
    ],
    "venue": "NLLP",
    "year": 2023,
    "tldr": null,
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}