{
    "acronym": "f87c1345cb5a10d8fea30580ba0bdf593472c004",
    "title": "Transformers Meet Visual Learning Understanding: A Comprehensive Review",
    "seed_ids": [
        "gpt",
        "f7e449d7695fbbf43081cc820a81fe0ccb11c3db",
        "203b965e5c9eb1e1c521ec66f82b036335c7cd4d",
        "2c4d5b1278125d84c9e66ebe1032af888d9211f3",
        "a9c214e846188adb645021cd7b1964b8ea1fef6f",
        "d8d2e574965fe733eb1416e03df2b5c2914fc530",
        "3cbe314cc5407a6c3249815b5173f22ea15173c2",
        "94b69cf199fa0b6c842e17fe5d6174a9d161c3df",
        "3a906b77fa218adc171fecb28bb81c24c14dcc7b",
        "2e1db8cb373f4d4a51d44308b7a457886d855fbb",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "bc022dbb37b1bbf3905a7404d19c03ccbf6b81a8",
        "a8427ce5aee6d62800c725588e89940ed4910e0d",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f87c1345cb5a10d8fea30580ba0bdf593472c004",
    "abstract": "Dynamic attention mechanism and global modeling ability make Transformer show strong feature learning ability. In recent years, Transformer has become comparable to CNNs methods in computer vision. This review mainly investigates the current research progress of Transformer in image and video applications, which makes a comprehensive overview of Transformer in visual learning understanding. First, the attention mechanism is reviewed, which plays an essential part in Transformer. And then, the visual Transformer model and the principle of each module are introduced. Thirdly, the existing Transformer-based models are investigated, and their performance is compared in visual learning understanding applications. Three image tasks and two video tasks of computer vision are investigated. The former mainly includes image classification, object detection, and image segmentation. The latter contains object tracking and video classification. It is significant for comparing different models' performance in various tasks on several public benchmark data sets. Finally, ten general problems are summarized, and the developing prospects of the visual Transformer are given in this review.",
    "authors": [
        "Yuting Yang",
        "Licheng Jiao",
        "X. Liu",
        "F. Liu",
        "Shuyuan Yang",
        "Zhixi Feng",
        "Xu Tang"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This review mainly investigates the current research progress of Transformer in image and video applications, which makes a comprehensive overview of Trans transformer in visual learning understanding."
    },
    "citationCount": 22,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}