{
    "acronym": "f88164017a65eb2fdfb4790defeb09851117e829",
    "title": "Automatic Follow-up Question Generation for Asynchronous Interviews",
    "seed_ids": [
        "gpt",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f88164017a65eb2fdfb4790defeb09851117e829",
    "abstract": "The user experience of an asynchronous video interview system is often deemed non-interactive and one-sided. Interview candidates anticipate them to be natural and coherent like a traditional face-to-face interview. One aspect of improving the interaction is by asking relevant follow-up questions based on the previously asked questions, and its answers. We propose a follow-up question generation model capable of generating relevant and diverse follow-up questions. We develop a 3D virtual interviewing system, Maya , equipped with follow-up question generator. Many existing asynchronous interviewing systems pose questions that are ﬁxed and scripted. Maya , on the contrary, reacts with relevant follow-up questions, a relatively unexplored dimen-sion in virtual interviewing systems. We leverage the implicit knowledge from deep pre-trained language models along with a small corpus of interview questions to generate rich and diverse follow-up questions in natural language. The generated questions achieve 77% relevance with human evaluation. We compare our follow-up question generation model with strong baselines of neural network and rule-based systems and show that it produces better quality questions.",
    "authors": [
        "P. B",
        "Manish Agnihotri",
        "D. Jayagopi"
    ],
    "venue": "INTELLANG",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A follow-up question generation model capable of generating relevant and diverse follow-up questions in natural language is proposed and compared with strong baselines of neural network and rule-based systems and shows that it produces better quality questions."
    },
    "citationCount": 4,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}