{
    "acronym": "f8d44802ac8190864c61c9aaf4a8b450261873ab",
    "title": "An Empirical Survey on Long Document Summarization: Datasets, Models, and Metrics",
    "seed_ids": [
        "bigbird",
        "longformer",
        "882a7756d91e98a498af294c6dd7d54cbe4b490b",
        "f8c6d9ed61fdf04cd390dce017a817152cf4d580",
        "f4566761fe39c4b5273d696d9bc3f4195c9325bb",
        "d25121da56c9050137800c69520111b30201d1ed",
        "9dc624d7258d1a56117ca720aea953ce46b66b21",
        "85e7d63f75c0916bd350a229e040c5fbb1472e7a",
        "7e9ff94476f41041c75e253e84f487db00e9c861",
        "7e5709d81558d3ef4265de29ea75931afeb1f2dd",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "01b15017ac59b8d6f2ce3598c4a7d6358c211426",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "f8d44802ac8190864c61c9aaf4a8b450261873ab",
    "abstract": "Long documents such as academic articles and business reports have been the standard format to detail out important issues and complicated subjects that require extra attention. An automatic summarization system that can effectively condense long documents into short and concise texts to encapsulate the most important information would thus be significant in aiding the reader’s comprehension. Recently, with the advent of neural architectures, significant research efforts have been made to advance automatic text summarization systems, and numerous studies on the challenges of extending these systems to the long document domain have emerged. In this survey, we provide a comprehensive overview of the research on long document summarization and a systematic evaluation across the three principal components of its research setting: benchmark datasets, summarization models, and evaluation metrics. For each component, we organize the literature within the context of long document summarization and conduct an empirical analysis to broaden the perspective on current research progress. The empirical analysis includes a study on the intrinsic characteristics of benchmark datasets, a multi-dimensional analysis of summarization models, and a review of the summarization evaluation metrics. Based on the overall findings, we conclude by proposing possible directions for future exploration in this rapidly growing field.",
    "authors": [
        "Huan Yee Koh",
        "Jiaxin Ju",
        "Ming Liu",
        "Shirui Pan"
    ],
    "venue": "ACM Computing Surveys",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey provides a comprehensive overview of the research on long document summarization and a systematic evaluation across the three principal components of its research setting: benchmark datasets, summarization models, and evaluation metrics."
    },
    "citationCount": 64,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}