{
    "acronym": "f92610c14267dc148ee26f180c866327f1c368a1",
    "title": "SimilarBERT: A Framework for Similarity-based Topic Modeling",
    "seed_ids": [
        "bert",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d"
    ],
    "s2id": "f92610c14267dc148ee26f180c866327f1c368a1",
    "abstract": "Topic modeling is a powerful technique for discovering clusters of related subjects in a corpus. However, traditional topic models often suffer from several limitations, such as being sensitive to the order of words in documents and not being able to capture the semantic similarity between words. In this paper, we introduce SimilarBERT. A framework designed for topic modeling using BERT embeddings. SimilarBERT integrates sentence embedding, clustering, outlier detection, topic descriptions, evaluation metrics, and a variety of visualizations to form a cohesive topic modeling pipeline. To assess the effectiveness of SimilarBERT, an experiment was conducted using the Quora Question Pairs dataset. The results showcase SimilarBERT’s ability to extract and evaluate topics, ultimately resulting in a comprehensive list of clusters, accompanied by relevant descriptions providing insight into the content of the clusters. Evaluation of topics is carried out with emphasis on topic similarity, and particularly focusing on inter-document relationships within each topic. Our results demonstrate that SimilarBERT is an effective way to discover topics in text data.",
    "authors": [
        "Sule Mohammed",
        "Bhavesh M. Patel"
    ],
    "venue": "Journées Francophones d'Ingénierie des Connaissances",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "SimilarBERT is introduced, a framework designed for topic modeling using BERT embeddings that integrates sentence embedding, clustering, outlier detection, topic descriptions, evaluation metrics, and a variety of visualizations to form a cohesive topic modeling pipeline."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}