{
    "acronym": "f9667fa79bef8878aa641dc0b75d577bff69b30b",
    "title": "Transformer Neural Networks for Automated Rhythm Generation",
    "seed_ids": [
        "transformerxl",
        "479eaafcee15a44b632b3cab41491b517e1531fe",
        "ce510c6cfeac703706460680e977c54554840830",
        "24a70db0bbb5f486126477e32a6a44ab917a4b11"
    ],
    "s2id": "f9667fa79bef8878aa641dc0b75d577bff69b30b",
    "abstract": "We propose a novel approach to automated rhythm generation in which a TransformerXL model is employed to model and generate rhythm from the Magenta Groove MIDI Dataset. Recent applications of this high-dimensional language framework in the field of music have demonstrated it’s ability to effectively capture and emulate long-term dependency in musical sequences dependencies characteristic of human notions of musicality and creative merit making it an ideal candidate to experiment with for the task of rhythm-specific generation. We evaluate hundreds of generations from our optimum model using a variety of methods; probabilistic, musicological and in blind listening tests to determine the extent to which our framework has learnt and reproduced the aspects of rhythm we understand to be valuable. Our model is able to achieve a standard of rhythmic production comparable to human playing across arbitrarily long time periods and multiple playing styles.",
    "authors": [
        "T. Nuttall",
        "B. Haki",
        "S. Jordà"
    ],
    "venue": "New Interfaces for Musical Expression",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel approach to automated rhythm generation in which a TransformerXL model is employed to model and generate rhythm from the Magenta Groove MIDI Dataset, able to achieve a standard of rhythmic production comparable to human playing across arbitrarily long time periods and multiple playing styles."
    },
    "citationCount": 7,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}