{
    "acronym": "f9b91c369f4cae2486c23cd052ad7495a5ad2983",
    "title": "A Short Survey of Pre-trained Language Models for Conversational AI-A New Age in NLP",
    "seed_ids": [
        "gpt",
        "5744f56d3253bd7c4341d36de40a93fceaa266b3",
        "a5ed9dfc0725bffb6428a2cc297a15265377906c",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "f9b91c369f4cae2486c23cd052ad7495a5ad2983",
    "abstract": "Building a dialogue system that can communicate naturally with humans is a challenging yet interesting problem of agent-based computing. The rapid growth in this area is usually hindered by the long-standing problem of data scarcity as these systems are expected to learn syntax, grammar, decision making, and reasoning from insufficient amounts of task-specific dataset. The recently introduced pre-trained language models have the potential to address the issue of data scarcity and bring considerable advantages by generating contextualized word embeddings. These models are considered counterpart of ImageNet in NLP and have demonstrated to capture different facets of language such as hierarchical relations, long-term dependency, and sentiment. In this short survey paper, we discuss the recent progress made in the field of pre-trained language models. We also deliberate that how the strengths of these language models can be leveraged in designing more engaging and more eloquent conversational agents. This paper, therefore, intends to establish whether these pre-trained models can overcome the challenges pertinent to dialogue systems, and how their architecture could be exploited in order to overcome these challenges. Open challenges in the field of dialogue systems have also been deliberated.",
    "authors": [
        "Munazza Zaib",
        "Quan Z. Sheng",
        "W. Zhang"
    ],
    "venue": "Australasian Computer Science Week",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper intends to establish whether these pre-trained models can overcome the challenges pertinent to dialogue systems, and how their architecture could be exploited in order to overcome these challenges."
    },
    "citationCount": 58,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}