{
    "acronym": "f9fff0d57ea37ec2a3a47bdbb8ced605e43f6b87",
    "title": "Video Background Music Generation with Controllable Music Transformer",
    "seed_ids": [
        "lineartransformer",
        "eb0931c39904a40c6cb4aa35c9b21d5e3b7dc856",
        "4c64c35198453662882afd63d618a832c7d8c1b2",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "ce510c6cfeac703706460680e977c54554840830",
        "24a70db0bbb5f486126477e32a6a44ab917a4b11",
        "fb507ada871d1e8c29e376dbf7b7879689aa89f9"
    ],
    "s2id": "f9fff0d57ea37ec2a3a47bdbb8ced605e43f6b87",
    "abstract": "In this work, we address the task of video background music generation. Some previous works achieve effective music generation but are unable to generate melodious music specifically for a given video, and none of them considers the video-music rhythmic consistency. To generate the background music that matches the given video, we first establish the rhythmic relationships between video and background music. In particular, we connect timing, motion speed, and motion saliency from video with beat, simu-note density, and simu-note strength from music, respectively. We then propose CMT, a Controllable Music Transformer that enables the local control of the aforementioned rhythmic features, as well as the global control of the music genre and the used instrument specified by users. Objective and subjective evaluations show that the generated background music has achieved satisfactory compatibility with the input videos, and at the same time, impressive music quality.",
    "authors": [
        "Shangzhe Di",
        "Jiang",
        "Sihan Liu",
        "Zhaokai Wang",
        "Leyan Zhu",
        "Zexin He",
        "Hongming Liu",
        "Shuicheng Yan"
    ],
    "venue": "ACM Multimedia",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work establishes the rhythmic relationships between video and background music, and proposes CMT, a Controllable Music Transformer that enables the local control of the aforementioned rhythmic features, as well as the global Control of the music genre and the used instrument specified by users."
    },
    "citationCount": 57,
    "influentialCitationCount": 8,
    "code": null,
    "description": null,
    "url": null
}