{
    "acronym": "fa51076458b7bcf9a60f476d525755e47199a6d8",
    "title": "ConvoSumm: Conversation Summarization Benchmark and Improved Abstractive Summarization with Argument Mining",
    "seed_ids": [
        "longformer",
        "6e6a2fe517b33e1f29d761ae31fb37ddccb9a213",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "ef57ad148ec2eeef5eb3467f3e37e30042b2c7bd",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "faadd7d081c8d67e8c2567e8a5579e46cd6b2280"
    ],
    "s2id": "fa51076458b7bcf9a60f476d525755e47199a6d8",
    "abstract": "While online conversations can cover a vast amount of information in many different formats, abstractive text summarization has primarily focused on modeling solely news articles. This research gap is due, in part, to the lack of standardized datasets for summarizing online discussions. To address this gap, we design annotation protocols motivated by an issues–viewpoints–assertions framework to crowdsource four new datasets on diverse online conversation forms of news comments, discussion forums, community question answering forums, and email threads. We benchmark state-of-the-art models on our datasets and analyze characteristics associated with the data. To create a comprehensive benchmark, we also evaluate these models on widely-used conversation summarization datasets to establish strong baselines in this domain. Furthermore, we incorporate argument mining through graph construction to directly model the issues, viewpoints, and assertions present in a conversation and filter noisy input, showing comparable or improved results according to automatic and human evaluations.",
    "authors": [
        "Alexander R. Fabbri",
        "Faiaz Rahman",
        "Imad Rizvi",
        "Borui Wang",
        "Haoran Li",
        "Yashar Mehdad",
        "Dragomir R. Radev"
    ],
    "venue": "Annual Meeting of the Association for Computational Linguistics",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Annotation protocols motivated by an issues–viewpoints–assertions framework are designed to crowdsource four new datasets on diverse online conversation forms of news comments, discussion forums, community question answering forums, and email threads, and benchmark state-of-the-art models on these datasets and analyze characteristics associated with the data."
    },
    "citationCount": 50,
    "influentialCitationCount": 5,
    "code": null,
    "description": null,
    "url": null
}