{
    "acronym": "faaafda9a27b009b633400a4d5ac0b241e31578f",
    "title": "Effective Entity Augmentation By Querying External Data Sources",
    "seed_ids": [
        "longformer",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "faaafda9a27b009b633400a4d5ac0b241e31578f",
    "abstract": "Users often want to augment and enrich entities in their datasets with relevant information from external data sources. As many external sources are accessible only via keyword-search interfaces, a user usually has to manually formulate a keyword query that extract relevant information for each entity. This approach is challenging as many data sources contain numerous tuples, only a small fraction of which may contain entity-relevant information. Furthermore, different datasets may represent the same information in distinct forms and under different terms (e.g., different data source may use different names to refer to the same person). In such cases, it is difficult to formulate a query that precisely retrieves information relevant to an entity. Current methods for information enrichment mainly rely on lengthy and resource-intensive manual effort to formulate queries to discover relevant information. However, in increasingly many settings, it is important for users to get initial answers quickly and without substantial investment in resources (such as human attention). We propose a progressive approach to discovering entity-relevant information from external sources with minimal expert intervention. It leverages end users' feedback to progressively learn how to retrieve information relevant to each entity in a dataset from external data sources. Our empirical evaluation shows that our approach learns accurate strategies to deliver relevant information quickly.",
    "authors": [
        "Christopher Buss",
        "Jasmin Mousavi",
        "M. Tokarev",
        "Arash Termehchy",
        "D. Maier",
        "Stefan Lee"
    ],
    "venue": "Proceedings of the VLDB Endowment",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a progressive approach to discovering entity-relevant information from external sources with minimal expert intervention that leverages end users' feedback to progressively learn how to retrieve information relevant to each entity in a dataset from external data sources."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}