{
    "acronym": "faea04bf558c1a8b072bdcfe3cebe06ea4d9d9ca",
    "title": "WSL-DS: Weakly Supervised Learning with Distant Supervision for Query Focused Multi-Document Abstractive Summarization",
    "seed_ids": [
        "bigbird",
        "longformer",
        "28307bc149a74cfcae657f782f1c7630b6f4acce",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "faea04bf558c1a8b072bdcfe3cebe06ea4d9d9ca",
    "abstract": "In the Query Focused Multi-Document Summarization (QF-MDS) task, a set of documents and a query are given where the goal is to generate a summary from these documents based on the given query. However, one major challenge for this task is the lack of availability of labeled training datasets. To overcome this issue, in this paper, we propose a novel weakly supervised learning approach via utilizing distant supervision. In particular, we use datasets similar to the target dataset as the training data where we leverage pre-trained sentence similarity models to generate the weak reference summary of each individual document in a document set from the multi-document gold reference summaries. Then, we iteratively train our summarization model on each single-document to alleviate the computational complexity issue that occurs while training neural summarization models in multiple documents (i.e., long sequences) at once. Experimental results on the Document Understanding Conferences (DUC) datasets show that our proposed approach sets a new state-of-the-art result in terms of various evaluation metrics.",
    "authors": [
        "Md Tahmid Rahman Laskar",
        "Enamul Hoque",
        "J. Huang"
    ],
    "venue": "International Conference on Computational Linguistics",
    "year": 2020,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper uses datasets similar to the target dataset as the training data where it leverage pre-trained sentence similarity models to generate the weak reference summary of each individual document in a document set from the multi-document gold reference summaries."
    },
    "citationCount": 33,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}