{
    "acronym": "faf48237de955fc0443f00bc70a3df2c4bc288ac",
    "title": "Detection and Positive Reconstruction of Cognitive Distortion sentences: Mandarin Dataset and Evaluation",
    "seed_ids": [
        "bert",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "50796b0f3edf9cb5ff1e447c298b33755378aa4f"
    ],
    "s2id": "faf48237de955fc0443f00bc70a3df2c4bc288ac",
    "abstract": "This research introduces a Positive Reconstruction Framework based on positive psychology theory. Overcoming negative thoughts can be challenging, our objective is to address and reframe them through a positive reinterpretation. To tackle this challenge, a two-fold approach is necessary: identifying cognitive distortions and suggesting a positively reframed alternative while preserving the original thought's meaning. Recent studies have investigated the application of Natural Language Processing (NLP) models in English for each stage of this process. In this study, we emphasize the theoretical foundation for the Positive Reconstruction Framework, grounded in broaden-and-build theory. We provide a shared corpus containing 4001 instances for detecting cognitive distortions and 1900 instances for positive reconstruction in Mandarin. Leveraging recent NLP techniques, including transfer learning, fine-tuning pretrained networks, and prompt engineering, we demonstrate the effectiveness of automated tools for both tasks. In summary, our study contributes to multilingual positive reconstruction, highlighting the effectiveness of NLP in cognitive distortion detection and positive reconstruction.",
    "authors": [
        "Shuya Lin",
        "Yuxiong Wang",
        "Jonathan Dong",
        "Shiguang Ni"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A Positive Reconstruction Framework based on positive psychology theory is introduced, highlighting the effectiveness of NLP in cognitive distortion detection and positive reconstruction and demonstrating the effectiveness of automated tools for both tasks."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}