{
    "acronym": "fb122bf1bda3a21dce47e032b1b770e379a4dff5",
    "title": "Lexical Semantic Change Analysis with Contextualised Word Representations",
    "seed_ids": [
        "gpt",
        "f6fbb6809374ca57205bd2cf1421d4f4fa04f975",
        "b47381e04739ea3f392ba6c8faaf64105493c196",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "fb122bf1bda3a21dce47e032b1b770e379a4dff5",
    "abstract": "How does the meaning of a word change over time? This thesis introduces a bottom-up procedure that aggregates word usages into groups of meaningful usage types in order to detect and investigate lexical semantic change within diachronic collections of texts. Computational measures of semantic change have relied on distributional and predictive word representations as well as on models for word sense induction. While the first fail to take word polysemy into account, the second involve an a priori selection of the number of underlying word senses, use a limited context window and treat sentences as bags of words. In order to address these limitations, we use a neural language model to obtain contextualised word representations which are uniquely defined by a word form together with its entire sentential context, and we aggregate said representations by automatically selecting the number of saliently different usage types, in a data-driven fashion. We then propose three metrics of semantic shift to quantify the degree of change undergone by a word and evaluate them against human judgements. Furthermore, we analyse the linguistic properties that guide the formation of clusters of word usages and probe our method with various types of semantic change. Results show that we are able to detect, in corpora of varying temporal granularity, the narrowing, broadening, and metaphorisation of a word’s interpretation. We can recognise cultural drifts driven by technological innovations, cultural transitions, and specific events, as well as more subtle linguistic shifts such as changes in the subcategorisation frames of nouns and verbs. Besides its empirical findings, this thesis demonstrates that language models and contextualised word representations constitute a versatile and fruitful framework for computational analyses of language change and variation.",
    "authors": [
        "M. Giulianelli"
    ],
    "venue": "",
    "year": 2019,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This thesis introduces a bottom-up procedure that aggregates word usages into groups of meaningful usage types in order to detect and investigate lexical semantic change within diachronic collections of texts and demonstrates that language models and contextualised word representations constitute a versatile and fruitful framework for computational analyses of language change and variation."
    },
    "citationCount": 14,
    "influentialCitationCount": 3,
    "code": null,
    "description": null,
    "url": null
}