{
    "acronym": "fb1931e9069cf8bfe11a1b8a1055ace7b526db1d",
    "title": "Don't Forget to Connect! Improving RAG with Graph-based Reranking",
    "seed_ids": [
        "bert",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481"
    ],
    "s2id": "fb1931e9069cf8bfe11a1b8a1055ace7b526db1d",
    "abstract": "Retrieval Augmented Generation (RAG) has greatly improved the performance of Large Language Model (LLM) responses by grounding generation with context from existing documents. These systems work well when documents are clearly relevant to a question context. But what about when a document has partial information, or less obvious connections to the context? And how should we reason about connections between documents? In this work, we seek to answer these two core questions about RAG generation. We introduce G-RAG, a reranker based on graph neural networks (GNNs) between the retriever and reader in RAG. Our method combines both connections between documents and semantic information (via Abstract Meaning Representation graphs) to provide a context-informed ranker for RAG. G-RAG outperforms state-of-the-art approaches while having smaller computational footprint. Additionally, we assess the performance of PaLM 2 as a reranker and find it to significantly underperform G-RAG. This result emphasizes the importance of reranking for RAG even when using Large Language Models.",
    "authors": [
        "Jialin Dong",
        "Bahare Fatemi",
        "Bryan Perozzi",
        "Lin F. Yang",
        "Anton Tsitsulin"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "G-RAG is introduced, a reranker based on graph neural networks (GNNs) between the retriever and reader in RAG that outperforms state-of-the-art approaches while having smaller computational footprint and emphasizes the importance of reranking for RAG even when using Large Language Models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}