{
    "acronym": "fb870f2d875c1395674d6ae99d3138169f8d4a19",
    "title": "Beyond Bounding Box: Multimodal Knowledge Learning for Object Detection",
    "seed_ids": [
        "gpt2",
        "319b84be7a843250bc81d7086f79a4126d550277",
        "d0086b86103a620a86bc918746df0aa642e2a8a3",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "fb870f2d875c1395674d6ae99d3138169f8d4a19",
    "abstract": "Multimodal supervision has achieved promising results in many visual language understanding tasks, where the language plays an essential role as a hint or context for recognizing and locating instances. However, due to the defects of the human-annotated language corpus, multimodal supervision remains unexplored in fully supervised object detection scenarios. In this paper, we take advantage of language prompt to introduce effective and unbiased linguistic supervision into object detection, and propose a new mechanism called multimodal knowledge learning (\\textbf{MKL}), which is required to learn knowledge from language supervision. Specifically, we design prompts and fill them with the bounding box annotations to generate descriptions containing extensive hints and context for instances recognition and localization. The knowledge from language is then distilled into the detection model via maximizing cross-modal mutual information in both image- and object-level. Moreover, the generated descriptions are manipulated to produce hard negatives to further boost the detector performance. Extensive experiments demonstrate that the proposed method yields a consistent performance gain by 1.6\\% $\\sim$ 2.1\\% and achieves state-of-the-art on MS-COCO and OpenImages datasets.",
    "authors": [
        "Wei Feng",
        "Xingyuan Bu",
        "Chenchen Zhang",
        "Xubin Li"
    ],
    "venue": "arXiv.org",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This paper takes advantage of language prompt to introduce effective and unbiased linguistic supervision into object detection, and proposes a new mechanism called multimodal knowledge learning (\\textbf{MKL}), which is required to learn knowledge from language supervision."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}