{
    "acronym": "fbba03eb3e9a4da92b5254ab7eef851914ab2fcf",
    "title": "SetCSE: Set Operations using Contrastive Learning of Sentence Embeddings",
    "seed_ids": [
        "bert",
        "73b222c2808a95878c8a3aa762b9ba1d4dd9ecd4",
        "b8ad6ba5a367dc44aeebc85baded2af54d28255d",
        "7db87539bcaed817c820c4e0c0855ec5fb24344c",
        "e092ecf56fcca38d0cd6fe9e1e6b11c380f6c286"
    ],
    "s2id": "fbba03eb3e9a4da92b5254ab7eef851914ab2fcf",
    "abstract": "Taking inspiration from Set Theory, we introduce SetCSE, an innovative information retrieval framework. SetCSE employs sets to represent complex semantics and incorporates well-defined operations for structured information querying under the provided context. Within this framework, we introduce an inter-set contrastive learning objective to enhance comprehension of sentence embedding models concerning the given semantics. Furthermore, we present a suite of operations, including SetCSE intersection, difference, and operation series, that leverage sentence embeddings of the enhanced model for complex sentence retrieval tasks. Throughout this paper, we demonstrate that SetCSE adheres to the conventions of human language expressions regarding compounded semantics, provides a significant enhancement in the discriminatory capability of underlying sentence embedding models, and enables numerous information retrieval tasks involving convoluted and intricate prompts which cannot be achieved using existing querying methods.",
    "authors": [
        "Kang Liu"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "It is demonstrated that SetCSE adheres to the conventions of human language expressions regarding compounded semantics, provides a significant enhancement in the discriminatory capability of underlying sentence embedding models, and enables numerous information retrieval tasks involving convoluted and intricate prompts which cannot be achieved using existing querying methods."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}