{
    "acronym": "fbebdc95eb3145ca3893a5493746c31acaf133e5",
    "title": "Adapt-to-Learn Policy Network for Abstractive Multi-document Summarization",
    "seed_ids": [
        "memcompress",
        "42e41ab2211b8ba78e36326ea21e05bd25d92c42",
        "008cfd24dfdfb28fc6a89c32772c7ffe5cb0cf8a",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "83fac78857c7e65fe10a11a798674dd3cd259c1d",
        "7cc730da554003dda77796d2cb4f06da5dfd5592",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0"
    ],
    "s2id": "fbebdc95eb3145ca3893a5493746c31acaf133e5",
    "abstract": "Abstractive multi-document summarization (MDS) aims to generate a summary for a set of topic-related documents, in which different documents may contain trivial and redundant information and present complementary or contradictory content. It is essential to extract salient information and detect redundancy across documents for abstractive MDS compared with single-document summarization. However, it is challenging for models to exploit salient information and generate concise summaries. In this paper, we propose an Adapt-to-Learn Policy (ALP) network to seamlessly adapt the key sentence selection and word generation over retrieval and generative agents, guided by the multi-document summarization reward. Moreover, our model learns latent dependencies among textual units and explicitly takes advantage of critical information by focusing on semantic similarity or discourse relations. Extensive experiments on WikiSum and Multi-News datasets confirm that our method is superior to prior competitive baselines, and experimental analyses show that higher-quality summaries and more fluent word order can be generated in our ALP network.",
    "authors": [
        "Hongzhang Mu",
        "Shuili Zhang",
        "Quangang Li",
        "Tingwen Liu",
        "Hongbo Xu"
    ],
    "venue": "IEEE International Joint Conference on Neural Network",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "An Adapt-to-Learn Policy (ALP) network is proposed to seamlessly adapt the key sentence selection and word generation over retrieval and generative agents, guided by the multi-document summarization reward, which is superior to prior competitive baselines."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}