{
    "acronym": "fbf68eb0cf8237cef59ebdb301569c79b9676ff9",
    "title": "MAXIM: Multi-Axis MLP for Image Processing",
    "seed_ids": [
        "gmlp",
        "fnet",
        "9b6af0e358e76d22f209c75b1702c3e6ea7815b1",
        "eaf3a64b637b3699678374a2afe8dde05d17a5cc",
        "1f133158a8973fb33fea188f20517cd7e69bfe7f",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "fbf68eb0cf8237cef59ebdb301569c79b9676ff9",
    "abstract": "Recent progress on Transformers and multilayer perceptron (MLP) models provide new network architectural designs for computer vision tasks. Although these models proved to be effective in many vision tasks such as image recognition, there remain challenges in adapting them for lowlevel vision. The inflexibility to support high-resolution images and limitations of local attention are perhaps the main bottlenecks. In this work, we present a multi-axis MLP based architecture called MAXIM, that can serve as an efficient and flexible general-purpose vision backbone for image processing tasks. MAXIM uses a UNet-shaped hierarchical structure and supports long-range interactions enabled by spatially-gated MLPs. Specifically, MAXIM contains two MLP-based building blocks: a multi-axis gated MLP that allows for efficient and scalable spatial mixing of local and global visual cues, and a cross-gating block, an alternative to cross-attention, which accounts for cross-feature conditioning. Both these modules are exclusively based on MLPs, but also benefit from being both global and ‘fully-convolutional’, two properties that are desirable for image processing. Our extensive experimental results show that the proposed MAXIM model achieves state-of-the-art performance on more than ten benchmarks across a range of image processing tasks, including denoising, deblurring, de raining, dehazing, and enhancement while requiring fewer or comparable numbers of parameters and FLOPs than competitive models. The source code and trained models will be available at https://github.com/google-research/maxim.",
    "authors": [
        "Zhengzhong Tu",
        "Hossein Talebi",
        "Han Zhang",
        "Feng Yang",
        "P. Milanfar",
        "A. Bovik",
        "Yinxiao Li"
    ],
    "venue": "Computer Vision and Pattern Recognition",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed MAXIM model achieves state-of-the-art performance on more than ten benchmarks across a range of image processing tasks, including denoising, deblurring, de raining, dehazing, and enhancement while requiring fewer or comparable numbers of parameters and FLOPs than competitive models."
    },
    "citationCount": 326,
    "influentialCitationCount": 48,
    "code": null,
    "description": null,
    "url": null
}