{
    "acronym": "fc736fadd20f3db8b214e7b20b42c62b707a2cb5",
    "title": "Generating Multi-Modal and Multi-Attribute Single-Cell Counts with CFGen",
    "seed_ids": [
        "classfreediffu",
        "587547493b5cf221af4b929cf390ef81e9768937",
        "b1d77c7921bcd79f520d252473225ac19d6b6289",
        "512fdb53eb341bc56769728274615c9bbe5bc23d",
        "e342165a614588878ad0f4bc9bacf3905df34d08",
        "3ff7153fd6bd47d08084c7f50f8fd70026c126e7",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "94bcd712aed610b8eaeccc57136d65ec988356f2"
    ],
    "s2id": "fc736fadd20f3db8b214e7b20b42c62b707a2cb5",
    "abstract": "Generative modeling of single-cell RNA-seq data has shown invaluable potential in community-driven tasks such as trajectory inference, batch effect removal and gene expression generation. However, most recent deep models generating synthetic single cells from noise operate on pre-processed continuous gene expression approximations, ignoring the inherently discrete and over-dispersed nature of single-cell data, which limits downstream applications and hinders the incorporation of robust noise models. Moreover, crucial aspects of deep-learning-based synthetic single-cell generation remain underexplored, such as controllable multi-modal and multi-label generation and its role in the performance enhancement of downstream tasks. This work presents Cell Flow for Generation (CFGen), a flow-based conditional generative model for multi-modal single-cell counts, which explicitly accounts for the discrete nature of the data. Our results suggest improved recovery of crucial biological data characteristics while accounting for novel generative tasks such as conditioning on multiple attributes and boosting rare cell type classification via data augmentation. By showcasing CFGen on a diverse set of biological datasets and settings, we provide evidence of its value to the fields of computational biology and deep generative models.",
    "authors": [
        "Alessandro Palma",
        "Till Richter",
        "Hanyi Zhang",
        "Manuel Lubetzki",
        "Alexander Tong",
        "Andrea Dittadi",
        "Fabian J Theis"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work presents Cell Flow for Generation (CFGen), a flow-based conditional generative model for multi-modal single-cell counts, which explicitly accounts for the discrete nature of the data."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}