{
    "acronym": "fc866557942cb33e57e9172af1b98f3a59ae6992",
    "title": "The Manifestation of Affective Polarization on Social Media: A Cross-Platform Supervised Machine Learning Approach",
    "seed_ids": [
        "bert"
    ],
    "s2id": "fc866557942cb33e57e9172af1b98f3a59ae6992",
    "abstract": "This project explores how affective polarization, hostility towards people’s political adversaries, manifests on social media. Whereas prior attempts have relied on sentiment analysis and bag-of-word approaches, we use supervised machine learning to capture the nuances of affective polarization in text on social media. Specifically, we fine-tune BERT to build a classifier that identifies expressions of affective polarization in posts shared on Facebook or Twitter during the first six months of the COVID-19 pandemic (n = 8,603,695). Focusing on this context allows us to study how affective polarization evolved on social media as the COVID-19 issue went from unfamiliar to highly political. We explore the temporal dynamics of affective polarization on Facebook and Twitter using ARIMA models and an outlier analysis of the first few months of the pandemic. Further, we examine the interplay between affective polarization and virality across the two platforms. The findings have important implications for those seeking to (1) capture affective polarization in text, and (2) understand how affective polarization manifests on social media. These implications are discussed.",
    "authors": [
        "Christian Staal Bruun Overgaard",
        "Josephine Lukito",
        "Kaiya Soorholtz"
    ],
    "venue": "International Conference on Web and Social Media",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This project fine-tune BERT to build a classifier that identifies expressions of affective polarization in posts shared on Facebook or Twitter during the first six months of the COVID-19 pandemic, and examines the interplay between affective polarization and virality across the two platforms."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}