{
    "acronym": "fcc1ccdee03cfd121ed840d089e1b9fd2778ea70",
    "title": "Seamless Human Motion Composition with Blended Positional Encodings",
    "seed_ids": [
        "classfreediffu",
        "6f6e2e0311589a9af045f6acd00b7dee6d19fce4",
        "465b80aea2b99ffe0710325f5c256e8d2ac642a5",
        "15736f7c205d961c00378a938daffaacb5a0718d",
        "e342165a614588878ad0f4bc9bacf3905df34d08",
        "87c5b281fa43e6f27191b20a8dd694eda1126336",
        "bf6ce546c589fa8054b3972b266532664914bd21",
        "c10075b3746a9f3dd5811970e93c8ca3ad39b39d",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "de18baa4964804cf471d85a5a090498242d2e79f",
        "925ad2897d1b5decbea320d07e99afa9110e09b2"
    ],
    "s2id": "fcc1ccdee03cfd121ed840d089e1b9fd2778ea70",
    "abstract": "Conditional human motion generation is an important topic with many applications in virtual reality, gaming, and robotics. While prior works have focused on generating motion guided by text, music, or scenes, these typically result in isolated motions confined to short durations. Instead, we address the generation of long, continuous sequences guided by a series of varying textual descriptions. In this context, we introduce FlowMDM, the first diffusion-based model that generates seamless Human Motion Compositions (HMC) without any postprocessing or redundant denoising steps. For this, we introduce the Blended Positional Encodings, a technique that leverages both absolute and relative positional encodings in the denoising chain. More specifically, global motion coherence is recovered at the absolute stage, whereas smooth and realistic transitions are built at the relative stage. As a result, we achieve state-of-the-art results in terms of accuracy, realism, and smoothness on the Babel and HumanML3D datasets. FlowMDM excels when trained with only a single description per motion sequence thanks to its Pose-Centric Cross-ATtention, which makes it robust against varying text descriptions at inference time. Finally, to address the limitations of existing HMC metrics, we propose two new metrics: the Peak Jerk and the Area Under the Jerk, to detect abrupt transitions.",
    "authors": [
        "Germán Barquero",
        "Sergio Escalera",
        "Cristina Palmero"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work introduces FlowMDM, the first diffusion-based model that generates seamless Human Motion Compositions (HMC) without any postprocessing or redundant denoising steps, and introduces the Blended Positional Encodings, a technique that leverages both absolute and relative positional encodings in the denoising chain."
    },
    "citationCount": 3,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}