{
    "acronym": "fcc7a44c19a553998dc471031652531c71a832aa",
    "title": "A Survey on Legal Judgment Prediction: Datasets, Metrics, Models and Challenges",
    "seed_ids": [
        "neurallegal",
        "b18b9d36b4bddf3111ecfa294457d27181941c3d",
        "24ec60734b3fcad2661fd3c18ec933430058c2f7",
        "fd33e77884e69f6bc099990fc2790248af2749d9",
        "c67843e9ccb8221abb5d2feecc4f3ce2708e9cf2",
        "0f655ded8a5e0a1e3770f59b9eadb7f68065f7d7",
        "61a5ae33fc34efcdbc710004554ec57e607ce75e",
        "1e3e65e7773b7869d9bd7f5394b54199e48195e6",
        "29584ed6d68a06fdf91440a018f6bc83a44fd177",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c"
    ],
    "s2id": "fcc7a44c19a553998dc471031652531c71a832aa",
    "abstract": "Legal judgment prediction (LJP) applies Natural Language Processing (NLP) techniques to predict judgment results based on fact descriptions automatically. The present work addresses the growing interest in the application of NLP techniques to the task of LJP. Despite the current performance gap between machines and humans, promising results have been achieved in a variety of benchmark datasets, owing to recent advances in NLP research and the availability of large-scale public datasets. To provide a comprehensive survey of existing LJP tasks, datasets, models, and evaluations, this study presents the following contributions: 1) an analysis of 43 LJP datasets constructed in 9 different languages, together with a classification method of LJP based on three different attributes; 2) a summary of 16 evaluation metrics categorized into 4 different types to evaluate the performance of LJP models for different outputs; 3) a review of 8 legal-domain pretrained models in 4 languages, highlighting four major research directions for LJP; 4) state-of-the-art results for 11 representative datasets from different court cases and an in-depth discussion of the open challenges in this area. This study aims to provide a comprehensive review for NLP researchers and legal professionals to understand the advances in LJP over the past years, and to facilitate further joint efforts towards improving the performance of LJP models.",
    "authors": [
        "Junyun Cui",
        "Xiaoyu Shen",
        "F. Nie",
        "Z. Wang",
        "Jinglong Wang",
        "Yulong Chen"
    ],
    "venue": "IEEE Access",
    "year": 2022,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This study aims to provide a comprehensive review for NLP researchers and legal professionals to understand the advances in LJP over the past years, and to facilitate further joint efforts towards improving the performance of LJP models."
    },
    "citationCount": 34,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}