{
    "acronym": "fcf2eaf61a3ec2220e9353595617bc73557dec51",
    "title": "A survey on fairness of large language models in e-commerce: progress, application, and challenge",
    "seed_ids": [
        "bert",
        "65369dc97a17dd7c2a2b4fa65d4fa73eb191fd59",
        "8a4320fd903677a3ea2bf606a6537b59885b1108",
        "c61d54644e9aedcfc756e5d6fe4cc8b78c87755d",
        "df602516e28a9ef0ef665ed0aef551984d8d770d",
        "6172422f0c4f244d82c5767c11191a5df46a1715",
        "7ea0e91c5d5dc73f2133bc46d7ebb6cb83034dae",
        "5d22b241836e30d5b0d852b463951ab7e3245ea4",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "031e4e43aaffd7a479738dcea69a2d5be7957aa3",
        "5e9c85235210b59a16bdd84b444a904ae271f7e7",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "fcf2eaf61a3ec2220e9353595617bc73557dec51",
    "abstract": "This survey explores the fairness of large language models (LLMs) in e-commerce, examining their progress, applications, and the challenges they face. LLMs have become pivotal in the e-commerce domain, offering innovative solutions and enhancing customer experiences. This work presents a comprehensive survey on the applications and challenges of LLMs in e-commerce. The paper begins by introducing the key principles underlying the use of LLMs in e-commerce, detailing the processes of pretraining, fine-tuning, and prompting that tailor these models to specific needs. It then explores the varied applications of LLMs in e-commerce, including product reviews, where they synthesize and analyze customer feedback; product recommendations, where they leverage consumer data to suggest relevant items; product information translation, enhancing global accessibility; and product question and answer sections, where they automate customer support. The paper critically addresses the fairness challenges in e-commerce, highlighting how biases in training data and algorithms can lead to unfair outcomes, such as reinforcing stereotypes or discriminating against certain groups. These issues not only undermine consumer trust, but also raise ethical and legal concerns. Finally, the work outlines future research directions, emphasizing the need for more equitable and transparent LLMs in e-commerce. It advocates for ongoing efforts to mitigate biases and improve the fairness of these systems, ensuring they serve diverse global markets effectively and ethically. Through this comprehensive analysis, the survey provides a holistic view of the current landscape of LLMs in e-commerce, offering insights into their potential and limitations, and guiding future endeavors in creating fairer and more inclusive e-commerce environments.",
    "authors": [
        "Qingyang Ren",
        "Zilin Jiang",
        "Jinghan Cao",
        "Sijia Li",
        "Chiqu Li",
        "Yiyang Liu",
        "Shuning Huo",
        "Tiange He"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey explores the fairness of large language models (LLMs) in e-commerce, examining their progress, applications, and the challenges they face, and advocates for ongoing efforts to mitigate biases and improve the fairness of these systems."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}