{
    "acronym": "fd38e1f3c5fa7e770c327180fd68bf8bbfc33a70",
    "title": "On the Usage of Continual Learning for Out-of-Distribution Generalization in Pre-trained Language Models of Code",
    "seed_ids": [
        "gpt2",
        "e9fc39f56abbc6b8aed1e05496d985e70345a95a",
        "c5f208832fa22c50061d8480b92556750d785fd3",
        "4b27f18bff43d605805c92696a979714ced0b805",
        "0646bb09db4d1ba24150e69b71edcd4aff691b3c",
        "0fe2636446cd686830da3d971b31a004d6094b3c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "fd38e1f3c5fa7e770c327180fd68bf8bbfc33a70",
    "abstract": "Pre-trained language models (PLMs) have become a prevalent technique in deep learning for code, utilizing a two-stage pre-training and fine-tuning procedure to acquire general knowledge about code and specialize in a variety of downstream tasks. However, the dynamic nature of software codebases poses a challenge to the effectiveness and robustness of PLMs. In particular, world-realistic scenarios potentially lead to significant differences between the distribution of the pre-training and test data, i.e., distribution shift, resulting in a degradation of the PLM's performance on downstream tasks. In this paper, we stress the need for adapting PLMs of code to software data whose distribution changes over time, a crucial problem that has been overlooked in previous works. The motivation of this work is to consider the PLM in a non-stationary environment, where fine-tuning data evolves over time according to a software evolution scenario. Specifically, we design a scenario where the model needs to learn from a stream of programs containing new, unseen APIs over time. We study two widely used PLM architectures, i.e., a GPT2 decoder and a RoBERTa encoder, on two downstream tasks, API call and API usage prediction. We demonstrate that the most commonly used fine-tuning technique from prior work is not robust enough to handle the dynamic nature of APIs, leading to the loss of previously acquired knowledge i.e., catastrophic forgetting. To address these issues, we implement five continual learning approaches, including replay-based and regularization-based methods. Our findings demonstrate that utilizing these straightforward methods effectively mitigates catastrophic forgetting in PLMs across both downstream tasks while achieving comparable or superior performance.",
    "authors": [
        "M. Weyssow",
        "Xin Zhou",
        "Kisub Kim",
        "David Lo",
        "H. Sahraoui"
    ],
    "venue": "ESEC/SIGSOFT FSE",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The motivation of this work is to consider the PLM in a non-stationary environment, where fine-tuning data evolves over time according to a software evolution scenario, and to implement five continual learning approaches, including replay-based and regularization-based methods."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}