{
    "acronym": "fd65d8ff7ecc367883dc3511081128803e326f97",
    "title": "SenDaL: An Effective and Efficient Calibration Framework of Low-Cost Sensors for Daily Life",
    "seed_ids": [
        "transformer",
        "performer",
        "2475b38a76a9c2dc67f74446e2e686815764b0f2",
        "3fbf6339273c50b04e886fa9bd4ad18c952a683d",
        "30dcc0e191a376fea0e7a46f94c53872c029efc9"
    ],
    "s2id": "fd65d8ff7ecc367883dc3511081128803e326f97",
    "abstract": "The collection of accurate and noise-free data is a crucial part of Internet of Things (IoT)-controlled environments. However, the data collected from various sensors in daily life often suffer from inaccuracies. Additionally, IoT-controlled devices with low-cost sensors lack sufficient hardware resources to employ conventional deep learning models. To overcome this limitation, we propose sensors for daily life (SenDaL), the first framework that utilizes neural networks for calibrating low-cost sensors. SenDaL introduces novel training and inference processes that enable it to achieve accuracy comparable to deep learning models while simultaneously preserving latency and energy consumption similar to linear models. SenDaL is first trained in a bottom-up manner, making decisions based on calibration results from both linear and deep learning models. Once both models are trained, SenDaL makes independent decisions through a top-down inference process, ensuring accuracy and inference speed. Furthermore, SenDaL can select the optimal deep learning model according to the resources of the IoT devices because it is compatible with various deep learning models, such as long short-term memory-based and Transformer-based models. We have verified that SenDaL outperforms existing deep learning models in terms of accuracy, latency, and energy efficiency through experiments conducted in different IoT environments and real-life scenarios.",
    "authors": [
        "Seokho Ahn",
        "Hyungjin Kim",
        "Euijong Lee",
        "Young-Duk Seo"
    ],
    "venue": "IEEE Internet of Things Journal",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "SenDaL proposes sensors for daily life (SenDaL), the first framework that utilizes neural networks for calibrating low-cost sensors to achieve accuracy comparable to deep learning models while simultaneously preserving latency and energy consumption similar to linear models."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}