{
    "acronym": "fe54af502b4bc68c96c5007618affd8db21dcc5f",
    "title": "Market-Level Integrated Detection Against Cyber Attacks in Real-Time Market Operations by Self-Supervised Learning",
    "seed_ids": [
        "transformer"
    ],
    "s2id": "fe54af502b4bc68c96c5007618affd8db21dcc5f",
    "abstract": "The increasing integration of information and communication technologies into power grids makes the coupling between cyber and physical power system operations intricate. Along with the deregulation of energy markets, there is an increased potential opportunity for cyber attacks, challenging the effectiveness of current cyber protection methods. In a real-time electricity market, attackers can utilize various kinds of cyber attacks to cause significant financial losses and create catastrophic consequences for grid operations. Therefore, detecting cyber attacks in the real-time market is crucial. However, most of the existing detection methods are primarily designed to identify a single type of attack. Furthermore, there is a scarcity of research focused on developing market-level detection methods against cyber attacks based on market-level behaviors. To fill the above gap, in this paper a novel self-supervised learning based method is proposed to detect multiple types of cyber attacks by analyzing real-time locational marginal prices (RTLMPs) data. Specifically, an autoencoder-enhanced generative adversarial network (GAN)-based method is proposed to examine the spatial-temporal correlations of RTLMPs, and determine whether the RTLMPs are compromised by the attackers or not. Finally, Midcontinent Independent System Operator data are employed for case studies, and simulation results demonstrate the efficiency of the proposed data-driven method.",
    "authors": [
        "Zhongjian Zhang",
        "Shengrong Bu",
        "Yanru Zhang",
        "Zhu Han"
    ],
    "venue": "IEEE Transactions on Smart Grid",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A novel self-supervised learning based method is proposed to detect multiple types of cyber attacks by analyzing real-time locational marginal prices (RTLMPs) data and determining whether the RTLMPs are compromised by the attackers or not."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}