{
    "acronym": "fe57045485eca4cc9a87c8733fd93f42e999056f",
    "title": "Anchor DETR: Query Design for Transformer-Based Object Detection",
    "seed_ids": [
        "luna",
        "af679d69fcc1d0fcf0f039aba937853bcb50a8de",
        "6f68e1bb253925d8431588555d3010419f322e04",
        "c0b79e6a5fd88ef13aa4780df5aae0aaa6b2be87",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "c8b25fab5608c3e033d34b4483ec47e68ba109b7"
    ],
    "s2id": "fe57045485eca4cc9a87c8733fd93f42e999056f",
    "abstract": "In this paper, we propose a novel query design for the transformer-based object detection. In previous transformer-based detectors, the object queries are a set of learned embeddings. However, each learned embedding does not have an explicit physical meaning and we cannot explain where it will focus on. It is difficult to optimize as the prediction slot of each object query does not have a specific mode. In other words, each object query will not focus on a specific region. To solved these problems, in our query design, object queries are based on anchor points, which are widely used in CNN-based detectors. So each object query focuses on the objects near the anchor point. Moreover, our query design can predict multiple objects at one position to solve the difficulty:\"one region, multiple objects\". In addition, we design an attention variant, which can reduce the memory cost while achieving similar or better performance than the standard attention in DETR. Thanks to the query design and the attention variant, the proposed detector that we called Anchor DETR, can achieve better performance and run faster than the DETR with 10$\\times$ fewer training epochs. For example, it achieves 44.2 AP with 19 FPS on the MSCOCO dataset when using the ResNet50-DC5 feature for training 50 epochs. Extensive experiments on the MSCOCO benchmark prove the effectiveness of the proposed methods. Code is available at \\url{https://github.com/megvii-research/AnchorDETR}.",
    "authors": [
        "Yingming Wang",
        "X. Zhang",
        "Tong Yang",
        "Jian Sun"
    ],
    "venue": "",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The proposed detector, called Anchor DETR, can achieve better performance and run faster than the DETR with 10$\\times$ fewer training epochs and can predict multiple objects at one position to solve the difficulty:\"one region, multiple objects\"."
    },
    "citationCount": 42,
    "influentialCitationCount": 4,
    "code": null,
    "description": null,
    "url": null
}