{
    "acronym": "fe7dd6a3968b51e4628aed843c2ef4816d9e50c1",
    "title": "Detecting Synthetic Lyrics with Few-Shot Inference",
    "seed_ids": [
        "bert",
        "73081c0d391f057e89b21347860c89cd09c1d2b1",
        "02f0d5faa1cd88ea0afe48b756bfbf9adfefba28",
        "10243faeb3db176f23ecf24568875142b8382e8d",
        "be55e8ec4213868db08f2c3168ae666001bea4b8",
        "1c13af186d1e177b85ef1ec3fc7b8d33ec314cfd",
        "964bd39b546f0f6625ff3b9ef1083f797807ef2e"
    ],
    "s2id": "fe7dd6a3968b51e4628aed843c2ef4816d9e50c1",
    "abstract": "In recent years, generated content in music has gained significant popularity, with large language models being effectively utilized to produce human-like lyrics in various styles, themes, and linguistic structures. This technological advancement supports artists in their creative processes but also raises issues of authorship infringement, consumer satisfaction and content spamming. To address these challenges, methods for detecting generated lyrics are necessary. However, existing works have not yet focused on this specific modality or on creative text in general regarding machine-generated content detection methods and datasets. In response, we have curated the first dataset of high-quality synthetic lyrics and conducted a comprehensive quantitative evaluation of various few-shot content detection approaches, testing their generalization capabilities and complementing this with a human evaluation. Our best few-shot detector, based on LLM2Vec, surpasses stylistic and statistical methods, which are shown competitive in other domains at distinguishing human-written from machine-generated content. It also shows good generalization capabilities to new artists and models, and effectively detects post-generation paraphrasing. This study emphasizes the need for further research on creative content detection, particularly in terms of generalization and scalability with larger song catalogs. All datasets, pre-processing scripts, and code are available publicly on GitHub and Hugging Face under the Apache 2.0 license.",
    "authors": [
        "Yanis Labrak",
        "Gabriel Meseguer-Brocal",
        "Elena V. Epure"
    ],
    "venue": "arXiv.org",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The first dataset of high-quality synthetic lyrics is curated and a comprehensive quantitative evaluation of various few-shot content detection approaches is conducted, testing their generalization capabilities and complementing this with a human evaluation."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}