{
    "acronym": "fe9807c580c230b184d97aad4082778fc78a4cc0",
    "title": "Machine Learning in Short-Reach Optical Systems: A Comprehensive Survey",
    "seed_ids": [
        "transformer",
        "9297502c3b1eaa528e8a8fb85a83842d0577fdc6",
        "016e99ccef0afb7011f3ea3b1b932611c8fb957b",
        "563bac1c5cdd5096e9dbf8d4f3d5b3c4f7284e06",
        "fc46ccb83dc121c33de7ab6bdedab7d970780b2f",
        "35a9749df07a2ab97c51af4d260b095b00da7676"
    ],
    "s2id": "fe9807c580c230b184d97aad4082778fc78a4cc0",
    "abstract": "Recently, extensive research has been conducted to explore the utilization of machine learning (ML) algorithms in various direct-detected and (self)-coherent short-reach communication applications. These applications encompass a wide range of tasks, including bandwidth request prediction, signal quality monitoring, fault detection, traffic prediction, and digital signal processing (DSP)-based equalization. As a versatile approach, ML demonstrates the ability to address stochastic phenomena in optical systems networks where deterministic methods may fall short. However, when it comes to DSP equalization algorithms such as feed-forward/decision-feedback equalizers (FFEs/DFEs) and Volterra-based nonlinear equalizers, their performance improvements are often marginal, and their complexity is prohibitively high, especially in cost-sensitive short-reach communications scenarios such as passive optical networks (PONs). Time-series ML models offer distinct advantages over frequency-domain models in specific contexts. They excel in capturing temporal dependencies, handling irregular or nonlinear patterns effectively, and accommodating variable time intervals. Within this survey, we outline the application of ML techniques in short-reach communications, specifically emphasizing their utilization in high-bandwidth demanding PONs. We introduce a novel taxonomy for time-series methods employed in ML signal processing, providing a structured classification framework. Our taxonomy categorizes current time-series methods into four distinct groups: traditional methods, Fourier convolution-based methods, transformer-based models, and time-series convolutional networks. Finally, we highlight prospective research directions within this rapidly evolving field and outline specific solutions to mitigate the complexity associated with hardware implementations. We aim to pave the way for more practical and efficient deployment of ML approaches in short-reach optical communication systems by addressing complexity concerns.",
    "authors": [
        "Chen Shao",
        "Elias Giacoumidis",
        "Syed Moktacim Billah",
        "Shi Li",
        "Jialei Li",
        "Prashasti Sahu",
        "Andre Richter",
        "Tobias Kaefer",
        "Michael Faerber"
    ],
    "venue": "Photonics",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This survey outlines the application of ML techniques in short-reach communications, specifically emphasizing their utilization in high-bandwidth demanding PONs, and introduces a novel taxonomy for time-series methods employed in ML signal processing, providing a structured classification framework."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}