{
    "acronym": "feee27c7a717fcb329b4e863b2c720a9defad504",
    "title": "Prompt-Based Editing for Text Style Transfer",
    "seed_ids": [
        "gpt2",
        "a905fc47b4ce0d4d32c8a86da5a8d90d26a68eb2",
        "0d6bb585493e34975f0437faa3179db3a02f6ae8",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "feee27c7a717fcb329b4e863b2c720a9defad504",
    "abstract": "Prompting approaches have been recently explored in text style transfer, where a textual prompt is used to query a pretrained language model to generate style-transferred texts word by word in an autoregressive manner. However, such a generation process is less controllable and early prediction errors may affect future word predictions. In this paper, we present a prompt-based editing approach for text style transfer. Specifically, we prompt a pretrained language model for style classification and use the classification probability to compute a style score. Then, we perform discrete search with word-level editing to maximize a comprehensive scoring function for the style-transfer task. In this way, we transform a prompt-based generation problem into a classification one, which is a training-free process and more controllable than the autoregressive generation of sentences. In our experiments, we performed both automatic and human evaluation on three style-transfer benchmark datasets, and show that our approach largely outperforms the state-of-the-art systems that have 20 times more parameters. Additional empirical analyses further demonstrate the effectiveness of our approach.",
    "authors": [
        "Guoqing Luo",
        "Yu Tong Han",
        "Lili Mou",
        "Mauajama Firdaus"
    ],
    "venue": "Conference on Empirical Methods in Natural Language Processing",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A prompt-based editing approach for text style transfer that prompts a pretrained language model for style classification and uses the classification probability to compute a style score, and performs discrete search with word-level editing to maximize a comprehensive scoring function for the style-transfer task."
    },
    "citationCount": 13,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}