{
    "acronym": "fefe6c2eb25da9f9f7982b8718f3abc1de2ada03",
    "title": "Modelling Temporal Document Sequences for Clinical ICD Coding",
    "seed_ids": [
        "longformer",
        "transformerxl",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0",
        "94c5464bbb2b0760e9e747b4efc7c1b7b0dbf0d8",
        "cc2d1a66c701e9be9124eb95431b6c3dd79a61d3"
    ],
    "s2id": "fefe6c2eb25da9f9f7982b8718f3abc1de2ada03",
    "abstract": "Past studies on the ICD coding problem focus on predicting clinical codes primarily based on the discharge summary. This covers only a small fraction of the notes generated during each hospital stay and leaves potential for improving performance by analysing all the available clinical notes. We propose a hierarchical transformer architecture that uses text across the entire sequence of clinical notes in each hospital stay for ICD coding, and incorporates embeddings for text metadata such as their position, time, and type of note. While using all clinical notes increases the quantity of data substantially, superconvergence can be used to reduce training costs. We evaluate the model on the MIMIC-III dataset. Our model exceeds the prior state-of-the-art when using only discharge summaries as input, and achieves further performance improvements when all clinical notes are used as input.",
    "authors": [
        "Clarence Boon Liang Ng",
        "Diogo Santos",
        "Marek Rei"
    ],
    "venue": "Conference of the European Chapter of the Association for Computational Linguistics",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes a hierarchical transformer architecture that uses text across the entire sequence of clinical notes in each hospital stay for ICD coding, and incorporates embeddings for text metadata such as their position, time, and type of note."
    },
    "citationCount": 5,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}