{
    "acronym": "ff20587563f2ffac3985a18d7fd28b755873c8f2",
    "title": "Early Perceptions of Teaching and Learning Using Generative AI in Higher Education",
    "seed_ids": [
        "gpt",
        "gpt2",
        "7b6a8c6d44e0f77bf930484e438d77b7465a69fb",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "ff20587563f2ffac3985a18d7fd28b755873c8f2",
    "abstract": "This project explored perceptions of ChatGPT in higher education among students and faculty to assess teaching and learning implications of this Generative Artificial Intelligence (Generative AI)–based novel tool. Two theoretical frameworks inspired the project, including Diffusion of Innovation theory (Rogers, 1962) and Technology Acceptance Model (Davis, 1989). An online survey was completed by 380 participants (N = 380). Participants indicated that they would not use ChatGPT to plagiarize but believed others would. When asked to rate the accuracy of ChatGPT's output, more than half took the incorrect output as correct/somewhat correct or could not tell whether it was correct or incorrect. Results varied based on participant demographics, including age, gender, and occupation. These findings support the need for data literacy. If Generative AI is to be used in higher education to aid in the learning process, it is imperative to continue teaching critical thinking.",
    "authors": [
        "Amanda D. Damiano",
        "E. Lauría",
        "Christian Sarmiento",
        "Ningjing Zhao"
    ],
    "venue": "Journal of Educational Technology Systems",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Perceptions of ChatGPT in higher education among students and faculty are explored to assess teaching and learning implications of this Generative Artificial Intelligence (Generative AI)–based novel tool and the need for data literacy is supported."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}