{
    "acronym": "ff3d445da7847f9f212118328c5cdb6246f1fe3d",
    "title": "CO-STAR: Conceptualisation of Stereotypes for Analysis and Reasoning",
    "seed_ids": [
        "gpt",
        "2ea64b7c7617f6cc1768373124ca0243d772a90f",
        "75acc731bdd2b626edc74672a30da3bc51010ae8",
        "f48ae425e2567be2d993efcaaf74c2274fc9d7c5",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "ff3d445da7847f9f212118328c5cdb6246f1fe3d",
    "abstract": "Warning: this paper contains material which may be offensive or upsetting. While much of recent work has focused on the detection of hate speech and overtly offensive content, very little research has explored the more subtle but equally harmful language in the form of implied stereotypes. This is a challenging domain, made even more so by the fact that humans often struggle to understand and reason about stereotypes. We build on existing literature and present CO-STAR (COnceptualisation of STereotypes for Analysis and Reasoning), a novel framework which encodes the underlying concepts of implied stereotypes. We also introduce the CO-STAR training data set, which contains just over 12K structured annotations of implied stereotypes and stereotype conceptualisations, and achieve state-of-the-art results after training and manual evaluation. The CO-STAR models are, however, limited in their ability to understand more complex and subtly worded stereotypes, and our research motivates future work in developing models with more sophisticated methods for encoding common-sense knowledge.",
    "authors": [
        "Teyun Kwon",
        "Anandha Gopalan"
    ],
    "venue": "arXiv.org",
    "year": 2021,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "The CO-STAR models are limited in their ability to understand more complex and subtly worded stereotypes, and the research motivates future work in developing models with more sophisticated methods for encoding common-sense knowledge."
    },
    "citationCount": 1,
    "influentialCitationCount": 1,
    "code": null,
    "description": null,
    "url": null
}