{
    "acronym": "ffb127811ec6843b51b9e5f19f37223de531e3d5",
    "title": "Universal Length Generalization with Turing Programs",
    "seed_ids": [
        "fire",
        "alibi",
        "repeatafterme",
        "8f490b938586d8e1b892304dd5209b2295c93ed7",
        "189fde3f4dfa105bb51472a8945618f395919560",
        "1ec3a3ff77cb4b424499b3805ecc90182ecd8f8b",
        "6f6e2e0311589a9af045f6acd00b7dee6d19fce4",
        "af385c0fdd0eda2bbf429bea6fedffc327c8a180",
        "e82e3f4347674b75c432cb80604d38ee630d4bf6",
        "c6d38add1b7bbc10f0da37a90e3f1b51ee5fb617",
        "d6c5aab433d9871cabc01ffb1e5e1ea89141155b",
        "a2fc77f075f666b462d9350e7576f0ba9845c61b",
        "92173d081b15824d22a9ef070e118744ceee8052",
        "66c10bf1f11bc1b2d92204d8f8391d087f6de1c4",
        "3694381e74445a8b9f8cb8d373e39626e47191b5",
        "dc48bc1a4d81e0f37603013fd2a95644dc233bd0"
    ],
    "s2id": "ffb127811ec6843b51b9e5f19f37223de531e3d5",
    "abstract": "Length generalization refers to the ability to extrapolate from short training sequences to long test sequences and is a challenge for current large language models. While prior work has proposed some architecture or data format changes to achieve length generalization, these proposals typically apply to a limited set of tasks. Building on prior scratchpad and Chain-of-Thought (CoT) techniques, we propose Turing Programs, a novel CoT strategy that decomposes an algorithmic task into steps mimicking the computation of a Turing Machine. This framework is both universal, as it can accommodate any algorithmic task, and simple, requiring only copying text from the context with small modifications. We show that by using Turing Programs, we obtain robust length generalization on a range of algorithmic tasks: addition, multiplication and in-context SGD. We then demonstrate that transformers achieve length generalization on random Turing Programs, suggesting that length generalization is possible for any algorithmic task. Finally, we theoretically prove that transformers can implement Turing Programs, constructing a simple RASP (Weiss et al.) program that simulates an arbitrary Turing machine.",
    "authors": [
        "Kaiying Hou",
        "David Brandfonbrener",
        "S. Kakade",
        "Samy Jelassi",
        "Eran Malach"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "This work proposes Turing Programs, a novel CoT strategy that decomposes an algorithmic task into steps mimicking the computation of a Turing Machine, and theoretically proves that transformers can implement Turing Programs."
    },
    "citationCount": 1,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}