{
    "acronym": "ffbfd0cdf02cd24134eeeb4382527a6e209a881f",
    "title": "AI Writing Assistants Influence Topic Choice in Self-Presentation",
    "seed_ids": [
        "gpt2",
        "98962528d113b47fd72ebe7ff205fb6a14d0d9e3",
        "5d22b241836e30d5b0d852b463951ab7e3245ea4",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "ffbfd0cdf02cd24134eeeb4382527a6e209a881f",
    "abstract": "AI language technologies increasingly assist and expand human communication. While AI-mediated communication reduces human effort, its societal consequences are poorly understood. In this study, we investigate whether using an AI writing assistant in personal self-presentation changes how people talk about themselves. In an online experiment, we asked participants (N=200) to introduce themselves to others. An AI language assistant supported their writing by suggesting sentence completions. The language model generating suggestions was fine-tuned to preferably suggest either interest, work, or hospitality topics. We evaluate how the topic preference of a language model affected users’ topic choice by analyzing the topics participants discussed in their self-presentations. Our results suggest that AI language technologies may change the topics their users talk about. We discuss the need for a careful debate and evaluation of the topic priors built into AI language technologies.",
    "authors": [
        "Ritika Poddar",
        "R. Sinha",
        "Mor Naaman",
        "Maurice Jakesch"
    ],
    "venue": "CHI Extended Abstracts",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Whether using an AI writing assistant in personal self-presentation changes how people talk about themselves and the need for a careful debate and evaluation of the topic priors built into AI language technologies are investigated."
    },
    "citationCount": 6,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}