{
    "acronym": "ffdd0b97b9ba996ba85e1a96f4a50ef86b796a4a",
    "title": "Looking Right is Sometimes Right: Investigating the Capabilities of Decoder-only LLMs for Sequence Labeling",
    "seed_ids": [
        "gpt",
        "bert",
        "cde48b24264e44355abb0e548a2cf7c70bb072b4",
        "2c4f43bb147946b3643c0b2bf4101072a23632d3",
        "99b0d1cb964c3942c6f6ce30d40d7d8eb4a8e66f",
        "13a0d8bb38f739990c8cd65a44061c6534f17221",
        "ca4ecf116a9b97ce525a01f3f51117877688ddf5",
        "8323c591e119eb09b28b29fd6c7bc76bd889df7a",
        "e0c6abdbdecf04ffac65c440da77fb9d66bb474c",
        "29ddc1f43f28af7c846515e32cc167bc66886d0c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "ffdd0b97b9ba996ba85e1a96f4a50ef86b796a4a",
    "abstract": "Pre-trained language models based on masked language modeling (MLM) excel in natural language understanding (NLU) tasks. While fine-tuned MLM-based encoders consistently outperform causal language modeling decoders of comparable size, recent decoder-only large language models (LLMs) perform on par with smaller MLM-based encoders. Although their performance improves with scale, LLMs fall short of achieving state-of-the-art results in information extraction (IE) tasks, many of which are formulated as sequence labeling (SL). We hypothesize that LLMs' poor SL performance stems from causal masking, which prevents the model from attending to tokens on the right of the current token. Yet, how exactly and to what extent LLMs' performance on SL can be improved remains unclear. We explore techniques for improving the SL performance of open LLMs on IE tasks by applying layer-wise removal of the causal mask (CM) during LLM fine-tuning. This approach yields performance gains competitive with state-of-the-art SL models, matching or outperforming the results of CM removal from all blocks. Our findings hold for diverse SL tasks, demonstrating that open LLMs with layer-dependent CM removal outperform strong MLM-based encoders and even instruction-tuned LLMs.",
    "authors": [
        "David Duki'c",
        "Jan vSnajder"
    ],
    "venue": "",
    "year": 2024,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "Techniques for improving the SL performance of open LLMs on IE tasks are explored by applying layer-wise removal of the causal mask (CM) during LLM fine-tuning, demonstrating that open LLMs with layer-dependent CM removal outperform strong MLM-based encoders and even instruction-tuned LLMs."
    },
    "citationCount": 2,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}