{
    "acronym": "fff2a52ea684a50aae8b2d6e1077ce129be89498",
    "title": "Surveying the Landscape of Text Summarization with Deep Learning: A Comprehensive Review",
    "seed_ids": [
        "gpt",
        "f8d44802ac8190864c61c9aaf4a8b450261873ab",
        "4eb45f33446018175e266738be22f4d830ed697e",
        "d766bffc357127e0dc86dd69561d5aeb520d6f4c",
        "13850aabbe8b70e99560a42504773a76ab5a4f47",
        "9dc624d7258d1a56117ca720aea953ce46b66b21",
        "925ad2897d1b5decbea320d07e99afa9110e09b2",
        "af34ea4242ca8725ea739ec1bef674bec10c1fa9",
        "75352cc69a29bd5fc411e0e79737cb96b6309161",
        "395de0bd3837fdf4b4b5e5f04835bcc69c279481",
        "7cc730da554003dda77796d2cb4f06da5dfd5592",
        "203b543bfa1e564bb80ff4229b43174d7c71b0c0",
        "4d244972ed2e0286363bfb054cb269574d21a72c",
        "9405cc0d6169988371b2755e573cc28650d14dfe"
    ],
    "s2id": "fff2a52ea684a50aae8b2d6e1077ce129be89498",
    "abstract": "In recent years, deep learning has revolutionized natural language processing (NLP) by enabling the development of models that can learn complex representations of language data, leading to significant improvements in performance across a wide range of NLP tasks. Deep learning models for NLP typically use large amounts of data to train deep neural networks, allowing them to learn the patterns and relationships in language data. This is in contrast to traditional NLP approaches, which rely on hand-engineered features and rules to perform NLP tasks. The ability of deep neural networks to learn hierarchical representations of language data, handle variable-length input sequences, and perform well on large datasets makes them well-suited for NLP applications. Driven by the exponential growth of textual data and the increasing demand for condensed, coherent, and informative summaries, text summarization has been a critical research area in the field of NLP. Applying deep learning to text summarization refers to the use of deep neural networks to perform text summarization tasks. In this survey, we begin with a review of fashionable text summarization tasks in recent years, including extractive, abstractive, multi-document, and so on. Next, we discuss most deep learning-based models and their experimental results on these tasks. The paper also covers datasets and data representation for summarization tasks. Finally, we delve into the opportunities and challenges associated with summarization tasks and their corresponding methodologies, aiming to inspire future research efforts to advance the field further. A goal of our survey is to explain how these methods differ in their requirements as understanding them is essential for choosing a technique suited for a specific setting.",
    "authors": [
        "Guanghua Wang",
        "Weili Wu"
    ],
    "venue": "Discret. Math. Algorithms Appl.",
    "year": 2023,
    "tldr": {
        "model": "tldr@v2.0.0",
        "text": "A goal of this survey is to explain how these methods differ in their requirements as understanding them is essential for choosing a technique suited for a specific setting, aiming to inspire future research efforts to advance the field further."
    },
    "citationCount": 0,
    "influentialCitationCount": 0,
    "code": null,
    "description": null,
    "url": null
}